Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: You know by now how to package a command-line application written in Python. A further step could be to distribute your package, meaning uploading it to a :term:`package index <Package Index>`, most commonly :term:`PyPI <Python Package Index (PyPI)>`. To do that, follow the instructions at :ref:`Packaging your project`. And once you're done, don't forget to :ref:`do some research <analyzing-pypi-package-downloads>` on how your package is received!
ja: これまでに、 Python で書かれたコマンドラインアプリケーションをパッケージする方法がわかったものと思います。さらなる一歩としては、そのパッケージを配布すること、つまり、最も一般的には :term:`PyPI <Python Package Index (PyPI)>` のような :term:`パッケージインデックス <Package Index>` へとアップロードすることでしょう。それをするためには、 :ref:`プロジェクトをパッケージする <Packaging your project>` の指示に従ってください。そして、一旦アップロードができたなら、パッケージがどのように受け入れられたかについて :ref:`いくらかの調査を行う <analyzing-pypi-package-downloads>` ことを実行してください！

source: README.rst / README.md
ja: README.rstとREADME.md

source: For example, let's install the `Requests`_ library from the :term:`Python Package Index (PyPI)`:
ja: 例として、 :term:`Python Package Index (PyPI)` から `Requests`_ ライブラリをインストールしてみましょう:

source: Configuring Trusted Publishing
ja: 信頼された出版 <Trusted Publishing> を設定する

source: This guide relies on PyPI's `Trusted Publishing`_ implementation to connect to `GitHub Actions CI/CD`_. This is recommended for security reasons, since the generated tokens are created for each of your projects individually and expire automatically. Otherwise, you'll need to generate an `API token`_ for both PyPI and TestPyPI. In case of publishing to third-party indexes like :doc:`devpi <devpi:index>`, you may need to provide a username/password combination.
ja: このガイド文書は、`GitHub Actions CI/CD`_ に接続するために PyPI の `Trusted Publishing`_ の実装に依存しています。これは、生成されるトークンが各プロジェクトでそれぞれ独立に作成されて自動的に期限切れになるというセキュリティ上の理由から推奨されています。さもなければ、 PyPI と TestPyPI の両方について `API トークン`_ を生成する必要があるでしょう。:doc:`devpi <devpi:index>` のような第三者パーティのインデックス向けに出版 <publish> する場合には、ユーザ名とパスワードの組み合わせを提供する必要があるかもしれません。

source: Since this guide will demonstrate uploading to both PyPI and TestPyPI, we'll need two trusted publishers configured. The following steps will lead you through creating the "pending" publishers for your new :term:`PyPI project <Project>`. However it is also possible to add `Trusted Publishing`_ to any pre-existing project, if you are its owner.
ja: このガイドではPyPIとTestPyPIの両方へのアップロードを実証しますので、ふたつの信頼あるパブリッシャが設定されていることが必要になるでしょう。以下に示すステップによって、新しい :term:`PyPI project <Project>` 用の " ペンディングされた" パブリッシャ群を作成する手順を一通りお見せします。しかしながら、あなたが所有者であるならば、任意の既存プロジェクトに `Trusted Publishing`_ を追加することが可能でもあります。

source: For security reasons, you must require `manual approval <https://docs.github.com/en/actions/how-tos/managing-workflow-runs-and-deployments/managing-deployments/managing-environments-for-deployment#creating-an-environment>`_ on each run for the ``pypi`` environment.
ja: セキュリティ上の理由から、``pypi`` 環境の実行の度に、 `手動での承認 <https://docs.github.com/en/actions/how-tos/managing-workflow-runs-and-deployments/managing-deployments/managing-environments-for-deployment#creating-an-environment>`_ を要求しなければなりません。

source: Now, let's add initial setup for our job that will publish to PyPI. It's a process that will execute commands that we'll define later. In this guide, we'll use the latest stable Ubuntu LTS version provided by GitHub Actions. This also defines a GitHub Environment for the job to run in its context and a URL to be displayed in GitHub's UI nicely. Additionally, it allows acquiring an OpenID Connect token that the ``pypi-publish`` actions needs to implement secretless Trusted Publishing to PyPI.
ja: さて、PyPI へ公開 <publish> する予定のジョブに初期設定を追加しましょう。それは、後ほど定義するであろうコマンドを実行するプロセスです。このガイド文書では、GitHub Actions が提供している最新版の Ubuntu LTS 安定版バージョンです。これは、また、そのコンテキスト内でジョブが走る GitHub 環境 <GitHub Environment> を定義するものでもあり、 GitHub の UI の中に申し分なく表示される URL でもあります。さらに、それは、 ``pypi-publish`` アクションがシークレットなしの PyPI への信頼ある公開を実装するために必要となる OpenID Connect のトークンを取得することを可能にするものでもあります。

source: Starting with version `v1.11.0 <https://github.com/pypa/gh-action-pypi-publish/releases/tag/v1.11.0>`_, `pypa/gh-action-pypi-publish`_ generates and uploads :pep:`740`-compatible attestations for each distribution by default. No additional manual signing steps are required.
ja: バージョン `v1.11.0 <https://github.com/pypa/gh-action-pypi-publish/releases/tag/v1.11.0>`_ 以降、 `pypa/gh-action-pypi-publish`_ は、デフォルトで各配布物に対する :pep:`740` 互換の証明書を生成しアップロードするようになりました。手動の署名手順はもはや必要ありません。

source: Most operating systems support some form of classical virtualization, running applications packaged as images containing a full operating system of their own. Running these virtual machines, or VMs, is a mature approach, widespread in data center environments.
ja: ほとんどのオペレーティングシステムでは、何らかの形であるオペレーティングシステム全体を内包するイメージの形にパッケージされたアプリケーションを動作させることができるような、古典的な仮想化がサポートされています。このような仮想マシンもしくは VM を動作させることは枯れた方法論で、データセンタ環境に広く普及しています。
pt_br: A maioria dos sistemas operacionais oferece suporte a alguma forma de virtualização clássica, executando aplicações empacotadas como imagens contendo um sistema operacional completo próprio. Executar essas máquinas virtuais, ou VMs, é uma abordagem madura, amplamente difundida em ambientes de datacenter.

source: `OpenStack <https://www.redhat.com/en/topics/openstack>`_ - A cloud management system in Python, with extensive VM support
ja: `OpenStack <https://www.redhat.com/en/topics/openstack>`_ - 大規模な VM サポート機能がついていて Python で書かれたクラウド管理システム
pt_br: `OpenStack <https://www.redhat.com/en/topics/openstack>`_ - Um sistema de gerenciamento de nuvem em Python, com suporte extenso a VM

source: Translate the guide
pt_br: Traduza o guia

source: :ref:`pip` came later in 2008, as alternative to :ref:`easy_install <easy_install>`, although still largely built on top of :ref:`setuptools` components. It was notable at the time for *not* installing packages as :term:`Eggs <Egg>` or from :term:`Eggs <Egg>` (but rather simply as 'flat' packages from :term:`sdists <Source Distribution (or "sdist")>`), and introducing the idea of :ref:`Requirements Files <pip:Requirements Files>`, which gave users the power to easily replicate environments.
pt_br: O :ref:`pip` veio mais tarde em 2008, como alternativa ao :ref:`easy_install <easy_install>`, embora ainda amplamente construído sobre os componentes :ref:`setuptools`. Era notável na época por *não* instalar pacotes como :term:`Eggs <Egg>` ou de :term:`Eggs <Egg>` (mas simplesmente como pacotes "planos" de :term:`sdists <Source Distribution (or "sdist")>`), e introduzindo a ideia de :ref:`Arquivos de Requisitos <pip:Requirements Files>`, que deu aos usuários o poder de replicar ambientes facilmente.

source: There are known exceptions for selecting the next version number. The maintainers may consciously choose to break the assumption that the last version segment only contains backwards-compatible changes. One such case is when security vulnerability needs to be addressed. Security releases often come in patch versions but contain breaking changes inevitably.
pt_br: Existem exceções conhecidas para selecionar o próximo número de versão. Os mantenedores podem escolher conscientemente quebrar a suposição de que o segmento da última versão contém apenas alterações compatíveis com versões anteriores. Um desses casos é quando a vulnerabilidade de segurança precisa ser abordada. As versões de segurança geralmente vêm em versões de patch, mas inevitavelmente contêm alterações importantes.

source: Semantic versioning is not a suitable choice for all projects, such as those with a regular time based release cadence and a deprecation process that provides warnings for a number of releases prior to removal of a feature.
pt_br: O versionamento semântico não é uma escolha adequada para todos os projetos, como aqueles com uma cadência de lançamento baseada em tempo regular e um processo de descontinuação que fornece avisos para vários lançamentos antes da remoção de um recurso.

source: Combinations of the above schemes are possible. For example, a project may combine date based versioning with serial versioning to create a *year.serial* numbering scheme that readily conveys the approximate age of a release, but doesn't otherwise commit to a particular release cadence within the year.
pt_br: Combinações dos esquemas acima são possíveis. Por exemplo, um projeto pode combinar o versionamento baseado em data com o versionamento serial para criar um esquema de numeração *ano.série* que transmite prontamente a idade aproximada de um lançamento, mas não se compromete com uma cadência de lançamento particular dentro do ano.

source: month
pt_br: mês

source: In particular, `NumPy <https://numpy.org/>`__, which provides the basis for most of the software in the `scientific Python stack <https://scientific-python.org>`_ can be configured to interoperate with different FORTRAN libraries, and can take advantage of different levels of vectorised instructions available in modern CPUs.
pt_br: Em particular, `NumPy <https://numpy.org/>`__, que fornece a base para a maioria do software na `pilha científica Python <https://scientific-python.org>`_ pode ser configurado para interoperar com diferentes bibliotecas FORTRAN e pode tirar proveito de diferentes níveis de instruções vetorizadas disponíveis em CPUs modernas.

source: Starting with version 1.10.4 of NumPy and version 1.0.0 of SciPy, pre-built 32-bit and 64-bit binaries in the ``wheel`` format are available for all major operating systems (Windows, macOS, and Linux) on PyPI. Note, however, that on Windows, NumPy binaries are linked against the `ATLAS <http://www.netlib.org/atlas/>`__ BLAS/LAPACK library, restricted to SSE2 instructions, so they may not provide optimal linear algebra performance.
pt_br: A partir da versão 1.10.4 do NumPy e da versão 1.0.0 do SciPy, binários pré-construídos de 32 e 64 bits no formato ``wheel`` estão disponíveis para todos os principais sistemas operacionais (Windows, macOS e Linux) em PyPI. Observe, no entanto, que no Windows, os binários do NumPy são vinculados à biblioteca BLAS/LAPACK do `ATLAS <http://www.netlib.org/atlas/>`__, restrita às instruções SSE2, portanto, podem não fornecer desempenho da álgebra linear.

source: The SciPy site lists `several distributions <https://scipy.org/install/#distributions>`_ that provide the full SciPy stack to end users in an easy to use and update format.
pt_br: O site SciPy lista `várias distribuições <https://scipy.org/install/#distributions>`_ que fornecem a pilha SciPy completa para usuários finais em um formato fácil de usar e atualizar.

source: `Anaconda <https://www.anaconda.com/products/individual/>`_ is a Python distribution published by Anaconda, Inc. It is a stable collection of Open Source packages for big data and scientific use. As of the 5.0 release of Anaconda, about 200 packages are installed by default, and a total of 400-500 can be installed and updated from the Anaconda repository.
pt_br: `Anaconda <https://www.anaconda.com/products/individual/>`_ é uma distribuição Python publicada pela Anaconda, Inc. É uma coleção estável de pacotes de código aberto para *big data* e uso científico. A partir da versão 5.0 do Anaconda, cerca de 200 pacotes são instalados por padrão, e um total de 400-500 podem ser instalados e atualizados a partir do repositório Anaconda.

source: ``conda`` is an open source (BSD licensed) package management system and environment management system included in Anaconda that allows users to install multiple versions of binary software packages and their dependencies, and easily switch between them. It is a cross-platform tool working on Windows, macOS, and Linux. Conda can be used to package up and distribute all kinds of packages, it is not limited to just Python packages. It has full support for native virtual environments. Conda makes environments first-class citizens, making it easy to create independent environments even for C libraries. It is written in Python, but is Python-agnostic. Conda manages Python itself as a package, so that :command:`conda update python` is possible, in contrast to pip, which only manages Python packages. Conda is available in Anaconda and Miniconda (an easy-to-install download with just Python and conda).
pt_br: ``conda`` é um sistema de gerenciamento de pacotes e de gerenciamento de ambiente de código aberto (licenciado por BSD) incluído no Anaconda que permite aos usuários instalar várias versões de pacotes de software binários e suas dependências, e alternar facilmente entre eles. É uma ferramenta multiplataforma que funciona no Windows, no macOS e no Linux. O Conda pode ser usado para empacotar e distribuir todos os tipos de pacotes, não está limitado apenas a pacotes Python. Possui suporte total para ambientes virtuais nativos. Conda torna os ambientes cidadãos de primeira classe, facilitando a criação de ambientes independentes até mesmo para bibliotecas C. Está escrito em Python, mas é agnóstico ao Python. O Conda gerencia o próprio Python como um pacote, de forma que :command:`conda update python` seja possível, em contraste com o pip, que gerencia apenas os pacotes Python. O Conda está disponível no Anaconda e no Miniconda (um download fácil de instalar com apenas Python e conda).

source: For example,let's install the `Requests`_ library from the :term:`Python Package Index (PyPI)`:
pt_br: Por exemplo, vamos instalar a biblioteca `Requests`_ do :term:`Python Package Index (PyPI)`:

source: Configuring trusted publishing
pt_br: Configurando publicação confiável

source: This guide relies on PyPI's `trusted publishing`_ implementation to connect to `GitHub Actions CI/CD`_. This is recommended for security reasons, since the generated tokens are created for each of your projects individually and expire automatically. Otherwise, you'll need to generate an `API token`_ for both PyPI and TestPyPI. In case of publishing to third-party indexes like :doc:`devpi <devpi:index>`, you may need to provide a username/password combination.
pt_br: Este guia se baseia na implementação de `publicação confiável`_ do PyPI para se conectar ao `CI/CD do GitHub Actions`_. Isso é recomendado por motivos de segurança, pois os tokens gerados são criados para cada um dos seus projetos individualmente e expiram automaticamente. Caso contrário, você precisará gerar um `token de API`_ para PyPI e TestPyPI. No caso de publicação em índices de terceiros como :doc:`devpi <devpi:index>`, pode ser necessário fornecer uma combinação de nome de usuário/senha.

source: Since this guide will demonstrate uploading to both PyPI and TestPyPI, we'll need two trusted publishers configured. The following steps will lead you through creating the "pending" publishers for your new :term:`PyPI project <Project>`. However it is also possible to add `trusted publishing`_ to any pre-existing project, if you are its owner.
pt_br: Como este guia demonstrará o envio para PyPI e TestPyPI, precisaremos de dois publicadores confiáveis configurados. As etapas a seguir guiarão você na criação dos publicadores "pendentes" para seu novo :term:`Projeto PyPI <Projeto>`. No entanto, também é possível adicionar `publicação confiável`_ a qualquer projeto preexistente, se você for o proprietário.

source: For security reasons, you must require `manual approval <https://docs.github.com/en/actions/deployment/targeting-different-environments/using-environments-for-deployment#deployment-protection-rules>`_ on each run for the ``pypi`` environment.
pt_br: Por motivos de segurança, você deve exigir a `aprovação manual <https://docs.github.com/en/actions/deployment/targeting-different-environments/using-environments-for-deployment#deployment-protection-rules>`_ em cada execução para o ambiente ``pypi``.

source: Now, let's add initial setup for our job that will publish to PyPI. It's a process that will execute commands that we'll define later. In this guide, we'll use the latest stable Ubuntu LTS version provided by GitHub Actions. This also defines a GitHub Environment for the job to run in its context and a URL to be displayed in GitHub's UI nicely. Additionally, it allows acquiring an OpenID Connect token that the ``pypi-publish`` actions needs to implement secretless trusted publishing to PyPI.
pt_br: Agora, vamos adicionar a configuração inicial para nosso trabalho que será publicado no PyPI. É um processo que executará comandos que definiremos mais tarde. Neste guia, usaremos a versão estável mais recente do Ubuntu LTS fornecida pelo GitHub Actions. Isso também define um ambiente GitHub para o trabalho ser executado em seu contexto e uma URL a ser exibida na interface do GitHub. Além disso, permite adquirir um token OpenID Connect que as ações ``pypi-publish`` precisam para implementar publicação confiável sem segredo para PyPI.

source: Signing the distribution packages
pt_br: Assinando os pacotes de distribuição

source: The following job signs the distribution packages with `Sigstore`_, the same artifact signing system `used to sign CPython <https://www.python.org/download/sigstore/>`_.
pt_br: O trabalho a seguir assina os pacotes de distribuição com `Sigstore`_, o mesmo sistema de assinatura de artefato `usado para assinar o CPython <https://www.python.org/download/sigstore/>`_.

source: Firstly, it uses the `sigstore/gh-action-sigstore-python GitHub Action`_ to sign the distribution packages. In the next step, an empty GitHub Release from the current tag is created using the ``gh`` CLI. Note this step can be further customised. See the `gh release documentation <https://cli.github.com/manual/gh_release>`_ as a reference.
pt_br: Em primeiro lugar, ele usa `sigstore/gh-action-sigstore-python do GitHub Action`_ para assinar os pacotes de distribuição. Na próxima etapa, uma versão vazia do GitHub da tag atual é criada usando a CLI ``gh``. Observe que esta etapa pode ser ainda mais personalizada. Consulte a `documentação de lançamento do gh <https://cli.github.com/manual/gh_release>`_ como referência.

source: You may need to manage your ``GITHUB_TOKEN`` permissions to enable creating the GitHub Release. See the `GitHub documentation <https://docs.github.com/repositories/managing-your-repositorys-settings-and-features/enabling-features-for-your-repository/managing-github-actions-settings-for-a-repository#configuring-the-default-github_token-permissions>`_ for instructions. Specifically, the token needs the ``contents: write`` permission.
pt_br: Pode ser necessário gerenciar suas permissões do ``GITHUB_TOKEN`` para permitir a criação da versão do GitHub. Consulte a `documentação do GitHub <https://docs.github.com/repositories/managing-your-repositorys-settings-and-features/enabling-features-for-your-repository/managing-github-actions-settings-for-a-repository#configuring-the-default-github_token-permissions>`_ para obter instruções. Especificamente, o token precisa da permissão ``contents: write``.

source: Finally, the signed distributions are uploaded to the GitHub Release.
pt_br: Finalmente, as distribuições assinadas são enviadas para o GitHub Release.

source: This is a replacement for GPG signatures, for which support has been `removed from PyPI <https://blog.pypi.org/posts/2023-05-23-removing-pgp/>`_. However, this job is not mandatory for uploading to PyPI and can be omitted.
pt_br: Este é um substituto para assinaturas GPG, para as quais o suporte foi `removido do PyPI <https://blog.pypi.org/posts/2023-05-23-removing-pgp/>`_. No entanto, este trabalho não é obrigatório para o envio para PyPI e pode ser omitido.

source: In this example, after installing your project, a ``spam-cli`` command will be available. Executing this command will do the equivalent of ``from spam import main_cli; main_cli()``.
pt_br: Neste exemplo, depois de instalar seu projeto, um comando ``spam-cli`` estará disponível. Executar este comando fará o equivalente a ``from spam import main_cli; main_cli()``.

source: This can take two forms. You can put your license in a file, typically ``LICENSE`` or ``LICENSE.txt``, and link that file here:
pt_br: Isto pode tomar duas formas. Você pode colocar sua licença em um arquivo, tipicamente ``LICENSE`` ou ``LICENSE.txt``, e vincular esse arquivo aqui:

source: or you can write the name of the license:
pt_br: ou você pode escrever o nome da licença:

source: Note that if the key contains spaces, it needs to be quoted, e.g., ``Website = "https://example.com"`` but ``"Official Website" = "https://example.com"``.
pt_br: Note que se a chave contém espaços, ela precisa ser citada, por exemplo, ``Website = "https://example.com"``, mas ``"Official Website" = "https://example.com"``.

source: The :doc:`discussions/index` section for in-depth explanations and discussion about topics, such as:
pt_br: A seção :doc:`discussions/index` para explicações aprofundadas e discussão sobre temas, tais como:

source: conda is the package management tool for `Anaconda <https://docs.anaconda.com/anaconda/>`__ Python installations. Anaconda Python is a distribution from `Anaconda, Inc <https://www.anaconda.com/products/individual>`__ specifically aimed at the scientific community, and in particular on Windows where the installation of binary extensions is often difficult.
pt_br: conda é a ferramenta de gerenciamento de pacotes para as instalações do `Anaconda <https://docs.anaconda.com/anaconda/>`__ Python . Anaconda Python é uma distribuição do `Anaconda, Inc <https://www.anaconda.com/products/individual>`__ voltada especificamente para a comunidade científica, e em particular no Windows onde a instalação de extensões binárias é frequentemente difícil .

source: Conda is a completely separate tool from :ref:`pip`, virtualenv and wheel, but provides many of their combined features in terms of package management, virtual environment management and deployment of binary extensions.
pt_br: Conda é uma ferramenta completamente separada de :ref:`pip`, virtualenv e wheel, mas fornece muitos de seus recursos combinados em termos de gerenciamento de pacotes, gerenciamento de ambiente virtual e implantação de extensões binárias.

source: Conda does not install packages from PyPI and can install only from the official Anaconda repositories, or anaconda.org (a place for user-contributed *conda* packages), or a local (e.g. intranet) package server. However, note that :ref:`pip` can be installed into, and work side-by-side with conda for managing :term:`distributions <Distribution Package>` from PyPI. Also, `conda skeleton <https://docs.conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`__ is a tool to make Python packages installable by conda by first fetching them from PyPI and modifying their metadata.
pt_br: O Conda não instala pacotes do PyPI e pode instalar apenas a partir dos repositórios oficiais do Anaconda, ou anaconda.org (um local para pacotes *conda* contribuídos pelo usuário), ou um servidor de pacotes local (por exemplo, intranet). No entanto, observe que :ref:`pip` pode ser instalado e trabalhar lado a lado com o conda para gerenciar :term:`distribuições <Pacote de Distribuição>` do PyPI. Além disso, `conda skeleton <https://docs.conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`__ é uma ferramenta para fazer pacotes Python instaláveis pelo conda primeiro obtendo-os em PyPI e modificando seus metadados.

source: The contents of a wheel file, where {distribution} is replaced with the name of the package, e.g. ``beaglevote`` and {version} is replaced with its version, e.g. ``1.0.0``, consist of:
pt_br: O conteúdo de um arquivo wheel, onde {distribution} é substituído pelo nome do pacote, por exemplo, ``beaglevote`` e {version} é substituído por sua versão, p.ex., ``1.0.0``, consiste em:
