Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Flit uses ``pyproject.toml`` to configure a project. Flit does not rely on tools such as :ref:`setuptools` to build distributions, or :ref:`twine` to upload them to PyPI. Flit requires Python 3, but you can use it to distribute modules for Python 2, so long as they can be imported on Python 3.
eo: Flit uzas ``pyproject.toml`` por agordi projekton. Flit ne uzas :ref:`setuptools` por konstrui distribuon, nek uzas :ref:`twine` por alŝuti distribuojn al PyPI. Flit postulas Python 3, sed oni povas uzi ĝin por distribui tiujn modulojn por Python 2, kiuj estas importeblaj en Python 3.
ja: Flit は、 ``pyproject.toml`` を使ってプロジェクトの設定を行います。Flit は、配布物をビルドする :ref:`setuptools` やそれを PyPI へアップロードする :ref:`twine` のようなツールには依存していません。 Flit は Python 3 を要求しますが、Python 3 上にインポートできるものであれば Python 2 向けのモジュールでも配布することが可能です。
pt_br: Flit usa ``pyproject.toml`` para configurar um projeto. O Flit não depende de ferramentas como :ref:`setuptools` para construir distribuições, ou :ref:`twine` para enviá-las ao PyPI. O Flit requer Python 3, mas você pode usá-lo para distribuir módulos para Python 2, desde que eles possam ser importados no Python 3.
ru: Flit использует ``pyproject.toml`` для конфигурирования проекта. Flit не полагается на такие инструменты, как :ref:`setuptools` для сборки дистрибутивов или :ref:`twine` для их загрузки на PyPI. Flit требует Python 3, но вы можете использовать его для распространения модулей для Python 2, если они могут быть импортированы на Python 3.
ta: ஒரு திட்டத்தை உள்ளமைக்க FLIT `` pyproject.toml`` ஐப் பயன்படுத்துகிறது. ஃபிளிட் போன்ற கருவிகளை நம்பவில்லை: குறிப்பு: விநியோகங்களை உருவாக்க `செடிப்டூல்ச்`, அல்லது: ref:` ட்வைன்` அவற்றை பைபியில் பதிவேற்ற. ஃப்ளிட்டுக்கு பைதான் 3 தேவைப்படுகிறது, ஆனால் பைதான் 2 க்கான தொகுதிகளை விநியோகிக்க நீங்கள் அதைப் பயன்படுத்தலாம், அவை பைதான் 3 இல் இறக்குமதி செய்யப்படும் வரை.

source: The flit package is lifted by `Matthias Bussonnier <https://github.com/Carreau>`__ since October 2023 on the `tidelift platform <https://tidelift.com/lifter/search/pypi/flit>`__, and funds sent to the PSF and earmarked for PyPA usage.
eo: La pako flit estas subtenata de `Matthias Bussonnier <https://github.com/Carreau>`__ ekde Oktobro 2023 sur la `platformo Tidelift <https://tidelift.com/lifter/search/pypi/flit>`__, kun fonduso sendita al PSF kaj markita por PyPA.
ja: flit パッケージは、2023年10月以来、 `tidelift platform <https://tidelift.com/lifter/search/pypi/flit>`__ でリフト <lift> (訳註、維持管理に対して対価を払うの意か) され、また、PSF に送られたファンドで PyPA 向けに使うように指定された資金を使って、 `Matthias Bussonnier <https://github.com/Carreau>`__ によって維持管理されています。
pt_br: O pacote flit é levantado por `Matthias Bussonnier <https://github.com/Carreau>`__ desde outubro de 2023 na `plataforma do tidelift <https://tidelift.com/lifter/search/pypi/flit>`__, e os fundos enviados para o PSF e destinados ao uso da PyPA.
ru: Пакет flit поднимается `Маттиасом Буссоньером <https://github.com/Carreau>`__ с октября 2023 года на платформе `tidelift <https://tidelift.com/lifter/search/pypi/flit>`__, а средства отправляются в PSF и предназначаются для использования в PyPA.
ta: ஃபிளிட் தொகுப்பு `மத்தியாச் புச்சன்னியர் <https://github.com/carreau>` __ அக்டோபர் 2023 முதல் `டிடெலிஃப்ட் இயங்குதளத்தில் <https://tidelift.com/lifter/search/pypi/flit> __, மற்றும் பி.எச்.எஃப் -க்கு அனுப்பப்பட்ட பொருள் மற்றும் பைபா பயன்பாட்டிற்காக ஒதுக்கப்பட்டுள்ளது.

source: hatch
ta: அட்ச்

source: `Docs <https://hatch.pypa.io/latest/>`__ | `GitHub <https://github.com/pypa/hatch>`__ | `PyPI <https://pypi.org/project/hatch>`__
eo: `Dokumentaro <https://hatch.pypa.io/latest/>`__ | `GitHub <https://github.com/pypa/hatch>`__ | `PyPI <https://pypi.org/project/hatch>`__
ja: `説明文書 <https://hatch.pypa.io/latest/>`__ | `GitHub <https://github.com/pypa/hatch>`__ | `PyPI <https://pypi.org/project/hatch/>`__
pt_br: `Documentação <https://hatch.pypa.io/latest/>`__ | `GitHub <https://github.com/pypa/hatch>`__ | `PyPI <https://pypi.org/project/hatch/>`__
ru: `Документы <https://hatch.pypa.io/latest/>`__ | `GitHub <https://github.com/pypa/hatch>`__ | `PyPI <https://pypi.org/project/hatch>`__
ta: `டாக்ச் <https://hatch.pypa.io/latest/>` __ | `Github <https://github.com/pypa/hatch>` __ | `Pypi <https://pypi.org/project/hatch> ____

source: Hatch is a unified command-line tool meant to conveniently manage dependencies and environment isolation for Python developers. Python package developers use Hatch and its :term:`build backend <Build Backend>` Hatchling to configure, version, specify dependencies for, and publish packages to PyPI. Its plugin system allows for easily extending functionality.
eo: Hatch estas unuigita komandlinia ilo por facile administri dependecojn kaj izoli mediojn por Python-programistoj. Aŭtoroj de Python-pako uzas Hatch kaj ĝian :term:`konstruan malfasadon <Build Backend>` por agordi pakojn, spuri versiojn, specifi dependecojn, kaj eldoni pakojn al PyPI. La kromprograma sistemo de Hatch faciligas etendado de ĝiaj funkcioj.
ja: Hatch は、 Python での開発者向けに依存関係の管理や環境の分離を便利に行うための統合されたコマンドラインツールです。 Python パッケージ開発者は Hatch とその :term:`ビルドバックエンド <Build Backend>` である Hatchling を使って、パッケージの設定を実施し、バージョン管理を行い、依存関係を指定し、そして PyPI で公開することができます。プラグインシステムがあるので、容易に機能を拡張することができます。
pt_br: Hatch é uma ferramenta de linha de comando unificada destinada para, de forma conveniente, gerenciar dependências e isolamento de ambiente para desenvolvedores Python. Os desenvolvedores de pacotes Python usam o Hatch e seu :term:`backend de construção <Build Backend>` Hatchling para configurar, criar versões, especificar dependências e publicar pacotes no PyPI. Seu sistema de plugins permite estender facilmente a funcionalidade.
ru: Hatch - это унифицированный инструмент командной строки, предназначенный для удобного управления зависимостями и изоляции окружения для разработчиков Python. Разработчики пакетов Python используют Hatch и его :term:`build backend <Build Backend>` Hatchling для конфигурирования, версионирования, указания зависимостей и публикации пакетов в PyPI. Его система плагинов позволяет легко расширять функциональность.
ta: அட்ச் என்பது ஒரு ஒருங்கிணைந்த கட்டளை-வரி கருவியாகும், அதாவது பைதான் டெவலப்பர்களுக்கான சார்புநிலைகள் மற்றும் சுற்றுச்சூழல் தனிமைப்படுத்தலை வசதியாக நிர்வகிப்பதாகும். பைதான் தொகுப்பு உருவாக்குபவர்கள் அட்ச் மற்றும் அதன்: காலத்தைப் பயன்படுத்துகிறார்கள்: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>` கட்டமைக்க, பதிப்பு, சார்புநிலைகளை குறிப்பிடுதல் மற்றும் PYPI க்கு தொகுப்புகளை வெளியிடுவது. அதன் சொருகி அமைப்பு செயல்பாட்டை எளிதில் நீட்டிக்க அனுமதிக்கிறது.

source: packaging
eo: pakado
ja: packaging ライブラリ
pt_br: empacotamento
ta: பொதியாக்கம்

source: :doc:`Docs <packaging:index>` | `Issues <https://github.com/pypa/packaging/issues>`__ | `GitHub <https://github.com/pypa/packaging>`__ | `PyPI <https://pypi.org/project/packaging>`__
eo: :doc:`Dokumentaro <packaging:index>` | `Cimoj <https://github.com/pypa/packaging/issues>`__ | `GitHub <https://github.com/pypa/packaging>`__ | `PyPI <https://pypi.org/project/packaging>`__
ja: :doc:`説明文書 <packaging:index>` | `課題リスト <https://github.com/pypa/packaging/issues>`__ | `GitHub <https://github.com/pypa/packaging>`__ | `PyPI <https://pypi.org/project/packaging>`__
pt_br: :doc:`Documentação <packaging:index>` | `Issues <https://github.com/pypa/packaging/issues>`__ | `GitHub <https://github.com/pypa/packaging>`__ | `PyPI <https://pypi.org/project/packaging>`__
ru: :doc:`Документы <packaging:index>` | `Проблемы <https://github.com/pypa/packaging/issues>`__ | `GitHub <https://github.com/pypa/packaging>`__ | `PyPI <https://pypi.org/project/packaging>`__
ta: : டாக்: `டாக்ச் <பேக்கேசிங்: குறியீட்டு>` | `சிக்கல்கள் <https://github.com/pypa/packaging/issues>` __ | `Github <https://github.com/pypa/packaging>` __ | `Pypi <https://pypi.org/project/packaging>` __

source: Core utilities for Python packaging used by :ref:`pip` and :ref:`setuptools`.
eo: Kernaj iloj por pakado de Python uzataj de :ref:`pip` kaj :ref:`setuptools`.
ja: (packaging ライブラリには) :ref:`pip` や :ref:`setuptools` で使われる Python パッケージングのための中核的なユーティリティ (としての core utilities があります)。
pt_br: Utilitários básicos para o empacotamento do Python usado por :ref:`pip` e :ref:`setuptools`.
ru: Основные утилиты для Python упаковки, используемой:ref:`pip'' и :ref:`setuptools'.
ta: பயன்படுத்திய பைதான் பேக்கேசிங்கிற்கான முக்கிய பயன்பாடுகள்: ref: `பிப்` மற்றும்: குறிப்பு:` செட்ப்டூல்ச்`.

source: The core utilities in the packaging library handle version handling, specifiers, markers, requirements, tags, and similar attributes and tasks for Python packages. Most Python users rely on this library without needing to explicitly call it; developers of the other Python packaging, distribution, and installation tools listed here often use its functionality to parse, discover, and otherwise handle dependency attributes.
ja: packaging ライブラリの core utilities は、バージョンの取り扱い、識別子、マーカ、依存先パッケージ、タグ、その他これに類似した属性やタスクを取り扱います。 Python ユーザのほとんどは、明示的に呼び出す必要に迫られることはなくともこのライブラリに依存しています; ここにリストされているような Python のパッケージングや配布やインストールを扱う他のパッケージを開発する者は、パースしたり検出したりそうでなければ依存関係の属性を取り扱うようなこのライブラリの機能をしばしば利用しています。
pt_br: Os utilitários principais na biblioteca de empacotamento lidam com manipulação de versão, especificadores, marcadores, requisitos, tags e atributos e tarefas semelhantes para pacotes Python. A maioria dos usuários Python confia nesta biblioteca sem precisar chamá-la explicitamente; os desenvolvedores de outras ferramentas de empacotamento, distribuição e instalação Python listadas aqui geralmente usam sua funcionalidade para analisar, descobrir e, de outra forma, lidar com atributos de dependência.
ru: Основные утилиты библиотеки упаковки работают с версиями, спецификаторами, маркерами, требованиями, тегами и подобными атрибутами и задачами для пакетов Python. Большинство пользователей Python используют эту библиотеку без необходимости ее явного вызова; разработчики других перечисленных здесь инструментов для упаковки, распространения и установки Python часто используют ее функциональность для анализа, обнаружения и другой обработки атрибутов зависимостей.
ta: பேக்கேசிங் நூலகத்தில் உள்ள முக்கிய பயன்பாடுகள் பதிப்பு கையாளுதல், குறிப்பான்கள், குறிப்பான்கள், தேவைகள், குறிச்சொற்கள் மற்றும் பைதான் தொகுப்புகளுக்கான ஒத்த பண்புக்கூறுகள் மற்றும் பணிகள். பெரும்பாலான பைதான் பயனர்கள் இந்த நூலகத்தை வெளிப்படையாக அழைக்கத் தேவையில்லாமல் நம்பியுள்ளனர்; இங்கே பட்டியலிடப்பட்டுள்ள பிற பைதான் பேக்கேசிங், வழங்கல் மற்றும் நிறுவல் கருவிகளின் உருவாக்குபவர்கள் பெரும்பாலும் அதன் செயல்பாட்டைப் பயன்படுத்துகிறார்கள், இது சார்பு பண்புகளை அலசவும், கண்டறியவும், கையாளவும் பயன்படுத்துகிறது.

source: This project specifically focuses on implementing the modern Python packaging interoperability standards defined at :ref:`packaging-specifications`, and will report errors for sufficiently old legacy packages that are incompatible with those standards. In contrast, the :ref:`distlib` project is a more permissive library that attempts to provide a plausible reading of ambiguous metadata in cases where :ref:`packaging` will instead report on error.
ja: このプロジェクトは、 :ref:`パッケージング仕様 <packaging-specifications` で定義された近代的な Python パッケージング相互運用性標準を実装することに焦点を当てており、この標準と互換性が取れないほど古いレガシーパッケージについてエラーを報告します。対照的に、 :ref:`distlib` プロジェクトはもっと寛容なライブラリで、 :ref:`packaging` ならばエラーを報告するような場合であっても曖昧なメタデータをもっともらしく読み込もうと試みます。
pt_br: Este projeto foca especificamente na implementação dos padrões modernos de interoperabilidade de pacotes Python definidos em :ref:`packaging-specifications`, e irá relatar erros para pacotes legados suficientemente antigos que são incompatíveis com esses padrões. Em contraste, o projeto :ref:`distlib` é uma biblioteca mais permissiva que tenta fornecer uma leitura plausível de metadados ambíguos em casos onde :ref:`packaging` irá relatar um erro.
ru: Этот проект фокусируется на реализации современных стандартов совместимости упаковки Python, определенных в :ref:`packaging-specifications`, и будет сообщать об ошибках для достаточно старых унаследованных пакетов, несовместимых с этими стандартами. В отличие от этого, проект :ref:`distlib` - это более свободная библиотека, которая пытается обеспечить правдоподобное прочтение неоднозначных метаданных в тех случаях, когда :ref:`packaging` вместо этого сообщит об ошибке.
ta: இந்த திட்டம் குறிப்பாக நவீன பைதான் பேக்கேசிங் இயங்குதன்மை தரங்களை செயல்படுத்துவதில் கவனம் செலுத்துகிறது: குறிப்பு: ref: `பேக்கேசிங்-குறிப்பிட்டவை`, மேலும் அந்த தரங்களுடன் பொருந்தாத போதுமான பழைய மரபு தொகுப்புகளுக்கான பிழைகளை புகாரளிக்கும். இதற்கு நேர்மாறாக,: ref: `Distlib` திட்டம் என்பது மிகவும் அனுமதிக்கப்பட்ட நூலகமாகும், இது தெளிவற்ற மெட்டாடேட்டாவை நம்பத்தகுந்த வாசிப்பை வழங்க முயற்சிக்கிறது: ref:` பேக்கேசிங்` அதற்கு பதிலாக பிழையைப் புகாரளிக்கும்.

source: pip
ta: பிப்

source: `Docs <https://pip.pypa.io/>`__ | `Issues <https://github.com/pypa/pip/issues>`__ | `GitHub <https://github.com/pypa/pip>`__ | `PyPI <https://pypi.org/project/pip/>`__
eo: `Dokumentaro <https://pip.pypa.io/>`__ | `Cimoj <https://github.com/pypa/pip/issues>`__ | `GitHub <https://github.com/pypa/pip>`__ | `PyPI <https://pypi.org/project/pip/>`__
ja: `説明文書 <https://pip.pypa.io/>`__ | `課題リスト <https://github.com/pypa/pip/issues>`__ | `GitHub <https://github.com/pypa/pip>`__ | `PyPI <https://pypi.org/project/pip/>`__
pt_br: `Documentação <https://pip.pypa.io/>`__ | `Issues <https://github.com/pypa/pip/issues>`__ | `GitHub <https://github.com/pypa/pip>`__ | `PyPI <https://pypi.org/project/pip/>`__
ru: `Документы <https://pip.pypa.io/>`__ | `Проблемы <https://github.com/pypa/pip/issues>`__ | `GitHub <https://github.com/pypa/pip>`__ | `PyPI <https://pypi.org/project/pip/>`__
ta: `டாக்ச் <https://pip.pypa.io/> __ | `சிக்கல்கள் <https://github.com/pypa/pip/issues>` __ | `Github <https://github.com/pypa/pip>` __ | `Pypi <https://pypi.org/project/pip/> ____

source: The most popular tool for installing Python packages, and the one included with modern versions of Python.
eo: La plej populara ilo por instali Python-pakojn, inkluzivita en modernaj versioj de Python.
ja: Python パッケージをインストールするに当たっての最もよく知られたツールで、Python の新しめのバージョンには同梱されているもの。
pt_br: A ferramenta mais popular para instalação de pacotes Python e incluída nas versões modernas do Python.
ru: Самый популярный инструмент для установки пакетов Python, входящий в состав современных версий Python.
ta: பைதான் தொகுப்புகளை நிறுவுவதற்கான மிகவும் பிரபலமான கருவி, மற்றும் பைதானின் நவீன பதிப்புகளுடன் சேர்க்கப்பட்டுள்ளது.

source: It provides the essential core features for finding, downloading, and installing packages from PyPI and other Python package indexes, and can be incorporated into a wide range of development workflows via its command-line interface (CLI).
eo: Ĝi provizas la necesajn ĉeffunkciojn por serĉi, elŝuti, kaj instali pakojn el PyPI kaj aliaj Python-pakindeksoj kaj estas integrebla en multajn evoluajn laborfluojn per la komandlinia fasado (CLI).
ja: PyPI やその他の Python パッケージインデックスのパッケージを探索・ダウンロード・インストールするための基本的な機能を提供するとともに、コマンドラインインタフェイス (CLI) を通じて広範囲の開発ワークフローに組み込むことができます。
pt_br: Ele fornece os recursos básicos essenciais para localizar, baixar e instalar pacotes do PyPI e outros índices de pacotes do Python e pode ser incorporado em uma ampla gama de fluxos de trabalho de desenvolvimento por meio de sua interface de linha de comando (CLI).
ru: Он предоставляет основные функции для поиска, загрузки и установки пакетов из PyPI и других индексов пакетов Python, а также может быть включен в широкий спектр рабочих процессов разработки с помощью интерфейса командной строки (CLI).
ta: இது PYPI மற்றும் பிற பைதான் தொகுப்பு குறியீடுகளிலிருந்து தொகுப்புகளைக் கண்டறிதல், பதிவிறக்கம் செய்தல் மற்றும் நிறுவுவதற்கான அத்தியாவசிய முக்கிய அம்சங்களை வழங்குகிறது, மேலும் அதன் கட்டளை-வரி இடைமுகம் (CLI) வழியாக பரந்த அளவிலான மேம்பாட்டு பணிப்பாய்வுகளில் இணைக்கப்படலாம்.

source: Pipenv
ta: பைபென்வ்

source: :doc:`Docs <pipenv:index>` | `Source <https://github.com/pypa/pipenv>`__ | `Issues <https://github.com/pypa/pipenv/issues>`__ | `PyPI <https://pypi.org/project/pipenv>`__
eo: :doc:`Dokumentaro <pipenv:index>` | `Fonto <https://github.com/pypa/pipenv>`__ | `Cimoj <https://github.com/pypa/pipenv/issues>`__ | `PyPI <https://pypi.org/project/pipenv>`__
ja: :doc:`説明文書 <pipenv:index>` | `ソースコード <https://github.com/pypa/pipenv>`__ | `課題リスト <https://github.com/pypa/pipenv/issues>`__ | `PyPI <https://pypi.org/project/pipenv>`__
pt_br: :doc:`Documentação <pipenv:index>` | `Código-fonte <https://github.com/pypa/pipenv>`__ | `Issues <https://github.com/pypa/pipenv/issues>`__ | `PyPI <https://pypi.org/project/pipenv>`__
ru: :doc:`Документы <pipenv:index>` | `Источник <https://github.com/pypa/pipenv>`__ | `Проблемы <https://github.com/pypa/pipenv/issues>`__ | `PyPI <https://pypi.org/project/pipenv>`__
ta: : டாக்: `டாக்ச் <பைபென்வி: குறியீட்டு>` | `மூல <https://github.com/pypa/pipenv>` __ | `சிக்கல்கள் <https://github.com/pypa/pipenv/issues> __ | `Pypi <https://pypi.org/project/pipenv> ____

source: Pipenv is a project that aims to bring the best of all packaging worlds to the Python world. It harnesses :ref:`Pipfile`, :ref:`pip`, and :ref:`virtualenv` into one single toolchain. It can autoimport ``requirements.txt`` and also check for CVEs in `Pipfile`_ using `safety <https://pyup.io/safety>`_.
eo: Pipenv estas projekto celanta provizi ĉiajn bonaĵojn al la mondo de Python. Ĝi jungas :ref:`Pipfile`, :ref:`pip`, kaj :ref:`virtualenv` al unu ilĉenon. Ĝi povas aŭtomate importi ``requirements.txt`` kaj kontroli vundeblecojn en `Pipfile`_ per `safety <https://pyup.io/safety>`_.
ja: Pipenv は、全てのパッケージング世界の最良のものを Python 世界に持ち込むことを目的とするプロジェクトです。 :ref:`Pipfile` ・ :ref:`pip` ・ :ref:`virtualenv` を単一のツールチェーンにまとめ上げるものです。 ``requirements.txt`` を自動的にインポートすることができ、また、 `safety <https://pyup.io/safety>`_ を使って `Pipfile`_ 中の CVE を確認することができます。
pt_br: Pipenv é um projeto que visa trazer o melhor de todos os mundos de empacotamento para o mundo Python. Ele agrega :ref:`Pipfile`, :ref:`pip` e :ref:`virtualenv` em um único conjunto de ferramentas. Ele pode autoimportar ``requirements.txt`` e também pode verificar por CVEs no `Pipfile`_ usando `safety <https://pyup.io/safety>`_.
ru: Pipenv - это проект, целью которого является привнесение лучшего из всех миров упаковки в мир Python. Он объединяет :ref:`Pipfile`, :ref:`pip` и :ref:`virtualenv` в единый инструментарий. Он может автоимпортировать ``requirements.txt``, а также проверять CVE в ``Pipfile`` с помощью `safety <https://pyup.io/safety>`_.
ta: பைபென்வி என்பது ஒரு திட்டமாகும், இது அனைத்து பேக்கேசிங் உலகங்களையும் பைதான் உலகிற்கு கொண்டு வருவதை நோக்கமாகக் கொண்டுள்ளது. இது பயன்படுத்துகிறது: ref: `பிப்ஃபைல்`,: குறிப்பு:` பிப்`, மற்றும்: ref: `Virtualenv` ஒரு ஒற்றை கருவித்தொகுப்பில். இது `` தேவைகள்.

source: Pipenv aims to help users manage environments, dependencies, and imported packages on the command line. It also works well on Windows (which other tools often underserve), makes and checks file hashes, to ensure compliance with hash-locked dependency specifiers, and eases uninstallation of packages and dependencies.
eo: Pipenv helpas uzantoj komandlinie administri mediojn, dependecojn kaj importitajn pakojn. Ĝi ankaŭ funkcias bone sur Windows (malkiel kelkaj aliaj iloj), faras kaj kontrolas haketaĵojn de dosieroj (por obei haketaĵe ŝlositajn dependeco-specifilojn), kaj faciligas malinstaladon de pakoj kaj dependaĵoj.
ja: Pipenv は、ユーザがコマンドラインで環境・依存関係・インポートされたパッケージを管理することを補助することを目的としています。 (他のツールが往々にしてうまく動かない) Windows 上でもきちんと動作し、ファイルのハッシュ値を計算し確認することでハッシュ値による依存関係識別子との互換性を確保し、パッケージの依存関係先のアンインストールを容易にします。
pt_br: O Pipenv visa ajudar os usuários a gerenciar ambientes, dependências e pacotes importados na linha de comando. Ele também funciona bem no Windows (que outras ferramentas muitas vezes não atendem), cria e verifica hashes de arquivo, para garantir a conformidade com especificadores de dependência bloqueados por hash e facilita a desinstalação de pacotes e dependências.
ru: Pipenv призван помочь пользователям управлять окружениями, зависимостями и импортированными пакетами в командной строке. Он также хорошо работает под Windows (что часто не удается другим инструментам), создает и проверяет хэши файлов, чтобы обеспечить соответствие спецификаторам зависимостей с хэш-блокировкой, и облегчает удаление пакетов и зависимостей.
ta: கட்டளை வரியில் சூழல்கள், சார்புநிலைகள் மற்றும் இறக்குமதி செய்யப்பட்ட தொகுப்புகளை நிர்வகிக்க பயனர்களுக்கு உதவுவதை பைபென்வி நோக்கமாகக் கொண்டுள்ளது. ஆச்-பூட்டப்பட்ட சார்பு குறிப்பான்களுடன் இணங்குவதை உறுதிசெய்ய, இது விண்டோசிலும் (பிற கருவிகள் பெரும்பாலும் அடிக்கோடிட்டுக் காட்டும்), கோப்பு ஆச்களை உருவாக்கி சரிபார்க்கிறது, மேலும் தொகுப்புகள் மற்றும் சார்புகளை நிறுவல் நீக்குவதை எளிதாக்குகிறது.

source: Pipfile
ta: பிப்ஃபைல்

source: `Source <https://github.com/pypa/pipfile>`__
eo: `Fonto <https://github.com/pypa/pipfile>`__
ja: `ソースコード <https://github.com/pypa/pipfile>`__
pt_br: `Código-fonte <https://github.com/pypa/pipfile>`__
ru: `Исходный код <https://github.com/pypa/pipfile>`__
ta: `ஆதாரம் <https://github.com/pypa/pipfile>` __

source: :file:`Pipfile` and its sister :file:`Pipfile.lock` are a higher-level application-centric alternative to :ref:`pip`'s lower-level :file:`requirements.txt` file.
eo: :file:`Pipfile` kaj ĝia frato :file:`Pipfile.lock` estas altnivela programo-centra alternativo al la malaltnivela dosiero :file:`requirements.txt` de :ref:`pip`.
ja: :file:`Pipfile` とその姉妹 :file:`Pipfile.lock` は、 :ref:`pip` における低レベルの :file:`requirements.txt` ファイルに代わる高レベルのアプリケーション中心のファイルです。
pt_br: :file:`Pipfile` e sua irmã :file:`Pipfile.lock` são uma alternativa centrada na aplicação de nível superior ao arquivo de baixo nível :file:`requirements.txt` do :ref:`pip`.
ru: :file:`Pipfile` и его собрат :file:`Pipfile.lock` являются ориентированной на приложения альтернативой более низкоуровневому файлу :ref:`pip` :file:`requirements.txt`.
ta: :file:`Pipfile` and its sister :file:`Pipfile.lock` அரே a higher-level application-centric alternative பெறுநர் :ref:`pip`'s lower-level :file:`requirements.txt` file.

source: `Docs <https://pipx.pypa.io/>`__ | `GitHub <https://github.com/pypa/pipx>`__ | `PyPI <https://pypi.org/project/pipx/>`__
eo: `Dokumentaro <https://pipx.pypa.io/>`__ | `GitHub <https://github.com/pypa/pipx>`__ | `PyPI <https://pypi.org/project/pipx/>`__
ja: `説明文書 <https://pipx.pypa.io/>`__ | `GitHub <https://github.com/pypa/pipx>`__ | `PyPI <https://pypi.org/project/pipx/>`__
pt_br: `Documentação <https://pipx.pypa.io/>`__ | `GitHub <https://github.com/pypa/pipx>`__ | `PyPI <https://pypi.org/project/pipx/>`__
ta: `டாக்ச் <https://pipx.pypa.io/> __ | `Github <https://github.com/pypa/pipx>` __ | `Pypi <https://pypi.org/project/pipx/> ____

source: pipx is a tool to install and run Python command-line applications without causing dependency conflicts with other packages installed on the system.
eo: pipx estas ilo por instali kaj ruli Python-an komandlinian programon sen dependeca konflikto kun aliaj pakoj instalitaj sur la sistemo.
ja: pipx は、システムにインストール済みの他のパッケージとの間に依存関係の衝突を起こすことなく Python のコマンドラインアプリケーションをインストールし動作させるためのツールです。
pt_br: pipx é uma ferramenta para instalar e executar aplicações de linha de comando Python sem causar conflitos de dependência com outros pacotes instalados no sistema.
ru: pipx - это инструмент для установки и запуска приложений командной строки Python, не вызывая конфликтов зависимостей с другими пакетами, установленными в системе.
ta: கணினியில் நிறுவப்பட்ட பிற தொகுப்புகளுடன் சார்பு மோதல்களை ஏற்படுத்தாமல் பைதான் கட்டளை-வரி பயன்பாடுகளை நிறுவி இயக்க PIPX என்பது ஒரு கருவியாகும்.
