Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Implementations with a very unstable ABI may use the first 6 bytes (as 8 base64-encoded characters) of the SHA-256 hash of their source code revision and compiler flags, etc, but will probably not have a great need to distribute binary distributions. Each implementation's community may decide how to best use the ABI tag.
eo: Python-realigo kun tre malstabila ABI povas uzi la unuajn 6 bajtojn (kiel ok base64-koditajn signojn) de la haketaĵo SHA-256 de la fontkoda revizio kaj tradukilaj flagoj ktp, sed ties komunumo verŝajne ne tre bezonas distribui duumajn distribuojn. La komunumo de ĉiu realigo povas decidi la uzadon de la ABI-etikedo.
ja: 非常に不安定な ABI を持つ実装は、そのソースコードのリビジョンやコンパイラフラグその他の SHA-256 ハッシュ値の最初の６バイトを (BASE64にエンコードされた８文字として) 用いても構いませんが、おそらくはバイナリ配布物を配布することには大きな需要はないでしょう。それぞれの実装のコミュニティで ABI タグをどのように用いるのが最適かを決定すればよいでしょう。
pt_br: Implementações com uma ABI muito instável podem usar os primeiros 6 bytes (como 8 caracteres codificados em base64) do hash SHA-256 de sua revisão de código-fonte e sinalizadores de compilador, etc, mas provavelmente não terão uma grande necessidade de distribuir distribuições binárias. A comunidade de cada implementação pode decidir como usar melhor a tag ABI.
ru: Реализации с очень нестабильным ABI могут использовать первые 6 байт (как 8 символов в base64-кодировке) SHA-256 хэша ревизии исходного кода, флаги компилятора и т. д., но, вероятно, не будут испытывать большой потребности в распространении бинарных дистрибутивов. Сообщество каждой реализации может решать, как лучше использовать метку ABI.
ta: மிகவும் நிலையற்ற பநிஇ கொண்ட செயலாக்கங்கள் அவற்றின் மூலக் குறியீடு திருத்தம் மற்றும் கம்பைலர் கொடிகள் போன்ற SHA-256 ஆசின் முதல் 6 பைட்டுகளை (8 பேச் 64-குறியிடப்பட்ட எழுத்துக்களாக) பயன்படுத்தலாம், ஆனால் பைனரி விநியோகங்களை விநியோகிக்க அதிக தேவை இருக்காது. ஒவ்வொரு செயல்படுத்தலின் சமூகமும் பநிஇ குறிச்சொல்லை எவ்வாறு சிறப்பாகப் பயன்படுத்துவது என்பதை தீர்மானிக்கலாம்.

source: Platform Tag
eo: Platformo-Etikedo
ja: プラットフォームタグ
pt_br: A tag Platform
ru: Метка платформы
ta: இயங்குதள குறிச்சொல்

source: Basic platform tags
eo: Bazaj platformaj etikedoj
ja: 基本的なプラットフォームタグ
ru: Базовые теги платформы
ta: அடிப்படை இயங்குதள குறிச்சொற்கள்

source: In its simplest form, the platform tag is :py:func:`sysconfig.get_platform()` with all hyphens ``-`` and periods ``.`` replaced with underscore ``_``. Until the removal of :ref:`distutils` in Python 3.12, this was ``distutils.util.get_platform()``. For example:
eo: En ĝia plej simpla formo, la platformo-etikedo estas :py:func:`sysconfig.get_platform()` kun ĉiuj streketoj ``-`` kaj punktoj ``.`` anstataŭigitaj per substrekoj ``_``. Ĝis la forigo de :ref:`distutils` en Python 3.12, tiu estis ``distutils.util.get_platform()``. Ekzemple:
ja: 最も単純な形式では、プラットフォームタグは、 :py:func:`sysconfig.get_platform()` (の出力) のすべてのハイフン ``-`` と ピリオド ``.`` をアンダースコア ``_`` で置き換えたものです。 Python 3.12 における :ref:`distutils` の削除があるまでは、これは ``distutils.util.get_platform()`` でした。例えば:
ru: В своей простейшей форме тег платформы - это :py:func:`sysconfig.get_platform()`` со всеми дефисами ``-`` и периодами ``.``, замененными на подчеркивание ``_``. До удаления :ref:`distutils` в Python 3.12, это было ``distutils.util.get_platform()``. Например:
ta: அதன் எளிமையான வடிவத்தில், இயங்குதள குறிச்சொல்: py: func: `sysconfig.get_platform ()` எல்லா ஐபன்களுடனும் `` --`` மற்றும் காலகட்டங்கள் `` `.`` அடிக்கோடிட்ட` `_`` உடன் மாற்றப்பட்டது. அகற்றும் வரை: குறிப்பு: பைதான் 3.12 இல் `தொலைதூரங்கள்`, இது` `distutils.util.get_platform ()` `. உதாரணமாக:

source: win32
ta: அது

source: linux_i386
ta: லினக்ச்_ஐ 386

source: linux_x86_64
ta: லினக்ச்_எக்ச் 86_64

source: ``manylinux``
ta: `` மேனிலினக்ச்``

source: The simple scheme above is insufficient for public distribution of wheel files to Linux platforms, due to the large ecosystem of Linux platforms and subtle differences between them.
eo: La ĉi-supra simpla skemo ne sufiĉas por publika distribuado de wheel-dosieroj al Linux-platformoj pro la diverseco de la granda ekosistemo de Linux-platformoj.
ja: 上記のような単純なスキームでは、Linux プラットフォーム向けに公開するための wheel ファイルの配布物用としては不十分で、それは、 Linux プラットフォーム群が巨大なエコシステムであって、プラットフォーム間に微妙な際が見られるためです。
ru: Простая схема, описанная выше, недостаточна для публичного распространения файлов wheel на платформах Linux из-за большой экосистемы платформ Linux и тонких различий между ними.
ta: லினக்ச் தளங்களின் பெரிய சுற்றுச்சூழல் அமைப்பு மற்றும் அவற்றுக்கிடையேயான நுட்பமான வேறுபாடுகள் காரணமாக, லினக்ச் தளங்களுக்கு சக்கர கோப்புகளை பொது விநியோகத்திற்கு மேலே உள்ள எளிய திட்டம் போதுமானதாக இல்லை.

source: Instead, for those platforms, the ``manylinux`` standard represents a common subset of Linux platforms, and allows building wheels tagged with the ``manylinux`` platform tag which can be used across most common Linux distributions.
eo: Anstataŭe, por tiuj platformoj, la normo ``manylinux`` estas komuna subaro de Linux-platformoj kaj permesas konstrui wheel kun la etikedo ``manylinux`` uzeblan tra oftaj Linux-distribuoj.
ja: 代わりに、そのようなプラットフォーム向けには、 ``manylinux`` という標準が Linux プラットフォームの共通のサブセットを体現していて、 ``manylinux`` プラットフォームタグを付けて wheel をビルドすることで一般的な Linux のディストリビューションのほとんどで使えるようにすることができます。
ru: Вместо этого, для этих платформ стандарт ``manylinux`` представляет общее подмножество платформ Linux и позволяет создавать колеса, помеченные тегом платформы ``manylinux``, которые могут быть использованы в большинстве распространенных дистрибутивов Linux.
ta: அதற்கு பதிலாக, அந்த தளங்களுக்கு, `` மேனிலினக்ச்`` தரநிலை லினக்ச் தளங்களின் பொதுவான துணைக்குழுவைக் குறிக்கிறது, மேலும் `` மேனிலினக்ச்`` இயங்குதள குறிச்சொல்லுடன் குறிக்கப்பட்ட சக்கரங்களை உருவாக்க அனுமதிக்கிறது, இது மிகவும் பொதுவான லினக்ச் விநியோகங்களில் பயன்படுத்தப்படலாம்.

source: The following older tags are still supported for backward compatibility:
eo: Jen malnovaj etikedoj ankoraŭ subtenataj por retrokongrueco:
ja: この後に述べる古めのタグ群は、後方互換性のために今もサポートされています:
ru: Следующие старые теги по-прежнему поддерживаются для обратной совместимости:
ta: பின்தங்கிய பொருந்தக்கூடிய தன்மைக்கு பின்வரும் பழைய குறிச்சொற்கள் இன்னும் ஆதரிக்கப்படுகின்றன:

source: ``manylinux1`` supports glibc 2.5 on ``x86_64`` and ``i686`` architectures.
eo: ``manylinux1`` subtenas glibc 2.5 ĉe la arĥitekturoj ``x86_64`` kaj ``i686``.
ja: ``manylinux1`` は、 ``x86_64`` と ``i686`` のアーキテクチャで libc 2.5 をサポートしています。
ru: ``manylinux1`` поддерживает glibc 2.5 на архитектурах ``x86_64`` и ``i686``.
ta: `` X86_64`` மற்றும் `i686`` கட்டமைப்புகளில்` `மேனிலினக்ச் 1`` கிளிப் 2.5 ஐ ஆதரிக்கிறது.

source: ``manylinux2010`` supports glibc 2.12 on ``x86_64`` and ``i686``.
eo: ``manylinux2010`` subtenas glibc 2.12 ĉe ``x86_64`` kaj ``i686``.
ja: ``manylinux2010`` は、 ``x86_64`` と ``i686`` 上で libc 2.12 をサポートしています。
ru: ``manylinux2010`` поддерживает glibc 2.12 на ``x86_64`` и ``i686``.
ta: `` x86_64`` மற்றும் `` i686`` ஆகியவற்றில் `` மேனிலினக்ச் 2010`` கிளிப் 2.12 ஐ ஆதரிக்கிறது.

source: ``manylinux2014`` supports glibc 2.17 on ``x86_64``, ``i686``, ``aarch64``, ``armv7l``, ``ppc64``, ``ppc64le``, and ``s390x``.
eo: ``manylinux2014`` subtenas glibc 2.17 ĉe ``x86_64``, ``i686``, ``aarch64``, ``armv7l``, ``ppc64``, ``ppc64le``, kaj ``s390x``.
ja: ``manylinux2014`` は、 ``x86_64`` ・ ``i686`` ・ ``aarch64`` ・ ``armv7l`` ・ ``ppc64`` ・ ``ppc64le`` ・ ``s390x`` 上で glibc 2.17 をサポートしています。
ru: ``manylinux2014`` поддерживает glibc 2.17 на ``x86_64``, ``i686``, ``aarch64``, ``armv7l``, ``ppc64``, ``ppc64le``, и ``390x``.
ta: `` X86_64``, `` i686``, `` aarch64``, `` ARMV7l``, `` பிபிசி 64``, `` பிபிசி 64le`` `.

source: In general, distributions built for older versions of the specification are forwards-compatible (meaning that ``manylinux1`` distributions should continue to work on modern systems) but not backwards-compatible (meaning that ``manylinux2010`` distributions are not expected to work on platforms that existed before 2010).
eo: Ĝenerale, distribuo konstruita por pli malnova versio de la specifo estas antaŭenkongrua (alivorte, distribuo ``manylinux1`` funkcias sur modernaj sistemoj) sed ne retrokongrua (alivorte, distribuo ``manylinux2010`` ne funkcias sur distribuo ekzistinta antaŭ 2010).
ja: 一般に、古めのバージョンの仕様向けにビルドされた配布物には前方互換性があります (というのは、 ``manylinux1`` の配布物はより新しいシステムでも同様に動作するはずだということです) が、後方互換性はありません (``manylinux2010`` の配布物が 2010 年よりも前に存在していたプラットフォームで動作するとは想定されていないということです) 。
pt_br: Em geral, as distribuições construídas para versões mais antigas da especificação são compatíveis com versões futuras (o que significa que as distribuições ``manylinux1`` devem continuar a funcionar em sistemas modernos), mas não compatíveis com versões anteriores (significando que distribuições ``manylinux2010`` não devem trabalhar em plataformas que existiam antes de 2010).
ru: В целом, дистрибутивы, созданные для старых версий спецификации, являются совместимыми вперед (то есть дистрибутивы ``manylinux1`` должны продолжать работать на современных системах), но не совместимыми назад (то есть дистрибутивы ``manylinux2010`` не должны работать на платформах, существовавших до 2010 года).
ta: பொதுவாக. 2010 க்கு முன்னர் இருந்த தளங்களில் வேலை செய்யுங்கள்).

source: Package maintainers should attempt to target the most compatible specification possible, with the caveat that the provided build environment for ``manylinux1`` and ``manylinux2010`` have reached end-of-life meaning that these images will no longer receive security updates.
eo: Mastrumanto de pako provu celi la plej kongruan specifon laŭeble, krom ke la provizitaj konstruo-medioj por ``manylinux1`` kaj ``manylinux2010`` estas eksvalidiĝintaj kaj ne plu ricevos ĝisdatigojn pri sekureco.
ja: ``manylinux1`` と ``manylinux2010`` は既に end-of-life に達していて、提供されているビルド環境にはもはやセキュリティアップデートが提供されることはないであろうという警告されていることもあって、パッケージ保守者は最も互換性のある仕様をターゲットにするように努力するべきです。
pt_br: Os mantenedores do pacote devem tentar atingir a especificação mais compatível possível, com a ressalva de que o ambiente de compilação fornecido para ``manylinux1`` e ``manylinux2010`` atingiu o fim da vida, o que significa que essas imagens não receberão mais atualizações de segurança.
ru: Сопровождающие пакеты должны стараться использовать максимально совместимую спецификацию, с оговоркой, что предоставленная среда сборки для ``manylinux1`` и ``manylinux2010`` уже отжила свой век, а значит, эти образы больше не будут получать обновления безопасности.
ta: `` மேனிலினக்ச் 1` மற்றும் `` மேனிலினக்ச் 2010`` ஆகியவற்றிற்கான வழங்கப்பட்ட உருவாக்க சூழலை உருவாக்கிய சூழலை வாழ்நாள் முழுவதும் அடைந்துவிட்டது என்ற எச்சரிக்கையுடன், தொகுப்பு பராமரிப்பாளர்கள் மிகவும் இணக்கமான விவரக்குறிப்பை குறிவைக்க முயற்சிக்க வேண்டும், அதாவது இந்த படங்கள் இனி பாதுகாப்பு புதுப்பிப்புகளைப் பெறாது.

source: The following table shows the minimum versions of relevant projects to support the various ``manylinux`` standards:
eo: Jen tabelo pri la minimumaj versioj de rilataj projektoj subtenantaj la diversajn normojn ``manylinux``:
ja: 適切なプロジェクトがサポートするさまざまな ``manylinux`` 標準の最低限のバージョンを次に掲げる表に示します:
pt_br: A tabela a seguir mostra as versões mínimas de projetos relevantes para oferecer suporte aos vários padrões ``manylinux``:
ru: В следующей таблице приведены минимальные версии соответствующих проектов для поддержки различных стандартов ``manylinux``:
ta: பின்வரும் அட்டவணை பல்வேறு `` மேனிலினக்ச்`` தரங்களை ஆதரிக்க தொடர்புடைய திட்டங்களின் குறைந்தபட்ச பதிப்புகளைக் காட்டுகிறது:

source: Tool
eo: Ilo
ja: ツール
pt_br: Ferramenta
ru: Инструмент
ta: கருவி

source: ``manylinux1``
ta: `` Mantinux1``

source: ``manylinux2010``
ta: `` Mantinux2010 `

source: ``manylinux2014``
ta: `` மேனிலினக்ச் 2014``

source: auditwheel
ta: தணிக்கை

source: Only support for ``manylinux_2_24`` has been added in auditwheel 3.3.0
eo: Nur subteno pri ``manylinux_2_24`` estis aldonita al auditwheel 3.3.0
ja: audit wheel 3.3.0 では ``manylinux_2_24`` へのサポートだけが追加されました
pt_br: Suporte somente para ``manylinux_2_24`` foi adicionado em auditwheel 3.3.0
ru: В auditwheel 3.3.0 добавлена только поддержка ``manylinux_2_24``
ta: `` மேனிலினக்ச்_2_24`` க்கான உதவி மட்டுமே தணிக்கைக்கு 3.3.0 இல் சேர்க்கப்பட்டுள்ளது

source: The musl version values can be obtained by executing the musl libc shared library the Python interpreter is currently running on, and parsing the output:
eo: Oni eltrovas la versian valoron de ``musl`` rulante la komunan C-bibliotekon de ``musl`` uzatan de la Python-interpretilo kaj analizante la eligaĵon:
ja: musl のバージョンの値は、 Python インタープリタが現在その上で走行している musl libc 共有ライブラリを実行し、その出力を字句解析することで得られます:
ru: Значения версий musl можно получить, выполнив команду musl libc shared library, на которой в данный момент работает интерпретатор Python, и разобрав полученный результат:
ta: MSL பதிப்பு மதிப்புகளைப் பெறலாம் MSL LIBC பகிரப்பட்ட நூலகத்தை இயக்குவதன் மூலம் பைதான் மொழிபெயர்ப்பாளர் தற்போது இயங்குகிறார், மேலும் வெளியீட்டை பாகுபடுத்துகிறார்:

source: There are currently two possible ways to find the musl library’s location that a Python interpreter is running on, either with the system ldd_ command, or by parsing the ``PT_INTERP`` section’s value from the executable’s ELF_ header.
eo: Aktuale ekzistas du manieroj por trovi la lokon de la biblioteko musl sur kiu Python-interpretilo ruliĝas: aŭ per la sistema komando ldd_, aŭ per analizado de la valoro de la sekcio ``PT_INTERP`` en la ELF_-ĉapo de la ruleblaĵo.
ja: Python インタープリタがその上で走行している musl ライブラリの場所を見つけるためには、現在、二つの可能なやり方があり、ひとつはシステムの ldd_ コマンドによるもの、もうひとつは 実行ファイルの ELF_ ヘッダから ``PT_INTERP`` セクションの値をパースする方法です。
ru: В настоящее время существует два способа найти местоположение библиотеки musl, на котором запущен интерпретатор Python: либо с помощью системной команды ldd_, либо путем разбора значения секции ``PT_INTERP`` из заголовка ELF_ исполняемого файла.
ta: ஒரு பைதான் மொழிபெயர்ப்பாளர் இயங்கும் MSL நூலகத்தின் இருப்பிடத்தைக் கண்டுபிடிக்க தற்போது இரண்டு வழிகள் உள்ளன, இது கணினி LDD_ கட்டளையுடன் அல்லது இயங்கக்கூடிய ELF_ தலைப்பிலிருந்து `` PT_INTERP`` பிரிவின் மதிப்பை பாகுபடுத்துவதன் மூலம்.

source: Use
eo: Uzado
ja: 使い方
pt_br: Uso
ru: Используйте
ta: பயன்படுத்தவும்

source: The tags are used by installers to decide which built distribution (if any) to download from a list of potential built distributions. The installer maintains a list of (pyver, abi, arch) tuples that it will support. If the built distribution's tag is ``in`` the list, then it can be installed.
ja: タグ類は、 (もしダウンロードが必要なら) 選択可能なビルド済配布物のリストの中からどれをダウンロードするのかをインストーラが決定するために使われます。インストーラは、自身がサポートする (pyver, abi, arch) タプルのリストを維持管理しています。ビルド済配布物のタグがリストに含まれて (``in`` ) いれば、それをインストールすることができます。
ru: Теги используются программами установки, чтобы решить, какой собранный дистрибутив (если таковой имеется) загрузить из списка потенциальных собранных дистрибутивов. Программа установки ведет список кортежей (pyver, abi, arch), которые она будет поддерживать. Если тег собранного дистрибутива находится ``в`` этом списке, то он может быть установлен.
ta: சாத்தியமான கட்டமைக்கப்பட்ட விநியோகங்களின் பட்டியலிலிருந்து பதிவிறக்கம் செய்ய எந்த கட்டமைக்கப்பட்ட வழங்கல் (ஏதேனும் இருந்தால்) என்பதை தீர்மானிக்க குறிச்சொற்கள் நிறுவிகளால் பயன்படுத்தப்படுகின்றன. நிறுவி ஆதரிக்கும் (பைவர், பநிஇ, ஆர்ச்) டூப்பிள்களின் பட்டியலை பராமரிக்கிறது. கட்டப்பட்ட விநியோகத்தின் குறிச்சொல் `` இன்` பட்டியலில் இருந்தால், அதை நிறுவலாம்.

source: It is recommended that installers try to choose the most feature complete built distribution available (the one most specific to the installation environment) by default before falling back to pure Python versions published for older Python releases. Installers are also recommended to provide a way to configure and re-order the list of allowed compatibility tags; for example, a user might accept only the ``*-none-any`` tags to only download built packages that advertise themselves as being pure Python.
ja: 古い Python リリース向けに発行された純 Python のバージョンにフォールバックするよりも前に、利用できる中で最も機能を網羅したビルド済配布物 (インストールする先の環境に最も適したもの) をインストーラがデフォルトで選択することが推奨されています。インストーラは、また、受け入れ可能な互換性タグのリストを設定変更したり順序を入れ替えたりする方法を持つことが推奨されています; 例えば、ユーザは、純 Python であると広報しているビルド済みパッケージだけをダウンロードするために、 ``*-none-any`` タグだけを受容しても構いません。
ru: Рекомендуется, чтобы программы установки старались выбирать наиболее функционально полный собранный дистрибутив (наиболее подходящий для среды установки) по умолчанию, прежде чем возвращаться к версиям чистого Python, опубликованным для старых версий Python. Инсталляторам также рекомендуется предоставлять возможность настраивать и изменять список разрешенных тегов совместимости; например, пользователь может принимать только теги ``*-none-any``, чтобы загружать только те собранные пакеты, которые рекламируют себя как чистый Python.
ta: பழைய பைதான் வெளியீடுகளுக்காக வெளியிடப்பட்ட தூய பைதான் பதிப்புகளுக்குத் திரும்புவதற்கு முன், இயல்புநிலையாக கிடைக்கக்கூடிய மிக அம்சமான கட்டமைக்கப்பட்ட விநியோகத்தை (நிறுவல் சூழலுக்கு மிகவும் குறிப்பிட்டது) தேர்வு செய்ய நிறுவல்கள் பரிந்துரைக்கப்படுகின்றன. அனுமதிக்கப்பட்ட பொருந்தக்கூடிய குறிச்சொற்களின் பட்டியலை உள்ளமைக்கவும் மீண்டும் ஆர்டர் செய்யவும் ஒரு வழியை வழங்க நிறுவிகள் பரிந்துரைக்கப்படுகின்றன; எடுத்துக்காட்டாக, ஒரு பயனர் தங்களை தூய பைத்தான் என்று விளம்பரப்படுத்தும் கட்டப்பட்ட தொகுப்புகளை மட்டுமே பதிவிறக்குவதற்கு ``*-ஒரு-எந்த` குறிச்சொற்களை மட்டுமே ஏற்றுக்கொள்ளலாம்.

source: Another desirable installer feature might be to include "re-compile from source if possible" as more preferable than some of the compatible but legacy pre-built options.
eo: Alia dezirinda funkcio de instalilo eble estas igi «retraduki el fonto se tio eblas» pli preferata ol la kongruaj sed malnovaj antaŭkonstruitaj opcioj.
ja: 互換性はあるがもはや古くなってしまったビルド済みのものを使う選択肢よりもより好ましいという点で、インストーラに望まれるもうひとつの機能は "可能ならソースコードから再コンパイルする" でしょう。
ru: Еще одной желательной функцией программы установки может быть включение опции "перекомпилировать из исходного кода, если это возможно" как более предпочтительной, чем некоторые совместимые, но устаревшие опции предварительной сборки.
ta: மற்றொரு விரும்பத்தக்க நிறுவி நற்பொருத்தம், "முடிந்தால் மூலத்திலிருந்து மீண்டும் இணைத்தல்" என்பது இணக்கமான ஆனால் மரபு முன்பே கட்டப்பட்ட சில விருப்பங்களை விட மிகவும் விரும்பத்தக்கதாக இருக்கும்.

source: This example list is for an installer running under CPython 3.3 on a linux_x86_64 system. It is in order from most-preferred (a distribution with a compiled extension module, built for the current version of Python) to least-preferred (a pure-Python distribution built with an older version of Python):
eo: Jen ekzempla listo por instalilo sub CPython 3.3 sur sistemo linux_x86_64, ordigita ekde la plej preferata (distribuo kun tradukita etendaĵa modulo por la aktuala versio de Python) ĝis la malplej preferata (pure Python-a distribuo konstruita per malnova versio de Python):
ja: この事例集は、インストーラを linux_x86_64 システム上の CPython 3.3 のもとで走らせるためのものです。最も好ましいもの (最新版の Python 向けにビルドされたコンパイル済みの拡張モジュールが付属している配布物) から、最も好ましくはないもの (古いバージョンの Python でビルドされた純 Python の配布物) へ、という順序で並んでいます:
ru: Этот пример списка предназначен для программы установки, работающей под управлением CPython 3.3 на системе linux_x86_64. Он расположен в порядке от наиболее предпочтительного (дистрибутив с скомпилированным модулем расширения, собранный для текущей версии Python) до наименее предпочтительного (дистрибутив чистого Python, собранный для более старой версии Python):
ta: இந்த எடுத்துக்காட்டு பட்டியல் லினக்ச்_எக்ச் 86_64 கணினியில் CPyThon 3.3 இன் கீழ் இயங்கும் நிறுவிக்கு. இது பெரும்பாலான விருப்பமான (ஒரு தொகுக்கப்பட்ட நீட்டிப்பு தொகுதியுடன் ஒரு வழங்கல், பைத்தானின் தற்போதைய பதிப்பிற்காக கட்டப்பட்டுள்ளது) குறைந்தது-விருப்பமான (பைத்தானின் பழைய பதிப்பைக் கொண்டு கட்டப்பட்ட தூய-பைதான் விநியோகம்):

source: cp3-none-any
ta: CP3-none-any-any

source: py30-none-any
ta: py30-none-any- any

source: Built distributions may be platform specific for reasons other than C extensions, such as by including a native executable invoked as a subprocess.
eo: Konstruita distribuo povas esti platformo-specifa pro kialo alia ol C-etendaĵo, kiel uzo de indiĝena ruleblaĵo alvokita kiel subprocezo.
ja: ビルド済み配布物は、サブプロセスとして起動されるネーティブの実行可能ファイルを含んでいるなどのようなC 言語拡張以外の理由によって、特定のプラットフォーム向けであっても構いません。
ru: Собранные дистрибутивы могут быть специфичными для конкретной платформы по причинам, не связанным с расширениями C, например, путем включения собственного исполняемого файла, вызываемого в качестве подпроцесса.
ta: சி நீட்டிப்புகளைத் தவிர வேறு காரணங்களுக்காக கட்டப்பட்ட விநியோகங்கள் குறிப்பிட்ட தளமாக இருக்கலாம், அதாவது ஒரு துணை செயலாக்கமாக செயல்படுத்தப்பட்ட ஒரு சொந்த இயங்கக்கூடியவை.

source: Sometimes there will be more than one supported built distribution for a particular version of a package. For example, a packager could release a package tagged ``cp33-abi3-linux_x86_64`` that contains an optional C extension and the same distribution tagged ``py3-none-any`` that does not. The index of the tag in the supported tags list breaks the tie, and the package with the C extension is installed in preference to the package without because that tag appears first in the list.
eo: Kelkfoje ekzistas pluraj subtenataj konstruitaj distribuoj por iu versio de pako. Ekzemple, aŭtoro povus eldoni pakon kun etikedo ``cp33-abi3-linux_x86_64`` enhavantan laŭvolan C-etendaĵon kaj la saman distribuon kun etikedo ``py3-none-any`` sen C-etendaĵo. La indico de la etikedo en la listo de subtenataj etikedoj decidas la instalotan pakon: la pako kun la C-etendaĵo estas instalota prefere al la pako sen ĝi, ĉar tiu etikedo ĉeestas unue en la listo.
ja: 時々、あるパッケージの特定のバージョンとして複数のビルド済み配布物が存在することがあるでしょう。例えば、パッケージ製作者が、 ``cp33-abi3-linux_x86_64`` というタグを付けて追加的な C 言語拡張を含むパッケージをリリースし、そのようなものを含まない同じ配布物に ``py3-none-any`` というタグを付けてリリースするような場合です。(このような場合でも) サポートされるタグのリストで先に出現する方を優先するという理由によって C 言語拡張付きのパッケージがそうでないパッケージよりも選好されてインストールされるという形で、インデックスによってどちらかに決めることができます。
ru: Иногда для определенной версии пакета существует более одного поддерживаемого собранного дистрибутива. Например, упаковщик может выпустить пакет с тегом ``cp33-abi3-linux_x86_64``, содержащий необязательное расширение C, и такой же дистрибутив с тегом ``py3-none-any``, не содержащий его. Индекс тега в списке поддерживаемых тегов разрушает равенство, и пакет с расширением C устанавливается предпочтительнее, чем пакет без него, поскольку этот тег появляется первым в списке.
ta: சில நேரங்களில் ஒரு தொகுப்பின் ஒரு குறிப்பிட்ட பதிப்பிற்கு ஒன்றுக்கு மேற்பட்ட உதவி கட்டப்பட்ட வழங்கல் இருக்கும். எடுத்துக்காட்டாக, ஒரு பேக்கேசர் ஒரு விருப்பமான சி நீட்டிப்பு மற்றும் அதே வழங்கல் குறிக்கப்பட்ட `` py3-none-any`` ஆகியவற்றைக் கொண்ட `` CP33-ABI3-LINUX_X86_64`` குறிக்கப்பட்ட ஒரு தொகுப்பை வெளியிட முடியும். ஆதரிக்கப்பட்ட குறிச்சொற்கள் பட்டியலில் உள்ள குறிச்சொல்லின் குறியீடு டை உடைக்கிறது, மேலும் சி நீட்டிப்புடன் கூடிய தொகுப்பு இல்லாமல் தொகுப்புக்கு முன்னுரிமை அளிக்கப்பட்டுள்ளது, ஏனெனில் அந்த குறிச்சொல் முதலில் பட்டியலில் தோன்றும்.

source: Compressed Tag Sets
eo: Densigitaj Etikedaroj
ja: 圧縮されたタグのセット
pt_br: Conjuntos de Etiquetas Comprimidos
ru: Сжатые наборы тегов
ta: சுருக்கப்பட்ட குறிச்சொல் தொகுப்புகள்
