Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The main disadvantage of using binary extensions is the fact that it makes subsequent distribution of the software more difficult. One of the advantages of using Python is that it is largely cross platform, and the languages used to write extension modules (typically C or C++, but really any language that can bind to the CPython C API) typically require that custom binaries be created for different platforms.
eo: La ĉefmalavantaĝo de duuma etendaĵo estas, ke posta distribuado de la programo estas malfacila. Unu el la avantaĝoj de Python estas la plurplatformeco. La lingvoj por etendaĵa modulo (ofte C aŭ C++, sed povas esti ajna lingvo bindebla al la C API de CPython) ordinare postulas kreadon de duumaĵoj po unu por ĉiu platformo.
ja: バイナリ拡張を使うことの主たる欠点は、引き続くソフトウェア配布がより難しくなることです。Python を使う利点のひとつは非常に広範囲のクロスプラットフォームである (訳注、同一の Python コードが広範囲の異種プラットフォームで動作する) ことですが、拡張モジュールを書くのに使われる言語 (典型的には C 言語や C++ だが、実際にはどんな言語でも CPython の C 言語 API にバインドできる) は異なるプラットフォームには異なるバイナリを作成しなければならないのが普通なのです。
pt_br: A principal desvantagem de usar extensões binárias é o fato de tornar a distribuição subsequente do software mais difícil. Uma das vantagens de usar o Python é que ele é amplamente multiplataforma, e as linguagens usadas para escrever módulos de extensão (normalmente C ou C++, mas na verdade qualquer linguagem que possa se ligar à API C do CPython) normalmente exigem que binários personalizados podem ser criados para plataformas diferentes.
ru: Основным недостатком использования бинарных расширений является то, что это затрудняет последующее распространение программного обеспечения. Одним из преимуществ использования Python является то, что он в значительной степени кроссплатформенный, а языки, используемые для написания модулей расширения (обычно это C или C++, но на самом деле любой язык, который может связываться с CPython C API), обычно требуют создания собственных двоичных файлов для разных платформ.
ta: பைனரி நீட்டிப்புகளைப் பயன்படுத்துவதன் முக்கிய குறைபாடு என்னவென்றால், இது மென்பொருளின் அடுத்தடுத்த விநியோகத்தை மிகவும் கடினமாக்குகிறது. பைத்தானைப் பயன்படுத்துவதன் நன்மைகளில் ஒன்று, இது பெரும்பாலும் குறுக்கு தளம், மற்றும் நீட்டிப்பு தொகுதிகளை எழுதப் பயன்படுத்தப்படும் மொழிகள் (பொதுவாக சி அல்லது சி ++, ஆனால் உண்மையில் சிபிதான் சி பநிஇ உடன் பிணைக்கக்கூடிய எந்தவொரு மொழியும் பொதுவாக தனிப்பயன் பைனரிகளை உருவாக்க வேண்டும் வெவ்வேறு தளங்கள்.

source: This means that binary extensions:
eo: Tio signifas, ke duumaj etendaĵoj:
ja: これが意味するところは、バイナリ拡張は:
pt_br: Isso significa que extensões binárias:
ru: Это означает, что двоичные расширения:
ta: This means that இருமம் extensions:

source: require that end users be able to either build them from source, or else that someone publish pre-built binaries for common platforms
eo: postulas, ke aŭ uzantoj povu konstrui ilin de fonto, aŭ aliulo eldonu konstruitajn duumaĵojn por oftaj platformoj
ja: エンドユーザがソースコードからビルドできるか、または、誰かが共通のプラットフォーム向けにビルド済みのバイナリを公開するか、のいずれかでなければなりません
pt_br: exigem que os usuários finais sejam capazes de criá-las a partir do código-fonte, ou então que alguém publique binários pré-construídos para plataformas comuns
ru: требуют, чтобы конечные пользователи могли либо собрать их из исходных текстов, либо чтобы кто-то опубликовал предварительно собранные двоичные файлы для распространенных платформ
ta: இறுதி பயனர்கள் அவற்றை மூலத்திலிருந்து உருவாக்க முடியும், இல்லையெனில் யாராவது பொதுவான தளங்களுக்கு முன்பே கட்டப்பட்ட பைனரிகளை வெளியிடுகிறார்கள்

source: may not be compatible with different builds of the CPython reference interpreter
eo: eble ne kongruas kun diversaj konstruoj de la referenca interpretilo CPython
ja: CPython 参照インタプリタのビルドが異なると互換性がないかもしれません
pt_br: pode não ser compatível com diferentes compilações do interpretador de referência do CPython
ru: может быть несовместим с различными сборками эталонного интерпретатора CPython
ta: Cpython குறிப்பு மொழிபெயர்ப்பாளரின் வெவ்வேறு கட்டடங்களுடன் பொருந்தாது

source: often will not work correctly with alternative interpreters such as PyPy, IronPython or Jython
eo: ofte ne funkcias ĝuste kun alternativaj interpretiloj kiel ekzemple PyPy, IronPython aŭ Jython
ja: PyPy ・ IronPython ・ Jython のような代替インタプリタ上では動作しないことがしばしばです
pt_br: frequentemente não funciona corretamente com interpretadores alternativos como PyPy, Iron Python ou Jython
ru: часто не будет корректно работать с альтернативными интерпретаторами, такими как PyPy, IronPython или Jython
ta: பைபி, அயர்ன் பிதான் அல்லது சைத்தான் போன்ற மாற்று மொழிபெயர்ப்பாளர்களுடன் பெரும்பாலும் சரியாக வேலை செய்யாது

source: if handcoded, make maintenance more difficult by requiring that maintainers be familiar not only with Python, but also with the language used to create the binary extension, as well as with the details of the CPython C API.
eo: se ĝi mankodita, malfaciligas evoluadon postulante, ke evoluiganto konu ne nur Python, sed ankaŭ la programlingvon por la duuma etendaĵo kaj la detalojn de la C API de CPython.
ja: もしハードコードされているなら、メンテナンス担当者が Python のみならずそのバイナリ拡張を作成するために使われている言語についてもCPython の C 言語 API についても慣れ親しんでいることが要求されるので、メンテナンスがより難しくなるでしょう。
pt_br: se codificado manualmente, torna a manutenção mais difícil, exigindo que os mantenedores estejam familiarizados não apenas com Python, mas também com a linguagem usada para criar a extensão binária, bem como com os detalhes da API C do CPython.
ru: при ручном кодировании усложняют сопровождение, требуя, чтобы сопровождающие были знакомы не только с Python, но и с языком, использованным для создания бинарного расширения, а также с деталями CPython C API.
ta: ஏண்ட்கோட் செய்யப்பட்டால், பராமரிப்பாளர்கள் பைத்தானுடன் மட்டுமல்லாமல், பைனரி நீட்டிப்பை உருவாக்கப் பயன்படுத்தப்படும் மொழியுடனும், சிபிதான் சி பநிஇ விவரங்களுடனும் தெரிந்திருக்க வேண்டும் என்று தேவைப்படுவதன் மூலம் பராமரிப்பை மிகவும் கடினமாக்குங்கள்.

source: if a pure Python fallback implementation is provided, make maintenance more difficult by requiring that changes be implemented in two places, and introducing additional complexity in the test suite to ensure both versions are always executed.
eo: malfaciligas mastrumadon (se pure Python-a alternativo estas provizita), postulante duoblan realigon de ĉiuj ŝanĝoj kaj komplikante la testaron pri rulado de ambaŭ versioj.
ja: 純粋な Python で書かれた退避先実装が用意されているなら、変更を実装するべき場所が２箇所になるのと、両方の実装が常に実行されることを保証するテストスイートを準備するために複雑さが増加することになるので、メンテナンスがより一層困難になります。
pt_br: se uma implementação de fallback de puro Python for fornecida, torna a manutenção mais difícil, exigindo que as alterações sejam implementadas em dois lugares, e introduzindo complexidade adicional no conjunto de testes para garantir que ambas as versões sejam sempre executadas.
ru: если предусмотрена обратная реализация на чистом Python, усложняет сопровождение, требуя, чтобы изменения были реализованы в двух местах, и вносит дополнительные сложности в набор тестов, чтобы гарантировать, что обе версии всегда выполняются.
ta: ஒரு தூய பைதான் குறைவடையும் செயல்படுத்தல் வழங்கப்பட்டால், இரண்டு இடங்களில் மாற்றங்கள் செயல்படுத்தப்பட வேண்டும் என்று தேவைப்படுவதன் மூலம் பராமரிப்பை மிகவும் கடினமாக்குங்கள், மேலும் இரண்டு பதிப்புகளும் எப்போதும் செயல்படுத்தப்படுவதை உறுதிசெய்ய சோதனை தொகுப்பில் கூடுதல் சிக்கலை அறிமுகப்படுத்துகின்றன.

source: Another disadvantage of relying on binary extensions is that alternative import mechanisms (such as the ability to import modules directly from zipfiles) often won't work for extension modules (as the dynamic loading mechanisms on most platforms can only load libraries from disk).
eo: Alia malavantaĝo de dependado je duuma etendaĵo estas, ke alternativa importa meĥanismo (kiel importado de modulo rekte el zip-arĥivo) ofte ne funkcias por etendaĵmodulo (ĉar la dinamika ŝargada meĥanismo en la plejmulto de platformoj nur povas ŝargi bibliotekon el disko).
ja: バイナリ拡張に依存することによるさらなる欠点は、 (例えば zip ファイルから直接にインポートする能力など) 通常とは異なるインポート機構が、しばしば拡張モジュールでは動作しない (ほとんどのプラットフォームでは動的ロード機構はディスクからライブラリを読み込むことしかできないため) ということです。
pt_br: Outra desvantagem de depender de extensões binárias é que mecanismos de importação alternativos (como a capacidade de importar módulos diretamente de arquivos zip) geralmente não funcionam para módulos de extensão (já que os mecanismos de carregamento dinâmico na maioria das plataformas só podem carregar bibliotecas do disco).
ru: Еще одним недостатком использования бинарных расширений является то, что альтернативные механизмы импорта (например, возможность импортировать модули непосредственно из zip-файлов) часто не работают для модулей расширений (поскольку механизмы динамической загрузки на большинстве платформ могут загружать библиотеки только с диска).
ta: பைனரி நீட்டிப்புகளை நம்புவதன் மற்றொரு தீமை என்னவென்றால், மாற்று இறக்குமதி வழிமுறைகள் (சிப்ஃபைல்களிலிருந்து நேரடியாக தொகுதிகளை இறக்குமதி செய்யும் திறன் போன்றவை) பெரும்பாலும் நீட்டிப்பு தொகுதிகளுக்கு வேலை செய்யாது (பெரும்பாலான தளங்களில் மாறும் ஏற்றுதல் வழிமுறைகள் வட்டில் இருந்து நூலகங்களை மட்டுமே ஏற்ற முடியும்).

source: Alternatives to handcoded accelerator modules
eo: Alternativoj al malaŭtomate koditaj akcelilaj moduloj
ja: ハードコードされたアクセラレータモジュールの代わりとなるもの
pt_br: Alternativas para módulos aceleradores codificados manualmente
ru: Альтернативы ручному написанию ускоряющих модулей
ta: ஏண்ட்கோட் செய்யப்பட்ட முடுக்கி தொகுதிகளுக்கு மாற்று வழிகள்

source: When extension modules are just being used to make code run faster (after profiling has identified the code where the speed increase is worth additional maintenance effort), a number of other alternatives should also be considered:
eo: Se oni uzus etendaĵan modulon nur por plirapidigi kodon (post kiam profilo markis tiujn partojn de la kodo, por kiuj la plirapidigo sufiĉe necesas malgraŭ la plia bezonata mastrumado), oni konsideru kelkajn alternativojn:
ja: 拡張モジュールが単純にプログラムを速く走らせるためだけに使われてい (て、プロファイリングの結果、メンテナンス工数が増えることを甘受しても速度を上げることに価値があると判断され) る時には、他の複数の選択肢も検討しておくべきです:
pt_br: Quando os módulos de extensão estão apenas sendo usados para tornar o código executado mais rápido (após a criação de perfil ter identificado o código onde o aumento de velocidade vale um esforço de manutenção adicional), uma série de outras alternativas também devem ser consideradas:
ru: Если модули расширения используются только для ускорения работы кода (после того как профилирование выявило код, где увеличение скорости стоит дополнительных усилий по сопровождению), следует рассмотреть и ряд других альтернатив:
ta: குறியீட்டை வேகமாக இயக்க நீட்டிப்பு தொகுதிகள் பயன்படுத்தப்படும்போது (விவரக்குறிப்பு கூடுதல் பராமரிப்பு முயற்சிக்கு மதிப்புள்ள குறியீட்டை விவரக்குறிப்பு அடையாளம் கண்டுள்ள பிறகு), பல மாற்றுகளும் கருத்தில் கொள்ளப்பட வேண்டும்:

source: look for existing optimised alternatives. The CPython standard library includes a number of optimised data structures and algorithms (especially in the builtins and the ``collections`` and ``itertools`` modules). The Python Package Index also offers additional alternatives. Sometimes, the appropriate choice of standard library or third party module can avoid the need to create your own accelerator module.
ja: 既存の最適化された代替策を探す。CPython の標準ライブラリには、最適化されたデータ構造やアルゴリズム (特に組み込み済みのものや ``collections`` および ``itertools`` モジュール) が多数含まれています。Python パッケージインデックスにも他の代替となるパッケージがあります。時には、標準ライブラリや第三パーティのモジュールから適切なものを選択することで、自分自身でアクセラレータパッケージを作成する必要に迫られないで済むでしょう。
pt_br: procure alternativas otimizadas existentes. A biblioteca padrão do CPython inclui uma série de estruturas de dados e algoritmos otimizados (especialmente nos módulos embutidos e ``collections`` e ``itertools``). O índice de Pacotes do Python também oferece alternativas adicionais. Às vezes, a escolha apropriada de biblioteca padrão ou módulo de terceiros pode evitar a necessidade de criar seu próprio módulo acelerador.
ru: искать существующие оптимизированные альтернативы. Стандартная библиотека CPython содержит ряд оптимизированных структур данных и алгоритмов (особенно во встроенных модулях и модулях ``коллекции`` и ``итертулы``). Индекс пакетов Python также предлагает дополнительные альтернативы. Иногда правильный выбор стандартной библиотеки или стороннего модуля позволяет избежать необходимости создания собственного модуля-ускорителя.
ta: இருக்கும் உகந்த மாற்றுகளைத் தேடுங்கள். CPython நிலையான நூலகத்தில் பல உகந்த தரவு கட்டமைப்புகள் மற்றும் வழிமுறைகள் (குறிப்பாக பில்டின்ச் மற்றும் `` சேகரிப்புகள்` மற்றும் `` itertools`` தொகுதிகள்) உள்ளன. பைதான் தொகுப்பு குறியீடு கூடுதல் மாற்றுகளையும் வழங்குகிறது. சில நேரங்களில், நிலையான நூலகம் அல்லது மூன்றாம் தரப்பு தொகுதியின் பொருத்தமான தேர்வு உங்கள் சொந்த முடுக்கி தொகுதியை உருவாக்க வேண்டிய அவசியத்தைத் தவிர்க்கலாம்.

source: for long running applications, the JIT compiled `PyPy interpreter <https://www.pypy.org/>`__ may offer a suitable alternative to the standard CPython runtime. The main barrier to adopting PyPy is typically reliance on other binary extension modules - while PyPy does emulate the CPython C API, modules that rely on that cause problems for the PyPy JIT, and the emulation layer can often expose latent defects in extension modules that CPython currently tolerates (frequently around reference counting errors - an object having one live reference instead of two often won't break anything, but no references instead of one is a major problem).
eo: por longe ruliĝanta programo, la ĝustatempe tradukita `interpretilo PyPy <https://www.pypy.org/>`__ povas esti taŭga alternativo al la norma interpretilo CPython. La ĉefobstaklo kontraŭ ekuzado de PyPy estas ofte dependo de alia duumaĵa etendaĵo-modulo – dum PyPy ja imitas la C API de CPython, modulo dependanta de tiu API kaŭzas problemojn por la ĝustatempa tradukilo de PyPy, kaj la imitada tavolo ofte reliefigas kaŝitajn makulojn en etendaĵo-modulo aktuale toleratan de CPython (ofte pri eraroj pri referenco-kalkulado – objekto havanta unu vivan referencon anstatŭ du ne estas problema, sed neniu referenco anstataŭ unu estas grave problema).
ja: 長時間に渡って走り続けるアプリケーションに対しては、標準の CPython ランタイムの代わりに JIT コンパイルされた `PyPy インタープリタ <https://www.pypy.org/>`__ を使うことが適切な代替策となるかもしれません。 PyPy を適用しようとする時、典型的には他のバイナリ拡張モジュールへの依存が主たる障害になります - PyPy が CPython の C 言語 API をエミュレートする一方で、その API に依存するモジュールの側が PyPy の JIT に問題を引き起こし、また、エミュレーション層が CPython では現在は許容されているような拡張モジュール側の潜在的な瑕疵 (参照カウントに関係するエラーであることが多い - あるオブジェクトへの参照が２個あるはずのところが１個しかないという状態は何も悪さをしませんが、１個の参照のはずが参照なしとなる場合が主な問題になります) をしばしば暴露してしまうのです。
pt_br: para aplicações de longa execução, o `interpretador PyPy <https://www.pypy.org/>`__ compilado por JIT pode oferecer uma alternativa adequada ao tempo de execução padrão do CPython. A principal barreira para a adoção do PyPy é normalmente a dependência de outros módulos de extensão binários -- enquanto o PyPy emula a API C do CPython, os módulos que dependem disso causam problemas para o PyPy de JIT e a camada de emulação pode frequentemente expor defeitos latentes na extensão módulos que o CPython atualmente tolera (frequentemente em torno de erros de contagem de referências -- um objeto com uma referência ativa em vez de duas geralmente não quebrará nada, mas nenhuma referência em vez de uma é um grande problema).
ru: Для долго работающих приложений JIT-компилируемый интерпретатор `PyPy <https://www.pypy.org/>`__ может стать подходящей альтернативой стандартной среде выполнения CPython. Основным препятствием для внедрения PyPy обычно является зависимость от других бинарных модулей расширения - хотя PyPy и эмулирует CPython C API, модули, полагающиеся на него, создают проблемы для PyPy JIT, а слой эмуляции часто может выявить скрытые дефекты в модулях расширения, к которым CPython в настоящее время терпим (часто вокруг ошибок подсчета ссылок - объект с одной живой ссылкой вместо двух часто ничего не нарушает, но отсутствие ссылок вместо одной является большой проблемой).
ta: க்கு long running applications, the JIT compiled `PyPy interpreter <https://www.pypy.org/>`__ சி-வைகாசி offer a suitable alternative பெறுநர் the தரநிலை CPython runtime. The main barrier பெறுநர் adopting PyPy is typically reliance on மற்றொன்று இருமம் extension தொகுதிகள் - while PyPy does emulate the CPython C பநிஇ, தொகுதிகள் that rely on that cause problems க்கு the PyPy JIT, and the போன்மம் layer can often expose latent defects in extension தொகுதிகள் that CPython currently tolerates (frequently around குறிப்பு counting errors - an பொருள் having one live குறிப்பு instead of two often won't இடைவேளை anything, but இல்லை குறிப்புகள் instead of one is a major problem).

source: `Cython <https://cython.org/>`__ is a mature static compiler that can compile most Python code to C extension modules. The initial compilation provides some speed increases (by bypassing the CPython interpreter layer), and Cython's optional static typing features can offer additional opportunities for speed increases. Using Cython still carries the `disadvantages`_ associated with using binary extensions, but has the benefit of having a reduced barrier to entry for Python programmers (relative to other languages like C or C++).
eo: `Cython <https://cython.org/>`__ estas matura statika tradukilo, kiu povas traduki la plejparton de Python-kodo al C-etendaĵomoduloj. La komenca tradukado povas iom rapidigi la kodon (preterpasante la interpretilon CPython), kaj la nedeviga statika tipado de Cython povas plu rapidi la kodon. Uzado de Cython ankoraŭ havas la `malavantaĝojn <disadvantages>`_ pri duumaj etendaĵoj, sed havas la avantaĝon de kutimeco por Python-programantoj (relative al aliaj lingvoj kiel C aŭ C++).
ja: `Cython <https://cython.org/>`__ は、ほとんどの Python コードを C 言語の拡張モジュールに変換できる成熟した静的コンパイラです。当初のコンパイルでは、(CPython のインタプリタ層をバイパスすることによって) いくらかの速度向上が見込めるとともに、 Cython のオプション扱いの静的型付け機能によってさらに速度向上の機会があるかもしれません。Cython の使用には、バイナリ拡張の使用に関連した `欠点`_ がまだ残っていますが、Python プログラマにとって (C 言語や C++ のような他言語に比べると) 参入障壁が低いという利点があります。
pt_br: `Cython <https://cython.org/>`__ é um compilador estático maduro que pode compilar a maioria dos códigos Python para módulos de extensão C. A compilação inicial fornece alguns aumentos de velocidade (contornando a camada de interpretador do CPython) e os recursos opcionais de tipagem estática do Cython podem oferecer oportunidades adicionais para aumentos de velocidade. O uso do Cython ainda carrega as `desvantagens`_ associadas ao uso de extensões binárias, mas tem o benefício de ter uma barreira de entrada reduzida para programadores Python (em relação a outras linguagens como C ou C++).
ru: `Cython <https://cython.org/>`__ - это зрелый статический компилятор, который может компилировать большинство кода Python в модули расширения C. Первоначальная компиляция обеспечивает некоторое увеличение скорости (минуя слой интерпретатора CPython), а дополнительные функции статической типизации Cython могут предложить дополнительные возможности для увеличения скорости. Использование Cython все еще имеет недостатки, связанные с использованием бинарных расширений, но имеет преимущество в виде снижения барьера входа для программистов на Python (по сравнению с другими языками, такими как C или C++).
ta: `சித்தான் <https://cython.org/> ____ என்பது ஒரு முதிர்ந்த நிலையான தொகுப்பி, இது சி நீட்டிப்பு தொகுதிகளில் பெரும்பாலான பைதான் குறியீட்டை தொகுக்க முடியும். ஆரம்ப தொகுப்பு சில வேக அதிகரிப்புகளை வழங்குகிறது (சிபிதான் மொழிபெயர்ப்பாளர் அடுக்கைத் தவிர்ப்பதன் மூலம்), மற்றும் சைதனின் விருப்ப நிலையான தட்டச்சு நற்பொருத்தங்கள் வேக அதிகரிப்புக்கு கூடுதல் வாய்ப்புகளை வழங்கும். சைதனைப் பயன்படுத்துவது பைனரி நீட்டிப்புகளைப் பயன்படுத்துவதோடு தொடர்புடைய `தீமைகள்`_ ஐக் கொண்டுள்ளது, ஆனால் பைதான் புரோகிராமர்களுக்கான நுழைவதற்கு குறைக்கப்பட்ட தடையைக் கொண்டிருப்பதன் நன்மையைக் கொண்டுள்ளது (சி அல்லது சி ++ போன்ற பிற மொழிகளுடன் ஒப்பிடும்போது).

source: `Numba <http://numba.pydata.org/>`__ is a newer tool, created by members of the scientific Python community, that aims to leverage LLVM to allow selective compilation of pieces of a Python application to native machine code at runtime. It requires that LLVM be available on the system where the code is running, but can provide significant speed increases, especially for operations that are amenable to vectorisation.
eo: `Numba <http://numba.pydata.org/>`__ estas pli nova ilo, kreita de anoj de la scienca Python-komunumo, celanta uzi LLVM por rultempa tradukado de partoj de Python-programo al maŝinkodo. Ĝi postulas la haveblon de LLVM je tiu sistemo, sur kiu ruliĝas la kodo. Tamen ĝi povas multe plirapidigi la kodon, speciale por operacioj vektorigeblaj.
ja: `Numba <http://numba.pydata.org/>`__ は新しめのツールで、LLVM を活用して Python アプリケーションの一部分をランタイムに選択的にネイティブの機械コードにコンパイルできるようにすることを目指している科学分野の Python コミュニティによって作成されました。この取り組みでは、コードが動作するシステムに LLVM が存在していなければなりませんが、特にベクトル化が容易な操作について顕著な速度増加を提供することができます。
pt_br: `Numba <http://numba.pydata.org/>`__ é uma ferramenta mais recente, criada por membros da comunidade científica do Python, que visa alavancar o LLVM para permitir a compilação seletiva de partes de uma aplicação Python para código de máquina nativo em tempo de execução. Requer que o LLVM esteja disponível no sistema onde o código está sendo executado, mas pode fornecer aumentos de velocidade significativos, especialmente para operações que são passíveis de vetorização.
ru: `Numba <http://numba.pydata.org/>`__ - это новый инструмент, созданный членами научного Python-сообщества, цель которого - использовать LLVM для выборочной компиляции частей Python-приложения в нативный машинный код во время выполнения. Он требует, чтобы LLVM был доступен в системе, на которой выполняется код, но может обеспечить значительное увеличение скорости, особенно для операций, которые поддаются векторизации.
ta: `Numba <http://numba.pydata.org/>` __ என்பது ஒரு புதிய கருவியாகும், இது விஞ்ஞான பைதான் சமூகத்தின் உறுப்பினர்களால் உருவாக்கப்பட்டது, இது ஒரு பைதான் பயன்பாட்டின் துண்டுகளை தேர்ந்தெடுக்கப்பட்ட தொகுப்பை சொந்த இயந்திரக் குறியீட்டிற்கு அனுமதிக்க எல்.எல்.வி.எம் இயக்க நேரம். குறியீடு இயங்கும் கணினியில் எல்.எல்.வி.எம் கிடைக்க வேண்டும், ஆனால் குறிப்பிடத்தக்க வேக அதிகரிப்புகளை வழங்க முடியும், குறிப்பாக திசையன்மயமாக்கலுக்கு ஏற்ற செயல்பாடுகளுக்கு.

source: Alternatives to handcoded wrapper modules
eo: Alternativoj al malaŭtomate koditaj volvilaj moduloj
ja: ハードコードされたラッパモジュールに対する代替策
pt_br: Alternativas para módulos wrapper codificados manualmente
ru: Альтернативы ручному написанию модулей-обёрток
ta: ஏண்ட்கோட் செய்யப்பட்ட ரேப்பர் தொகுதிகளுக்கு மாற்று வழிகள்
