Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: A Dependency Group Include includes another Dependency Group in the current group.
eo: Dependecgrupa Inkluzivo inkluzivas alian Dependecan Grupon en la aktuala grupo.
ru: Группа зависимостей Include включает другую группу зависимостей в текущую группу.
ta: ஒரு சார்பு குழுவில் தற்போதைய குழுவில் மற்றொரு சார்பு குழு அடங்கும்.

source: An include is a table with exactly one key, ``"include-group"``, whose value is a string, the name of another Dependency Group.
eo: Inkluzivo estas tabelo kun ekzakte unu ŝlosilo, ``"include-group"``, kies valoro estas signoĉeno, la nomo de alia Dependeca Grupo.
ru: Включенная группа - это таблица с одним ключом, ``«include-group»``, значением которого является строка, имя другой группы зависимостей.
ta: அன் என்பது சரியாக ஒரு விசையுடன் கூடிய அட்டவணை, `` "" குழுவைச் சேர்க்கவும் "` `, அதன் மதிப்பு ஒரு சரம், மற்றொரு சார்பு குழுவின் பெயர்.

source: Includes are defined to be exactly equivalent to the contents of the named Dependency Group, inserted into the current group at the location of the include. For example, if ``foo = ["a", "b"]`` is one group, and ``bar = ["c", {include-group = "foo"}, "d"]`` is another, then ``bar`` should evaluate to ``["c", "a", "b", "d"]`` when Dependency Group Includes are expanded.
ru: Включения определяются как точно эквивалентные содержимому именованной группы зависимостей, вставленные в текущую группу в месте расположения включения. Например, если ``foo = [«a», «b»]`` - это одна группа, а ``bar = [«c», {include-group = «foo»}, «d»]`` - другая, то ``bar`` должен оцениваться как ``[«c», «a», „b“, «d»]`` при раскрытии Dependency Group Includes.
ta: பெயரிடப்பட்ட சார்பு குழுவின் உள்ளடக்கங்களுக்கு சமமானதாக அடங்கும், சேர்க்கப்பட்ட இடத்தில் தற்போதைய குழுவில் செருகப்படுகிறது. எடுத்துக்காட்டாக, `` foo = ["a", "b"] `` ஒரு குழு, மற்றும் `` பார் = ["சி", {சேர்க்கவும்-குழு = "ஃபூ"}, "டி"] `` மற்றொன்று, `` பார்`` `` ["சி", "ஏ", "பி", "டி"] `` சார்புடைய குழு சேர்க்கப்படும்போது விரிவாக்கப்படும்போது மதிப்பீடு செய்ய வேண்டும்.

source: Dependency Group Includes may specify the same package multiple times. Tools SHOULD NOT deduplicate or otherwise alter the list contents produced by the include. For example, given the following table:
eo: Inklzivo de Dependeca Grupo povas specifi la saman pakon plurfoje. Ilo NE SENDUPLIKATIGU NEK alie MODIFU la enhavon de la enhavojn de listo generita de la inkluzivo. Ekzemple, pri la jena tabelo:
ru: Включения групп зависимостей могут указывать один и тот же пакет несколько раз. Инструменты НЕ ДОЛЖНЫ дедуплицировать или иным образом изменять содержимое списка, созданного включением. Например, в следующей таблице:
ta: சார்பு குழு அடங்கும் ஒரே தொகுப்பை பல முறை குறிப்பிடலாம். கருவிகள் தயாரிக்கப்பட்ட பட்டியல் உள்ளடக்கங்களை கைவிடவோ அல்லது மாற்றவோ கூடாது. எடுத்துக்காட்டாக, பின்வரும் அட்டவணையைக் கொடுத்தால்:

source: The resolved value of ``all`` SHOULD be ``["foo", "foo", "foo>1.0", "foo<1.0"]``. Tools should handle such a list exactly as they would handle any other case in which they are asked to process the same requirement multiple times with different version constraints.
eo: La solvita valoro de ``all`` ESTU ``["foo", "foo", "foo>1.0", "foo<1.0"]``. Ilo pritraktu tian liston precize same kiel en aliaj kazoj, je kio ilo pritraktu la saman postulon plurfoje kun malsamaj versio-limigoj.
ru: Разрешенное значение ``all`` ДОЛЖНО быть ``[«foo», „foo“, «foo>1.0», «foo<1.0»]``. Инструменты должны работать с таким списком точно так же, как и в любом другом случае, когда их просят обработать одно и то же требование несколько раз с разными ограничениями на версию.
ta: `` அனைத்தையும்`` இன் தீர்க்கப்பட்ட மதிப்பு `` ["ஃபூ", "ஃபூ", "ஃபூ> 1.0", "ஃபூ <1.0"] `` ஆக இருக்க வேண்டும். கருவிகள் அத்தகைய பட்டியலை சரியாகக் கையாள வேண்டும், அதே நேரத்தில் வெவ்வேறு பதிப்பு தடைகளுடன் ஒரே தேவையை பல முறை செயலாக்கும்படி கேட்கப்படும் வேறு எந்த வழக்கையும் அவர்கள் கையாளுவார்கள்.

source: Dependency Group Includes may include groups containing Dependency Group Includes, in which case those includes should be expanded as well. Dependency Group Includes MUST NOT include cycles, and tools SHOULD report an error if they detect a cycle.
eo: Dependecgrupa Inkluzivo povas inkluzivi grupojn enhavantajn Dependecgrupajn Inkluzivojn; tiukaze, oni ankaŭ etendu tiujn inkluzivojn. Dependecgrupa Inkluzivo DEVAS NE havi ciklon. Trovinte ciklon, ilo RAPORTU eraron.
ru: Dependency Group Includes может включать группы, содержащие Dependency Group Includes, в этом случае эти включения также должны быть расширены. Dependency Group Includes НЕ ДОЛЖНЫ включать циклы, и инструменты ДОЛЖНЫ сообщать об ошибке, если они обнаруживают цикл.
ta: சார்பு குழு அடங்கும், இது சார்பு குழுவைக் கொண்ட குழுக்கள் அடங்கும், இந்த விசயத்தில் அவற்றில் அடங்கும். சார்பு குழுவில் சுழற்சிகள் இருக்கக்கூடாது, மற்றும் கருவிகள் ஒரு சுழற்சியைக் கண்டறிந்தால் பிழையைப் புகாரளிக்க வேண்டும்.

source: Package Building
eo: Konstruado de Pako
ru: Создание пакета
ta: தொகுப்பு கட்டிடம்

source: Build backends MUST NOT include Dependency Group data in built distributions as package metadata. This means that sdist ``PKG-INFO`` and wheel ``METADATA`` files should not include referenceable fields containing Dependency Groups.
eo: Konstrua malfasado DEVAS NE inkluzivi datenon pri Dependecaj Grupoj en konstruita distribuo kiel pakan metadatenon. Tio signifas, ke la dosiero ``PKG-INFO`` de fonta distribuo kaj la dosiero ``METADATA`` de wheel ne inkluzivu referenceblan kampon enhavantan Dependecan Grupon.
ta: கட்டிய பின்தளத்தில் கட்டமைக்கப்பட்ட விநியோகங்களில் சார்பு குழு தரவை தொகுப்பு மெட்டாடேட்டாவாக சேர்க்கக்கூடாது. இதன் பொருள் Sdist `` pkg-info`` மற்றும் சக்கரம் `` மெட்டாடேட்டா`` கோப்புகள் சார்பு குழுக்களைக் கொண்ட குறிப்பிடக்கூடிய புலங்களைக் கொண்டிருக்கக்கூடாது.

source: It is, however, valid to use Dependency Groups in the evaluation of dynamic metadata, and ``pyproject.toml`` files included in sdists will still contain ``[dependency-groups]``. However, the table's contents are not part of a built package's interfaces.
eo: Tamen validas uzi Dependecan Grupo por solvi dinamikajn metadatenojn, kaj dosiero ``pyproject.toml`` en fonta distribuo ankoraŭ enhavas ``[dependency-groups]``. Tamen, la enhavo de la tabelo ne estas parto de la interfaco de konstruita pako.
ta: எவ்வாறாயினும், மாறும் மெட்டாடேட்டாவின் மதிப்பீட்டில் சார்பு குழுக்களைப் பயன்படுத்துவது செல்லுபடியாகும், மேலும் SDIST களில் சேர்க்கப்பட்டுள்ள `` pyproject.toml`` கோப்புகள் இன்னும் `` [சார்பு-குழுக்கள்] `` கொண்டிருக்கும். இருப்பினும், அட்டவணையின் உள்ளடக்கங்கள் கட்டப்பட்ட தொகுப்பின் இடைமுகங்களின் ஒரு பகுதியாக இல்லை.

source: Installing Dependency Groups & Extras
eo: Instali Dependecajn Grupojn kaj Ekstraĵojn
ru: Установка групп зависимостей и дополнительных функций
ta: சார்பு குழுக்கள் மற்றும் கூடுதல் நிறுவுதல்

source: There is no syntax or specification-defined interface for installing or referring to Dependency Groups. Tools are expected to provide dedicated interfaces for this purpose.
eo: Ne ekzistas sintakso aŭ specifo-difinita interfaco por instalado aŭ menciado de Dependeco-Grupo. Ilo provizu proprajn interfacojn por tiu celo.
ta: சார்பு குழுக்களை நிறுவ அல்லது குறிப்பிடுவதற்கு தொடரியல் அல்லது விவரக்குறிப்பு-வரையறுக்கப்பட்ட இடைமுகம் எதுவும் இல்லை. கருவிகள் இந்த நோக்கத்திற்காக பிரத்யேக இடைமுகங்களை வழங்கும் என்று எதிர்பார்க்கப்படுகிறது.

source: Tools MAY choose to provide the same or similar interfaces for interacting with Dependency Groups as they do for managing extras. Tools authors are advised that the specification does not forbid having an extra whose name matches a Dependency Group. Separately, users are advised to avoid creating Dependency Groups whose names match extras, and tools MAY treat such matching as an error.
ta: கூடுதல்வற்றை நிர்வகிப்பதற்காகச் செய்வதைப் போலவே சார்பு குழுக்களுடன் தொடர்புகொள்வதற்கு அதே அல்லது ஒத்த இடைமுகங்களை வழங்க கருவிகள் தேர்வு செய்யலாம். கருவிகள் ஆசிரியர்கள் அறிவுறுத்தப்படுகிறார்கள், விவரக்குறிப்பைக் கொண்டிருப்பதைத் தடைசெய்யவில்லை, அதன் பெயர் சார்பு குழுவுடன் பொருந்துகிறது. தனித்தனியாக, பயனர்கள் சார்பு குழுக்களை உருவாக்குவதைத் தவிர்க்க அறிவுறுத்தப்படுகிறார்கள், அதன் பெயர்கள் கூடுதல் பொருந்துகின்றன, மேலும் கருவிகள் அத்தகைய பொருத்தத்தை பிழையாகக் கருதலாம்.

source: Validation and Compatibility
eo: Valideckontrolo kaj Kongrueco
ru: Проверка и совместимость
ta: சரிபார்ப்பு மற்றும் பொருந்தக்கூடிய தன்மை

source: Tools supporting Dependency Groups may want to validate data before using it. When implementing such validation, authors should be aware of the possibility of future extensions to the specification, so that they do not unnecessarily emit errors or warnings.
ta: சார்பு குழுக்களை ஆதரிக்கும் கருவிகள் தரவைப் பயன்படுத்துவதற்கு முன்பு அதை சரிபார்க்க விரும்பலாம். இத்தகைய சரிபார்ப்பை செயல்படுத்தும்போது, விவரக்குறிப்புக்கு எதிர்கால நீட்டிப்புகளின் சாத்தியக்கூறுகள் குறித்து ஆசிரியர்கள் அறிந்திருக்க வேண்டும், இதனால் அவர்கள் தேவையின்றி பிழைகள் அல்லது எச்சரிக்கைகளை வெளியிடுவதில்லை.

source: Tools SHOULD error when evaluating or processing unrecognized data in Dependency Groups.
eo: Ilo SCIIGU pri eraro, kiam ĝi renkontas aŭ pritraktas nerekonatan datenon en Dependeca Grupo.
ta: சார்பு குழுக்களில் அங்கீகரிக்கப்படாத தரவை மதிப்பீடு செய்யும்போது அல்லது செயலாக்கும்போது கருவிகள் பிழையாக இருக்க வேண்டும்.

source: Tools SHOULD NOT eagerly validate the contents of *all* Dependency Groups unless they have a need to do so.
eo: Ilo NE KONTROLU malprokraste la validecon de la enhavoj de *ĉiuj* Dependecaj Grupoj, se ĝi ne bezonas tion.
ta: கருவிகள் * அனைத்து * சார்பு குழுக்களின் உள்ளடக்கங்களையும் ஆவலுடன் சரிபார்க்கக்கூடாது.

source: This means that in the presence of the following data, most tools should allow the ``foo`` group to be used and only error if the ``bar`` group is used:
eo: Tiu signifas, ke por la jenaj datenoj, iloj ordinare permesos la uzadon de la grupo ``foo``, kaj nur sciigos pri eraro se la grupo ``bar`` estas uzata:
ru: Это означает, что при наличии следующих данных большинство инструментов должны разрешить использование группы ``foo`` и ошибаться только в случае использования группы ``bar``:
ta: இதன் பொருள் பின்வரும் தரவின் முன்னிலையில், பெரும்பாலான கருவிகள் `` ஃபூ`` குழுவை பயன்படுத்த அனுமதிக்க வேண்டும், மேலும் `` பார்`` குழு பயன்படுத்தப்பட்டால் மட்டுமே பிழை:

source: There are several known cases of tools which have good cause to be stricter. Linters and validators are an example, as their purpose is to validate the contents of all Dependency Groups.
eo: Kelkfoje, ilo tamen povas esti pli strikta. Ekzemple, erardetektilo kaj valideckontrolilo celas kontroli, ĉu la enhavoj de ĉiuj Dependecaj Grupoj validas.
ta: பல அறியப்பட்ட கருவிகள் உள்ளன, அவை கடுமையானதாக இருக்க நல்ல காரணத்தைக் கொண்டுள்ளன. அனைத்து சார்பு குழுக்களின் உள்ளடக்கங்களையும் சரிபார்ப்பதே அவற்றின் நோக்கம் என்பதால், லிண்டர்கள் மற்றும் வாலிடேட்டர்கள் ஒரு எடுத்துக்காட்டு.

source: Reference Implementation
eo: Referenca Realigo
ja: 参照実装
ru: Справочное осуществление
ta: குறிப்பு செயல்படுத்தல்

source: The following Reference Implementation prints the contents of a Dependency Group to stdout, newline delimited. The output is therefore valid ``requirements.txt`` data.
eo: La jena Referenca Realigo eligas la enhavon de Dependeca Grupo al ``stdout``, apartigitan per novlinioj. La eligaĵo estas tial valida dateno por ``requirements.txt``.
ru: Следующая реализация справочника выводит содержимое группы зависимостей в stdout с разграничением по новой строке. Таким образом, на выходе получаются корректные данные ``requirements.txt``.
ta: பின்வரும் குறிப்பு செயல்படுத்தல் ஒரு சார்பு குழுவின் உள்ளடக்கங்களை stdout க்கு அச்சிடுகிறது, நியூலைன் பிரிக்கப்பட்டது. எனவே வெளியீடு செல்லுபடியாகும் `` தேவைகள். Txt`` தரவு.

source: October 2024: This specification was approved through :pep:`735`.
eo: Oktobro 2024: Ĉi tiu specifo estis aprobita per :pep:`735`.
ru: Октябрь 2024 года: Эта спецификация была одобрена через :pep:`735`.
ta: அக்டோபர் 2024: இந்த விவரக்குறிப்பு அங்கீகரிக்கப்பட்டது: PEP: `735`.

source: Dependency specifiers
eo: Dependeco-specifiloj
ja: 依存関係指定子
pt_br: Especificadores de dependência
ru: Спецификаторы зависимостей
ta: சார்பு குறிப்பான்கள்

source: This document describes the dependency specifiers format as originally specified in :pep:`508`.
eo: Jen dokumento priskribanta la formon de dependeco-specifiloj, laŭ la originala normo :pep:`508`.
ja: 元々は :pep:`508` で指定されていた依存関係指定子のフォーマットを、この説明文書は記述します。
pt_br: Este documento descreve o formato dos especificadores de dependência conforme originalmente especificado na :pep:`508`.
ru: Этот документ описывает формат спецификаторов зависимостей, изначально указанный в :pep:`508`.
ta: இந்த ஆவணம் முதலில் குறிப்பிடப்பட்டுள்ளபடி சார்பு குறிப்பிட்ட வடிவமைப்பை விவரிக்கிறது: PEP: `508`.

source: The job of a dependency is to enable tools like pip [#pip]_ to find the right package to install. Sometimes this is very loose - just specifying a name, and sometimes very specific - referring to a specific file to install. Sometimes dependencies are only relevant in one platform, or only some versions are acceptable, so the language permits describing all these cases.
ja: 依存関係 <dependency> の任務は、 pip [#pip]_ のようなツールがインストールするべき正しいパッケージを探し出すことができるようにすることです。これは時には大変に曖昧で名称を指定するだけであったり、別の時には非常に限定的でインストールするべき特定のファイルを参照したりします。場合によっては、依存関係 <dependency> がひとつのプラットフォームでのみ妥当であったり、いくつかのバージョンだけが受け入れ可能であったりするので、(依存関係 <dependency> を記述する) 言語としてはこれらすべてのケースを記述できるものでなければなりません。
pt_br: O trabalho de uma dependência é permitir que ferramentas como pip [#pip]_ encontrem o pacote certo para instalar. Às vezes, isso é muito vago -- apenas especificando um nome -- e, às vezes, muito específico -- referindo-se a um arquivo específico a ser instalado. Às vezes, as dependências são relevantes apenas em uma plataforma, ou apenas algumas versões são aceitáveis, então a linguagem permite descrever todos esses casos.
ru: Задача зависимостей - дать возможность таким инструментам, как pip [#pip]_, найти нужный пакет для установки. Иногда это очень неконкретно - просто указание имени, а иногда очень конкретно - ссылка на конкретный файл для установки. Иногда зависимости актуальны только для одной платформы, или допустимы только некоторые версии, поэтому язык позволяет описывать все эти случаи.
ta: ஒரு சார்புநிலையின் வேலை, பிஐபி [#PIP] போன்ற கருவிகளை நிறுவுவதற்கு சரியான தொகுப்பைக் கண்டுபிடிப்பது. சில நேரங்களில் இது மிகவும் தளர்வானது - ஒரு பெயரைக் குறிப்பிடுவது, சில நேரங்களில் மிகவும் குறிப்பிட்டது - நிறுவ ஒரு குறிப்பிட்ட கோப்பைக் குறிப்பிடுகிறது. சில நேரங்களில் சார்புநிலைகள் ஒரு தளத்தில் மட்டுமே பொருத்தமானவை, அல்லது சில பதிப்புகள் மட்டுமே ஏற்றுக்கொள்ளத்தக்கவை, எனவே இந்த நிகழ்வுகள் அனைத்தையும் விவரிக்கும் மொழி அனுமதிக்கிறது.

source: The language defined is a compact line based format which is already in widespread use in pip requirements files, though we do not specify the command line option handling that those files permit. There is one caveat - the URL reference form, specified in :ref:`Versioning specifier specification <version-specifiers>` is not actually implemented in pip, but we use that format rather than pip's current native format.
ja: 定義された言語は、簡潔な行単位のフォーマットであって pip の requirements ファイルで既に広く使われているものですが、そのようなファイル群を許容するようなコマンドラインオプションを指定することはしていません。ひとつ注意しなければならないのは、 :ref:`バージョン指定子仕様 <version-specifiers>` で指定されているような URL を参照する形式は実は pip では実装されていないのに、現在の pip の本来のフォーマットよりもむしろそちらのフォーマットを使っているという点です。
ru: Определенный язык - это компактный формат, основанный на строках, который уже широко используется в файлах требований pip, хотя мы не указываем обработку опций командной строки, которую допускают эти файлы. Есть одна оговорка - форма URL-ссылки, указанная в :ref:`Спецификация спецификатора версий <version-specifiers>`, на самом деле не реализована в pip, но мы используем этот формат, а не текущий родной формат pip.
ta: வரையறுக்கப்பட்ட மொழி ஒரு சிறிய வரி அடிப்படையிலான வடிவமாகும், இது ஏற்கனவே PIP தேவைகள் கோப்புகளில் பரவலான பயன்பாட்டில் உள்ளது, இருப்பினும் அந்தக் கோப்புகள் அனுமதிக்கும் கட்டளை வரி விருப்பத்தை நாங்கள் குறிப்பிடவில்லை. ஒரு எச்சரிக்கை உள்ளது - முகவரி குறிப்பு படிவம், குறிப்பிடப்பட்டுள்ளது: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு -விவரக்குறிப்புகள்>` உண்மையில் PIP இல் செயல்படுத்தப்படவில்லை, ஆனால் PIP இன் தற்போதைய சொந்த வடிவமைப்பைக் காட்டிலும் அந்த வடிவமைப்பைப் பயன்படுத்துகிறோம்.

source: All features of the language shown with a name based lookup::
eo: Jen ekzemplo de ĉiuj funkcioj de la lingvo kun nombaza postulo::
ja: この言語のすべての機能を、名前に基づいた参照とともに示します::
pt_br: Todos os recursos do idioma mostrados com uma pesquisa baseada em nome ::
ru: Все возможности языка отображаются с помощью поиска по названию::
ta: பெயர் அடிப்படையிலான தேடலுடன் காட்டப்பட்டுள்ள மொழியின் அனைத்து அம்சங்களும் ::

source: A minimal URL based lookup::
eo: Minimuma URL-baza serĉo::
ja: 最低限の URL に基づいた参照::
pt_br: Uma pesquisa baseada em URL mínima ::
ru: Минимальный поиск на основе URL ::
ta: குறைந்தபட்ச முகவரி அடிப்படையிலான தேடல் ::

source: Concepts
eo: Konceptoj
ja: 概念
pt_br: Conceitos
ru: Концепции
ta: கருத்துக்கள்

source: A dependency specification always specifies a distribution name. It may include extras, which expand the dependencies of the named distribution to enable optional features. The version installed can be controlled using version limits, or giving the URL to a specific artifact to install. Finally the dependency can be made conditional using environment markers.
ja: 依存関係の指定では、常に、配布物の名前を指定します。名前で指定された配布物で特定の追加機能を有効にするように依存関係を拡張するような追加物 <extra> を含んでいても構いません。インストールされたバージョンをバージョンリミットで制御することもできますし、特定のアーティファクトをインストールするために URL を与えることもできます。依存関係は最終的に環境マーカを用いて条件別に作成することもできます。
pt_br: Uma especificação de dependência sempre especifica um nome de distribuição. Pode incluir extras, que expandem as dependências da distribuição nomeada para habilitar recursos opcionais. A versão instalada pode ser controlada usando limites de versão ou fornecendo a URL para um artefato específico para instalação. Finalmente, a dependência pode ser condicionada usando marcadores de ambiente.
ru: Спецификация зависимостей всегда указывает имя дистрибутива. Она может включать дополнения, которые расширяют зависимости именованного дистрибутива для включения дополнительных возможностей. Установленная версия может контролироваться с помощью ограничений версии или указания URL-адреса конкретного артефакта для установки. Наконец, зависимость может быть обусловлена с помощью маркеров окружения.
ta: சார்பு விவரக்குறிப்பு எப்போதும் விநியோக பெயரைக் குறிப்பிடுகிறது. இது கூடுதல் அம்சங்களை உள்ளடக்கியது, இது விருப்ப அம்சங்களை செயல்படுத்த பெயரிடப்பட்ட விநியோகத்தின் சார்புகளை விரிவுபடுத்துகிறது. நிறுவப்பட்ட பதிப்பை பதிப்பு வரம்புகளைப் பயன்படுத்தி கட்டுப்படுத்தலாம் அல்லது நிறுவ ஒரு குறிப்பிட்ட கலைப்பொருளுக்கு முகவரி ஐ வழங்கலாம். இறுதியாக சுற்றுச்சூழல் குறிப்பான்களைப் பயன்படுத்தி சார்புநிலையை நிபந்தனைக்குட்படுத்தலாம்.

source: Grammar
eo: Gramatiko
ja: 文法
pt_br: Gramática
ru: Грамматика
ta: இலக்கணம்

source: We first cover the grammar briefly and then drill into the semantics of each section later.
eo: Ni unue maldetale diskutas la gramatikon kaj poste detalos la semantikon de ĉiu sekcio.
ja: 最初に文法について簡単に触れた後、それぞれの節の意味論 <semantics> について深く掘り下げることにしましょう。
pt_br: Primeiro, abordamos brevemente a gramática e, posteriormente, detalhamos a semântica de cada seção.
ru: Сначала мы кратко рассмотрим грамматику, а затем углубимся в семантику каждого раздела.
ta: நாங்கள் முதலில் இலக்கணத்தை சுருக்கமாக மூடி, பின்னர் ஒவ்வொரு பிரிவின் சொற்பொருளிலும் துளைக்கிறோம்.

source: A distribution specification is written in ASCII text. We use a parsley [#parsley]_ grammar to provide a precise grammar. It is expected that the specification will be embedded into a larger system which offers framing such as comments, multiple line support via continuations, or other such features.
ja: 配布物の仕様は ASCII テキストで書かれています。厳密な文法としては parsley [#parsley]_ の文法を使っています。この仕様は、コメントや継続による複数行サポートやその他の機能の枠組みを与えるもっと大きなシステムの中に組み込まれることを期待しています。
pt_br: Uma especificação de distribuição é escrita em texto ASCII. Usamos uma gramática de parsley [#parsley]_ para fornecer uma gramática precisa. Espera-se que a especificação seja incorporada a um sistema maior que ofereça enquadramento, como comentários, suporte a várias linhas por meio de continuações ou outros recursos semelhantes.
ru: Спецификация дистрибутива записывается в виде ASCII-текста. Мы используем грамматику parsley [#parsley]_, чтобы обеспечить точную грамматику. Предполагается, что спецификация будет встроена в более крупную систему, которая предлагает такие возможности, как комментарии, поддержка нескольких строк через продолжения или другие подобные возможности.
ta: விநியோக விவரக்குறிப்பு ASCII உரையில் எழுதப்பட்டுள்ளது. ஒரு துல்லியமான இலக்கணத்தை வழங்க நாங்கள் ஒரு வோக்கோசு [#பார்ச்லி] _ இலக்கணத்தைப் பயன்படுத்துகிறோம். விவரங்கள் ஒரு பெரிய அமைப்பில் உட்பொதிக்கப்படும் என்று எதிர்பார்க்கப்படுகிறது, இது கருத்துகள், தொடர்ச்சியான பல வரி உதவி அல்லது இதுபோன்ற பிற நற்பொருத்தங்கள் போன்ற ஃப்ரேமிங்கை வழங்குகிறது.

source: The full grammar including annotations to build a useful parse tree is included at the end of this document.
eo: La plena gramatiko kun komentoj por konstrui utilan sintaksarbon troviĝas ĉe la fino de ĉi tiu dokumento.
ja: 役に立つ構文解析ツリーを構成するための注釈機能を含む完全な文法は、この説明文書の末尾に置きました。
pt_br: A gramática completa, incluindo anotações para construir uma árvore de análise útil, está incluída no final deste documento.
ru: Полная грамматика, включая аннотации для построения полезного дерева разбора, приведена в конце этого документа.
ta: இந்த ஆவணத்தின் முடிவில் பயனுள்ள பாகுபடுத்தும் மரத்தை உருவாக்குவதற்கான சிறுகுறிப்புகள் உட்பட முழு இலக்கணம் சேர்க்கப்பட்டுள்ளது.

source: Versions may be specified according to the rules of the :ref:`Version specifier specification <version-specifiers>`. (Note: URI is defined in :rfc:`std-66 <3986>`)::
eo: Versio estas specifebla laŭ la reguloj de :ref:`la specifo pri versio-specifiloj <version-specifiers>`. (Notu: URI estas difinita en :rfc:`std-66 <3986>`)::
ja: :ref:`バージョン指定子仕様 <version-specifiers>` の規則に従ってバージョンを指定しても構いません。(ノート: URI は :rfc:`std-66 <3986>` で定義されています)::
pt_br: As versões podem ser especificadas de acordo com as regras da :ref:`especificação de especificadores de versão <version-specifiers>`. (Nota: URI é definido em :rfc:`std-66 <3986>`)::
ru: Версии могут быть указаны в соответствии с правилами спецификации спецификатора версий <version-specifiers>`. (Примечание: URI определены в :rfc:`std-66 <3986>`)::
ta: பதிப்புகள்: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>` விதிகளின் படி குறிப்பிடப்படலாம். .

source: Environment markers allow making a specification only take effect in some environments::
eo: Media marko permesas efektivigi specifon nur en kelkaj medioj::
ja: 環境マーカを使うことで、ある仕様が特定の環境でのみ有効であることを示すことができます::
pt_br: Os marcadores de ambiente permitem que uma especificação só tenha efeito em alguns ambientes ::
ru: Маркеры среды позволяют сделать так, чтобы спецификация действовала только в некоторых средах::
ta: சுற்றுச்சூழல் குறிப்பான்கள் ஒரு விவரக்குறிப்பை உருவாக்க சில சூழல்களில் மட்டுமே நடைமுறைக்கு வர அனுமதிக்கின்றன ::

source: Optional components of a distribution may be specified using the extras field::
eo: Nedeviga komponanto de distribuo estas specifebla per la kampo ``extras``::
ja: 配布物のうちの必須ではない部分については extras フィールドを使って指定することができます::
pt_br: Componentes opcionais de uma distribuição podem ser especificados usando o campo extras::
ru: Дополнительные компоненты дистрибутива могут быть указаны с помощью поля extras::
ta: ஒரு விநியோகத்தின் விருப்ப கூறுகள் கூடுதல் புலத்தைப் பயன்படுத்தி குறிப்பிடப்படலாம் ::

source: Restrictions on names for extras is defined in :pep:`685`.
eo: Restriktoj pri nomoj de kromaĵoj estas difinitaj en :pep:`685`.
ja: 追加物の名前に対する制限事項は :pep:`685` で定義されています。
pt_br: Restrições de nomes para extras são definidas na :pep:`685`.
ru: Ограничения на имена для дополнений определены в :pep:`685`.
ta: கூடுதல் பெயர்களுக்கான கட்டுப்பாடுகள் வரையறுக்கப்பட்டுள்ளன: PEP: `685`.
