Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The following table lists labels that are well-known for the purpose of specializing the presentation of ``Project-URL`` metadata:
eo: Jen tabelo de etikedoj bone konataj por montrado de metadatenoj ``Project-URL``:
ru: В следующей таблице перечислены метки, которые хорошо известны для целей специализации представления метаданных ``Project-URL``:
ta: `` Project-URL`` மெட்டாடேட்டாவின் விளக்கக்காட்சியை நிபுணத்துவம் பெறுவதற்கான நோக்கத்திற்காக நன்கு அறியப்பட்ட லேபிள்களை பின்வரும் அட்டவணை பட்டியலிடுகிறது:

source: Label (Human-readable equivalent)
eo: Etikedo (Home legebla ekvivalentaĵo)
ru: Этикетка (человекочитаемый эквивалент)
ta: சிட்டை (மனிதனால் படிக்கக்கூடிய சமமான)

source: Aliases
eo: Sinonimoj
ru: Псевдонимы
ta: மாற்றுப்பெயர்கள்

source: ``homepage`` (Homepage)
ru: ``Домашняя страница`` (Домашняя страница)
ta: `` முகப்புப்பக்கத்தை` (முகப்புப்பக்கம்)

source: The project's home page
eo: La ĉefpaĝo de la projekto
ru: Домашняя страница проекта
ta: திட்டத்தின் முகப்பு பக்கம்

source: *(none)*
eo: *(nenio)*
ru: *(никто)*
ta: *(எதுவுமில்லை)*

source: ``source`` (Source Code)
ru: ``Источник`` (Исходный код)
ta: `` மூல`` (மூலக் குறியீடு)

source: The project's hosted source code or repository
eo: La gastigita fontokodo aŭ deponejo de la projekto
ru: Размещенный исходный код проекта или репозиторий
ta: திட்டத்தின் புரவலன் செய்யப்பட்ட மூலக் குறியீடு அல்லது களஞ்சியம்

source: ``repository``, ``sourcecode``, ``github``
ta: `` களஞ்சியம்``, `` சோர்ச் கோட்``, `` கிதுப்``

source: ``download`` (Download)
ru: ``Загрузить`` (Загрузка)
ta: `` பதிவிறக்கம்`` (பதிவிறக்கம்)

source: A download URL for the current distribution, equivalent to ``Download-URL``
eo: Elŝuta retadreso por la distribuo, ekvivalenta al ``Download-URL``
ru: URL-адрес загрузки текущего дистрибутива, эквивалентный ``Скачать-URL``
ta: தற்போதைய விநியோகத்திற்கான பதிவிறக்க முகவரி, `` பதிவிறக்கம்-url`` க்கு சமம்

source: ``changelog`` (Changelog)
ru: ``changelog`` (журнал изменений)
ta: `` சேஞ்ச்லாக்`` (சேஞ்ச்லாக்)

source: The project's comprehensive changelog
eo: La plena ŝanĝoprotokolo de la projekto
ru: Полный журнал изменений проекта
ta: திட்டத்தின் விரிவான சேஞ்ச்லாக்

source: ``changes``, ``whatsnew``, ``history``
ta: `` மாற்றங்கள்``, `` வாட்ச்நியூ``, `` வரலாறு``

source: ``releasenotes`` (Release Notes)
ru: ``releasenotes`` (Заметки о выпуске)
ta: `` வெளியீட்டு குறிப்புகள்)

source: The project's curated release notes
eo: La eldonaj notoj de la projekto
ru: Примечания к выпуску проекта
ta: திட்டத்தின் நிர்வகிக்கப்பட்ட வெளியீட்டுக் குறிப்புகள்

source: ``documentation`` (Documentation)
ru: ``документация`` (Документация)
ta: `` ஆவணங்கள்`` (ஆவணங்கள்)

source: The project's online documentation
eo: La Interreta dokumentaro de la projekto
ru: Онлайн-документация проекта
ta: திட்டத்தின் நிகழ்நிலை ஆவணங்கள்

source: ``docs``
ta: `` டாக்ச்``

source: ``issues`` (Issue Tracker)
ru: ``issues`` (Трекер проблем)
ta: `` சிக்கல்கள்`` (டிராக்கர் வெளியீடு)

source: The project's bug tracker
eo: La cimdatenbanko de la projekto
ru: Трекер ошибок проекта
ta: திட்டத்தின் பிழை டிராக்கர்

source: ``bugs``, ``issue``, ``tracker``, ``issuetracker``, ``bugtracker``
ta: `` பிழைகள்``, `` வெளியீடு``, `` டிராக்கர்``, `` issuetracker``, `` bugtracker``

source: ``funding`` (Funding)
ru: ``финансирование`` (Финансирование)
ta: `` நிதி`` (நிதி)

source: Funding Information
eo: Informoj pri Financado
ru: Информация о финансировании
ta: பொருள் செய்தி

source: ``sponsor``, ``donate``, ``donation``
ru: ``спонсор``, ``пожертвовать``, ``пожертвование``
ta: `` ச்பான்சர்``, `` நன்கொடை``, `` நன்கொடை``

source: Package metadata consumers may choose to render aliased labels the same as their "parent" well known label, or further specialize them.
eo: Uzanto de pakaj metadatenoj povas montri sinonimajn etikedojn same kiel la «gepatran» bone konatan etikedon aŭ pli speciale.
ta: தொகுப்பு மேனிலை தரவு நுகர்வோர் தங்கள் "பெற்றோர்" நன்கு அறியப்பட்ட லேபிளைப் போலவே மாற்றியமைக்கப்பட்ட லேபிள்களை வழங்க தேர்வு செய்யலாம் அல்லது அவற்றை மேலும் நிபுணத்துவம் பெறலாம்.

source: Example behavior
eo: Ekzempla konduto
ta: எடுத்துக்காட்டு நடத்தை

source: The following shows the flow of project URL metadata from ``pyproject.toml`` to core metadata to a potential index presentation:
eo: Jen la fluo de projekta retadresa metadateno el ``pyproject.toml`` al kerna metadateno al ebla indeksa prezento:
ta: `` Pyproject.toml`` இலிருந்து கோர் மெட்டாடேட்டாவிலிருந்து சாத்தியமான குறியீட்டு விளக்கக்காட்சிக்கு திட்ட முகவரி மெட்டாடேட்டாவின் ஓட்டத்தை பின்வருவது காட்டுகிறது:

source: Example project URLs in standard configuration
eo: Ekzemplaj projektaj retadresoj por ordinara agordado
ta: நிலையான உள்ளமைவில் எடுத்துக்காட்டு திட்ட முகவரி கள்

source: Core metadata representation
eo: Prezento de kernaj metadatenoj
ta: கோர் மேனிலை தரவு பிரதிநிதித்துவம்

source: Potential rendering
eo: Ebla montrado
ta: சாத்தியமான வழங்குதல்

source: Observe that the core metadata appears in the form provided by the user (since metadata *producers* do not perform normalization), but the metadata *consumer* normalizes and identifies appropriate human-readable equivalents based on the normalized form:
eo: Notu, ke la kernaj metadatenoj aperas en la formo provizita de la uzanto (la *produktanto* de metadatenoj ne normigas), sed la *konsumanto* de metadatenoj normigas kaj identigas taŭgajn home legeblajn ekvivalentaĵojn laŭ la normigitaj formoj:
ta: பயனரால் வழங்கப்பட்ட வடிவத்தில் கோர் மேனிலை தரவு தோன்றும் என்பதைக் கவனியுங்கள் (மெட்டாடேட்டா * தயாரிப்பாளர்கள் * இயல்பாக்கம் செய்யாததால்), ஆனால் மேனிலை தரவு * நுகர்வோர் * இயல்பாக்கப்பட்ட வடிவத்தின் அடிப்படையில் பொருத்தமான மனித-படிக்கக்கூடிய சமமானவற்றை இயல்பாக்குகிறது மற்றும் அடையாளம் காட்டுகிறது:

source: ``Home page`` becomes ``homepage``, which is rendered as ``Homepage``
eo: ``Home page`` fariĝas ``homepage``, kiu montriĝas kiel ``Homepage``
ta: `` முகப்பு பக்கம்`` `` முகப்புப்பக்கத்தை`` ஆகிறது, இது `` முகப்புப்பக்கத்தை`` என வழங்கப்படுகிறது

source: ``DOCUMENTATION`` becomes ``documentation``, which is rendered as ``Documentation``
eo: ``DOCUMENTATION`` fariĝas ``documentation``, kiu montriĝas kiel ``Documentation``
ta: `` ஆவணங்கள்`` `` ஆவணங்கள்` ஏற்படுகிறது, இது `` ஆவணங்கள்`` என வழங்கப்படுகிறது

source: ``Repository`` becomes ``repository``, which is rendered as ``Source Code``
eo: ``Repository`` fariĝas ``repository``, kiu montriĝas kiel ``Source Code``
ta: `` களஞ்சியம்`` `` களஞ்சியத்தை` `ஆகிறது, இது` `மூலக் குறியீடு`` என வழங்கப்படுகிறது

source: ``GitHub`` becomes ``github``, which is rendered as ``Source Code (GitHub)`` (as a specialization of ``Source Code``)
eo: ``GitHub`` fariĝas ``github``, kiu montriĝas kiel ``Source Code (GitHub)`` (specialaĵo de ``Source Code``)
ta: `` கிதுப்`` `` கிட்அப்`` ஆகிறது, இது `` மூலக் குறியீடு (கிதுப்) `` (`` மூலக் குறியீடு`` இன் நிபுணத்துவமாக) என வழங்கப்படுகிறது)

source: How to Get Support
eo: Kiel Esti Helpata
ja: サポートを得るには
pt_br: Como obter suporte
ru: Как получить поддержку
ta: ஆதரவைப் பெறுவது எப்படி

source: For support related to a specific project, see the links on the :doc:`Projects <key_projects>` page.
eo: Por subteno pri specifa projekto, vidu la hiperligojn ĉe la paĝo :doc:`Projektoj <key_projects>`.
ja: 特定のプロジェクトに関係するサポートについては、 :doc:`プロジェクト群 <key_projects>` のリンク集のページを見てください。
pt_br: Para suporte relacionado a um projeto específico, consulte os links na página :doc:`Projetos <key_projects>`.
ru: Для получения поддержки, связанной с конкретным проектом, смотрите ссылки на странице :doc:`Projects <key_projects>`.
ta: ஒரு குறிப்பிட்ட திட்டத்துடன் தொடர்புடைய ஆதரவுக்கு, டாக்: `திட்டங்கள் <KEY_PROJECTS>` பக்கம் ஆகியவற்றில் உள்ள இணைப்புகளைப் பார்க்கவும்.

source: For something more general, or when you're just not sure, please `open an issue <https://github.com/pypa/packaging-problems/issues/new?template=general_issue.yml>`_ on the `packaging-problems <https://github.com/pypa/packaging-problems>`_ repository on GitHub.
eo: Por io pli ĝenerala, aŭ se vi ne certas, bonvolu `raporti problemon <https://github.com/pypa/packaging-problems/issues/new?template=general_issue.yml>`_ pri la deponejo `packaging-problems <https://github.com/pypa/packaging-problems>`_ ĉe GitHub.
ja: もっと一般的なサポートを求めている場合や、確信を持てないだけの場合には、GitHub の `パッケージングに関わる問題 <https://github.com/pypa/packaging-problems>`_ の `課題リストに課題を作成する <https://github.com/pypa/packaging-problems/issues/new?template=general_issue.yml>`_ 下さい。
pt_br: Para algo mais geral, ou quando você não tiver certeza, por favor `relate o problema <https://github.com/pypa/packaging-problems/issues/new?template=general_issue.yml>`_ no repositório `packaging-problems <https://github.com/pypa/packaging-problems>`_ no GitHub.
ru: Для чего-то более общего, или если вы просто не уверены, пожалуйста, `откройте проблему <https://github.com/pypa/packaging-problems/issues/new?template=general_issue.yml>`_ в репозитории `packaging-problems <https://github.com/pypa/packaging-problems>`_ на GitHub.
ta: இன்னும் பொதுவான ஒன்றுக்கு, அல்லது உங்களுக்குத் தெரியாதபோது, தயவுசெய்து ஒரு சிக்கலைத் திறக்கவும் <https://github.

source: Creating documentation
eo: Krei dokumentaron
ja: 説明文書を作成する
ru: Создание документации
ta: ஆவணங்களை உருவாக்குதல்

source: This tutorial has been removed since it is not related to packaging and was unmaintained. Please see the `Sphinx tutorial <https://www.sphinx-doc.org/en/master/tutorial>`_ instead.
eo: Jen forigita lernilo, ĉar ĝi ne estas rilata al pakado kaj ne estis mastrumata. Bonvolu legi `la lernilon pri Sphinx <https://www.sphinx-doc.org/en/master/tutorial>`_ anstataŭe.
ja: パッケージングに関連していないことと、維持管理されていないことから、このチュートリアルは取り除かれました。代わりに `Sphinx チュートリアル <https://www.sphinx-doc.org/en/master/tutorial>`_ を見てください。
ru: Это руководство было удалено, поскольку оно не имеет отношения к упаковке и не поддерживается. Пожалуйста, обратитесь к учебнику `Sphinx <https://www.sphinx-doc.org/en/master/tutorial>`_ вместо этого.
ta: இந்த டுடோரியல் பேக்கேசிங் தொடர்பானது அல்ல, ஏனெனில் இது அளவிடப்படவில்லை. அதற்கு பதிலாக `ச்பின்க்ச் டுடோரியல் <https://www.sphinx-doc.org/en/master/tutorial> _ _ ஐப் பார்க்கவும்.

source: **Tutorials** are opinionated step-by-step guides to help you get familiar with packaging concepts. For more detailed information on specific packaging topics, see :doc:`/guides/index`.
eo: **Lernilo** estas opinihava paŝo-post-paŝa dokumento helpanta vin sci pli pri konceptoj pri pakado. Por pli detalaj informoj pri specifaj temoj pri pakado, vidu :doc:`/guides/index`.
ja: **チュートリアル** は、どのようにすれば良いかを指示しながらステップバイステップで進めるガイドで、あなたがパッケージングの概念に慣れ親しむのを助けます。パッケージングの特定の話題に関するより詳しい情報については、 :doc:`/guides/index` を見てください。
pt_br: **Tutoriais** são guias passo a passo opinativos para ajudá-lo a se familiarizar com os conceitos de empacotamento. Para obter informações mais detalhadas sobre tópicos de empacotamento específicos, consulte :doc:`/guides/index`.
ru: **Учебники** - это пошаговые руководства, которые помогут вам ознакомиться с концепциями упаковки. Более подробную информацию по конкретным темам упаковки можно найти в :doc:`/guides/index`.
ta: ** பயிற்சிகள் ** பேக்கேசிங் கருத்துக்களை நன்கு அறிந்து கொள்ள உதவும் படிப்படியான வழிகாட்டிகள். குறிப்பிட்ட பேக்கேசிங் தலைப்புகள் பற்றிய விரிவான தகவலுக்கு, காண்க: DOC: `/வழிகாட்டிகள்/குறியீட்டு`.

source: Installing Packages
eo: Instali Pakojn
ja: パッケージをインストールする
pt_br: Instalando pacotes
ru: Установка Пакетов
ta: தொகுப்புகளை நிறுவுதல்

source: This section covers the basics of how to install Python :term:`packages <Distribution Package>`.
eo: Jen paragrafo pri kiel instali Python-:term:`pakojn <Distribution Package>`.
ja: この節では、 Python の :term:`パッケージ <Distribution Package>` をインストールする方法の基本について示します。
pt_br: Esta seção cobre o básico de como instalar :term:`pacotes <Distribution Package>` Python.
ru: В этом разделе рассматриваются основы установки Python :term:`packages <Distribution Package>`.
ta: இந்த பிரிவு பைத்தானை எவ்வாறு நிறுவுவது என்பதற்கான அடிப்படைகளை உள்ளடக்கியது: கால: `தொகுப்புகள் <விநியோக தொகுப்பு>`.

source: It's important to note that the term "package" in this context is being used to describe a bundle of software to be installed (i.e. as a synonym for a :term:`distribution <Distribution Package>`). It does not refer to the kind of :term:`package <Import Package>` that you import in your Python source code (i.e. a container of modules). It is common in the Python community to refer to a :term:`distribution <Distribution Package>` using the term "package". Using the term "distribution" is often not preferred, because it can easily be confused with a Linux distribution, or another larger software distribution like Python itself.
eo: Notu, ke la esprimo «pako» en tiu kunteksto estas instalebla fasko da programoj (t.e. sinonimo de :term:`distribuo <Distribution Package>`). Ĝi ne signifas :term:`pakon <Import Package>`, kiun vi importas en via Python-fontkodo (ujon de moduloj). La Python-komunumo ofte uzas la terminon «pako» por signifi :term:`distribuon <Distribution Package>` Ofte oni evitas la terminon «distribuo», pro konfuzo kun Linux-distribuo aŭ pli granda programdistribuo kiel Python mem.
ja: この文脈では、 "パッケージ" という用語が、インストールされるソフトウェアの束を表すものである (すなわち、 :term:`配布物 <Distribution Package>` の同義語である) ことを注記しておくことは重要です。 Python のなんらかのソースコードをインポートする (つまり、モジュール群の) 容れ物としての :term:`パッケージ <Import Package>` のことを指してはいないのです。 Python のコミュニティでは、 :term:`配布物 <Distribution Package>` のことを "パッケージ" という用語で呼ぶことは一般的に行われています。 Linux ディストロや、 Python そのもののようなその他の大きなソフトウェア配布物と紛らわしいので、 "配布物" という用語を使うことはしばしば歓迎されません。
ru: Важно отметить, что термин "пакет" в данном контексте используется для описания пакета программного обеспечения, подлежащего установке (т.е. как синоним :term:`distribution <Distribution Package>`). Он не относится к типу :term:`package <Import Package>`, который вы импортируете в исходный код Python (т.е. контейнер модулей). В сообществе Python принято ссылаться на :term:`distribution <Distribution Package>`, используя термин "пакет". Использование термина "дистрибутив" часто не является предпочтительным, поскольку его легко спутать с дистрибутивом Linux или другим большим дистрибутивом программного обеспечения, таким как сам Python.
ta: இந்த சூழலில் "தொகுப்பு" என்ற சொல் நிறுவப்பட வேண்டிய மென்பொருளை விவரிக்க பயன்படுத்தப்படுகிறது என்பதை கவனத்தில் கொள்ள வேண்டும் (அதாவது A க்கு ஒத்ததாக: கால: `விநியோக <விநியோக தொகுப்பு>`). இது உங்கள் பைதான் மூலக் குறியீட்டில் இறக்குமதி செய்யும் (அதாவது தொகுதிகளின் கொள்கலன்) நீங்கள் இறக்குமதி செய்யும்: `தொகுப்பு <இறக்குமதி தொகுப்பு> வகைகளைக் குறிக்கவில்லை. ஒரு: கால: `விநியோகம் <விநியோக தொகுப்பு>` "தொகுப்பு" என்ற வார்த்தையைப் பயன்படுத்துவது பைதான் சமூகத்தில் பொதுவானது. "வழங்கல்" என்ற வார்த்தையைப் பயன்படுத்துவது பெரும்பாலும் விரும்பப்படுவதில்லை, ஏனென்றால் இது லினக்ச் விநியோகத்துடன் அல்லது பைத்தான் போன்ற மற்றொரு பெரிய மென்பொருள் விநியோகத்துடன் எளிதாக குழப்பமடையக்கூடும்.

source: Requirements for Installing Packages
eo: Postuloj por Instali Pakojn
ja: パッケージをインストールするための必須事項
pt_br: Requisitos para instalar pacotes
ru: Требования к установке пакетов
ta: தொகுப்புகளை நிறுவுவதற்கான தேவைகள்

source: This section describes the steps to follow before installing other Python packages.
eo: Jen paragrafo pri la paŝoj farendaj antaŭ ol instali aliajn Python-pakojn.
ja: この節では、その他の Python パッケージをインストールする前にやっておくべきステップを記します。
pt_br: Esta seção descreve as etapas a serem seguidas antes de instalar outros pacotes Python.
ru: В этом разделе описаны шаги, которые необходимо выполнить перед установкой других пакетов Python.
ta: இந்த பிரிவு பிற பைதான் தொகுப்புகளை நிறுவுவதற்கு முன் பின்பற்ற வேண்டிய படிகளை விவரிக்கிறது.

source: Ensure you can run Python from the command line
eo: Certigu, ke vi povas ruli Python komandlinie
ja: コマンドラインから Python を起動できることを確認する
pt_br: Certifique-se de que você consegue executar Python a partir da linha de comando
ru: Убедитесь, что вы можете запускать Python из командной строки
ta: கட்டளை வரியிலிருந்து பைத்தானை இயக்க முடியும் என்பதை உறுதிப்படுத்தவும்

source: Before you go any further, make sure you have Python and that the expected version is available from your command line. You can check this by running:
eo: Komence certigu, ke vi havas Python kaj ke la atendata versio disponiĝas ĉe via komandlinio. Vi povas kontroli tion rulante la jenon:
ja: 先へ進む前に、期待通りのバージョンの Python が手元のコマンドラインで動作していることを確認しておきましょう。つぎのコマンドを実行すれば確認できます:
pt_br: Antes de prosseguir, certifique-se de ter o Python e de que a versão esperada está disponível em sua linha de comando. Você pode verificar isso executando:
ru: Прежде чем продолжить, убедитесь, что у вас есть Python и что ожидаемая версия доступна в командной строке. Вы можете проверить это, выполнив команду:
ta: நீங்கள் மேலும் செல்வதற்கு முன், உங்களிடம் பைதான் உள்ளது என்பதையும், எதிர்பார்க்கப்படும் பதிப்பு உங்கள் கட்டளை வரியிலிருந்து கிடைக்கிறது என்பதையும் உறுதிப்படுத்திக் கொள்ளுங்கள். இயங்குவதன் மூலம் இதை நீங்கள் சரிபார்க்கலாம்:

source: You should get some output like ``Python 3.6.3``. If you do not have Python, please install the latest 3.x version from `python.org`_ or refer to the :ref:`Installing Python <python-guide:installation>` section of the Hitchhiker's Guide to Python.
eo: Vi ricevu eligaĵon kiel ``Python 3.6.3``. Se vi ne havas Python, bonvolu instali la plej novan version 3.x el `python.org`_ aŭ vidu la paragrafon :ref:`Instali Python <python-guide:installation>` de la dokumentaro.
ja: ``Python 3.6.3`` のような応答が出力されるはずです。もし Python がなければ、最新バージョンの 3.x を `python.org`_ からインストールするか、 Python ユーザのためのヒッチハイクガイドの :ref:`Python をインストールする <python-guide:installation>` の節を参照するか、どちらかをしてください。
pt_br: Você deve obter alguma saída como ``Python 3.6.3``. Se você não tiver o Python, instale a versão 3.x mais recente de `python.org`_ ou consulte a seção :ref:`Instalando Python <python-guide:installation>` do Guia do Mochileiro para Python.
ru: Вы должны получить результат вроде ``Python 3.6.3``. Если у вас нет Python, пожалуйста, установите последнюю версию 3.x с сайта `python.org`_ или обратитесь к разделу :ref:`Установка Python <python-guide:installation>` руководства "Путеводитель автостопщика по Питону".
ta: `` பைதான் 3.6.3`` போன்ற சில வெளியீட்டை நீங்கள் பெற வேண்டும். உங்களிடம் பைதான் இல்லையென்றால், தயவுசெய்து `python.org`_ இலிருந்து அண்மைக் கால 3.x பதிப்பை நிறுவவும் அல்லது: குறிப்பு:` பைத்தானை நிறுவுதல் <பைதான்-வழிகாட்டியாக: நிறுவல்> `பைத்தானுக்கு இட்சிகரின் வழிகாட்டியின் பிரிவு.

source: If you're a newcomer and you get an error like this:
eo: Se vi estas komencanto kaj ricevas eraron similan al la jeno:
ja: あなたがまだ慣れていなくて、しかも次のようなエラーに遭遇した場合には:
pt_br: Se você for um novato e receber um erro como este:
ru: Если вы новичок и получаете ошибку, подобную этой:
ta: நீங்கள் ஒரு புதியவர் என்றால், இது போன்ற பிழையைப் பெறுவீர்கள்:

source: It's because this command and other suggested commands in this tutorial are intended to be run in a *shell* (also called a *terminal* or *console*). See the Python for Beginners `getting started tutorial`_ for an introduction to using your operating system's shell and interacting with Python.
eo: Tio estas ĉar tiu komando kaj aliaj sugestataj komandoj en ĉi tiu lernilo estu rulata en *ŝelo* (ankaŭ konata kiel *terminalo* aŭ *konzolo*). Vidu `tiun lernilon <getting started tutorial>`_ por enkonduko pri uzado de la ŝelo de via mastruma sistemo kaj interagado kun Python.
ja: それは、このコマンドや、このチュートリアルに出てくる他のコマンドが、 *シェル* (*ターミナル* とか *コンソール* とも呼ばれます) で動作することを意図しているからです。オペレーティングシステムのシェルを使って Python とやりとりするための導入説明として、初心者のための Python `はじめの第一歩チュートリアル <getting started tutorial`_ を見てください。
pt_br: É porque este comando e outros comandos sugeridos neste tutorial devem ser executados em um *shell* (também chamado de *terminal* ou *console*). Veja o `tutorial de introdução`_ para iniciantes do Python para uma introdução sobre como usar o shell do seu sistema operacional e interagir com o Python.
ru: Это связано с тем, что данная команда и другие команды, предложенные в этом руководстве, предназначены для запуска в *оболочке* (также называемой *терминалом* или *консолью*). О том, как использовать оболочку операционной системы и взаимодействовать с Python, читайте в учебнике Python для начинающих `Начало работы`_.
ta: ஏனென்றால், இந்த கட்டளையும் இந்த டுடோரியலில் பரிந்துரைக்கப்பட்ட பிற கட்டளைகளும் ஒரு *செல் *இல் இயக்கப்பட வேண்டும் (ஒரு *முனையம் *அல்லது *கன்சோல் *என்றும் அழைக்கப்படுகிறது). உங்கள் இயக்க முறைமையின் செல்லைப் பயன்படுத்துவதற்கும் பைத்தானுடன் தொடர்புகொள்வதற்கும் ஒரு அறிமுகத்திற்கு தொடக்கக்காரர்களுக்கான பைதானைப் பார்க்கவும்.

source: If you're using an enhanced shell like IPython or the Jupyter notebook, you can run system commands like those in this tutorial by prefacing them with a ``!`` character:
eo: Se oni uzas pliigitan ŝelon kiel IPython aŭ Jupyter-notlibron, oni povas ruli sistemajn komandojn kiel tiujn en ĉi tiu lernilo per prefikso ``!``:
ja: IPython や Jupyter notebook のような拡張されたシェルを使っているのであれば、先頭に ``!`` マークを付けることで、このチュートリアルに出てくるようなシステムコマンドを実行することができます:
pt_br: Se estiver usando um shell aprimorado como o IPython ou o notebook Jupyter, você pode executar comandos do sistema como os deste tutorial precedendo-os com um caractere ``!``:
ru: Если вы используете расширенную оболочку, такую как IPython или блокнот Jupyter, вы можете запускать системные команды, подобные тем, что приведены в этом руководстве, предваряя их символом ``!``:
ta: நீங்கள் ஐபிதான் அல்லது சூபிட்டர் நோட்புக் போன்ற மேம்பட்ட செல்லைப் பயன்படுத்துகிறீர்கள் என்றால், இந்த டுடோரியலில் உள்ளதைப் போன்ற கணினி கட்டளைகளை ``! `` எழுத்து:

source: It's recommended to write ``{sys.executable}`` rather than plain ``python`` in order to ensure that commands are run in the Python installation matching the currently running notebook (which may not be the same Python installation that the ``python`` command refers to).
eo: Ni rekomendas skribi ``{sys.Executable}`` prefere ol ``python`` por certigi, ke komandoj ruliĝas en la Python-instalo kongrua kun la aktuale rulata notlibro (kiu povas esti ne sama kiel la instalo de Python identigita de la komando ``python``).
ja: 現在動作している notebook の Python 実装 (これは ``python`` コマンドが実際に呼び出す Python 実装と同じであるとは限らない) で (投入した) コマンドが動作していることを確実にするために、 単に ``python`` と書くのではなく ``{sys.executable}`` と書くことを推奨します。
pt_br: É recomendado escrever ``{sys.executable}`` em vez de ``python`` simples para garantir que os comandos sejam executados na instalação do Python correspondendo ao ambiente em execução (que pode não ser o mesmo Python instalação à qual o comando ``python`` se refere).
ru: Рекомендуется писать ``{sys.executable}``, а не просто ``python``, чтобы обеспечить выполнение команд в установке Python, соответствующей текущему запущенному блокноту (которая может быть не той установкой Python, на которую ссылается команда ``python``).
ta: தற்போது இயங்கும் நோட்புக்குடன் பொருந்தக்கூடிய பைதான் நிறுவலில் கட்டளைகள் இயங்குவதை உறுதி செய்வதற்காக `` பைதான்`` ஐ விட `{sys.executable}` `எழுத பரிந்துரைக்கப்படுகிறது.
