Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: This section covers how to use the public PyPI download statistics dataset to learn more about downloads of a package (or packages) hosted on PyPI. For example, you can use it to discover the distribution of Python versions used to download a package.
eo: Ĉi tiu paragrafo priskribas kiel uzi la publikan statistikan datenaron pri elŝutoj el PyPI por lerni pli pri elŝutoj de pako (aŭ pakoj) ĉe PyPI. Ekzemple, oni povas uzi ĝin por malkovri la distribuojn de Python-versioj uzitaj por elŝuti pakon.
ja: この節では、公開のPyPIダウンロードデータセットを用いて、PyPIにホストされているパッケージ(あるいはパッケージ群)のダウンロード状況を詳しく見ていくことを記述しています。例えば、ダウンロードに使われたPythonのバージョンの分布を発見することができます。
pt_br: Esta seção cobre como usar o conjunto de dados de estatísticas de download público do PyPI para saber mais sobre os downloads de um pacote (ou pacotes) hospedado no PyPI. Por exemplo, você pode usá-lo para descobrir a distribuição das versões do Python usadas para baixar um pacote.
ru: Этот раздел охватывает, как использовать публичный набор данных статистики загрузки PyPI, чтобы узнать больше о загрузках пакета (или пакетов), размещенного на PyPI. Например, вы можете использовать его для обнаружения распространения версий Python, используемых для загрузки пакета.
ta: PYPI இல் புரவலன் செய்யப்பட்ட ஒரு தொகுப்பின் (அல்லது தொகுப்புகள்) பதிவிறக்கங்களைப் பற்றி மேலும் அறிய பொது PYPI பதிவிறக்க புள்ளிவிவர தரவுத்தொகுப்பை எவ்வாறு பயன்படுத்துவது என்பதை இந்த பிரிவு உள்ளடக்கியது. எடுத்துக்காட்டாக, ஒரு தொகுப்பைப் பதிவிறக்குவதற்குப் பயன்படுத்தப்படும் பைதான் பதிப்புகளின் விநியோகத்தைக் கண்டறிய இதைப் பயன்படுத்தலாம்.

source: Background
eo: Fonaj informoj
ja: 背景
pt_br: Contexto
ru: Фон
ta: பின்னணி

source: PyPI does not display download statistics for a number of reasons: [#]_
eo: PyPI ne montras statistikojn pri elŝutoj pro kelkaj kialoj: [#]_
ja: PyPIはいくつもの理由からダウンロード統計を表示しません。:[#]_
pt_br: O PyPI não exibe estatísticas de download por vários motivos: [#]_
ru: PyPI не отображает статистику загрузки по ряду причин: [#]_
ta: பல காரணங்களுக்காக பதிவிறக்க புள்ளிவிவரங்களை PYPI காட்டாது: [#] _

source: **Inefficient to make work with a Content Distribution Network (CDN):** Download statistics change constantly. Including them in project pages, which are heavily cached, would require invalidating the cache more often, and reduce the overall effectiveness of the cache.
eo: **Ne kongrua kun Enhavo-Distribua Reto (CDN):** Statistikoj pri elŝutoj ŝanĝadas. Inkluzivado de tiuj en projekto-paĝoj tre enkaŝmemorigitaj postulus oftan eksvalidigon de la kaŝmemoro kaj igus la kaŝmemoron malpli efika.
ja: **コンテンツデリバリネットワーク(CDN)と一緒に動かす時の効率の悪さ** ダウンロード用系は常に変動します。プロジェクトのページでのダウンロードは強烈にキャッシュされていますが、(訳註、統計を正しく取ろうとするなら)より頻繁にキャッシュし直さなければならず、これはキャッシュの効率性を損ねます。
pt_br: **Ineficiente para fazer funcionar com uma Rede de Distribuição de Conteúdo (CDN):** As estatísticas de download mudam constantemente. Incluí-las nas páginas do projeto, que são altamente armazenadas em cache, exigiria a invalidação do cache com mais frequência e reduziria a eficácia geral do cache.
ru: **Неэффективно работать с сетью распространения контента (CDN):** Загрузка статистики меняется постоянно. Включение их в страницы проекта, которые сильно кэшируются, потребует более частой аннулирования кэша и снижения общей эффективности кэша.
ta: ** உள்ளடக்க விநியோக நெட்வொர்க்குடன் (சி.டி.என்) வேலை செய்ய திறமையற்றது: ** புள்ளிவிவரங்களைப் பதிவிறக்குங்கள் தொடர்ந்து மாறுகிறது. திட்ட பக்கங்களில் அவற்றைச் சேர்ப்பது, பெரிதும் தற்காலிக சேமிப்பில் உள்ளது, தற்காலிக சேமிப்பை அடிக்கடி செல்லாததாக்க வேண்டும், மேலும் தற்காலிக சேமிப்பின் ஒட்டுமொத்த செயல்திறனைக் குறைக்கும்.

source: **Highly inaccurate:** A number of things prevent the download counts from being accurate, some of which include:
eo: **Tre malpreciza:** Kelkaj problemoj malhelpas la precizecon de la kalkulado de elŝutoj, interalie:
ja: **非常に不正確** 次に挙げるものを含め、いくつもの要因でダウンロード数が正確とは言えないものになります：
pt_br: **Altamente imprecisa:** Várias coisas impedem que as contagens de download sejam precisas, algumas das quais incluem:
ru: **Очень неточно:** Некоторые вещи не позволяют считать загрузку точной, некоторые из которых включают:
ta: ** மிகவும் துல்லியமற்றது: ** பதிவிறக்க எண்ணிக்கைகள் துல்லியமாக இருப்பதைத் தடுக்கின்றன, அவற்றில் சில பின்வருவனவற்றை உள்ளடக்குகின்றன:

source: ``pip``'s download cache (lowers download counts)
eo: Elŝuta kaŝmemoro de ``pip`` (kiu malpliigas la kalkulon de eŝutoj)
ja: ``pip``のダウンロードキャッシュ (ダウンロード数を小さくする)
pt_br: Cache de download do ``pip`` (diminui a contagem de downloads)
ru: ``pip`` кэш загрузки (считывает количество загрузок)
ta: `` பிஐபி பதிவிறக்கம் கேச் (பதிவிறக்க எண்ணிக்கையை குறைக்கிறது)

source: Internal or unofficial mirrors (can both raise or lower download counts)
eo: Internaj aŭ neoficialaj speguloj (povas kaj pliigi kaj malpliigi elŝutajn kalkulojn)
ja: 内部の、または、非公式のミラーサイト (ダウンロード数を大きくする要因にも小さくする要因にもなる)
pt_br: Espelhos internos ou não oficiais (pode aumentar ou diminuir as contagens de download)
ru: Внутренние или неофициальные зеркала (могут как поднять, так и снизить количество загрузок)
ta: உள் அல்லது அதிகாரப்பூர்வமற்ற கண்ணாடிகள் (பதிவிறக்க எண்ணிக்கையை உயர்த்தலாம் அல்லது குறைக்கலாம்)

source: Packages not hosted on PyPI (for comparisons sake)
eo: Pakoj ne gastigitaj de PyPI (por komparo)
ja: PyPIにホストされていないパッケージ (比較することの妥当性を損ねる)
pt_br: Pacotes não hospedados no PyPI (para fins de comparação)
ru: Пакеты, не размещенные на PyPI (для сравнения)
ta: PYPI இல் புரவலன் செய்யப்படாத தொகுப்புகள் (ஒப்பீடுகளுக்காக)

source: Unofficial scripts or attempts at download count inflation (raises download counts)
eo: Neoficialaj instaliloj aŭ provoj falsi la fojojn de elŝutado (kiuj pliigas la nombron de elŝutoj)
ja: ダウンロード数を増やす非公式のスクリプトまたは試行 (ダウンロード数を大きくする)
pt_br: Scripts não oficiais ou tentativas de aumento da contagem de download (aumenta a contagem de downloads)
ru: Неофициальные скрипты или попытки скачать подсчет инфляции (изобличает количество загрузок)
ta: அதிகாரப்பூர்வமற்ற ச்கிரிப்ட்கள் அல்லது பதிவிறக்க எண்ணிக்கையிலான பணவீக்கத்திற்கான முயற்சிகள் (பதிவிறக்க எண்ணிக்கையை உயர்த்தும்)

source: Known historical data quality issues (lowers download counts)
eo: Konataj historiaj problemoj pri datena kvalito (kiuj malpliigas la nombron de elŝutoj)
ja: 過去のデータ品質における既知の問題 (ダウンロード数を小さくする)
pt_br: Problemas conhecidos de qualidade de dados históricos (diminui a contagem de downloads)
ru: Известные исторические проблемы качества данных (низкие числа загрузок)
ta: அறியப்பட்ட வரலாற்று தரவு தர சிக்கல்கள் (பதிவிறக்க எண்ணிக்கையை குறைக்கிறது)

source: **Not particularly useful:** Just because a project has been downloaded a lot doesn't mean it's good; Similarly just because a project hasn't been downloaded a lot doesn't mean it's bad!
eo: **Ne tre utila:** Ne veras, ke ju pli elŝutata projekto estas, des pli bona ĝi estas!
ja: **とりわけ利用価値があるというわけではない** プロジェクト(の配布物、訳註。)がたくさんダウンロードされたからといってそれだけで良いことだと決まったわけではありませんし、あまりダウンロードされなかったとしてもそれだけで悪いことだと決めつけることもできません！
pt_br: **Não é particularmente útil:** Só porque um projeto foi muito baixado, não significa que ele seja bom; Da mesma forma, só porque um projeto não foi muito baixado, não significa que ele seja ruim!
ru: ** Не особенно полезно:** То, что проект был загружен очень много, не означает, что он хорош; Точно так же только потому, что проект не был загружен много, не означает, что это плохо!
ta: ** குறிப்பாக பயனுள்ளதாக இல்லை: ** ஒரு திட்டம் நிறைய பதிவிறக்கம் செய்யப்பட்டுள்ளதால் அது நல்லது என்று அர்த்தமல்ல; இதேபோல் ஒரு திட்டம் அதிகம் பதிவிறக்கம் செய்யப்படாததால் அது மோசமானது என்று அர்த்தமல்ல!

source: In short, because its value is low for various reasons, and the tradeoffs required to make it work are high, it has been not an effective use of limited resources.
eo: Resume, ĉar la valoro estas malalta pro diversaj kialoj, kaj la kostoj estas altaj, tio ne estas efika uzo de limigitaj resursoj.
ja: まとめると、様々な理由からその価値が低い上、動作させるために犠牲になるものが多いので、限られた資源の効率的な利用にはならないのです。
pt_br: Resumindo, como seu valor é baixo por vários motivos e as compensações necessárias para fazê-lo funcionar são altas, não tem sido um uso eficaz de recursos limitados.
ru: Короче говоря, поскольку его стоимость является низкой по различным причинам, а компромиссы, необходимые для его работы, высоки, это не было эффективным использованием ограниченных ресурсов.
ta: சுருக்கமாக, அதன் மதிப்பு பல்வேறு காரணங்களுக்காக குறைவாக இருப்பதால், அதைச் செய்யத் தேவையான பரிமாற்றங்கள் அதிகமாக இருப்பதால், இது வரையறுக்கப்பட்ட வளங்களின் பயனுள்ள பயன்பாடு அல்ல.

source: Public dataset
eo: Publika datenaro
ja: 公開データセット
pt_br: Conjunto de dados públicos
ru: Набор данных
ta: பொது தரவுத்தொகுப்பு

source: As an alternative, the `Linehaul project <https://github.com/pypa/linehaul-cloud-function/>`__ streams download logs from PyPI to `Google BigQuery`_ [#]_, where they are stored as a public dataset.
eo: Alternative, `la projekto Linehaul <https://github.com/pypa/linehaul-cloud-function/>`__ transigas elŝutajn protokolojn de PyPI al `Google BigQuery`_ [#]_, konservitajn kiel publikan datenaron.
ja: 別の方法としては、 `Linehaulプロジェクト <https://github.com/pypa/linehaul-cloud-function/>`__ がダウンロードのログをPyPIから `Google BigQuery`_ [#]_ へ連続的に取り出して、公開のデータセットとして保管しています。
pt_br: Como alternativa, o `projeto Linehaul <https://github.com/pypa/linehaul-cloud-function/>`__ transmite registros de download do PyPI para o `Google BigQuery`_ [#]_, onde são armazenados como um conjunto de dados público.
ru: <https://github.com/pypa/linehaul-cloud- function/>`__ потоков загружает журналы от PyPI до `Google BigQuery`_ [#]_, где они хранятся в виде набора общедоступных данных.
ta: மாற்றாக, `லைன்ஆல் திட்டம் <https://github.com/pypa/linehaul-cloud-function/>` __ ச்ட்ரீம்கள் பைபியிலிருந்து `கூகிள் பிக்குவரி`_ [#] _ க்கு பதிவுகள் பதிவிறக்குகின்றன பொது தரவுத்தொகுப்பு.

source: Getting set up
eo: Ekstarigi
ja: セットアップのやり方
pt_br: Preparando-se
ru: Подготовка к работе
ta: அமைக்கப்படுகிறது

source: In order to use `Google BigQuery`_ to query the `public PyPI download statistics dataset`_, you'll need a Google account and to enable the BigQuery API on a Google Cloud Platform project. You can run up to 1TB of queries per month `using the BigQuery free tier without a credit card <https://cloud.google.com/blog/products/data-analytics/query-without-a-credit-card-introducing-bigquery-sandbox>`__
eo: Por uzi `Google BigQuery`_ por serĉi `la publikan statistikan datenaron pri elŝutoj el PyPI <public PyPI download statistics dataset>`_, oni bezonas havi konton ĉe Google kaj ŝalti la BigQuery API por projekto ĉe Google Cloud Platform. Oni rajtas uzi maksimume po 1 terabajton da informpetoj en ĉiu monato `uzante la senkostan tavolon de BigQuery sen kreditkarto <https://cloud.google.com/blog/products/data-analytics/query-without-a-credit-card-introducing-bigquery-sandbox>`__
ja: `Google BigQuery`_ を使って `PyPIダウンロード統計の公開データセット <public PyPI download statistics dataset>`_ に問い合わせを行うためには、まずGoogleアカウントが必要で、Google Cloud Platform (GCP)でBigQuery APIを有効にしておく必要があります。`クレジットカード登録なしのBigQuery 無料枠 <https://cloud.google.com/blog/products/data-analytics/query-without-a-credit-card-introducing-bigquery-sandobox>`__ を使うと一ヶ月当たり1TBまでのクエリを走らせることができます
pt_br: Para usar o `Google BigQuery`_ para consultar o `conjunto de dados público de estatísticas de download do PyPI`_, você precisará de uma conta do Google e habilitar a API do BigQuery em um projeto do Google Cloud Platform. Você pode executar até 1 TB de consultas por mês `usando o free tier do BigQuery sem um cartão de crédito <https://cloud.google.com/blog/products/data-analytics/query-without-a-credit-card-introducing-bigquery-sandbox>`__
ru: Для того, чтобы использовать `Google BigQuery`_ для запроса 'публичной PyPI загрузки статистических данных `_, вам понадобится учетная запись Google и включить API BigQuery в проект Google Cloud Platform. <https://cloud.google.com/blog/products/data-analytics/query- without-a-credit-card-introducing-bigquery-sandbox>`__
ta: `பொது PYPI பதிவிறக்க புள்ளிவிவரங்கள் தரவுத்தொகுப்பு`_ ஐ வினவ` Google bigquery`_ ஐப் பயன்படுத்த, உங்களுக்கு Google கணக்கு தேவை மற்றும் Google முகில் இயங்குதள திட்டத்தில் பெரிய பநிஇ ஐ இயக்க வேண்டும். கடன் அட்டை இல்லாமல் பிக்வரி இலவச அடுக்கைப் பயன்படுத்தி மாதத்திற்கு 1TB வினவல்கள் வரை இயக்கலாம் <https://cloud.google.com/blog/products/data-analytics -பிகுவரி-சாண்ட்பாக்ச்> `__

source: Navigate to the `BigQuery web UI`_.
eo: Navigu al la `reta fasado de BigQuery <BigQuery web UI>`_.
ja: `BigQuery ウェブ UI <BigQuery web UI>`_ への道案内。
pt_br: Acesse a `interface web do BigQuery`_.
ru: Перейдите к `BigQuery web UI`_.
ta: `பெரிய வலை UI`_ க்கு செல்லவும்.

source: Create a new project.
eo: Krei novan projekton.
ja: 新しいプロジェクトを作成する。
pt_br: Crie um novo projeto.
ru: Создайте новый проект.
ta: புதிய திட்டத்தை உருவாக்கவும்.

source: Enable the `BigQuery API <https://console.developers.google.com/apis/library/bigquery-json.googleapis.com>`__.
eo: Ŝalti la `BigQuery API <https://console.developers.google.com/apis/library/bigquery-json.googleapis.com>`__.
ja: `BigQuery API <https://console.developers.google.com/apis/library/bigquery-json.googleapis.com>`__ を有効にする。
pt_br: Habilite a `BigQuery API <https://console.developers.google.com/apis/library/bigquery-json.googleapis.com>`__.
ru: Включить `BigQuery API <https://console.developers.google.com/apis/library/bigquery-json.googleapis.com>`__.
ta: `BigQuery பநிஇ <https://console.tevelopers.google.com/apis/library/bigquery-json.googleapis.com> __.

source: For more detailed instructions on how to get started with BigQuery, check out the `BigQuery quickstart guide <https://cloud.google.com/bigquery/docs/quickstarts/quickstart-web-ui>`__.
eo: Por pli detalaj instrukcioj pri kiel ekuzi BigQuery, legu `BigQuery quickstart guide <https://cloud.google.com/bigquery/docs/quickstarts/quickstart-web-ui>`__.
ja: BigQueryの始め方についてさらに詳しい指南が欲しい場合は、`Cloud Console を使用したクイックスタート <https://cloud.google.com/bigquery/docs/quickstarts/quickstart-web-ui>`__ を参照してください。
pt_br: Para obter instruções mais detalhadas sobre como começar a usar o BigQuery, consulte o `guia de início rápido do BigQuery <https://cloud.google.com/bigquery/docs/quickstarts/quickstart-web-ui>`__.
ru: Для более подробных инструкций о том, как начать работу с BigQuery, ознакомьтесь с `BigQuery Руководством по ускоренному запуску <https://cloud.google.com/bigquery/docs/quickstarts/quickstart-web-ui>`__.
ta: பிக்வெரியுடன் எவ்வாறு தொடங்குவது என்பது குறித்த விரிவான வழிமுறைகளுக்கு, `பிக்வெரி குயிக்ச்டார்ட் வழிகாட்டி <https://cloud.google.com/bigquery/docs/quickstarts/quickstart-web-ui> ____.

source: Data schema
eo: Datena skemo
ja: データ構造
pt_br: Esquema de dados
ru: Схема данных
ta: தரவுத் திட்டம்

source: Linehaul writes an entry in a ``bigquery-public-data.pypi.file_downloads`` table for each download. The table contains information about what file was downloaded and how it was downloaded. Some useful columns from the `table schema <https://console.cloud.google.com/bigquery?pli=1&p=bigquery-public-data&d=pypi&t=file_downloads&page=table>`__ include:
eo: Linehaul skribas eron en tabelon ``bigquery-public-data.pypi.file_downloads`` por ĉiu elŝuto. La tabelo enhavas informojn pri la elŝutita dosiero kaj la maniero de elŝuto. Jen kelkaj utilaj kolumnoj en la `tabela skemo <https://console.cloud.google.com/bigquery?pli=1&p=bigquery-public-data&d=pypi&t=file_downloads&page=table>`__:
ja: それぞれのダウンロードの情報を格納した ``bigquery-public-data.pypi.file_downloads``テーブルについての説明をLinehaulが書きました。このテーブルは、どのファイルがどのようにダウンロードされたかに関する情報を格納しています。`テーブル構造 <https://console.cloud.google.com/bigquery?pli=1&p=bigquery-public-data&d=pypi&t=file_downloads&page=table>`__ から役に立つカラムをいくつか挙げると：
pt_br: Linehaul escreve uma entrada em uma tabela ``bigquery-public-data.pypi.file_downloads`` para cada download. A tabela contém informações sobre qual arquivo foi baixado e como foi baixado. Algumas colunas úteis do `esquema da tabela <https://console.cloud.google.com/bigquery?pli=1&p=bigquery-public-data&d=pypi&t=file_downloads&page=table>`__ inclui:
ru: Linehaul пишет запись в таблице ``bigquery-public-data.pypi.file_downloads`` для каждой загрузки. В таблице содержится информация о том, какой файл был загружен и как он был загружен. Некоторые полезные столбцы из «табличной схемы <https://console.cloud.google.com/bigquery?pli=1&p=bigquery-public-data&d=pypi&t=file_downloads&page=table>`__ включить:
ta: ஒவ்வொரு பதிவிறக்கத்திற்கும் `` BigQuery-public-data.pypi.file_downloads`` அட்டவணையில் ஒரு பதிவை லைன்ஆல் எழுதுகிறார். எந்த கோப்பு பதிவிறக்கம் செய்யப்பட்டது, அது எவ்வாறு பதிவிறக்கம் செய்யப்பட்டது என்பது பற்றிய தகவல்கள் அட்டவணையில் உள்ளன. `அட்டவணை ச்கீமா <https://console.cloud.google.com/bigquery?pli=1&p=bigquery-public-data&d=pypi&t=file_downloads&page=table> __ இல் இருந்து சில பயனுள்ள நெடுவரிசைகள்:` __

source: Column
eo: Kolumno
ja: カラム
pt_br: Coluna
ru: Колонка
ta: நெடுவரிசை

source: Description
eo: Priskribo
ja: 説明
pt_br: Descrição
ru: Описание
ta: விவரம்

source: Examples
eo: Ekzemploj
ja: 例
pt_br: Exemplos
ru: Примеры
ta: எடுத்துக்காட்டுகள்

source: Date and time
eo: Dato kaj tempo
ja: 日付と時刻
pt_br: Data e hora
ru: Дата и время
ta: தேதி மற்றும் நேரம்

source: Project name
eo: Nomo de projekto
ja: プロジェクト名
pt_br: Nome do projeto
ru: Название проекта
ta: திட்ட பெயர்

source: Package version
eo: Versio de pako
ja: パッケージのバージョン
pt_br: Versão do pacote
ru: Версия пакета
ta: தொகுப்பு பதிப்பு

source: Installer
eo: Instalilo
ja: インストーラ
pt_br: Instalador
ru: Установщик
ta: நிறுவி

source: pip, :ref:`bandersnatch`
ta: பிப்,: ref: `bandersnatch`

source: Python version
eo: Versio de Python
ja: Pythonバージョン
pt_br: Versão do Python
ru: Версия Python
ta: பைதான் பதிப்பு

source: Useful queries
eo: Utilaj informpetoj
ja: 役に立つクエリ
pt_br: Consultas úteis
ru: Полезные запросы
ta: பயனுள்ள வினவல்கள்

source: Run queries in the `BigQuery web UI`_ by clicking the "Compose query" button.
eo: Rulu informpetojn en la `reta fasado de BigQuery <BigQuery web UI>`_ alklakante la butonon «Compose query».
ja: 「クエリを新規作成」ボタンをクリックすることで `BigQuery web UI`_ 内でクエリを走らせましょう。
pt_br: Executa consultas na `interface web do BigQuery`_ clicando no botão "Compose query".
ru: Запустить запросы в `BigQuery веб-UI`_, нажав на кнопку "Compose request".
ta: "வினவல்" பொத்தானைக் சொடுக்கு செய்வதன் மூலம் `பிக்வெரி வலை UI`_ இல் வினவல்களை இயக்கவும்.

source: Note that the rows are stored in a partitioned table, which helps limit the cost of queries. These example queries analyze downloads from recent history by filtering on the ``timestamp`` column.
eo: Notu, ke la vicoj estas en dispartigita tabelo, kio limigas la koston de informpetoj. Jen ekzemplaj informpetoj analizantaj lastatempajn elŝutojn filtrante la kolumnon ``timestamp``.
ja: クエリのコストを削減するためにデータベースの行がパーティションされた状態で格納されていることを覚えておいてください。これらの例では、``timestamp`` カラムを使って絞り込むことで最近のダウンロード履歴を分析しています。
pt_br: Observe que as linhas são armazenadas em uma tabela particionada, o que ajuda a limitar o custo das consultas. Essas consultas de exemplo analisam downloads do histórico recente filtrando na coluna ``timestamp``.
ru: Обратите внимание, что строки хранятся в разделенной таблице, что помогает ограничить стоимость запросов. Эти примеры запросов анализируют загрузки из недавней истории путем фильтрации на столбце ``timestamp``.
ta: வரிசைகள் ஒரு பகிர்வு செய்யப்பட்ட அட்டவணையில் சேமிக்கப்படுகின்றன என்பதை நினைவில் கொள்க, இது வினவல்களின் விலையை கட்டுப்படுத்த உதவுகிறது. இந்த எடுத்துக்காட்டு வினவல்கள் `` நேர முத்திரை` நெடுவரிசையில் வடிகட்டுவதன் மூலம் அண்மைக் கால வரலாற்றிலிருந்து பதிவிறக்கங்களை பகுப்பாய்வு செய்கின்றன.

source: Counting package downloads
eo: Kalkuli elŝutojn de pako
ja: パッケージのダウンロードを数える
pt_br: Contando downloads de pacotes
ru: Подсчёт количества загрузок пакетов
ta: தொகுப்பு பதிவிறக்கங்களை எண்ணுதல்

source: The following query counts the total number of downloads for the project "pytest".
eo: Jen informpeto kalkulanta la totalan nombron de elŝutoj de la projekto «pytest».
ja: 次のクエリは"pytest"プロジェクトのダウンロード総数を数えています。
pt_br: A consulta a seguir conta o número total de downloads do projeto "pytest".
ru: В следующем запросе учитывается общее количество загрузок для проекта «pytest.
ta: பின்வரும் வினவல் "பைடெச்ட்" திட்டத்திற்கான மொத்த பதிவிறக்கங்களின் எண்ணிக்கையைக் கணக்கிடுகிறது.

source: To count downloads from pip only, filter on the ``details.installer.name`` column.
eo: Por kalkuli nur elŝutojn per pip, filtru la kolumnon ``details.installer.name``.
ja: pipを通じてダウンロードされた数だけを数えるには、``details.installer.name``カラムを使って抽出してください。
pt_br: Para contar apenas os downloads do pip, filtre na coluna ``details.installer.name``.
ru: Чтобы подсчитать загрузки только из pip, отфильтруйте столбец ``details.installer.name``.
ta: PIP இலிருந்து பதிவிறக்கங்களை மட்டும் எண்ணுவதற்கு, `` விவரங்கள்.இன்ச்டாலர்.நாம்`` நெடுவரிசையில் வடிகட்டவும்.

source: Package downloads over time
eo: Nombro de pakaj elŝutoj tra tempo
ja: 時系列のパッケージダウンロード数
pt_br: Downloads de pacotes ao longo do tempo
ru: Загрузки пакетов с течением времени
ta: தொகுப்பு காலப்போக்கில் பதிவிறக்குகிறது

source: To group by monthly downloads, use the ``TIMESTAMP_TRUNC`` function. Also filtering by this column reduces corresponding costs.
eo: Por grupigi laŭ monatoj, uzu la funkcion ``TIMESTAMP_TRUNC``. Ankaŭ filtrado per tiu kolumno reduktas la koston.
ja: 月毎のダウンロード数を数えるには、``TIMESTAMP_TRUNC``関数を使います。このカラムを使って抽出することは、通信量を抑えることにもなります。
pt_br: Para agrupar por downloads mensais, use a função ``TIMESTAMP_TRUNC``. Além disso, a filtragem por esta coluna reduz os custos correspondentes.
ru: Для группировки по месячным загрузкам используйте функцию ``TIMESTAMP_TRUNC``. Также фильтрация по этому столбцу снижает соответствующие расходы.
ta: மாதாந்திர பதிவிறக்கங்கள் மூலம் குழுவாக, `` TimeStamp_Trunc`` செயல்பாட்டைப் பயன்படுத்தவும். இந்த நெடுவரிசை மூலம் வடிகட்டுவது தொடர்புடைய செலவுகளைக் குறைக்கிறது.

source: Python versions over time
eo: Versioj de Python tra tempo
ja: 時系列で見たPythonバージョン
pt_br: Versões Python ao longo do tempo
ru: Python версии с течением времени
ta: காலப்போக்கில் பைதான் பதிப்புகள்

source: Extract the Python version from the ``details.python`` column. Warning: This query processes over 500 GB of data.
eo: Eltiri la version de Python el la kolumno ``details.python``. Averto: tiu informpeto pritraktas pli ol 500 gigabajtojn da datenoj.
ja: ``details.python``カラムからPythonのバージョンを取り出します。警告：このクエリは500GB以上のデータを処理します。
pt_br: Extrai a versão Python da coluna ``details.python``. Aviso: esta consulta processa mais de 500 GB de dados.
ru: Исключить Python версию из колонки ``details.python``. Предупреждение: Этот запрос обрабатывает 500 ГБ данных.
ta: `` விவரங்கள் .பிதான்` நெடுவரிசையில் இருந்து பைதான் பதிப்பை பிரித்தெடுக்கவும். எச்சரிக்கை: இந்த வினவல் 500 சிபி தரவை செயலாக்குகிறது.

source: python
ta: பைதான்

source: Getting absolute links to artifacts
eo: Akiri absolutajn hiperligojn al artefaktoj
ja: アーティファクトへの完全なリンクを得る
pt_br: Obtendo links absolutos para artefatos
ru: Получение абсолютной связи с артефактами
ta: கலைப்பொருட்களுக்கு முழுமையான இணைப்புகளைப் பெறுதல்
