Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: ``pkg_resources.parse_version`` allows arbitrarily deeply nested version signifiers like ``1.0.dev1.post1.dev5``. This specification however allows only a single use of each type and they must exist in a certain order.
eo: ``pkg_resources.parse_version`` permesas iom ajn da versio-signifiloj kiel ``1.0.dev1.post1.dev5``. Ĉi tiu specifo, tamen, nur permesas nur unu uzon de ĉiu tipo, en difinita ordo.
ja: ``pkg_resources.parse_version`` では、 ``1.0.dev1.post1.dev5`` のように任意に深く入れ子になったバージョン番号の記号表現を許容します。しかし、この仕様では、それぞれのタイプが高々一度だけ使われることと、ある順番に従って存在していることを許容しているだけです。
ru: ``pkg_resources.parse_version`` позволяет произвольно глубоко вложенные указатели версий, такие как ``1.0.dev1.post1.dev5``. Однако эта спецификация допускает только одно использование каждого типа, и они должны существовать в определенном порядке.
ta: `` pkg_resources.parse_version`` `` 1.0.dev1.post1.dev5`` போன்ற தன்னிச்சையாக ஆழமான உள்ளமைக்கப்பட்ட பதிப்பு அடையாளங்காட்டிகளை அனுமதிக்கிறது. இருப்பினும் இந்த விவரக்குறிப்பு ஒவ்வொரு வகையின் ஒரு பயன்பாட்டை மட்டுமே அனுமதிக்கிறது, மேலும் அவை ஒரு குறிப்பிட்ட வரிசையில் இருக்க வேண்டும்.

source: Appendix: Parsing version strings with regular expressions
eo: Apendico: Sintaksanalizi versian tekston per regulaj esprimoj
ja: 補遺: 正規表現を伴うバージョン文字列を解析する
ru: Приложение: Разбор строк версий с помощью регулярных выражений
ta: பின் இணைப்பு: வழக்கமான வெளிப்பாடுகளுடன் பதிப்பு சரங்களை பாகுபடுத்துதல்

source: As noted earlier in the :ref:`public-version-identifiers` section, published version identifiers SHOULD use the canonical format. This section provides regular expressions that can be used to test whether a version is already in that form, and if it's not, extract the various components for subsequent normalization.
ja: :ref:`public-version-identifiers` 節で述べられているように、公開されたバージョン識別子は、正統な書式を使用するべきです。この説では、あるバージョン番号が既にその書式に従っているか否かをテストするために使うことができ、そして、もし否であればその後の標準化のためにさまざまな構成要素を引き出すために使うことができる、そのような正規表現を提供します。
ru: Как отмечалось ранее в разделе :ref:`public-version-identifiers`, идентификаторы опубликованных версий ДОЛЖНЫ использовать канонический формат. В этом разделе приведены регулярные выражения, которые можно использовать для проверки того, имеет ли версия уже такую форму, и, если нет, извлечь различные компоненты для последующей нормализации.
ta: முன்னர் குறிப்பிட்டுள்ளபடி: ref: `பொது-பதிப்பு-அடையாளங்காட்டிகள்` பிரிவு, வெளியிடப்பட்ட பதிப்பு அடையாளங்காட்டிகள் நியமன வடிவமைப்பைப் பயன்படுத்த வேண்டும். இந்த பிரிவு வழக்கமான வெளிப்பாடுகளை வழங்குகிறது, இது ஒரு பதிப்பு ஏற்கனவே அந்த வடிவத்தில் உள்ளதா என்பதை சோதிக்கப் பயன்படுகிறது, அது இல்லையென்றால், அடுத்தடுத்த இயல்பாக்கத்திற்கு பல்வேறு கூறுகளை பிரித்தெடுக்கவும்.

source: To test whether a version identifier is in the canonical format, you can use the following function:
eo: Por kontroli, ĉu versia identigilo estas en la kanona formo, oni povas uzi la jenan funkcion:
ja: バージョン識別子が正統な書式であるか否かを確かめるためには、次の関数を使うことができます:
ru: Чтобы проверить, соответствует ли идентификатор версии каноническому формату, можно воспользоваться следующей функцией:
ta: பதிப்பு அடையாளங்காட்டி நியமன வடிவத்தில் உள்ளதா என்பதை சோதிக்க, நீங்கள் பின்வரும் செயல்பாட்டைப் பயன்படுத்தலாம்:

source: To extract the components of a version identifier, use the following regular expression (as defined by the `packaging <https://github.com/pypa/packaging>`_ project):
eo: Por eltiri la komponantojn de versia identigilo, uzu la jenan regulan esprimon (difinitan de la projekto `packaging <https://github.com/pypa/packaging>`_):
ja: バージョン識別子の構成部分を取り出すためには、以下の正規表現を使ってください (`パッケージング <https://github.com/pypa/packaging>`_ プロジェクトによって定義されたもの):
ru: Чтобы извлечь компоненты идентификатора версии, используйте следующее регулярное выражение (как определено в проекте `packaging <https://github.com/pypa/packaging>`_):
ta: பதிப்பு அடையாளங்காட்டியின் கூறுகளைப் பிரித்தெடுக்க, பின்வரும் வழக்கமான வெளிப்பாட்டைப் பயன்படுத்தவும் (`பேக்கேசிங் <https://github.com/pypa/packaging> _ _ திட்டம்):

source: August 2014: This specification was approved through :pep:`440`.
eo: Aŭgusto 2014: Ĉi tiu specifo estis aprobita per :pep:`440`.
ja: 2014年8月: :pep:`440` を通じてこの仕様が承認された。
ru: Август 2014 г: Эта спецификация была одобрена через :pep:`440`.
ta: ஆகச்ட் 2014: இந்த விவரக்குறிப்பு அங்கீகரிக்கப்பட்டது: PEP: `440`.

source: Python Virtual Environments
eo: Virtualaj Python-Medioj
ja: Python 仮想環境
ru: Виртуальные среды Python
ta: பைதான் மெய்நிகர் சூழல்கள்

source: For Python 3.3 and later versions, :pep:`405` introduced interpreter level support for the concept of "Python Virtual Environments". Each virtual environment has its own Python binary (allowing creation of environments with various Python versions) and can have its own independent set of installed Python packages in its site directories, but shares the standard library with the base installed Python. While the concept of virtual environments existed prior to this update, there was no previously standardised mechanism for declaring or discovering them.
eo: Por Python 3.3 kaj postaj versioj, :pep:`405` enkondukis interpretilo-nivelan subtenon por la koncepto de «Virtuala Python-Medio». Ĉiu virtuala medio havas sian propran Python-duumaĵon (ebligante kreadon de medioj kun diversaj Python-versioj) kaj sian propran sendependan aron de instalitaj Python-pakoj, sed komune kunhavas la norman bibliotekon kun la baza instalita Python. Dum la koncepto de virtuala medio ekzistis antaŭ tiu ĝisdatigo, mankis normigita meĥanismo por deklari aŭ malkovri ĝin.
ja: Python 3.3 およびそれ以降のバージョンでは、 :pep:`405` で "Python 仮想環境 <Python Virtual Environment>" の概念に対するサポートがインタープリタのレベルで導入されました。それぞれの仮想環境が独自の Python バイナリを持ち (従ってさまざまなバージョンの Python 環境を作成することが可能) 、そのサイトディレクトリの中にそれぞれ独立した Python パッケージ群をインストールすることができ、同時に、ベースシステムにインストールされた Python と標準ライブラリを共有することができます。仮想環境の概念はこのアップデートに先立って存在していましたが、(訳註、仮想環境を) 宣言したり発見したりするための標準化されたメカニズムはそれまで存在しなかったのです。
ru: Для Python 3.3 и более поздних версий в :pep:`405` появилась поддержка концепции "виртуальных окружений Python" на уровне интерпретатора. Каждая виртуальная среда имеет свой собственный двоичный файл Python (что позволяет создавать среды с различными версиями Python) и может иметь свой собственный независимый набор установленных пакетов Python в каталогах сайта, но разделяет стандартную библиотеку с базовым установленным Python. Хотя концепция виртуальных сред существовала и до этого обновления, ранее не было стандартизированного механизма для их объявления или обнаружения.
ta: பைதான் 3.3 மற்றும் பின்னர் பதிப்புகளுக்கு,: PEP: `405`" பைதான் மெய்நிகர் சூழல்கள் "என்ற கருத்துக்கு மொழிபெயர்ப்பாளர் நிலை ஆதரவை அறிமுகப்படுத்தியது. ஒவ்வொரு மெய்நிகர் சூழலும் அதன் சொந்த பைதான் பைனரி (பல்வேறு பைதான் பதிப்புகளுடன் சூழல்களை உருவாக்க அனுமதிக்கிறது) மற்றும் அதன் தள கோப்பகங்களில் நிறுவப்பட்ட பைதான் தொகுப்புகளின் சொந்த சுயாதீனமான தொகுப்பைக் கொண்டிருக்கலாம், ஆனால் நிலையான நூலகத்தை அடிப்படை நிறுவப்பட்ட பைத்தானுடன் பகிர்ந்து கொள்கிறது. இந்த புதுப்பிப்புக்கு முன்னர் மெய்நிகர் சூழல்களின் கருத்து இருந்தபோதிலும், அவற்றை அறிவிக்க அல்லது கண்டுபிடிப்பதற்கு முன்னர் தரப்படுத்தப்பட்ட வழிமுறை எதுவும் இல்லை.

source: Runtime detection of virtual environments
eo: Rultempa detektado de virtualaj medioj
ja: 仮想環境のランタイムを識別する
ru: Обнаружение виртуальных сред во время выполнения
ta: மெய்நிகர் சூழல்களின் இயக்க நேர கண்டறிதல்

source: At runtime, virtual environments can be identified by virtue of :py:data:`sys.prefix` (the filesystem location of the running interpreter) having a different value from :py:data:`sys.base_prefix` (the default filesystem location of the standard library directories).
eo: Rultempe oni povas detekti virtualan medion kontrolante, ĉu :py:data:`sys.prefix` (la dosiersistema loko de la rulata interpretilo) diferencas de :py:data:`sys.base_prefix` (la apriora dosiersistema loko de la normaj bibliotekoj).
ja: ランタイムには、仮想環境は :py:data:``sys.prefix`` (動作中のインタープリタのファイルシステム上の場所) が :py:data:``sys.base_prefix`` (標準ライブラリのディレクトリのデフォルトでのファイルシステム上の場所) とは異なる値を持つおかげで識別可能です。
ru: Во время выполнения виртуальные среды можно определить по тому, что значение :py:data:`sys.prefix` (расположение файловой системы запущенного интерпретатора) отличается от значения :py:data:`sys.base_prefix` (расположение файловой системы по умолчанию для каталогов стандартной библиотеки).
ta: இயக்க நேரத்தில், மெய்நிகர் சூழல்களை நற்பண்பால் அடையாளம் காணலாம்: PY: தரவு: `sys.prefix` (இயங்கும் மொழிபெயர்ப்பாளரின் கோப்பு முறைமை இருப்பிடம்) வேறுபட்ட மதிப்பைக் கொண்டுள்ளது: py: தரவு:` sys.base_prefix` (நிலையான நூலக இயக்குநர்களின் இயல்புநிலை கோப்பு முறைமை இருப்பிடம்).

source: :ref:`venv-explanation` in the Python standard library documentation for the :py:mod:`venv` module covers this along with the concept of "activating" a virtual environment in an interactive operating system shell (this activation step is optional and hence the changes it makes can't be reliably used to detect whether a Python program is running in a virtual environment or not).
eo: :ref:`venv-explanation` en la dokumentaro de la norma biblioteko de Python pri :py:mod:`venv` diskutas tion, kune kun la koncepto de «aktivigo» de virtuala medio en interaga mastrusistema ŝelo (tiu paŝo ne estas deviga, kaj tial oni ne povas dependi de la ŝanĝoj pri aktivigo por detekti, ĉu programo ruliĝas en virtuala medio).
ja: :py:mod:`venv` モジュールに関する Python 標準ライブラリの説明文書の :ref:`venv-explanation` は、オペレーティングシステムの対話型シェル内で仮想環境を "活性化 <activating>" するという概念 (この活性化のステップはオプションであり、それがもたらす変化を使っても Python プログラムが仮想環境内で走っているのか否かを信頼できる形で判別することはできません) とともに、これを説明しています。
ru: :ref:`venv-explanation` в документации по стандартной библиотеке Python для модуля :py:mod:`venv` рассказывает об этом, а также о концепции "активации" виртуальной среды в интерактивной оболочке операционной системы (этот шаг активации необязателен, и поэтому изменения, которые он вносит, не могут быть надежно использованы для определения того, запущена ли программа Python в виртуальной среде или нет).
ta: :ref:`venv-explanation` in the பைதான் தரநிலை library ஆவணப்படுத்துதல் க்கு the :py:mod:`venv` தொகுதி மறையம் this along with the concept of "activating" a virtual சூழல் in an interactive operating மண்டலம் ஓடு (this activation படி is விரும்பினால் and hence the changes it makes can't be reliably used பெறுநர் detect whether a பைதான் திட்டம் is running in a virtual சூழல் or not).

source: Declaring installation environments as Python virtual environments
eo: Deklari instalajn mediojn kiel virtualajn Python-mediojn
ja: インストール先の環境がPython 仮想環境であることを宣言する
ru: Объявление сред установки виртуальными средами Python
ta: நிறுவல் சூழல்களை பைதான் மெய்நிகர் சூழல்களாக அறிவித்தல்

source: As described in :pep:`405`, a Python virtual environment in its simplest form consists of nothing more than a copy or symlink of the Python binary accompanied by a ``site-packages`` directory and a ``pyvenv.cfg`` file with a ``home`` key that indicates where to find the Python standard library modules.
eo: Laŭ :pep:`405`, la plej simpla formo de virtuala Python-medio konsistas nur el kopio aŭ simbola ligilo de Python-interpretilo kun dosierujo ``site-packages`` kaj dosiero ``pyvenv.cfg`` kun ŝlosilo ``home`` pri la lokoj de la moduloj de la norma biblioteko de Python.
ja: :pep:`405` で述べられているように、最も単純な形式での Python 仮想環境は、 Python バイナリのコピーかシンボリックリンクに、 ``site-packages`` ディレクトリと、 Python 標準ライブラリのモジュール群がどこで見つかるかを指し示す ``home`` キーを伴った ``pyvenv.cfg`` ファイルが随伴しているだけのもので構成されます。
ru: Как описано в :pep:`405`, виртуальная среда Python в своей простейшей форме состоит не более чем из копии или симлинка двоичного файла Python, сопровождаемого каталогом ``ite-packages`` и файлом ``pyvenv.cfg`` с ключом ``home``, указывающим, где найти модули стандартной библиотеки Python.
ta: இதில் விவரிக்கப்பட்டுள்ளபடி: PEP: `405`, ஒரு பைதான் மெய்நிகர் சூழலில் அதன் எளிமையான வடிவத்தில் ஒரு` `தள-பேக்கேச்கள்` கோப்பகம் மற்றும் ஒரு` `pyvenv.cfg` கோப்புடன் ஒரு` `pyvenv.cfg` கோப்புடன் ஒரு` `` pyvenv.cfg` கோப்புடன் ஒரு `` pyvenv.cfg` கோப்புடன் ஒரு நகல் அல்லது சிம்லிங்க் ஆகியவற்றைத் தவிர வேறொன்றையும் கொண்டிருக்கவில்லை.

source: While designed to meet the needs of the standard :py:mod:`venv` module, this split installation and ``pyvenv.cfg`` file approach can be used by *any* Python installation provider that desires Python-specific tools to be aware that they are already operating in a virtual environment and no further environment nesting is required or desired.
ja: 標準である :py:mod:`venv` モジュールの要求するものに合うように設計されている一方で、この分割実装と ``pyvenv.cfg`` ファイルのアプローチは、Python に特化したツール群が自身がすでに仮想環境の中で動作していて、それ以上の入れ子環境は要求もされておらず望ましくもないことを認識するようにしたいと望む Python 実装提供者なら *誰でも* 採用することができます。
ru: Хотя он разработан для удовлетворения потребностей стандартного модуля :py:mod:`venv`, этот подход с раздельной установкой и файлом ``pyvenv.cfg`` может быть использован *любым* поставщиком установки Python, который хочет, чтобы инструменты, специфичные для Python, знали, что они уже работают в виртуальной среде, и дальнейшее вложение среды не требуется или нежелательно.
ta: தரத்தின் தேவைகளைப் நிறைவு செய்ய வடிவமைக்கப்பட்டிருந்தாலும்: PY: MOD: `VEV` தொகுதி, இந்த பிளவு நிறுவல் மற்றும்` `pyvenv.cfg`` கோப்பு அணுகுமுறை ஆகியவை * எந்த * பைதான் நிறுவல் வழங்குநரால் பயன்படுத்தப்படலாம், அவை பைதான்-குறிப்பிட்ட கருவிகளை ஏற்கனவே ஒரு மெய்நிகர் சூழலில் இயங்குகின்றன, மேலும் எந்தவொரு சூழலும் தேவையில்லை அல்லது தேவையில்லை.

source: Even in the absence of a ``pyvenv.cfg`` file, any approach (e.g. ``sitecustomize.py``, patching the installed Python runtime) that results in :py:data:`sys.prefix` and :py:data:`sys.base_prefix` having different values, while still providing a matching default package installation scheme in :py:mod:`sysconfig`, will be detected and behave as a Python virtual environment.
eo: Eĉ se la dosiero ``pyvenv.cfg`` mankas, ajna maniero (ekz. ``sitecustomize.py``, modifi la instalitan Python-rultempon) kaŭzanta malsamajn valorojn inter :py:data:`sys.prefix` kaj :py:data:`sys.base_prefix`, dum kongrua apriora pak-instala skemo ekzistas en :py:mod:`sysconfig`, detektiĝos kaj funkcios kiel virtuala medio de Python.
ja: ``pyvenv.cfg`` ファイルがない場合であっても、 (例えばインストール済みの Python ランタイムにパッチを当てる ``sitecustomize.py`` のような) どんなアプローチでも、 :py:data:``sys.prefix`` と :py:data:``sys.base_prefix`` が相異なる値を持つような結果となる一方で、依然として対応するパッケージをインストールする枠組みを :py:mod:``sysconfig`` 内で提供するアプローチであれば、それと認識されて Python 仮想環境として振る舞います。
ru: Даже при отсутствии файла ``pyvenv.cfg``, любой подход (например, ``ситэкастомайзер.py``, исправление установленной среды исполнения Python), который приводит к тому, что :py: данные:`sys. префикс` и :py: данные:`sys.базовый_префикс`` имеют разные значения, но при этом обеспечивает совпадение схемы установки пакетов по умолчанию в :py:mod:`sysconfig``, будет обнаружен и будет вести себя как виртуальная среда Python.
ta: `` Pyvenv.cfg`` கோப்பு இல்லாத நிலையில் கூட, எந்தவொரு அணுகுமுறையும் (எ.கா. : py: mod: `sysconfig`, கண்டறியப்பட்டு பைதான் மெய்நிகர் சூழலாக நடந்து கொள்ளும்.

source: May 2012: This specification was approved through :pep:`405`.
eo: Majo 2012: Ĉi tiu specifo estis aprobita per :pep:`405`.
ja: 2012年5月: :pep:`405` を通じてこの仕様が承認されました。
ru: Май 2012 г: Эта спецификация была одобрена через :pep:`405`.
ta: மே 2012: இந்த விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `405`.

source: Well-known Project URLs in Metadata
eo: Bone Konataj Projektaj Retadresoj en Metadatenoj
ru: Известные URL-адреса проектов в метаданных
ta: மெட்டாடேட்டாவில் நன்கு அறியப்பட்ட திட்ட முகவரி கள்

source: This document is primarily of interest to metadata *consumers*, who should use the normalization rules and well-known list below to make their presentation of project URLs consistent across the Python ecosystem.
eo: Ĉi tiu dokumento estas ĉefe por *konsumanto* de metadatenoj, kiu uzu la regulojn pri normigado kaj liston de bone konataj etikedoj ĉi-subajn por prezenti projektajn retadresojn unuforme tra la ekosistemo de Python.
ru: Этот документ представляет интерес в первую очередь для *потребителей* метаданных, которые должны использовать правила нормализации и известный список ниже, чтобы сделать представление URL-адресов проектов согласованным во всей экосистеме Python.
ta: இந்த ஆவணம் முதன்மையாக மேனிலை தரவு *நுகர்வோர் *க்கு ஆர்வமாக உள்ளது, அவர் பைதான் சுற்றுச்சூழல் அமைப்பு முழுவதும் திட்ட முகவரி களை வழங்குவதற்கு இயல்பாக்குதல் விதிகளையும் நன்கு அறியப்பட்ட பட்டியலையும் பயன்படுத்த வேண்டும்.

source: Metadata *producers* (such as build tools and individual package maintainers) may continue to use any labels they please, within the overall ``Project-URL`` length restrictions. However, when possible, users are *encouraged* to pick meaningful labels that normalize to well-known labels.
ru: Производители *метаданных* (такие как инструменты сборки и отдельные сопровождающие пакетов) могут продолжать использовать любые метки по своему усмотрению, в рамках общих ограничений длины ``Project-URL``. Однако, когда это возможно, пользователям *приветствуется* выбирать значимые метки, которые нормализуются к известным меткам.
ta: மேனிலை தரவு * தயாரிப்பாளர்கள் * (உருவாக்க கருவிகள் மற்றும் தனிப்பட்ட தொகுப்பு பராமரிப்பாளர்கள் போன்றவை) ஒட்டுமொத்த `` திட்ட-உர்எல்`` நீளக் கட்டுப்பாடுகளுக்குள் அவர்கள் விரும்பும் எந்த லேபிள்களையும் தொடர்ந்து பயன்படுத்தலாம். இருப்பினும், முடிந்தால், பயனர்கள் நன்கு அறியப்பட்ட லேபிள்களுக்கு இயல்பாக்கும் அர்த்தமுள்ள லேபிள்களை எடுக்க * ஊக்குவிக்கப்படுகிறார்கள் *.

source: See :ref:`Writing your pyproject.toml - urls <writing-pyproject-toml-urls>` for user-oriented guidance on choosing project URL labels in your package's metadata.
eo: Vidu :ref:`Verki vian pyproject.toml – retadresoj <writing-pyproject-toml-urls>` por diskuto pri elektado de projekta retadresa etikedo por la metadatenoj de via pako.
ru: Смотрите :ref:`Writing your pyproject.toml - urls <writing-pyproject-toml-urls>` для ориентированного на пользователя руководства по выбору меток URL проекта в метаданных вашего пакета.
ta: காண்க: குறிப்பு: `உங்கள் pyproject.toml-URL கள் <எழுதுதல்-pyproject-toml-urls>` உங்கள் தொகுப்பின் மெட்டாடேட்டாவில் திட்ட முகவரி லேபிள்களைத் தேர்ந்தெடுப்பதற்கான பயனர் சார்ந்த வழிகாட்டுதலுக்காக.

source: This specification was originally defined in :pep:`753`.
eo: Ĉi tiu specifo estis originale difinita en :pep:`753`.
ru: Эта спецификация была первоначально определена в :pep:`753`.
ta: இந்த விவரக்குறிப்பு முதலில் வரையறுக்கப்பட்டது: PEP: `753`.

source: :pep:`753` deprecates the :ref:`core-metadata-home-page` and :ref:`core-metadata-download-url` metadata fields in favor of :ref:`core-metadata-project-url`, and defines a normalization and lookup procedure for determining whether a ``Project-URL`` is "well-known," i.e. has the semantics assigned to ``Home-page``, ``Download-URL``, or other common project URLs.
eo: :pep:`753` evitindigas la metadatenajn kampojn :ref:`core-metadata-home-page` kaj :ref:`core-metadata-download-url` (kiujn :ref:`core-metadata-project-url` anstataŭas), kaj difinas normigan kaj serĉan procedon por kontroli, ĉu ``Project-URL`` estas «bone konata», t.e. asignita al ``Home-page``, ``Download-URL``, aŭ alia ofta projekta retadreso.
ru: :pep:`753` упраздняет поля метаданных :ref:`core-metadata-home-page` и :ref:`core-metadata-download-url` в пользу :ref:`core-metadata-project-url`, и определяет процедуру нормализации и поиска для определения того, является ли ``Project-URL`` "хорошо известным", т.е. имеет семантику, присущую ``Home-page``, ``Download-URL``, или другим распространенным URL проекта.
ta: . `` முகப்பு-பக்கம்``, `` பதிவிறக்கம்-உர்எல்`` அல்லது பிற பொதுவான திட்ட முகவரி கள்.

source: This allows indices (such as the Python Package Index) and other downstream metadata consumers to present project URLs in a consistent manner.
eo: Per tio, indekso (kiel la Python-Pakindekso) kaj aliaj uzantoj de metadatenoj povas prezenti projektajn retadresojn kohere.
ru: Это позволяет индексам (таким как Python Package Index) и другим потребителям метаданных представлять URL-адреса проектов в согласованном виде.
ta: இது குறியீடுகளை (பைதான் தொகுப்பு அட்டவணை போன்றவை) மற்றும் பிற கீழ்நிலை மேனிலை தரவு நுகர்வோர் திட்ட முகவரி களை சீரான முறையில் வழங்க அனுமதிக்கிறது.

source: Label normalization
eo: Normigo de etikedo
ru: Нормализация меток
ta: சிட்டை இயல்பாக்கம்

source: Label normalization is performed by metadata *consumers*, not metadata producers.
eo: Normigon de etikedoj faras la *uzantoj* de metadatenoj, ne la produktantoj de metadatenoj.
ru: Нормализация меток выполняется *потребителями* метаданных, а не производителями метаданных.
ta: சிட்டை இயல்பாக்கம் மேனிலை தரவு *நுகர்வோர் *, மேனிலை தரவு உற்பத்தியாளர்கள் அல்ல.

source: To determine whether a ``Project-URL`` label is "well-known," metadata consumers should normalize the label before comparing it to the :ref:`list of well-known labels <well-known-labels>`.
eo: Por determini ĉu etikedo ``Project-URL`` estas «bone konata», uzanto de metadatenoj normigo la etikedon antaŭ ol kompari al la :ref:`listo de bone konataj etikedoj <well-known-labels>`.
ru: Чтобы определить, является ли метка ``Project-URL`` "хорошо известной", потребители метаданных должны нормализовать ее перед сравнением со :ref:`списком хорошо известных меток <well-known-labels>`.
ta: ஒரு `` திட்ட-உர்எல்`` சிட்டை "நன்கு அறியப்பட்டதா" என்பதை தீர்மானிக்க, மேனிலை தரவு நுகர்வோர் லேபிளை ஒப்பிடுவதற்கு முன்பு இயல்பாக்க வேண்டும்: குறிப்பு: `நன்கு அறியப்பட்ட லேபிள்களின் பட்டியல் <நன்கு அறியப்பட்ட-லேபிள்கள்>`.

source: The normalization procedure for ``Project-URL`` labels is defined by the following Python function:
eo: La normiga proceduro por etikedoj ``Project-URL`` estas difinita per la jena Python-funkcio:
ru: Процедура нормализации меток ``Project-URL`` определяется следующей функцией Python:
ta: `` Project-URL`` லேபிள்களுக்கான இயல்பாக்க செயல்முறை பின்வரும் பைதான் செயல்பாட்டால் வரையறுக்கப்படுகிறது:

source: In plain language: a label is *normalized* by deleting all ASCII punctuation and whitespace, and then converting the result to lowercase.
eo: En ordinara lingvo: oni *normigas* etikedon forigante ĉiujn Askiajn interpunkciojn kaj minuskligante la rezulton.
ru: Простым языком: метка *нормализуется* путем удаления всех знаков препинания и пробельных символов ASCII, а затем преобразуется в строчные буквы.
ta: எளிய மொழியில்: அனைத்து ASCII நிறுத்தற்குறி மற்றும் இடைவெளிகளையும் நீக்குவதன் மூலம் ஒரு சிட்டை * இயல்பாக்கப்பட்டது *, பின்னர் முடிவை சிறிய எழுத்துக்கு மாற்றுகிறது.

source: The following table shows examples of labels before (raw) and after normalization:
eo: Jen tabelo da ekzemploj de etikedoj antaŭ normigo (krudaj) kaj post normigo:
ru: В следующей таблице приведены примеры меток до (сырой) и после нормализации:
ta: பின்வரும் அட்டவணை லேபிள்களின் எடுத்துக்காட்டுகளை (மூல) மற்றும் இயல்பாக்கத்திற்குப் பிறகு காட்டுகிறது:

source: Raw
eo: Kruda
ru: Необработанный
ta: மூல

source: Normalized
eo: Normigita
ru: Нормализованный
ta: இயல்பாக்கப்பட்டது

source: ``Homepage``
ta: `` முகப்புப்பக்கம்``

source: ``homepage``
ta: `` முகப்புப்பக்கம்``

source: ``Home-page``
ta: `` முகப்பு-பக்கம்``

source: ``Home page``
ta: `` முகப்பு பக்கம்``

source: ``Change_Log``
ta: `` மாற்றம்_லாக்``

source: ``changelog``
ta: `` சேஞ்ச்லாக்``

source: ``What's New?``
ta: `` புதியது என்ன? ``

source: ``whatsnew``
ta: `` வாட்ச்நியூ``

source: ``github``
ta: `` கிடினப்``

source: Well-known labels
eo: Bone konataj etikedoj
ru: Известные лейблы
ta: நன்கு அறியப்பட்ட லேபிள்கள்

source: The list of well-known labels is a living standard, maintained as part of this document.
eo: La listo de bone konataj etikedoj estas viva normo, mastrumata kiel parto de ĉi tiu dokumento.
ru: Список известных лейблов - это живой стандарт, поддерживаемый в рамках данного документа.
ta: நன்கு அறியப்பட்ட லேபிள்களின் பட்டியல் ஒரு வாழ்க்கைத் தரமாகும், இது இந்த ஆவணத்தின் ஒரு பகுதியாக பராமரிக்கப்படுகிறது.
