Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The guide is deployed via ReadTheDocs and the configuration lives at https://readthedocs.org/projects/python-packaging-user-guide/. It's served from a custom domain and fronted by Fast.ly.
eo: La gvidilo disponiĝas per ReadTheDocs, kaj la agordoj troviĝas ĉe https://readthedocs.org/projects/python-packaging-user-guide/. Ĝi estas servata ĉe propra retadreso per Fast.ly.
ja: この文書は ReadTheDocs を通じて展開されていて、 https://readthedocs.org/projects/python-packaging-user-guide/ から読めるようになっています。また、 Fast.ly から独自のドメイン名から提供されるようになっています(第二文はここだけでは意味が取れない)。
pt_br: O guia é disponibilizado via ReadTheDocs e a configuração está em https://readthedocs.org/projects/python-packaging-user-guide/.. É servido a partir de um domínio personalizado e guardado por Fast.ly.
ru: Руководство развернуто через ReadTheDocs, и конфигурация живет на https://readthedocs.org/projects/python-packaging-user-guide/. Он подается из пользовательского домена и перед ним Fast.ly.
ta: வழிகாட்டி ReadThedocs வழியாகவும், உள்ளமைவு https://readthedocs.org/projects/python-packaging-user-guide/ இல் பயன்படுத்தப்படுகிறது. இது ஒரு தனிப்பயன் களத்திலிருந்து வழங்கப்படுகிறது மற்றும் ஃபாச்ட்.லியின் முன்னால் உள்ளது.

source: Style guide
eo: Rekomendoj pri stilo
ja: スタイルガイド
pt_br: Guia de estilo
ru: Стиль руководство
ta: நடை வழிகாட்டி

source: This style guide has recommendations for how you should write the |PyPUG|. Before you start writing, please review it. By following the style guide, your contributions will help add to a cohesive whole and make it easier for your contributions to be accepted into the project.
eo: Ĉi tiu stila gvidilo havas rekomendojn pri kiel verki la |PyPUG|. Antaŭ ol vi ekverkas, bonvolu revizii ĝin. Sekvante la stilgvidilon, viaj kontribuoj pli koheros kaj iĝos pli akceptindaj en la projekton.
ja: このスタイルガイドは、あなたがどのように|PyPUG|を書くべきかについて推奨事項を与えます。あなたが書き始める前に目を通してください。スタイルガイドに従うことであなたの貢献がまとまりのある全体の中の一部として追加され、あなたの貢献がプロジェクトによって受け入れられやすくなります。
pt_br: Este guia de estilo contém recomendações de como você deve escrever o |PyPUG|. Antes de começar a escrever, revise-o. Seguindo o guia de estilo, suas contribuições ajudarão a formar um todo coeso e tornar mais fácil para que suas contribuições sejam aceitas no projeto.
ru: Это руководство по стилю имеет рекомендации о том, как вы должны писать |PyPUG|. Прежде чем начать писать, пожалуйста, просмотрите его. Следуя руководству по стилю, ваш вклад поможет добавить в единое целое и облегчит принятие вашего вклада в проект.
ta: இந்த பாணி வழிகாட்டியில் நீங்கள் | பைபக் | ஐ எவ்வாறு எழுத வேண்டும் என்பதற்கான பரிந்துரைகள் உள்ளன. நீங்கள் எழுதத் தொடங்குவதற்கு முன், அதை மதிப்பாய்வு செய்யவும். பாணி வழிகாட்டியைப் பின்பற்றுவதன் மூலம், உங்கள் பங்களிப்புகள் ஒரு ஒருங்கிணைந்த முழுமையைச் சேர்க்க உதவும் மற்றும் உங்கள் பங்களிப்புகளை திட்டத்தில் ஏற்றுக்கொள்வதை எளிதாக்கும்.

source: Purpose
eo: Celo
ja: 目的
pt_br: Propósito
ru: Цель
ta: நோக்கம்

source: The purpose of the |PyPUG| is to be the authoritative resource on how to package, publish, and install Python projects using current tools.
eo: La |PyPUG| celas esti la aŭtoritata dokumento pri kiel enpaki, eldoni kaj instali Python-projektojn per nunaj iloj.
ja: |PyPUG|の目的は、現在のツール群を用いてPythonプロジェクトをパッケージし、公開し、インストールする方法に関して権威ある参照先となることです。
pt_br: O objetivo do |PyPUG| é ser o recurso autorizado sobre como empacotar, publicar e instalar projetos Python usando as ferramentas atuais.
ru: Цель |PyPUG| - быть авторитетным ресурсом о том, как упаковать, опубликовать и установить Python проекты с использованием современных инструментов.
ta: | பைபக் | இன் நோக்கம் தற்போதைய கருவிகளைப் பயன்படுத்தி பைதான் திட்டங்களை எவ்வாறு தொகுத்தல், வெளியிடுவது மற்றும் நிறுவுவது என்பதற்கான அதிகாரப்பூர்வ ஆதாரமாக இருக்க வேண்டும்.

source: Scope
eo: Amplekso
ja: スコープ
pt_br: Escopo
ru: Область действия
ta: நோக்கம்

source: The guide is meant to answer questions and solve problems with accurate and focused recommendations.
eo: La gvidilo celas respondi al demandoj kaj solvi problemojn per precizaj kaj enfokusigitaj rekomendoj.
ja: この文書は、正確で的を射た推奨事項を添えた形で疑問に答え問題を解決することを意図しています。
pt_br: O guia destina-se a responder a perguntas e resolver problemas com recomendações precisas e focadas.
ru: Руководство предназначено для ответа на вопросы и решения проблем с помощью точных и целенаправленных рекомендаций.
ta: வழிகாட்டி என்பது கேள்விகளுக்கு பதிலளிப்பதற்கும் துல்லியமான மற்றும் கவனம் செலுத்தும் பரிந்துரைகளுடன் சிக்கல்களைத் தீர்ப்பதற்கும் ஆகும்.

source: The guide isn't meant to be comprehensive and it's not meant to replace individual projects' documentation. For example, pip has dozens of commands, options, and settings. The pip documentation describes each of them in detail, while this guide describes only the parts of pip that are needed to complete the specific tasks described in this guide.
eo: La gvidilo ne celas esti plenplena, nek anstataŭigi la dokumentaron de individuaj projektoj. Ekzemple, pip havas dekduojn da komandoj, opciojn, kaj agordoj. La dokumentaro de pip priskribas ĉiujn el tiuj detale, dum la gvidilo nur priskribas tiajn partojn de pip, kiaj necesas por kompletigi la specifajn taskojn priskribitajn en la gvidilo.
ja: この文書は網羅的であることを目指してはおらず、それぞれのプロジェクトのドキュメントを置き換えることも意図していません。例えば、pipにはたくさんのコマンドやオプションや設定事項があります。pipのドキュメントはその一つ一つについて詳細に記述していますが、この文書ではこの文書に記述されたタスクを完了するために必要となる部分に限ってpipに触れています。
pt_br: O guia não pretende ser abrangente e não pretende substituir a documentação de projetos individuais. Por exemplo, pip tem dezenas de comandos, opções e configurações. A documentação do pip descreve cada um deles em detalhes, enquanto este guia descreve apenas as partes do pip que são necessárias para concluir as tarefas específicas descritas neste guia.
ru: Руководство не должно быть всеобъемлющим, и оно не предназначено для замены документации отдельных проектов. Например, pip имеет десятки команд, опций и настроек. Документация pip описывает каждую из них в деталях, в то время как в этом руководстве описываются только те части pip, которые необходимы для выполнения конкретных задач, описанных в настоящем руководстве.
ta: வழிகாட்டி விரிவானதாக இருக்கக்கூடாது, மேலும் இது தனிப்பட்ட திட்டங்களின் ஆவணங்களை மாற்றுவதற்காக அல்ல. எடுத்துக்காட்டாக, பிஐபி டசன் கணக்கான கட்டளைகள், விருப்பங்கள் மற்றும் அமைப்புகளைக் கொண்டுள்ளது. பிஐபி ஆவணங்கள் அவை ஒவ்வொன்றையும் விரிவாக விவரிக்கிறது, அதே நேரத்தில் இந்த வழிகாட்டி இந்த வழிகாட்டியில் விவரிக்கப்பட்டுள்ள குறிப்பிட்ட பணிகளை முடிக்க தேவையான பிஐபி பகுதிகளை மட்டுமே விவரிக்கிறது.

source: Audience
eo: Legantaro
ja: 想定される読者
pt_br: Público-alvo
ru: Аудитория
ta: பார்வையாளர்கள்

source: The audience of this guide is anyone who uses Python with packages.
eo: La legantoj de ĉi tiu gvidilo estas iuj ajn, kiuj uzas Python kun pakoj.
ja: この文書の読者として想定されるのは、Pythonのパッケージを扱う方です。
pt_br: O público-alvo deste guia é qualquer pessoa que use Python com pacotes.
ru: Аудитория этого руководства - любой, кто использует Python с пакетами.
ta: இந்த வழிகாட்டியின் பார்வையாளர்கள் பைத்தானை தொகுப்புகளுடன் பயன்படுத்தும் எவரும்.

source: Don't forget that the Python community is big and welcoming. Readers may not share your age, gender, education, culture, and more, but they deserve to learn about packaging just as much as you do.
eo: Ne forgesu, ke la Python-komunumo estas granda kaj bonveniga. Legantoj ne povas havi la saman aĝon, sekson, edukon, kulturon ktp kiel vi, sed ili meritas lerni pakadon tiel, kiel vi.
ja: Pythonコミュニティが巨大で温かいコミュニティであることを忘れないでください。読者は年齢・性別・教育程度・文化やその他諸々の点であなたと同じではないかもしれませんが、しかし、あなたがあなたにできる限りパッケージングについて学ぶことを称賛します。
pt_br: Não se esqueça de que a comunidade Python é grande e acolhedora. Os leitores podem não compartilhar sua idade, sexo, educação, cultura e muito mais, mas eles merecem aprender sobre empacotamento tanto quanto você.
ru: Не забывайте, что сообщество Python является большим и приветственным. Читатели могут не делить свой возраст, пол, образование, культуру и многое другое, но они заслуживают того, чтобы узнать о упаковке так же, как и вы.
ta: பைதான் சமூகம் பெரியது மற்றும் வரவேற்கத்தக்கது என்பதை மறந்துவிடாதீர்கள். வாசகர்கள் உங்கள் அகவை, பாலினம், கல்வி, பண்பாடு மற்றும் பலவற்றைப் பகிர்ந்து கொள்ளக்கூடாது, ஆனால் அவர்கள் உங்களைப் போலவே பேக்கேசிங் பற்றி அறிய தகுதியுடையவர்கள்.

source: In particular, keep in mind that not all people who use Python see themselves as programmers. The audience of this guide includes astronomers or painters or students as well as professional software developers.
eo: Aparte notu, ke ne ĉiuj, kiuj uzas Python, rigardas sin kiel programistojn. La legandaro de ĉi tiu gvidilo inkluzivas astronomojn, pentristojn kaj lernantojn kune kun profesiaj programistoj.
ja: とりわけ、Pythonを使う人なら誰でも自分をプログラマーだと思っているというわけではないことを覚えておいてください。この文書の想定される読者には、ソフトウェア開発を職業としているプロだけでなく、宇宙飛行士や画家あるいは学生も含まれるのです。
pt_br: Em particular, tenha em mente que nem todas as pessoas que usam Python se consideram programadores. O público deste guia inclui astrônomos, pintores ou estudantes, bem como desenvolvedores de software profissionais.
ru: В частности, имейте в виду, что не все люди, которые используют Python, считают себя программистами. Аудитория этого руководства включает в себя астрономов или художников или студентов, а также профессиональных разработчиков программного обеспечения.
ta: குறிப்பாக, பைத்தானைப் பயன்படுத்தும் அனைவரும் தங்களை புரோகிராமர்களாகப் பார்க்கவில்லை என்பதை நினைவில் கொள்ளுங்கள். இந்த வழிகாட்டியின் பார்வையாளர்களில் வானியலாளர்கள் அல்லது ஓவியர்கள் அல்லது மாணவர்கள் மற்றும் தொழில்முறை மென்பொருள் உருவாக்குநர்கள் உள்ளனர்.

source: Voice and tone
eo: Voĉo kaj tono
ja: 口調や語調
pt_br: Voz e tom
ru: Голос и тон
ta: குரல் மற்றும் தொனி

source: When writing this guide, strive to write with a voice that's approachable and humble, even if you have all the answers.
eo: Dum verkado de tiu gvidilo, klopodu skribi kun voĉo amikeca kaj humila, eĉ se vi scias ĉion.
ja: この文書を書く時には、たとえあなたが答えを全部わかっていたとしても親しみやすく控えめな語調で書くように努力してください。
pt_br: Ao escrever este guia, esforce-se para escrever com uma voz que seja acessível e humilde, mesmo que você tenha todas as respostas.
ru: При написании этого руководства старайтесь писать голосом, который подходит и скромен, даже если у вас есть все ответы.
ta: இந்த வழிகாட்டியை எழுதும் போது, உங்களிடம் எல்லா பதில்களும் இருந்தாலும், அணுகக்கூடிய மற்றும் தாழ்மையான குரலுடன் எழுத முயற்சி செய்யுங்கள்.

source: Imagine you're working on a Python project with someone you know to be smart and skilled. You like working with them and they like working with you. That person has asked you a question and you know the answer. How do you respond? *That* is how you should write this guide.
eo: Imagu, ke vi laboras pri Python-projekto kun iu inteligenta kaj sperta. Vi ŝatas labori kun tiu, kaj tiu ŝatas labori kun vi. Tiu ulo demandis al vi, kaj vi scias la respondon. Kiel vi respondus? Jen *tiel* vi verku ĉi tiun gvidilon.
ja: 頭が良くてスキルのある人たちと一緒にPythonのプロジェクトをやるところを思い描いてください。あなたは彼らと働くのが好きだし、彼らもあなたと働くのが好きなのです。そんな人があなたに質問をして、あなたが答えを知っていたとしましょう。あなたはどんな風に応対しますか？*それ*こそが、あなたがこの文書を書く時のやり方なのです。
pt_br: Imagine que você está trabalhando em um projeto Python com alguém que sabe ser inteligente e habilidoso. Você gosta de trabalhar com eles e eles gostam de trabalhar com você. Essa pessoa fez uma pergunta e você sabe a resposta. Como você responde? *É assim* que você deve escrever este guia.
ru: Представьте, что вы работаете над проектом Python с кем-то, кого вы знаете, чтобы быть умным и квалифицированным. Вам нравится работать с ними, и им нравится работать с вами. Этот человек задал вам вопрос, и вы знаете ответ. Как ты реагируешь? * Вот как вы должны написать это руководство.
ta: அறிவாளி மற்றும் திறமையானவர் என்று உங்களுக்குத் தெரிந்த ஒருவருடன் நீங்கள் ஒரு பைதான் திட்டத்தில் பணிபுரிகிறீர்கள் என்று கற்பனை செய்து பாருங்கள். நீங்கள் அவர்களுடன் பணியாற்ற விரும்புகிறீர்கள், அவர்கள் உங்களுடன் பணியாற்ற விரும்புகிறார்கள். அந்த நபர் உங்களிடம் ஒரு கேள்வியைக் கேட்டிருக்கிறார், உங்களுக்கு பதில் தெரியும். நீங்கள் எவ்வாறு பதிலளிப்பீர்கள்? * அதுதான்* இந்த வழிகாட்டியை நீங்கள் எவ்வாறு எழுத வேண்டும்.

source: Here's a quick check: try reading aloud to get a sense for your writing's voice and tone. Does it sound like something you would say or does it sound like you're acting out a part or giving a speech? Feel free to use contractions and don't worry about sticking to fussy grammar rules. You are hereby granted permission to end a sentence in a preposition, if that's what you want to end it with.
eo: Jen rapida kontrolo: provu laŭtlegi por senti la voĉon kaj tonon de via verkaĵo. Ĉu ĝi similas ion, kion vi dirus, aŭ similas aktoraĵon aŭ prelegon? Se tio plaĉas al vi, uzu malformalan lingvaĵon kaj ignoru trostriktajn gramatikajn regulojn.
ja: 簡単な確認方法：あなたが書いたものを声に出して読めば、その口調や語調の感じがわかります。それはあなたが言いたかった感じに響きましたか、それとも、演説の一部みたいに聞こえましたか？短縮形を使っても構いませんし、曖昧な文法規則に固執することはありません。あなたはここに、もしそうしたいのならば前置詞で文を終わっても構わないと言う権限を与えられました。
pt_br: Aqui está uma verificação rápida: tente ler em voz alta para ter uma noção da voz e do tom de sua escrita. Parece algo que você diria ou parece que você está encenando um papel ou fazendo um discurso? Sinta-se à vontade para usar contrações e não se preocupe em seguir regras gramaticais complicadas. Você tem permissão para encerrar uma frase em uma preposição, se for assim que deseja encerrá-la.
ru: Вот быстрая проверка: попробуйте читать вслух, чтобы понять голос и тон вашего письма. Это звучит как что-то, что вы скажете или звучит так, будто вы играете роль или произносите речь? Почувствуйте себя свободно в использовании схваток и не волнуйтесь о том, чтобы придерживаться безумных правил грамматики. Настоящим вам предоставляется разрешение на завершение предложения в предположении, если это то, с чем вы хотите покончить.
ta: இங்கே விரைவான சோதனை: உங்கள் எழுத்தின் குரல் மற்றும் தொனியைப் புரிந்துகொள்ள சத்தமாக படிக்க முயற்சிக்கவும். இது நீங்கள் சொல்வதைப் போலத் தோன்றுகிறதா அல்லது நீங்கள் ஒரு பகுதியை செயல்படுத்துவது அல்லது ஒரு உரையை வழங்குவது போல் தெரிகிறது? சுருக்கங்களைப் பயன்படுத்த தயங்காதீர்கள், மேலும் கடுமையான இலக்கண விதிகளில் ஒட்டிக்கொள்வதைப் பற்றி கவலைப்பட வேண்டாம். ஒரு வாக்கியத்தை ஒரு முன்மொழிவில் முடிக்க உங்களுக்கு இதன்மூலம் இசைவு வழங்கப்படுகிறது, அதுதான் நீங்கள் அதை முடிக்க விரும்பினால்.

source: When writing the guide, adjust your tone for the seriousness and difficulty of the topic. If you're writing an introductory tutorial, it's OK to make a joke, but if you're covering a sensitive security recommendation, you might want to avoid jokes altogether.
eo: Dum verkado de la gvidilo, adaptu vian tonon por la graveco kaj malfacileco de la temo. Se vi verkas enkondukan lernilon, estas bone ŝerci, sed se vi diskutas gravan rekomendon pri sekureco, vi eble volas eviti ŝercojn entute.
ja: ガイド文書を書くときは、論題の深刻さや難しさに合った語調に調整してください。もしあなたが入門篇のようなチュートリアルを書くときには冗談を挟んでも構いませんが、繊細な注意を必要とするセキュリティ上の推奨事項をカバーするなら冗談を全く入れないようにしたいと思うかもしれません。
pt_br: Ao escrever o guia, ajuste seu tom de acordo com a seriedade e a dificuldade do tópico. Se você estiver escrevendo um tutorial introdutório, não há problema em fazer uma piada, mas se estiver cobrindo uma recomendação de segurança sensível, convém evitar piadas completamente.
ru: При написании руководства корректируйте свой тон на серьезность и сложность темы. Если вы пишете вводный учебник, это нормально, чтобы шутить, но если вы покрываете чувствительные рекомендации по безопасности, вы можете избежать шуток в целом.
ta: வழிகாட்டியை எழுதும் போது, தலைப்பின் தீவிரத்தன்மைக்கும் சிரமத்திற்கும் உங்கள் தொனியை சரிசெய்யவும். நீங்கள் ஒரு அறிமுக டுடோரியலை எழுதுகிறீர்கள் என்றால், ஒரு நகைச்சுவையை உருவாக்குவது சரி, ஆனால் நீங்கள் ஒரு முக்கியமான பாதுகாப்பு பரிந்துரையை உள்ளடக்கியிருந்தால், நீங்கள் நகைச்சுவைகளை முழுவதுமாக தவிர்க்க விரும்பலாம்.

source: Conventions and mechanics
eo: Konvencioj kaj meĥaniko
ja: 慣例と手順
pt_br: Convenções e mecânicas
ru: Соглашения и механики
ta: மாநாடுகள் மற்றும் இயக்கவியல்

source: **Write to the reader**
eo: **Verku por la leganto**
ja: **読者に向けて書く**
pt_br: **Escreva para o leitor**
ru: **Пишите читателю**
ta: ** வாசகருக்கு எழுதுங்கள் **

source: When giving recommendations or steps to take, address the reader as *you* or use the imperative mood.
eo: Kiam vi donas rekomendojn aŭ farendaĵojn, alparolu la leganton kiel «vi», aŭ uzu la imperativon.
ja: 推奨事項や実行すべきステップを与えるときは、読者に*あなた*と呼びかけるか、または、命令法を用いて欲しい。
pt_br: Ao dar recomendações ou etapas a serem seguidas, dirija-se ao leitor como *você* ou use o humor imperativo.
ru: Давая рекомендации или расписывая шаги, обращайтесь к читателю на *вы* или используйте повелительное наклонение.
ta: எடுக்க வேண்டிய பரிந்துரைகள் அல்லது படிகளை வழங்கும்போது, வாசகரை * நீங்கள் * என உரையாற்றவும் அல்லது கட்டாய மனநிலையைப் பயன்படுத்தவும்.

source: Wrong: To install it, the user runs…
eo: Netaŭga: Por instali ĝin, la uzanto rulas…
ja: 誤：それをインストールするために、ユーザは...を実行します。
pt_br: Errado: Para instalá-lo, o usuário executa…
ru: Неправильно: Чтобы установить его, пользователь запускает…
ta: தவறு: அதை நிறுவ, பயனர் இயங்குகிறார்…

source: Right: You can install it by running…
eo: Taŭga: Vi povas instali ĝin per rulado de…
ja: 正：...を実行することであなたはそれをインストールすることができます。
pt_br: Certo: Você pode instalá-lo executando…
ru: Правильно: Вы можете установить его, запустив…
ta: வலது: இயங்குவதன் மூலம் அதை நிறுவலாம்…

source: Right: To install it, run…
eo: Taŭga: Por instali ĝin, rulu…
ja: 正：それをインストールするには、...を実行してください。
pt_br: Certo: Para instalá-lo, execute…
ru: Правильно: Чтобы установить его, запустите…
ta: வலது: அதை நிறுவ, இயக்க…

source: **State assumptions**
eo: **Klarigu supozojn**
ja: **前提条件の明示**
pt_br: **Presuma**
ru: **Государственные предположения**
ta: ** மாநில அனுமானங்கள் **

source: Avoid making unstated assumptions. Reading on the web means that any page of the guide may be the first page of the guide that the reader ever sees. If you're going to make assumptions, then say what assumptions that you're going to make.
eo: Evitu nedeklaritajn supozojn. Je Interreta legado, iu ajn paĝo de la gvidilo povas esti la unua paĝo vidata de leganto. Se vi supozas ion, do klarigu tiujn supozojn.
ja: 暗黙のうちに前提条件を仮定することのないようにしましょう。Webページとして提供するということは、この文書のどのページであってもそれが読者にとっての初めてのページになるかもしれないということです。
pt_br: Evite fazer suposições não declaradas. Ler na web significa que qualquer página do guia pode ser a primeira página do guia que o leitor vê. Se você vai fazer suposições, diga quais suposições você vai fazer.
ru: Избегайте делать негласные предположения. Чтение в Интернете означает, что любая страница руководства может быть первой страницей руководства, которое читатель когда-либо видел. Если вы собираетесь делать предположения, то скажите, какие предположения вы собираетесь делать.
ta: நிலையற்ற அனுமானங்களைச் செய்வதைத் தவிர்க்கவும். வலையில் படிப்பது என்பது வழிகாட்டியின் எந்தப் பக்கமும் வாசகர் பார்க்கும் வழிகாட்டியின் முதல் பக்கமாக இருக்கலாம். நீங்கள் அனுமானங்களைச் செய்யப் போகிறீர்கள் என்றால், நீங்கள் என்ன செய்யப் போகிறீர்கள் என்று சொல்லுங்கள்.

source: **Cross-reference generously**
eo: **Interreferencu ofte**
ja: **豊富な相互参照**
pt_br: **Faça uso generoso de referência cruzada**
ru: **Кросс-ссылки щедро**
ta: ** குறுக்கு-குறிப்பு தாராளமாக **

source: The first time you mention a tool or practice, link to the part of the guide that covers it, or link to a relevant document elsewhere. Save the reader a search.
eo: La unuan fojon vi mencias ilon aŭ praktikon, ligu al la parto de la gvidilo pri ĝi aŭ al signifa dokumento aliloka. Ne serĉigu la leganton.
ja: あるツールや行為にあなたが初めて言及するときには、ガイドのそれを説明している部分へのリンク、または、どこか他の場所であっても適切な説明文書へのリンクも提供してください。
pt_br: Na primeira vez que você mencionar uma ferramenta ou prática, coloque um link para a parte do guia que a cobre ou para um documento relevante em outro lugar. Economize uma pesquisa ao leitor.
ru: В первый раз, когда вы упоминаете инструмент или практику, обратитесь к той части руководства, которая его охватывает, или обратитесь к соответствующему документу в другом месте. Сохраните читателю поиск.
ta: முதல் முறையாக நீங்கள் ஒரு கருவி அல்லது பயிற்சியைக் குறிப்பிடும்போது, அதை உள்ளடக்கிய வழிகாட்டியின் ஒரு பகுதியுடன் இணைக்கவும் அல்லது வேறு இடங்களில் தொடர்புடைய ஆவணத்துடன் இணைக்கவும். வாசகரை ஒரு தேடலைச் சேமிக்கவும்.

source: **Respect naming practices**
eo: **Respektu nomojn**
ja: **命名慣習を尊重すること**
pt_br: **Respeite as práticas de nomenclatura**
ru: **Следуйте правилам именования**
ta: ** பெயரிடும் நடைமுறைகளை மதிக்கவும் **

source: When naming tools, sites, people, and other proper nouns, use their preferred capitalization.
eo: Kiam vi nomas ilojn, retejojn, homojn kaj aliajn proprajn nomojn, uzu iliajn preferatajn usklojn.
ja: ツールやサイト、登場人物や他の適切な名詞に名前を付けるときには、大文字小文字などそれぞれが好んで使っている書き方を尊重してください。
pt_br: Ao nomear ferramentas, sites, pessoas e outros nomes próprios, use a capitalização de sua preferência.
ru: При указании названий инструментов, сайтов, имён людей и других собственных существительных используйте их предпочтительную капитализацию.
ta: கருவிகள், தளங்கள், நபர்கள் மற்றும் பிற சரியான பெயர்ச்சொற்களுக்கு பெயரிடும் போது, தங்களுக்கு விருப்பமான மூலதனத்தைப் பயன்படுத்துங்கள்.

source: Wrong: Pip uses…
eo: Netaŭga: Pip uzas…
ja: 誤：Pipは…
pt_br: Errado: Pip usa…
ru: Неправильно: Pip использует…
ta: தவறு: பிஐபி பயன்படுத்துகிறது…

source: Right: pip uses…
eo: Taŭga: pip uzas…
ja: 正：pipは…
pt_br: Certo: pip usa…
ru: Правильно: pip использует…
ta: வலது: பிஐபி பயன்படுத்துகிறது…

source: Wrong: …hosted on github.
eo: Netaŭga: …gastigata ĉe github.
ja: 誤：...はgithubにホストされている。
pt_br: Errado: …hospedado no github.
ru: Неправильно: …размещён на github.
ta: தவறு:… கிட்அப்பில் புரவலன் செய்யப்பட்டது.

source: Right: …hosted on GitHub.
eo: Taŭga: …gastigata ĉe GitHub.
ja: 正：...はGitHubにホストされている。
pt_br: Certo: …hospedado no GitHub.
ru: Правильно: …размещён на GitHub.
ta: வலது:… கிட்அப்பில் புரவலன் செய்யப்பட்டது.

source: **Use a gender-neutral style**
eo: **Uzu seksneŭtralan stilon**
ja: **ジェンダー中立なスタイルを使う**
pt_br: **Use um estilo de gênero neutro**
ru: **Используйте гендерно-нейтральный стиль**
ta: ** பாலின-நடுநிலை பாணியைப் பயன்படுத்தவும் **

source: Often, you'll address the reader directly with *you*, *your* and *yours*. Otherwise, use gender-neutral pronouns *they*, *their*, and *theirs* or avoid pronouns entirely.
eo: Ofte vi rekte alparolu la leganton per *vi*, *vin* aŭ *via*. Alie, uzu seksneŭtralajn pronomojn *ili*, *ŝ/li* aŭ entute evitu pronomojn.
ja: あなたが読者に直接呼びかけるときは「あなた」「あなたの」「あなたのもの」を使ってください。そうできない場合は代名詞として「彼ら」「彼らの」「彼らのもの」を使う(訳註：従来なら"he", "she"を用いた場所に"they"を使うことでジェンダーへの配慮を示す場合がある)か、または、代名詞をまったく使わないようにしましょう。
pt_br: Frequentemente, você se dirigirá ao leitor diretamente com *you*, *your* e *yours*. Caso contrário, use pronomes de gênero neutro *they*, *their* e *theirs* ou evite os pronomes completamente.
ru: Часто вы будете обращаться к читателю напрямую с *ты*, *ваш* и *ваш*. В противном случае используйте гендерно-нейтральные местоимения *они *, * их * и * их * или полностью избегайте местоимений.
ta: பெரும்பாலும், நீங்கள் *நீங்கள் *, *உங்கள் *மற்றும் *உங்களுடைய *உடன் நேரடியாக வாசகரை உரையாற்றுவீர்கள். இல்லையெனில், பாலின-நடுநிலை பிரதிபெயர்களைப் பயன்படுத்துங்கள் *அவை *, *அவற்றின் *, மற்றும் *அவர்களுடைய *அல்லது பிரதிபெயர்களை முழுவதுமாக தவிர்க்கவும்.

source: Wrong: A maintainer uploads the file. Then he…
eo: Malĝuste: Mastrumanto alŝutas la dosieron. Poste li…
ja: 誤：メンテナンス担当者がファイルをアップロードする。それから、彼は…
pt_br: Errado: A maintainer uploads the file. Then he…
ru: Неправильно: Сопровождающий загружает файл. Затем он…
ta: தவறு: ஒரு பராமரிப்பாளர் கோப்பை பதிவேற்றுகிறார். பின்னர் அவர்…

source: Right: A maintainer uploads the file. Then they…
eo: Ĝuste: Mastrumanto alŝutas la dosieron. Poste ŝ/li…
ja: 正：メンテナンス担当者がファイルをアップロードする。それから、彼らは…
pt_br: Certo: A maintainer uploads the file. Then they…
ru: Правильно: Сопровождающий загружает файл. Затем они…
ta: வலது: ஒரு பராமரிப்பாளர் கோப்பை பதிவேற்றுகிறார். பின்னர் அவர்கள்…
