Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: As with other translated version identifiers, the corresponding Olson database version could be recorded in the project metadata.
eo: Samkiel aliaj tradukitaj versiaj identigiloj, la respondanta versio de la Olson-datenbanko povas esti registrita en la projektaj metadatenoj.
ja: 他の翻訳されたバージョン識別子と同様に、対応する Olson データベースのバージョン番号は、そのプロジェクトのメタデータに記録しておくことが可能です。
ru: Как и в случае с другими идентификаторами переведенных версий, соответствующая версия базы данных Olson может быть записана в метаданных проекта.
ta: பிற மொழிபெயர்க்கப்பட்ட பதிப்பு அடையாளங்காட்டிகளைப் போலவே, தொடர்புடைய ஓல்சன் தரவுத்தள பதிப்பையும் திட்ட மெட்டாடேட்டாவில் பதிவு செய்யலாம்.

source: A version specifier consists of a series of version clauses, separated by commas. For example::
eo: Versi-specifilo konsistas el serio de versio-kondiĉoj apartigitaj per komoj. Ekzemple::
ja: バージョン指定子は、一連のバージョン番号節をコンマで区切ったものから構成されます。例えば::
ru: Спецификатор версии состоит из ряда пунктов версии, разделенных запятыми. Например::
ta: ஒரு பதிப்பு விவரக்குறிப்பு தொடர்ச்சியான பதிப்பு உட்பிரிவுகளைக் கொண்டுள்ளது, இது காற்புள்ளிகளால் பிரிக்கப்பட்டுள்ளது. உதாரணமாக ::

source: The comparison operator determines the kind of version clause:
eo: La kompara operatoro determinas la specon de versia kondiĉo:
ja: 比較演算子がバージョン番号節の種類を決定します:
ru: Оператор сравнения определяет тип положения версии:
ta: ஒப்பீட்டு ஆபரேட்டர் பதிப்பு விதிமுறையை தீர்மானிக்கிறது:

source: ``~=``: `Compatible release`_ clause
eo: ``~=``: Kondiĉo `Kongrua eldono <Compatible release>`_
ja: ``~=``: `互換性のあるリリース <Compatible release>`_ 節
ru: ``~=``: `Совместимый релиз`_ пункт
ta: `` ~ = ``: `இணக்கமான வெளியீடு`_ பிரிவு

source: ``==``: `Version matching`_ clause
eo: ``==``: Kondiĉo `Versia egaleco <Version matching>`_
ja: ``==``: `バージョン番号のマッチング <Version matching>`_ 節
ru: ``==``: `Версия соответствует`_ пункту
ta: `` == ``: `பதிப்பு பொருந்தும்`_ பிரிவு

source: ``!=``: `Version exclusion`_ clause
eo: ``!=``: Kondiĉo `Ekskluzivo de versio <Version exclusion>`_
ja: ``!=``: `バージョンの除外 <Version exclusion>`_ 節
ru: ``!=``: `исключение версии`_ пункт
ta: ``! = ``: `பதிப்பு விலக்கு`_ பிரிவு

source: ``<=``, ``>=``: `Inclusive ordered comparison`_ clause
eo: ``<=``, ``>=``: Kondiĉo `Inkluziva orda komparo <Inclusive ordered comparison>`_
ja: ``<=``, ``>=``: `境界を含む順序比較 <Inclusive ordered comparison>`_ 節
ru: ``<=``, ``>=``: предложение ``включенного упорядоченного сравнения`_
ta: `` <= ``, ``> = ``: `உள்ளடக்கிய உத்தரவிடப்பட்ட ஒப்பீடு`_ பிரிவு

source: ``<``, ``>``: `Exclusive ordered comparison`_ clause
eo: ``<``, ``>``: Kondiĉo `Ekskluziva orda komparo <Exclusive ordered comparison>`_
ja: ``<``, ``>``: `境界を含まない順序比較 <Exclusive ordered comparison>`_ 節
ru: ``<``, ``>``: предложение ``исключительного упорядоченного сравнения``
ta: `` <``, ``> ``: `பிரத்யேக உத்தரவிடப்பட்ட ஒப்பீடு`_ பிரிவு

source: ``===``: `Arbitrary equality`_ clause.
eo: ``===``: Kondiĉo `Arbitra egaleco <Arbitrary equality>`_.
ja: ``===``: `あらゆる意味での同一性 <Arbitrary equality>`_ clause.
ru: ``===``: предложение `произвольного равенства`.
ta: `` === ``: `தன்னிச்சையான சமத்துவம்`_ பிரிவு.

source: The comma (",") is equivalent to a logical **and** operator: a candidate version must match all given version clauses in order to match the specifier as a whole.
eo: La komo («,») ekvivalentas al logika **kaj**-operatoro: kandidata versio devas kongrui kun ĉiuj donitaj versio-kondiĉoj por kongrui kun la tuta specifilo.
ja: コンマ (",") は、論理 **積** 演算子と同一のものです: 候補バージョン番号は、全体として指定子に合致するために、すべての与えられた節が合致しなければなりません。
ru: Запятая (",") эквивалентна логическому оператору **и**: версия-кандидат должна соответствовать всем заданным пунктам версии, чтобы соответствовать спецификатору в целом.
ta: கமா (",") ஒரு தர்க்கரீதியான ** மற்றும் ** ஆபரேட்டருக்கு சமம்: ஒரு வேட்பாளர் பதிப்பு கொடுக்கப்பட்ட அனைத்து பதிப்பு உட்பிரிவுகளையும் பொருத்த வேண்டும்.

source: Whitespace between a conditional operator and the following version identifier is optional, as is the whitespace around the commas.
eo: Blanka spaco inter kondiĉa operatoro kaj la sekva versia identigilo estas nedeviga; same pri la blanka spaco ĉirkaŭ komo.
ja: 条件演算子とその後のバージョン識別子の間の空白文字は、コンマの周囲の空白文字と同様にオプションです。
ru: Пробелы между условным оператором и следующим идентификатором версии необязательны, как и пробелы вокруг запятых.
ta: ஒரு நிபந்தனை ஆபரேட்டருக்கும் பின்வரும் பதிப்பு அடையாளங்காட்டிக்கும் இடையிலான இடைவெளி விருப்பமானது, காற்புள்ளிகளைச் சுற்றியுள்ள இடைவெளி.

source: When multiple candidate versions match a version specifier, the preferred version SHOULD be the latest version as determined by the consistent ordering defined by the standard `Version scheme`_. Whether or not pre-releases are considered as candidate versions SHOULD be handled as described in `Handling of pre-releases`_.
ja: 複数の候補バージョンがバージョン識別子に合致する時には、好ましいバージョンは、標準の `バージョン番号枠組み <Version scheme>`_ で定義された首尾一貫する順序付けによって決定される最新のバージョンです。プレリリースが候補バージョンだと見做されるか否かは、 `プレリリースの取り扱い <Handling of pre-releases>`_ に記述されているとおりに扱われるべきです。
ru: Когда несколько версий-кандидатов соответствуют спецификатору версии, предпочтительной версией ДОЛЖНА быть последняя версия, как определено последовательным упорядочиванием, определенным стандартной `Схемой версий`_. Вопрос о том, рассматриваются ли предварительные выпуски в качестве версий-кандидатов, ДОЛЖЕН решаться в соответствии с описанием в `Обработке предварительных выпусков`_.
ta: பல வேட்பாளர் பதிப்புகள் ஒரு பதிப்பு விவரக்குறிப்புடன் பொருந்தும்போது, விருப்பமான பதிப்பு நிலையான `பதிப்பு திட்டம்`_ ஆல் வரையறுக்கப்பட்ட நிலையான வரிசைப்படுத்தலால் நிர்ணயிக்கப்பட்ட அண்மைக் கால பதிப்பாக இருக்க வேண்டும். முன் வெளியீடுகள் வேட்பாளர் பதிப்புகளாக கருதப்படுகிறதா இல்லையா என்பது `முன் வெளியீடுகளை கையாளுதல்`_ இல் விவரிக்கப்பட்டுள்ளபடி கையாளப்பட வேண்டும்.

source: Except where specifically noted below, local version identifiers MUST NOT be permitted in version specifiers, and local version labels MUST be ignored entirely when checking if candidate versions match a given version specifier.
eo: Krom la specife notitaj esceptoj ĉi-subaj, loka versia identigilo DEVAS NE esti uzata en versio-specifilo, kaj oni DEVAS plene ignori lokan versian etikedon dum kontrolado ĉu kandidata versio kongruas kun iu versio-specifilo.
ja: 以下で特に注記される場合を除いて、バージョン指定子内ではローカルバージョン指定子は許されてはならず、あるバージョン指定子に合致する候補バージョンかどうかを調べる際にはローカルバージョンラベルは完全に無視されなければなりません。
ru: За исключением случаев, оговоренных ниже, локальные идентификаторы версий НЕ ДОЛЖНЫ быть разрешены в спецификаторах версий, а локальные метки версий ДОЛЖНЫ полностью игнорироваться при проверке соответствия версий-кандидатов заданному спецификатору версий.
ta: கீழே குறிப்பாக குறிப்பிடப்பட்ட இடத்தைத் தவிர, உள்ளக பதிப்பு அடையாளங்காட்டிகள் பதிப்பு குறிப்பான்களில் அனுமதிக்கப்படக்கூடாது, மேலும் வேட்பாளர் பதிப்புகள் கொடுக்கப்பட்ட பதிப்பு விவரக்குறிப்புடன் பொருந்துமா என்பதைச் சரிபார்க்கும்போது உள்ளக பதிப்பு லேபிள்கள் முற்றிலும் புறக்கணிக்கப்பட வேண்டும்.

source: Compatible release
eo: Kongrua eldono
ja: 互換性のあるリリース <Compatible release>
pt_br: Versão compatível
ru: Совместимый выпуск
ta: இணக்கமான வெளியீடு

source: A compatible release clause consists of the compatible release operator ``~=`` and a version identifier. It matches any candidate version that is expected to be compatible with the specified version.
eo: Kondiĉo de kongrua eldono konsistas el la operatoro de kongrua eldono ``~=`` kaj versio-identigilo. Ĝi kongruas kun kandidata versio atendate kongrua kun la specifita versio.
ja: 互換性のあるリリース節は、互換リリース演算子 ``~=`` とバージョン識別子から構成されます。指定されたバージョンと互換性があるものと期待されるすべての候補バージョンに合致します。
ru: Условие совместимого выпуска состоит из оператора совместимого выпуска ``~=`` и идентификатора версии. Он соответствует любой версии-кандидату, которая, как ожидается, будет совместима с указанной версией.
ta: இணக்கமான வெளியீட்டு பிரிவு இணக்கமான வெளியீட்டு ஆபரேட்டர் `` ~ = `` மற்றும் பதிப்பு அடையாளங்காட்டியைக் கொண்டுள்ளது. குறிப்பிட்ட பதிப்போடு இணக்கமாக இருக்கும் என்று எதிர்பார்க்கப்படும் எந்த வேட்பாளர் பதிப்பையும் இது பொருந்துகிறது.

source: The specified version identifier must be in the standard format described in `Version scheme`_. Local version identifiers are NOT permitted in this version specifier.
eo: La specifita versio-identigilo devas esti en la norma formo laŭ `Versia skemo <Version scheme>`_. Loka versio-identigilo estas MALPERMESATA en ĉi tiu versio-specifilo.
ja: 指定されたバージョン識別子は、 `バージョン番号枠組み <Version scheme`_ に記述された標準フォーマットの範疇に収まっていなければなりません。ローカルバージョン識別子は、このバージョン識別子の中では許容されません。
ru: Указанный идентификатор версии должен быть в стандартном формате, описанном в `Схема версии`_. Локальные идентификаторы версий в этом спецификаторе версий НЕ допускаются.
ta: குறிப்பிட்ட பதிப்பு அடையாளங்காட்டி `பதிப்பு திட்டம்`_ இல் விவரிக்கப்பட்டுள்ள நிலையான வடிவத்தில் இருக்க வேண்டும். இந்த பதிப்பு விவரக்குறிப்பில் உள்ளக பதிப்பு அடையாளங்காட்டிகள் அனுமதிக்கப்படவில்லை.

source: For a given release identifier ``V.N``, the compatible release clause is approximately equivalent to the pair of comparison clauses::
eo: Por iu eldono-specifilo ``V.N``, la kondiĉo pri kongrua eldono estas proksimume ekvivalenta al la jena paro de kondiĉoj::
ja: あるリリース識別子 ``V.N`` にとって、互換リリース節は、一組の比較節とほぼ同一のものです::
ru: Для данного идентификатора выпуска ``V.N`` совместимое положение о выпуске приблизительно эквивалентно паре положений сравнения::
ta: கொடுக்கப்பட்ட வெளியீட்டு அடையாளங்காட்டிக்கு `` v.n`` க்கு, இணக்கமான வெளியீட்டு விதிமுறை ஒப்பீட்டு உட்பிரிவுகளின் சோடியுக்கு சமமானதாகும் ::

source: This operator MUST NOT be used with a single segment version number such as ``~=1``.
eo: Oni DEVAS NE uzi ĉi tiun operatoron kun unusegmenta versia numero kiel ``~=1``.
ja: この演算子は、 ``~=1`` のように単独の構成部分バージョン番号と一緒に用いてはなりません。
ru: Этот оператор НЕ ДОЛЖЕН использоваться с номером версии одного сегмента, таким как ``~=1``.
ta: இந்த ஆபரேட்டர் `` ~ = 1`` போன்ற ஒற்றை பிரிவு பதிப்பு எண்ணுடன் பயன்படுத்தப்படக்கூடாது.

source: For example, the following groups of version clauses are equivalent::
eo: Ekzemple, la jenaj grupoj de versio-kondiĉoj estas ekvivalentaj::
ja: 例えば、次に挙げるバージョン番号群はすべて同等ということになります::
ru: Например, следующие группы положений о версии эквивалентны::
ta: எடுத்துக்காட்டாக, பதிப்பு உட்பிரிவுகளின் பின்வரும் குழுக்கள் சமமானவை ::

source: If a pre-release, post-release or developmental release is named in a compatible release clause as ``V.N.suffix``, then the suffix is ignored when determining the required prefix match::
eo: Se antaŭeldono, posteldono aŭ evoluada eldono estas nomita en kondiĉo de kongrua eldono kiel ``V.N.sufikso``, do la sufikso estas ignorita dum determinado de la postulata prefiksa kongrueco::
ja: プレリリース、ポストリリース、または開発リリースが ``V.N.suffix`` のような互換性のあるリリース節の形の名前を付けられているなら、要求される接頭辞と合致するかどうかを決める時には接尾辞が無視されます::
ru: Если предрелиз, пострелиз или релиз разработки назван в положении о совместимом релизе как ``V.N.suffix``, то суффикс игнорируется при определении требуемого соответствия префикса::
ta: ஒரு முன் வெளியீடு, வெளியீடு அல்லது மேம்பாட்டு வெளியீடு ஒரு இணக்கமான வெளியீட்டு பிரிவில் `` v.n.suffix`` என பெயரிடப்பட்டால், தேவையான முன்னொட்டு பொருத்தத்தை தீர்மானிக்கும்போது பின்னொட்டு புறக்கணிக்கப்படுகிறது ::

source: The padding rules for release segment comparisons means that the assumed degree of forward compatibility in a compatible release clause can be controlled by appending additional zeros to the version specifier::
eo: La reguloj pri metado de nuloj por komparado de eldono-segmento signifas, ke la supozata grado de kongrueco en kondiĉo pri kongruaj eldonoj estas modifebla per nuloj ĉe la komenco de la versio-specifilo::
ja: リリース番号構成部分の比較に対するパディングの規則とは、互換性のあるリリース節での前方互換性に想定された度合いを、バージョン識別子の後ろにゼロを追加して制御することが可能です::
ru: Правила вставки для сравнения сегментов выпуска означают, что предполагаемая степень прямой совместимости в положении о совместимом выпуске может контролироваться путем добавления дополнительных нулей к спецификатору версии::
ta: வெளியீட்டு பிரிவு ஒப்பீடுகளுக்கான திணிப்பு விதிகள் என்பது இணக்கமான வெளியீட்டு பிரிவில் முன்னோக்கி பொருந்தக்கூடிய அளவைக் கருதுவதன் மூலம் கூடுதல் பூச்சியங்களை பதிப்பில் சேர்ப்பதன் மூலம் கட்டுப்படுத்த முடியும் ::

source: Version matching
eo: Versia egaleco
ja: バージョン番号の照合
ru: Соответствие версий
ta: பதிப்பு பொருந்தும்

source: A version matching clause includes the version matching operator ``==`` and a version identifier.
eo: Versio-egaleca kondiĉo inkluzivas la versio-egalecan operatoron ``==`` kaj versian identigilon.
ja: バージョン番号マッチング節には、バージョン番号マッチング演算子 ``==`` とバージョン識別子を含みます。
ru: Условие сопоставления версий включает оператор сопоставления версий ``==`` и идентификатор версии.
ta: ஒரு பதிப்பு பொருந்தும் பிரிவில் பதிப்பு பொருந்தும் ஆபரேட்டர் `` == `` மற்றும் பதிப்பு அடையாளங்காட்டி ஆகியவை அடங்கும்.

source: The specified version identifier must be in the standard format described in `Version scheme`_, but a trailing ``.*`` is permitted on public version identifiers as described below.
eo: La specifita versio-identigilo devas observi la norman formon priskribitan en `Versia skemo <Version scheme>`_, sed sufiksa ``.*`` estas permesata post publika versio-identigilo jene.
ja: 指定されたバージョン識別子は、 `バージョン番号枠組み`_ に記述された標準フォーマットでなければなりませんが、公開のバージョン識別子における後続する ``.*`` は以下に述べるように許されています。
ru: Указанный идентификатор версии должен быть в стандартном формате, описанном в `Version scheme`_, но в идентификаторах публичных версий допускается наличие конца ``.*``, как описано ниже.
ta: குறிப்பிட்ட பதிப்பு அடையாளங்காட்டி `பதிப்பு திட்டம்`_ இல் விவரிக்கப்பட்டுள்ள நிலையான வடிவத்தில் இருக்க வேண்டும், ஆனால் கீழே விவரிக்கப்பட்டுள்ளபடி பொது பதிப்பு அடையாளங்காட்டிகளில்` `.

source: By default, the version matching operator is based on a strict equality comparison: the specified version must be exactly the same as the requested version. The *only* substitution performed is the zero padding of the release segment to ensure the release segments are compared with the same length.
ja: デフォルトでは、バージョン番号マッチング演算子は、厳密な同一性の比較です: 指定されたバージョンは、要求されたバージョンと正確に同一でなければなりません。 *唯一の* 置換が行われるのは、リリース番号構成部分を同じ長さで行うことを保証するために、リリース番号構成部分にゼロをパディングする時だけです。
ru: По умолчанию оператор сопоставления версий основан на строгом сравнении равенства: указанная версия должна быть точно такой же, как и запрашиваемая. Единственная выполняемая замена - это нулевое заполнение сегмента выпуска, чтобы гарантировать, что сегменты выпуска сравниваются с одинаковой длиной.
ta: இயல்பாக, பதிப்பு பொருந்தும் ஆபரேட்டர் கடுமையான சமத்துவ ஒப்பீட்டை அடிப்படையாகக் கொண்டது: குறிப்பிட்ட பதிப்பு கோரப்பட்ட பதிப்பைப் போலவே இருக்க வேண்டும். வெளியீட்டுப் பிரிவுகள் ஒரே நீளத்துடன் ஒப்பிடப்படுவதை உறுதிசெய்ய வெளியீட்டு பிரிவின் சுழிய திணிப்பு * மட்டுமே செய்யப்படுகிறது.

source: Whether or not strict version matching is appropriate depends on the specific use case for the version specifier. Automated tools SHOULD at least issue warnings and MAY reject them entirely when strict version matches are used inappropriately.
eo: Ĉu aŭ ne strikta versio-egaleco taŭgas, dependas de la specifa uzkazo de la versio-specifilo. Aŭtomata ilo almenaŭ AVERTU pri maltaŭga strikta versio-egaleco kaj POVAS malakcepti ĝin.
ja: 厳密なバージョンマッチングが適切であるか否かは、バージョン指定子のユースケースによって変わります。自動化されたツール群は、厳密なバージョンマッチングが使用された時には、少なくとも警告を発するべきで、全てを拒絶しても構いません。
ru: Уместно ли строгое соответствие версии или нет, зависит от конкретного случая использования спецификатора версии. Автоматизированные инструменты ДОЛЖНЫ как минимум выдавать предупреждения, а могут и полностью отклонять их, если строгое соответствие версий используется неуместно.
ta: கண்டிப்பான பதிப்பு பொருத்தம் பொருத்தமானது இல்லையா என்பது பதிப்பு விவரக்குறிப்புக்கான குறிப்பிட்ட பயன்பாட்டு வழக்கைப் பொறுத்தது. தானியங்கு கருவிகள் குறைந்தபட்சம் எச்சரிக்கைகளை வழங்க வேண்டும், மேலும் கடுமையான பதிப்பு போட்டிகள் தகாத முறையில் பயன்படுத்தப்படும்போது அவற்றை முழுமையாக நிராகரிக்கலாம்.

source: Prefix matching may be requested instead of strict comparison, by appending a trailing ``.*`` to the version identifier in the version matching clause. This means that additional trailing segments will be ignored when determining whether or not a version identifier matches the clause. If the specified version includes only a release segment, then trailing components (or the lack thereof) in the release segment are also ignored.
ja: バージョンマッチング節のバージョン識別子の末尾に ``.*`` を孵化することで、厳密な比較の代わりに接頭辞マッチングが要求されることもあります。これによって、あるバージョン識別子がその節に合致するか否かを決定する時に、追加の後続構成要素を無視することになるでしょう。指定されたバージョン番号がリリース番号構成部分だけを含んでいるなら、リリース番号構成部分の中の後続の構成部分 (あるいは、その欠落) もまた、無視されます。
ru: Вместо строгого сравнения можно запросить префиксное сопоставление, добавив к идентификатору версии в предложении о сопоставлении версий сдерживающий сегмент ``.*``. Это означает, что при определении соответствия идентификатора версии условию дополнительные сегменты в конце фразы будут игнорироваться. Если указанная версия включает в себя только сегмент релиза, то сдерживающие компоненты (или их отсутствие) в сегменте релиза также игнорируются.
ta: பதிப்பு பொருந்தும் பிரிவில் பதிப்பு அடையாளங்காட்டிக்கு `` `` `` என்ற பின்தங்கியதைச் சேர்ப்பதன் மூலம், கடுமையான ஒப்பீட்டுக்கு பதிலாக முன்னொட்டு பொருத்தம் கோரப்படலாம். பதிப்பு அடையாளங்காட்டி பிரிவுடன் பொருந்துகிறதா இல்லையா என்பதை தீர்மானிக்கும்போது கூடுதல் பின்தங்கிய பிரிவுகள் புறக்கணிக்கப்படும் என்பதே இதன் பொருள். குறிப்பிட்ட பதிப்பில் ஒரு வெளியீட்டு பிரிவு மட்டுமே இருந்தால், வெளியீட்டு பிரிவில் உள்ள பின்வரும் கூறுகள் (அல்லது அதன் பற்றாக்குறை) புறக்கணிக்கப்படுகின்றன.

source: For example, given the version ``1.1.post1``, the following clauses would match or not as shown::
eo: Ekzemple, pri la versio ``1.1.post1``, la ĉi-subaj kondiĉoj estas plenumitaj aŭ ne jene::
ja: 例えば、あるバージョン番号 ``1.1.post1`` が与えられたとして、以下に示すように合致したり合致しなかったりします::
ru: Например, для версии ``1.1.post1`` следующие пункты будут совпадать или не совпадать, как показано на рисунке::
ta: எடுத்துக்காட்டாக, பதிப்பு `` 1.1.post1`` கொடுக்கப்பட்டால், பின்வரும் உட்பிரிவுகள் பொருந்தாது அல்லது காட்டப்பட்டுள்ளபடி இல்லை ::

source: For purposes of prefix matching, the pre-release segment is considered to have an implied preceding ``.``, so given the version ``1.1a1``, the following clauses would match or not as shown::
eo: Pri kongrueco de prefikso, la antaŭeldono-segmento havas implicitan prefiksan ``.``. Tial, pri la versio ``1.1a1``, kaj jenaj kondiĉoj kongruus aŭ ne kongruus jene::
ja: 接頭辞マッチングの目的のためには、プレリリース構成部分は、暗黙の裡に先行する ``.`` を持つものと見なされ、従って、バージョン番号 ``1.1a1`` が与えられたとすれば、以下に示すように合致したり合致しなかったりします::
ru: Для целей сопоставления префиксов сегмент pre-release считается имеющим подразумеваемый предшествующий ``.``, поэтому, учитывая версию ``1.1a1``, следующие фразы будут соответствовать или не соответствовать, как показано::
ta: முன்னொட்டு பொருத்தத்தின் நோக்கங்களுக்காக, வெளியீட்டுக்கு முந்தைய பிரிவு `` .`` க்கு முந்தைய ஒரு மறைமுகத்தைக் கொண்டிருப்பதாகக் கருதப்படுகிறது, எனவே பதிப்பு `` 1.1a1```

source: An exact match is also considered a prefix match (this interpretation is implied by the usual zero padding rules for the release segment of version identifiers). Given the version ``1.1``, the following clauses would match or not as shown::
eo: Ekzakta kongrueco implicas prefiksan kongruecon (tia interpreto estas konsekvenco de la nulo-antaŭmeta regulo pri la eldonsegmento de versio-identigilo). Pri la versio ``1.1``, la jenaj kondiĉoj kongruus aŭ ne jene::
ja: 正確な合致は、また、接頭辞の合致 (これの解釈は、リリース番号構成部分やバージョン識別子に対する通常のゼロパディングを暗に意味します) であるものと見做されます。バージョン番号 ``1.1`` が与えられたなら、以下に示すように合致したり合致しなかったりします::
ru: Точное совпадение также считается совпадением с префиксом (такая интерпретация подразумевается обычными правилами нулевого заполнения для сегмента release в идентификаторах версий). Для версии ``1.1`` следующие пункты будут совпадать или не совпадать, как показано на рисунке::
ta: ஒரு சரியான போட்டி ஒரு முன்னொட்டு போட்டியாகவும் கருதப்படுகிறது (இந்த விளக்கம் பதிப்பு அடையாளங்காட்டிகளின் வெளியீட்டு பிரிவுக்கான வழக்கமான சுழிய திணிப்பு விதிகளால் குறிக்கப்படுகிறது). பதிப்பு `` 1.1`` கொடுக்கப்பட்டால், பின்வரும் உட்பிரிவுகள் பொருந்தாது அல்லது காட்டப்பட்டுள்ளபடி இல்லை ::

source: It is invalid to have a prefix match containing a development or local release such as ``1.0.dev1.*`` or ``1.0+foo1.*``. If present, the development release segment is always the final segment in the public version, and the local version is ignored for comparison purposes, so using either in a prefix match wouldn't make any sense.
ja: ``1.0.dev1.`` や ``1.0foo1.*`` のような開発リリース番号やローカルリリース番号を含む接頭辞マッチは正当なものではありません。もし存在すれば、開発リリース番号構成部分は常に公開のバージョン番号の最終構成部分であり、ローカルバージョン番号は比較の目的においては無視されるので、そのようなものが接頭辞マッチにあったとしても意味を成しません。
ru: Недопустимо использовать префиксное соответствие, содержащее релиз разработки или локальный релиз, например ``1.0.dev1.*`` или ``1.0+foo1.*``. Если они присутствуют, сегмент релиза разработки всегда является последним сегментом публичной версии, а локальная версия игнорируется для целей сравнения, поэтому использование любого из них в префиксном совпадении не имеет смысла.
ta: `` 1.0.dev1.*`` அல்லது `` 1.0+foo1.*`` போன்ற வளர்ச்சி அல்லது உள்ளக வெளியீட்டைக் கொண்ட முன்னொட்டு பொருத்தத்தைக் கொண்டிருப்பது தவறானது.*``. இருந்தால், வளர்ச்சி வெளியீட்டு பிரிவு எப்போதும் பொது பதிப்பில் இறுதிப் பகுதியாகும், மேலும் உள்ளக பதிப்பு ஒப்பீட்டு நோக்கங்களுக்காக புறக்கணிக்கப்படுகிறது, எனவே முன்னொட்டு போட்டியில் பயன்படுத்துவது எந்த அர்த்தமும் இல்லை.

source: The use of ``==`` (without at least the wildcard suffix) when defining dependencies for published distributions is strongly discouraged as it greatly complicates the deployment of security fixes. The strict version comparison operator is intended primarily for use when defining dependencies for repeatable *deployments of applications* while using a shared distribution index.
ja: 公開された配布物に対する依存関係を定義する時、 (少なくとも接尾辞にワイルドカードを含まないような) ``==`` の使用は強い非推奨であり、それはセキュリティフィクスの展開を大きく複雑化させるからです。厳密なバージョン比較演算子は、一義的に、共有の配布物インデックスを使う上で繰り返し可能な *アプリケーションの展開* のための依存関係を定義するために使われることを想定しています。
ru: Использование ``==`` (без суффикса подстановки) при определении зависимостей для опубликованных дистрибутивов категорически не рекомендуется, так как это значительно усложняет развертывание исправлений безопасности. Строгий оператор сравнения версий предназначен в первую очередь для использования при определении зависимостей для повторяющихся *развертываний приложений* при использовании общего индекса дистрибутива.
ta: வெளியிடப்பட்ட விநியோகங்களுக்கான சார்புகளை வரையறுக்கும் போது `` == `` (குறைந்தபட்சம் வைல்டு அட்டை பின்னொட்டு இல்லாமல்) பயன்பாடு பாதுகாப்புத் திருத்தங்களை வரிசைப்படுத்துவதை பெரிதும் சிக்கலாக்குவதால் கடுமையாக ஊக்கமளிக்கிறது. பகிரப்பட்ட விநியோகக் குறியீட்டைப் பயன்படுத்தும் போது மீண்டும் மீண்டும் செய்யக்கூடிய * பயன்பாடுகளின் வரிசைப்படுத்தல்களுக்கான சார்புகளை வரையறுக்கும் போது கடுமையான பதிப்பு ஒப்பீட்டு ஆபரேட்டர் முதன்மையாக பயன்பாட்டிற்காக கருதப்படுகிறது.

source: If the specified version identifier is a public version identifier (no local version label), then the local version label of any candidate versions MUST be ignored when matching versions.
eo: Se la specifita versio-identigilo estas publika versio-identigilo (sen loka versio-etikedo), do la loka versio-etikedo de iu ajn kandidata versio DEVAS ignoriĝi dum komputado de kongrueco inter versioj.
ja: 指定されたバージョン識別子は (ローカルバージョン番号ラベルなしの) 公開バージョン識別子であり、候補バージョンに付けられたローカルバージョン番号ラベルは、バージョンマッチングの際には無視されなければなりません。
ru: Если указанный идентификатор версии является общедоступным идентификатором версии (без метки локальной версии), то метка локальной версии любых версий-кандидатов ДОЛЖНА игнорироваться при сопоставлении версий.
ta: குறிப்பிட்ட பதிப்பு அடையாளங்காட்டி ஒரு பொது பதிப்பு அடையாளங்காட்டி (உள்ளூர் பதிப்பு சிட்டை இல்லை) என்றால், எந்த வேட்பாளர் பதிப்புகளின் உள்ளக பதிப்பு சிட்டை பதிப்புகளுடன் பொருந்தும்போது புறக்கணிக்கப்பட வேண்டும்.
