Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Historically, PyPI supported descriptions in plain text and `reStructuredText (reST) <https://docutils.sourceforge.io/docs/ref/rst/restructuredtext.html>`_, and could render reST into HTML. However, it is common for distribution authors to write the description in `Markdown <https://daringfireball.net/projects/markdown/>`_ (:rfc:`7763`) as many code hosting sites render Markdown READMEs, and authors would reuse the file for the description. PyPI didn't recognize the format and so could not render the description correctly. This resulted in many packages on PyPI with poorly-rendered descriptions when Markdown is left as plain text, or worse, was attempted to be rendered as reST. This field allows the distribution author to specify the format of their description, opening up the possibility for PyPI and other tools to be able to render Markdown and other formats.
eo: Historie, PyPI subtenis priskribojn en ordinara teksto kaj `reStructuredText (reST) <https://docutils.sourceforge.io/docs/ref/rst/restructuredtext.html>`_, kaj povis montri reST en HTML. Tamen, ofte aŭtoroj de distribuoj verkas la priskribojn en `Markdown <https://daringfireball.net/projects/markdown/>`_ (:rfc:`7763`), ĉar multaj kodgastigejoj montras README en Markdown, kaj aŭtoroj reuzas la dosieron por la priskribo. PyPI ne agnoskis tiun formon kaj tial ne povis montri la priskribon ĝuste. Tio kaŭzis multajn pakojn ĉe PyPI kun malĝustaj priskriboj de Markdown montrita kiel ordinara teksto aŭ, pli aĉe, kiel reST. Ĉi tiu kampo ebligas la aŭtoron de la distribuo specifi la dosierformon de la priskribo, ebligante PyPI kaj aliajn ilojn montri Markdown kaj aliajn dosierformojn.
ja: 歴史的には PyPI はプレーンテキストおよび `reStructuredText (reST) <https://docutils.sourceforge.io/docs/ref/rst/restructuredtext.html>`_ での description をサポートし、 reST を HTML として表示することができました。しかしながら、多くのソースコード管理サイトが Markdown の README を表示するようになったので、配布物の作者たちが description を `Markdown <https://daringfireball.net/projects/markdown/>`_ (:rfc:`7763`) で書くことが普通になり、作者たちはそのファイルを description として再利用するようになってきました。 PyPI はこのフォーマットを認識せず、従って description の内容を正しく表示することができませんでした。その結果、 PyPI 上の多くのパッケージで Markdown がプレーンテキストとして、もっと悪い場合には reST として解釈して、惨めな表示になっていました。このフィールドは配布物の作者がその description のフォーマットを指定できるようにしますので、 PyPI やその他のツールが Markdown やその他のフォーマットを正しく表示できるようになる可能性を広げます。
pt_br: Historicamente, o PyPI oferecia suporte a descrições em texto simples e `reStructuredText (reST) <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_, e poderia renderizar reST em HTML. No entanto, é comum que os autores da distribuição escrevam a descrição em `Markdown <https://daringfireball.net/projects/markdown/>`_ (:rfc:`7763`) visto que tantos sites de hospedagem de código renderizam READMEs de Markdown, e os autores reutilizariam o arquivo para a descrição. O PyPI não reconhecia o formato e, portanto, não conseguia processar a descrição corretamente. Isso resultava em muitos pacotes no PyPI com descrições mal renderizadas quando Markdown é deixado como texto simples, ou pior, era tentado ser renderizado como reST. Este campo permite que o autor da distribuição especifique o formato de sua descrição, abrindo a possibilidade para PyPI e outras ferramentas serem capazes de renderizar Markdown e outros formatos.
ru: Исторически PyPI поддерживал описания в виде обычного текста и `reStructuredText (reST) <https://docutils.sourceforge.io/docs/ref/rst/restructuredtext.html>`_, а также мог преобразовывать reST в HTML. Однако часто авторы дистрибутивов пишут описание в формате `Markdown <https://daringfireball.net/projects/markdown/>`_ (:rfc:`7763`), так как многие сайты хостинга кода выдают Markdown README, и авторы могут использовать этот файл для описания. PyPI не распознавал этот формат и поэтому не мог корректно отобразить описание. Это привело к тому, что многие пакеты на PyPI имели плохо отрисованные описания, когда Markdown оставался простым текстом или, что еще хуже, пытался быть отрисованным как reST. Это поле позволяет автору дистрибутива указать формат описания, открывая возможность для PyPI и других инструментов отображать Markdown и другие форматы.
ta: வரலாற்று ரீதியாக, PYPI எளிய உரையில் விளக்கங்களை ஆதரித்தது மற்றும் `மறுசீரமைப்பு (ஓய்வு) <https://docutils.sourceforge.io/docs/ref/rst/RestructuredText.html>` _, மற்றும் உஉகுமொ இல் ஓய்வெடுக்க முடியும். இருப்பினும், விநியோக ஆசிரியர்கள் விளக்கத்தை `மார்க் பேரூர் <https://daringfireball.net/projects/markdown/>` _ (: rfc: `7763`) இல் எழுதுவது பொதுவானது, ஏனெனில் பல குறியீடு ஓச்டிங் தளங்கள் மார்க் பேரூர் வாசிப்புகளை வழங்குகின்றன விளக்கத்திற்கான கோப்பை மீண்டும் பயன்படுத்தும். பைபி வடிவமைப்பை அடையாளம் காணவில்லை, எனவே விளக்கத்தை சரியாக வழங்க முடியவில்லை. இதன் விளைவாக பைபியில் பல தொகுப்புகள் மோசமாக வழங்கப்பட்ட விளக்கங்களுடன் மார்க் பேரூர் எளிய உரையாகவோ அல்லது மோசமாகவோ இருக்கும்போது, ஓய்வாக வழங்க முயற்சிக்கப்பட்டது. இந்த புலம் விநியோக எழுத்தாளரின் விளக்கத்தின் வடிவமைப்பைக் குறிப்பிட அனுமதிக்கிறது, பைபி மற்றும் பிற கருவிகளுக்கான மார்க் பேரூர் மற்றும் பிற வடிவங்களை வழங்குவதற்கான வாய்ப்பைத் திறக்கிறது.

source: The format of this field is the same as the ``Content-Type`` header in HTTP (i.e.: `RFC 1341 <https://www.w3.org/Protocols/rfc1341/4_Content-Type.html>`_). Briefly, this means that it has a ``type/subtype`` part and then it can optionally have a number of parameters:
eo: La formo de tiu kampo estas sama kiel la ĉapo ``Content-Type`` de HTTP (laŭ `RFC 1341 <https://www.w3.org/Protocols/rfc1341/4_Content-Type.html>`_). Resume, ĝi havas parton ``type/subtype`` kun nedeviga(j) parametro(j):
ja: このフィールドのフォーマットは HTTP (すなわち `RFC 1341 <https://www.w3.org/Protocols/rfc1341/4_Content-Type.html>`_) における ``Content-Type`` ヘッダのそれと同じです。端的に言えば、これは ``type/subtype`` の部分を持っていて、オプションとしていくつかのパラメータを取ることができるというものです:
pt_br: O formato deste campo é o mesmo do cabeçalho ``Content-Type`` em HTTP (ou seja: `RFC 1341 <https://www.w3.org/Protocols/rfc1341/4_Content-Type.html>`_). Resumidamente, isso significa que ele tem uma parte do ``tipo/subtipo`` e então pode opcionalmente ter uma série de parâmetros:
ru: Формат этого поля такой же, как у заголовка ``Content-Type`` в HTTP (т.е.: `RFC 1341 <https://www.w3.org/Protocols/rfc1341/4_Content-Type.html>`_). Вкратце это означает, что оно имеет часть ``тип/подтип``, а затем может иметь несколько параметров:
ta: இந்த புலத்தின் வடிவம் http இல் உள்ள `` உள்ளடக்க-வகை` தலைப்பு (அதாவது: `rfc 1341 <https://www.w3.org/protocols/rfc1341/4_content-type.html>` `_) . சுருக்கமாக, இதன் பொருள் இது ஒரு `` வகை/துணை வகை`` பகுதியைக் கொண்டுள்ளது, பின்னர் அது விருப்பமாக பல அளவுருக்களைக் கொண்டிருக்கலாம்:

source: Format::
eo: Formo::
ja: フォーマット::
pt_br: Formato::
ru: Формат::
ta: வடிவம் ::

source: The ``type/subtype`` part has only a few legal values:
eo: La parto ``type/subtype`` nur havas kelkajn validajn valorojn:
ja: ``type/subtype`` 部分はいくつかの正当な値を取ります:
pt_br: A parta ``tipo/subtipo`` tem apenas alguns poucos valores válidos:
ru: Часть ``тип/подтип`` имеет только несколько допустимых значений:
ta: `` வகை/துணை வகை`` பகுதியில் சில சட்ட மதிப்புகள் மட்டுமே உள்ளன:

source: ``text/plain``
ta: `` உரை/வெற்று``

source: ``text/x-rst``
ta: `` உரை/x-rst``

source: ``text/markdown``
ta: `` உரை/மார்க் டவுன்``

source: The ``charset`` parameter can be used to specify the character encoding of the description. The only legal value is ``UTF-8``. If omitted, it is assumed to be ``UTF-8``.
eo: La parametro ``charset`` povas specifi la signokodadon de la priskribo. La ununura valida valoro estas ``UTF-8``. Se ĝi mankas, oni supozas la valoron ``UTF-8``.
ja: ``charset`` パラメータは、description のキャラクターのエンコーディングを指定するために使われます。唯一の正当な値は ``UTF-8`` です。省略時には ``UTF-8`` であるものと仮定します。
pt_br: O parâmetro ``charset`` pode ser usado para especificar a codificação de caracteres da descrição. O único valor válido é ``UTF-8``. Se omitido, é considerado ``UTF-8``.
ru: Параметр ``charset'' может использоваться для указания кодировки описания. Единственным допустимым значением является ``UTF-8``. Если значение опущено, то предполагается, что оно равно ``UTF-8``.
ta: விளக்கத்தின் எழுத்துக்குறி குறியாக்கத்தைக் குறிப்பிட `` சார்செட்`` அளவுருவைப் பயன்படுத்தலாம். ஒரே சட்ட மதிப்பு `` UTF-8``. விடுபட்டால், அது `` utf-8`` என்று கருதப்படுகிறது.

source: Other parameters might be specific to the chosen subtype. For example, for the ``markdown`` subtype, there is an optional ``variant`` parameter that allows specifying the variant of Markdown in use (defaults to ``GFM`` if not specified). Currently, two variants are recognized:
eo: Aliaj parametroj povas esti specifaj pri la subtipo. Ekzemple, por la subtipo ``markdown``, ekzistas nedeviga parametro ``variant`` pri la uzita varianto de Markdown (se ĝi mankas, tio implicas ``GFM``). Aktuale du variantoj estas konataj:
ja: サブタイプを選択するために他のパラメータが指定される場合もあります。例えば、 ``markdown`` サブタイプを指定する際に、使われている Markdown の異種 (指定がない場合にはデフォルトでは ``GFM``) を指定することができるオプションの ``variant`` パラメータが存在します。現時点ではふたつの異種が認識されます:
pt_br: Outros parâmetros podem ser específicos para o subtipo escolhido. Por exemplo, para o subtipo ``markdown``, existe um parâmetro opcional ``variant`` que permite especificar a variante do Markdown em uso (o padrão é ``GFM`` se não for especificado). Atualmente, duas variantes são reconhecidas:
ru: Другие параметры могут быть специфичны для выбранного подтипа. Например, для подтипа ``markdown`` есть необязательный параметр ``variant``, который позволяет указать используемый вариант Markdown (по умолчанию ``GFM``, если не указан). В настоящее время распознаются два варианта:
ta: பிற அளவுருக்கள் தேர்ந்தெடுக்கப்பட்ட துணை வகைக்கு குறிப்பிட்டதாக இருக்கலாம். எடுத்துக்காட்டாக, `` மார்க் டவுன்` துணை வகைக்கு, பயன்பாட்டில் உள்ள மார்க் டவுனின் மாறுபாட்டைக் குறிப்பிட அனுமதிக்கும் ஒரு விருப்ப `` மாறுபாடு`` அளவுரு உள்ளது (இயல்புநிலைகள் குறிப்பிடப்படாவிட்டால் `` சி.எஃப்.எம்`` க்கு). தற்போது, இரண்டு வகைகள் அங்கீகரிக்கப்பட்டுள்ளன:

source: ``GFM`` for :rfc:`GitHub-flavored Markdown <7764#section-3.2>`
eo: ``GFM`` por :rfc:`GitHub-stila Markdown <7764#section-3.2>`
ja: ``GFM`` すなわち :rfc:`Github 流の Markdown <7764#section-3.2>`
pt_br: ``GFM`` para :rfc:`GitHub-flavored Markdown <7764#section-3.2>`
ru: ``GFM`` для :rfc:``GitHub-flavored Markdown <7764#section-3.2>`
ta: `` Gfm`` க்கு: RFC: `Github-சுவை மார்க் பேரூர் <7764#பிரிவு -3.2>`

source: ``CommonMark`` for :rfc:`CommonMark <7764#section-3.5>`
eo: ``CommonMark`` por :rfc:`CommonMark <7764#section-3.5>`
ja: :rfc:`CommonMark <7764#section-3.5>` を指定する ``CommonMark``
pt_br: ``CommonMark`` para :rfc:`CommonMark <7764#section-3.5>`
ru: ``CommonMark`` для :rfc:``CommonMark <7764#section-3.5>`
ta: `` காமன்மார்க்``` க்கு: ஆர்.எஃப்.சி: `காமன்மார்க் <7764#பிரிவு -3.5>`

source: If a ``Description-Content-Type`` is not specified, then applications should attempt to render it as ``text/x-rst; charset=UTF-8`` and fall back to ``text/plain`` if it is not valid rst.
eo: Se ``Description-Content-Type`` mankas, programo provu montri la priskribon kiel ``text/x-rst; charset=UTF-8`` kaj, se ĝi ne estas valida reStructuredText, montri ĝin kiel ``text/plain``.
ja: ``Description-Content-Type`` が指定されていない場合には、アプリケーションとしては、まず ``text/x-rst; charset=UTF-8`` として表示を試み、正当な rst ではない場合に ``text/plain`` にフォールバックするべきです。
pt_br: Se um ``Description-Content-Type`` não for especificado, as aplicações devem tentar renderizá-lo como ``text/x-rst; charset=UTF-8`` e volta para ``text/plain`` se não for válido primeiro.
ru: Если ``Description-Content-Type`` не указан, то приложения должны попытаться отобразить его как ``text/x-rst; charset=UTF-8`` и вернуться к ``text/plain``, если он не является корректным rst.
ta: ஒரு `` விளக்கம்-உள்ளடக்க வகை`` குறிப்பிடப்படவில்லை என்றால், விண்ணப்பங்கள் அதை `` உரை/எக்ச்-ஆர்எச்டி என வழங்க முயற்சிக்க வேண்டும்; charset = utf-8`` மற்றும் `` உரை/வெற்று`` இது செல்லுபடியாகாது என்றால் மீண்டும் விழுங்கள்.

source: If a ``Description-Content-Type`` is an unrecognized value, then the assumed content type is ``text/plain`` (Although PyPI will probably reject anything with an unrecognized value).
eo: Se ``Description-Content-Type`` estas nekonata valoro, do la supozata enhavtipo estas ``text/plain`` (kvankam PyPI verŝajne malakceptos ion ajn de nekonata valoro).
ja: ``Description-Content-Type`` が認識できない値である場合には、内容の型が ``text/plain`` であるものと仮定します (とはいえ、認識できない値であれば何であっても PyPI が拒否することになるでしょう) 。
pt_br: Se um ``Description-Content-Type`` é um valor não reconhecido, então o tipo de conteúdo presumido ser ``text/plain`` (embora PyPI provavelmente rejeite qualquer coisa com um valor não reconhecido).
ru: Если ``Description-Content-Type`` является нераспознанным значением, то предполагаемый тип содержимого - ``text/plain`` (хотя PyPI, вероятно, отклонит все, что имеет нераспознанное значение).
ta: ஒரு `` விளக்கம்-உள்ளடக்க வகை`` அங்கீகரிக்கப்படாத மதிப்பு என்றால், கருதப்பட்ட உள்ளடக்க வகை `` உரை/வெற்று`` (பைபி அடையாளம் காணப்படாத மதிப்பைக் கொண்ட எதையும் நிராகரிக்கும் என்றாலும்).

source: If the ``Description-Content-Type`` is ``text/markdown`` and ``variant`` is not specified or is set to an unrecognized value, then the assumed ``variant`` is ``GFM``.
eo: Se ``Description-Content-Type`` estas ``text/markdown`` kaj ``variant`` estas nespecifita aŭ nekonata, do la implicita ``variant`` estas ``GFM``.
ja: ``Description-Content-Type`` が ``text/markdown`` で、 ``variant`` が指定されない場合や認識できない値が指定された場合には、 ``variant`` が ``GFM`` であるものと仮定されます。
pt_br: Se o ``Description-Content-Type`` for ``text/markdown`` e ``variant`` não for especificado ou estiver definido com um valor não reconhecido, então a presume-se ``variant`` ser ``GFM`` .
ru: Если ``Description-Content-Type`` имеет значение ``text/markdown``, а ``вариант`` не указан или имеет нераспознанное значение, то предполагаемым ``вариантом`` будет ``GFM``.
ta: `` விளக்கம்-உள்ளடக்க வகை`` `` உரை/மார்க் டவுன்`` மற்றும் `` மாறுபாடு`` என்பது குறிப்பிடப்படவில்லை அல்லது அங்கீகரிக்கப்படாத மதிப்புக்கு அமைக்கப்பட்டால், கருதப்பட்ட `` மாறுபாடு`` .

source: So for the last example above, the ``charset`` defaults to ``UTF-8`` and the ``variant`` defaults to ``GFM`` and thus it is equivalent to the example before it.
eo: Por la ĉi-supra ekzemplo, ``charset`` estas implicite ``UTF-8``, kaj ``varianto`` estas implicite ``GFM``. Tial, ĝi ekvivalentas la ekzemplon antaŭ si.
ja: 上記の最後の例を見ると ``charset`` はデフォルトでは ``UTF-8`` であり、 ``variant`` はデフォルトでは ``GFM`` ですので、それ以前の例と同等であるということになります。
pt_br: Portanto, para o último exemplo acima, o ``charset`` padrão é ``UTF-8`` e o ``variant`` padrão ``GFM`` e, portanto, é equivalente ao exemplo anterior.
ru: Таким образом, в последнем примере по умолчанию ``charset`` принимает значение ``UTF-8``, а ``variant`` принимает значение ``GFM``, и поэтому он эквивалентен предыдущему примеру.
ta: ஆகவே, மேலே உள்ள கடைசி எடுத்துக்காட்டுக்கு, `` சர்செட்`` இயல்புநிலை `` utf-8`` மற்றும் `` மாறுபாடு`` இயல்புநிலை `` gfm`` க்கு இயல்புநிலையாகிறது, இதனால் அது அதற்கு முன் எடுத்துக்காட்டுக்கு சமம்.

source: Keywords
ja: キーワード
ru: Ключевые слова
ta: முக்கிய வார்த்தைகள்

source: A list of additional keywords, separated by commas, to be used to assist searching for the distribution in a larger catalog.
eo: Listo de ekstraj ŝlosilvortoj, apartigitaj de komoj, por helpi serĉadon de la distribuo en granda katalogo.
ja: より大きなカタログで配布物を検索する助けとなるべく使用される、コンマで区切られた追加のキーワードのリスト。
pt_br: Uma lista de palavras-chave adicionais, separadas por vírgulas, a serem usadas para auxiliar na busca pela distribuição em um catálogo maior.
ru: Список дополнительных ключевых слов, разделенных запятыми, которые будут использоваться для облегчения поиска дистрибутива в большом каталоге.
ta: ஒரு பெரிய பட்டியலில் விநியோகத்தைத் தேட உதவுவதற்கு காற்புள்ளிகளால் பிரிக்கப்பட்ட கூடுதல் முக்கிய வார்த்தைகளின் பட்டியல்.

source: The specification previously showed keywords separated by spaces, but distutils and setuptools implemented it with commas. These tools have been very widely used for many years, so it was easier to update the specification to match the de facto standard.
eo: Ĉi tiu normo antaŭe apartigis ŝlosilvortojn per spacetoj, sed distutils kaj setuptools realigis ĝin per komoj. Tiuj iloj estas vaste uzata dum multaj jaroj; tial pli facilas modifi la normon por kongrui kun la realo.
ja: 以前にお見せした仕様ではキーワードを区切るのに空白文字を使っていましたが、 distutils と setuptools はコンマで区切ります。これらのツールは多年に渡って非常に広く使われていますので、仕様をデファクト標準に合わせる形で更新する方が簡単でした。
pt_br: A especificação anteriormente mostrava palavras-chave separadas por espaços, mas distutils e setuptools a implementaram com vírgulas. Essas ferramentas foram amplamente utilizadas por muitos anos, então era mais fácil atualizar a especificação para corresponder ao padrão de fato.
ru: Ранее в спецификации ключевые слова разделялись пробелами, но в distutils и setuptools это было сделано через запятую. Эти инструменты очень широко используются уже много лет, поэтому было проще обновить спецификацию, чтобы она соответствовала стандарту де-факто.
ta: விவரக்குறிப்பு முன்னர் இடைவெளிகளால் பிரிக்கப்பட்ட முக்கிய வார்த்தைகளைக் காட்டியது, ஆனால் தொலைதூரங்கள் மற்றும் செட்டுப்டூல்கள் அதை காற்புள்ளியுடன் செயல்படுத்தின. இந்த கருவிகள் பல ஆண்டுகளாக மிகவும் பரவலாகப் பயன்படுத்தப்படுகின்றன, எனவே உண்மையான தரத்துடன் பொருந்தக்கூடிய விவரக்குறிப்பைப் புதுப்பிப்பது எளிதாக இருந்தது.

source: Author
ru: Автор
ta: நூலாசிரியர்

source: A string containing the author's name at a minimum; additional contact information may be provided.
eo: Signoĉeno enhavanta la nomon de la aŭtoro minimume; kromaj kontaktaj informoj povas esti disponigitaj.
ja: 少なくとも作者の名前を含む文字列で、連絡先となる情報を追加しても構いません。
pt_br: Um string contendo o nome do autor, no mínimo; informações de contato adicionais podem ser fornecidas.
ru: Строка, содержащая, как минимум, имя автора; может быть указана дополнительная контактная информация.
ta: ஆசிரியரின் பெயரைக் கொண்ட ஒரு சரம் குறைந்தபட்சம்; கூடுதல் தொடர்பு செய்தி வழங்கப்படலாம்.

source: Author-email
ta: ஆசிரியர்-கடந்த காலம்

source: A string containing the author's e-mail address. It can contain a name and e-mail address in the legal forms for a RFC-822 ``From:`` header.
eo: Signoĉeno enhavanta la retpoŝtan adreson de la aŭtoro. Ĝi povas enhavi nomon kaj retpoŝtan adreson laŭ la formo de la ĉapo ``From:`` en RFC 822.
ja: 作者の電子メールアドレスを含む文字列。 RFC-822 の ``From:`` ヘッダの記述形式として正当な形で名前と電子メールアドレスを含んでいても構いません。
pt_br: Uma string contendo o endereço de e-mail do autor. Ela pode conter um nome e endereço de e-mail nas formas válidos para um cabeçalho ``From:`` do RFC-822.
ru: Строка, содержащая адрес электронной почты автора. Может содержать имя и адрес электронной почты в законных формах для заголовка RFC-822 ``From:``.
ta: ஆசிரியரின் மின்னஞ்சல் முகவரியைக் கொண்ட ஒரு சரம். இது ஒரு RFC-822 `` என்பதற்கான சட்ட படிவங்களில் ஒரு பெயர் மற்றும் மின்னஞ்சல் முகவரியைக் கொண்டிருக்கலாம்: `` தலைப்பு.

source: Per RFC-822, this field may contain multiple comma-separated e-mail addresses::
eo: Laŭ RFC 822, ĉi tiu kampo povas enhavi pluajn kome disigitajn retpoŝtajn adresojn::
ja: RFC-822 によれば、このフィールドは、複数の電子メールアドレスをコンマで区切って記述しても構いません::
pt_br: De acordo com RFC-822, este campo pode conter vários endereços de e-mail separados por vírgula::
ru: Согласно RFC-822, это поле может содержать несколько адресов электронной почты, разделенных запятыми::
ta: RFC-822 க்கு, இந்த துறையில் பல கமாவால் பிரிக்கப்பட்ட மின்னஞ்சல் முகவரிகள் இருக்கலாம் ::

source: Maintainer
eo: Prizorganto
ja: メンテナ
pt_br: Mantenedor
ru: Сопровождающий
ta: பராமரிப்பாளர்

source: A string containing the maintainer's name at a minimum; additional contact information may be provided.
eo: Signoĉeno enhavanta la nomon de la mastrumanto minimume; kromaj kontaktaj informoj povas esti disponigitaj.
ja: 少なくともメンテナの名前を含む文字列で、連絡先となる情報を追加しても構いません。
pt_br: Uma string contendo o nome do mantenedor, no mínimo; informações de contato adicionais podem ser fornecidas.
ru: Строка, содержащая, как минимум, имя сопровождающего; может быть предоставлена дополнительная контактная информация.
ta: பராமரிப்பாளரின் பெயரைக் கொண்ட ஒரு சரம் குறைந்தபட்சம்; கூடுதல் தொடர்பு செய்தி வழங்கப்படலாம்.

source: Note that this field is intended for use when a project is being maintained by someone other than the original author: it should be omitted if it is identical to ``Author``.
eo: Notu, ke ĉi tiu kampo estas por tiam, kiam projekto estas mastrumata de iu alia ol la origina aŭtoro. Ĝi malestu, se ĝi estus identa al ``Author``.
ja: 当該プロジェクトが元々の作者とは異なる誰かによって保守されている場合にこのフィールドを使うことを想定しているということを覚えておいてください: もし ``Author`` と同一人物であれば、このフィールドを省略するべきです。
pt_br: Observe que este campo deve ser usado quando um projeto está sendo mantido por alguém que não seja o autor original: ele deve ser omitido se for idêntico a ``Author``.
ru: Обратите внимание, что это поле предназначено для использования, когда проект поддерживается кем-то, кроме оригинального автора: его следует опустить, если оно идентично ``Author``.
ta: அசல் எழுத்தாளரைத் தவிர வேறு ஒருவரால் ஒரு திட்டம் பராமரிக்கப்படும்போது இந்த புலம் பயன்படுத்தப்பட வேண்டும் என்பதை நினைவில் கொள்க: இது `` எழுத்தாளர்`` க்கு ஒத்ததாக இருந்தால் அது தவிர்க்கப்பட வேண்டும்.

source: Maintainer-email
ta: பராமரிப்பாளர்-எமெயில்

source: A string containing the maintainer's e-mail address. It can contain a name and e-mail address in the legal forms for a RFC-822 ``From:`` header.
eo: Signoĉeno enhavanta la retpoŝtan adreson de la mastrumanto. Ĝi povas enhavi nomon kaj retpoŝtan adreson laŭ la formo de la ĉapo ``From:`` en RFC 822.
ja: メンテナの電子メールアドレスを含む文字列。 RFC-822 の ``From:`` ヘッダの記述形式として正当な形で名前と電子メールアドレスを含んでいても構いません。
pt_br: Uma string contendo o endereço de e-mail do mantenedor. Ela pode conter um nome e endereço de e-mail nas formas válidas para um cabeçalho ``From:`` do RFC-822.
ru: Строка, содержащая адрес электронной почты сопровождающего. Может содержать имя и адрес электронной почты в законных формах для заголовка RFC-822 ``From:``.
ta: பராமரிப்பாளரின் மின்னஞ்சல் முகவரியைக் கொண்ட ஒரு சரம். இது ஒரு RFC-822 `` என்பதற்கான சட்ட படிவங்களில் ஒரு பெயர் மற்றும் மின்னஞ்சல் முகவரியைக் கொண்டிருக்கலாம்: `` தலைப்பு.

source: Note that this field is intended for use when a project is being maintained by someone other than the original author: it should be omitted if it is identical to ``Author-email``.
eo: Notu, ke ĉi tiu kampo estas por tiam, kiam projekto estas mastrumata de iu alia ol la origina aŭtoro. Ĝi malestu, se ĝi estus identa al ``Author-email``.
ja: 当該プロジェクトが元々の作者とは異なる誰かによって保守されている場合にこのフィールドを使うことを想定しているということを覚えておいてください: もし ``Author-email`` と同一であれば、このフィールドを省略するべきです。
pt_br: Observe que este campo deve ser usado quando um projeto está sendo mantido por alguém que não seja o autor original: ele deve ser omitido se for idêntico a ``Author-email``.
ru: Обратите внимание, что это поле предназначено для использования, когда проект поддерживается кем-то, кроме оригинального автора: оно должно быть опущено, если оно идентично ``Author-email``.
ta: அசல் எழுத்தாளரைத் தவிர வேறு ஒருவரால் ஒரு திட்டம் பராமரிக்கப்படும்போது இந்த புலம் பயன்படுத்தப்பட வேண்டும் என்பதை நினைவில் கொள்க: இது `` ஆசிரியர்-எமெயில்`` க்கு ஒத்ததாக இருந்தால் அது தவிர்க்கப்பட வேண்டும்.

source: License
ru: Лицензия
ta: உரிமம்

source: in favour of ``License-Expression``.
eo: Anstataŭe uzu ``License-Expression``.
ru: в пользу ``лицензии-выражения``.
ta: `` உரிம-வெளிப்பாடு`` க்கு ஆதரவாக.
