Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: :doc:`Setuptools <setuptools:index>` provides the `pkg_resources.declare_namespace`_ function and the ``namespace_packages`` argument to :func:`~setuptools.setup`. Together these can be used to declare namespace packages. While this approach is no longer recommended, it is widely present in most existing namespace packages. If you are creating a new distribution within an existing namespace package that uses this method then it's recommended to continue using this as the different methods are not cross-compatible and it's not advisable to try to migrate an existing package.
eo: :doc:`Setuptools <setuptools:index>` provizas la funkcion `pkg_resources.declare_namespace`_ kaj la argumenton ``namespace_packages`` de :func:`~setuptools.setup`. Oni uzas tiujn kune por deklari nomspacan pakon. Kvankam tiu maniero ne plu estas rekomendata, ĝi estas vaste uzata en ekzistantaj nomspacaj pakoj. Se oi verkas novan distribuon en ekzistanta nomspaca pako uzanta tiun metodon, estas rekomendate daŭre uzi tion, ĉar la diversaj metodoj ne kongruas inter si, kaj ne konsilindas provi migri ekzistantan pakon.
ja: :doc:`Setuptools <setuptools:index>` は、 `pkg_resources.declare_namespace`_ 関数と :func:`~setuptools.setup` に渡す ``namespace_packages`` 引数を提供します。これらを一緒に使うことで名前空間パッケージを宣言することができます。この手法はもはや推奨されていませんが、既存の名前空間パッケージのほとんどで使われています。この手法を採用している既存の名前空間パッケージの中に新しい配布物を作成する時には、異なる手法が相互に互換ではないために既存パッケージを移植しようとすることが推奨されていないので、この手法を採用し続けることを推奨します。
pt_br: :doc:`Setuptools <setuptools:index>` fornece a função `pkg_resources.declare_namespace`_ e o argumento ``namespace_packages`` para :func:`~setuptools.setup`. Juntos, eles podem ser usados para declarar pacotes de espaço de nomes. Embora essa abordagem não seja mais recomendada, ela está amplamente presente na maioria dos pacotes de espaço de nomes existentes. Se você estiver criando uma nova distribuição dentro de um pacote de espaço de nomes existente que usa esse método, é recomendável continuar usando-o, pois os diferentes métodos não são compatíveis entre si e não é aconselhável tentar migrar um pacote existente.
ru: :doc:`Setuptools <setuptools:index>` предоставляет функцию `pkg_resources.declare_namespace`_ и аргумент ``namespace_packages``:func:`~setuptools.setup'. Вместе они могут быть использованы для объявления пакетов пространства имен. Хотя этот подход больше не рекомендуется, он широко присутствует в большинстве существующих пакетов пространства имен. Если вы создаете новое распределение в существующем пакете пространства имен, который использует этот метод, рекомендуется продолжать использовать это, поскольку различные методы не являются взаимосовместимыми, и не рекомендуется пытаться мигрировать существующий пакет.
ta: . பெயர்வெளி தொகுப்புகளை அறிவிக்க இவை ஒன்றாக பயன்படுத்தப்படலாம். இந்த அணுகுமுறை இனி பரிந்துரைக்கப்படவில்லை என்றாலும், இது தற்போதுள்ள பெரும்பாலான பெயர்வெளி தொகுப்புகளில் பரவலாக உள்ளது. இந்த முறையைப் பயன்படுத்தும் ஏற்கனவே உள்ள பெயர்வெளி தொகுப்புக்குள் நீங்கள் ஒரு புதிய விநியோகத்தை உருவாக்குகிறீர்கள் என்றால், வெவ்வேறு முறைகள் குறுக்கு-இணக்கமானவை அல்ல என்பதால் இதைப் பயன்படுத்த தொடர்ந்து பரிந்துரைக்கப்படுகிறது, மேலும் ஏற்கனவே உள்ள தொகுப்பை இடம்பெயர முயற்சிப்பது நல்லதல்ல.

source: To create a pkg_resources-style namespace package, you need to provide an :file:`__init__.py` file for the namespace package:
eo: Por krei pkg_resources-stilan nomspacan pakon, oni devas provizi dosieron :file:`__init__.py` por la nomspaca pako:
ja: pkg_resources 型名前空間パッケージを作成するには、名前空間パッケージ用の :file:`__init__.py` を準備する必要があります:
pt_br: Para criar um pacote de espaço de nomes no estilo pkg_resources, você precisa fornecer um arquivo :file:`__init __. Py` para o pacote de espaço de nomes:
ru: Чтобы создать пакет пространства имен в стиле pkg_resources, вам нужно предоставить файл :file:`__init__.py` для пакета пространства имен:
ta: PKG_RESOURCES- பாணி பெயர்வெளி தொகுப்பை உருவாக்க, நீங்கள் ஒரு: கோப்பு: `__init __. பெயர்வெளி தொகுப்புக்கான கோப்பு:

source: Some older recommendations advise the following in the namespace package :file:`__init__.py`:
eo: Kelkaj malnovaj rekomendoj konsilas la jenon en la nomspaca pako :file:`__init__.py`:
ja: いくつかの古めの推奨では、次のような名前空間パッケージ用 :file:`__init__.py` を使うように言っています:
pt_br: Algumas recomendações mais antigas aconselham o seguinte no :file:`__init__.py` de pacotes de espaço de nomes:
ru: В некоторых старых рекомендациях в пакете пространства имен :file:`__init__.py` рекомендуется следующее:
ta: சில பழைய பரிந்துரைகள் பெயர்வெளி தொகுப்பில் பின்வருவனவற்றை அறிவுறுத்துகின்றன: கோப்பு: `__init __. Py`:

source: The idea behind this was that in the rare case that setuptools isn't available packages would fall-back to the pkgutil-style packages. This isn't advisable because pkgutil and pkg_resources-style namespace packages are not cross-compatible. If the presence of setuptools is a concern then the package should just explicitly depend on setuptools via ``install_requires``.
eo: La kialo estis, ke en la malofta kazo kiam setuptools ne estas havebla, pako povas funkcii kiel pkgutil-stila pako. Tio ne estas konsilinda, ĉar pkgutil kaj pkg_resources-stilaj nomspacopakoj ne kongruas inter si. Se la ĉeesto de setuptools estas problema, do la pako simple eksplicite dependu de setuptools per ``install_requires``.
ja: 背景にあるアイデアとしては、 setuptools を使えないような稀な場合には、パッケージを pkgutil 型パッケージに切り戻したいと言うことがあるかもしれません。 pkgutil 型と pkg_resources 型の名前空間パッケージは互いに非互換なので、これは推奨できるものではありません。 setuptool が存在するか否かが問題なのであれば、パッケージとしては ``install_requires`` を通じて setuptools に明示的に依存すると示しておくべきです。
pt_br: A ideia por trás disso era que, no caso raro de setuptools não estar disponível, os pacotes recorreriam aos pacotes no estilo pkgutil. Isso não é aconselhável porque os pacotes de espaço de nomes estilo pkgutil e pkg_resources não são compatíveis entre si. Se a presença de setuptools é uma preocupação, então o pacote deve depender explicitamente de setuptools via ``install_requires``.
ru: Идея заключалась в том, что в редких случаях, когда setuptools недоступен, пакеты будут возвращаться к пакетам в стиле pkgutil. Это нежелательно, поскольку пакеты пространства имен в стиле pkgutil и pkg_resources не являются кросс-совместимыми. Если наличие setuptools является проблемой, то пакет должен просто явно зависеть от setuptools через ``install_requires``.
ta: இதன் பின்னணியில் உள்ள சிந்தனை என்னவென்றால், செட்டுப்டூல்ச் கிடைக்காத அரிதான விசயத்தில் தொகுப்புகள் PKGUTIL- பாணி தொகுப்புகளுக்கு விழும். இது நல்லதல்ல, ஏனெனில் PKGUTIL மற்றும் PKG_RESOURCES-பாணி பெயர்வெளி தொகுப்புகள் குறுக்கு இணக்கமானவை அல்ல. செட்ப்டூல்களின் இருப்பு ஒரு கவலையாக இருந்தால், தொகுப்பு `` install_requires`` வழியாக செட்டுப்டூல்களை வெளிப்படையாக சார்ந்து இருக்க வேண்டும்.

source: Finally, every distribution must provide the ``namespace_packages`` argument to :func:`~setuptools.setup` in :file:`setup.py`. For example:
eo: Fine, ĉiu distribuo devas provizi la argumenton ``namespace_packages`` al to :func:`~setuptools.setup` en :file:`setup.py`. Ekzemple:
ja: 最後に、それぞれの配布物は :file:`setup.py` の :func:`~setuptools.setup` 向けに ``namespace_packages`` 引数を準備しておく必要があります。例えば:
pt_br: Finalmente, cada distribuição deve fornecer o argumento ``namespace_packages`` para :func:`~setuptools.setup` no :file:`setup.py`. Por exemplo:
ru: Наконец, каждый дистрибутив должен предоставить аргумент ``namespace_packages`` в :func:`~setuptools.setup` в :file:`setup.py`. Например:
ta: இறுதியாக, ஒவ்வொரு விநியோகமும் `` பெயர்வெளி_பேக்கேச்கள்` வாதத்தை வழங்க வேண்டும்: func: `~ setuptools.setup` இல்: கோப்பு:` setup.py`. உதாரணமாக:

source: A complete working example of two pkg_resources-style namespace packages can be found in the `pkg_resources namespace example project`_.
eo: Plena funkcianta ekzemplo de du pkg_resources-stilaj nomspacaj pakoj troviĝas en la `pkg_resources-nomspaca ekzempla projekto <pkg_resources namespace example project>`_.
ja: pkg_resources 型の名前空間パッケージの動作可能な二つの例が `pkg_resources 型名前空間例示プロジェクト`_ で見つかるはずです。
pt_br: Um exemplo de completamente funcional de dois pacotes de espaço de nomes no estilo pkg_resources pode ser encontrado no `projeto exemplo de espaço de nomes de pkg_resources`_.
ru: Полный рабочий пример двух пакетов пространства имен в стиле pkg_resources можно найти в проекте `pkg_resources namespace example`_.
ta: இரண்டு pkg_resources- பாணி பெயர்வெளி தொகுப்புகளின் முழுமையான வேலை எடுத்துக்காட்டு `pkg_resources பெயர்வெளி எடுத்துக்காட்டு திட்டம்`_ இல் காணலாம்.

source: Publishing package distribution releases using GitHub Actions CI/CD workflows
eo: Eldoni pakajn distribuajn eldonoj per la laborfluoj por kontinuaj integrado kaj disponigo ĉe GitHub Actions
ja: GitHub Actions CI/CD ワークフローを用いてパッケージ配布物のリリースを公開する
pt_br: Publicando versões de distribuição de pacotes usando fluxos de trabalho de CI/CD do GitHub Actions
ru: Публикация релизов дистрибутивов пакетов с помощью рабочих процессов GitHub Actions CI/CD
ta: அறிவிலிமையம் செயல்கள் சிஐ/சிடி பணிப்பாய்வுகளைப் பயன்படுத்தி தொகுப்பு விநியோக வெளியீடுகளை வெளியிடுகிறது

source: `GitHub Actions CI/CD`_ allows you to run a series of commands whenever an event occurs on the GitHub platform. One popular choice is having a workflow that's triggered by a ``push`` event. This guide shows you how to publish a Python distribution whenever a tagged commit is pushed. It will use the `pypa/gh-action-pypi-publish GitHub Action`_ for publishing. It also uses GitHub's `upload-artifact`_ and `download-artifact`_ actions for temporarily storing and downloading the source packages.
ja: `GitHub Actions CI/CD`_ を使うと、 GitHub プラットフォームで何かイベントが発生するたびに一連のコマンドを実行することができます。よくある選択のひとつは、 ``push`` イベントを引き金にしてあるワークフローを行うというものです。このガイドでは、タグ付きのコミットが push されるたびに Python 配布物を公開するやり方をお見せします。それには `pypa/gh-action-pypi-publish GitHub Action`_ を使って出版 <publish> します。また、一時的な格納やソースコード配布物のダウンロードのためにGitHubの `upload-artifact`_ と `download-artifact`_ を使います。
pt_br: O `CI/CD do GitHub Actions`_ permite que você execute uma série de comandos sempre que ocorrer um evento na plataforma GitHub. Uma escolha popular é ter um fluxo de trabalho que é disparado por um evento ``push``. Este guia mostra como publicar uma distribuição Python sempre que um commit marcado é enviado. Ele usará o `GitHub Action pypa/gh-action-pypi-publish`_ para publicação. Ele também usa as actions `upload-artifact`_ e `download-artifact`_ do GitHub para temporariamente armazenar e baixar os pacotes fontes.
ru: `GitHub Actions CI/CD`_ позволяет запускать серию команд каждый раз, когда на платформе GitHub происходит какое-либо событие. Одним из популярных вариантов является рабочий процесс, который запускается по событию ``push``. В этом руководстве показано, как публиковать дистрибутив Python каждый раз, когда выкладывается коммит с меткой. Для публикации будет использован экшен GitHub `pypa/gh-action-pypi-publish`_. Также используются действия GitHub `upload-artifact`_ и `download-artifact`_ для временного хранения и загрузки исходных пакетов.
ta: `கிட்அப் செயல்கள் சிஐ/சி.டி`_ அறிவிலிமையம் மேடையில் ஒரு நிகழ்வு நிகழும்போது தொடர்ச்சியான கட்டளைகளை இயக்க உங்களை அனுமதிக்கிறது. ஒரு பிரபலமான தேர்வு ஒரு `` புச்`` நிகழ்வால் தூண்டப்பட்ட ஒரு பணிப்பாய்வு. குறிக்கப்பட்ட உறுதிப்பாட்டைத் தள்ளும்போதெல்லாம் பைதான் விநியோகத்தை எவ்வாறு வெளியிடுவது என்பதை இந்த வழிகாட்டி உங்களுக்குக் காட்டுகிறது. இது வெளியீட்டிற்கு `பைபா/சிஎச்-ஆக்சன்-பைபி-வெளியீட்டு அறிவிலிமையம் அதிரடி`_ ஐப் பயன்படுத்தும். மூல தொகுப்புகளை தற்காலிகமாக சேமித்து பதிவிறக்குவதற்கு இது கிதுபின் `பதிவேற்ற-ஆர்டிஃபாக்ட்`_ மற்றும்` பதிவிறக்கம்-பார்ட்டிஃபாக்ட்`_ செயல்களையும் பயன்படுத்துகிறது.

source: This guide *assumes* that you already have a project that you know how to build distributions for and *it lives on GitHub*. This guide also avoids details of building platform specific projects. If you have binary components, check out :ref:`cibuildwheel`'s GitHub Action examples.
eo: Ĉi tiu gvidilo *supozas*, ke vi jam havas projekton, ke vi scias kiel konstrui distribuojn, kaj ke *ĝi ekzistas sur GitHub*. Ĉi tiu gvidilo ankaŭ ignoras detalojn pri konstruado de platformo-specifa projekto. Se vi havas duuman komponanton, vidu la ekzemplojn de GitHub-Agoj por :ref:`cibuildwheel`.
ja: このガイドでは、配布物をビルドするやり方を知っているプロジェクトが既にそんざいして、それが *GitHub に置いてある* ことを *前提* にしています。このガイドは、また、特定のプロジェクトをビルドするプラットフォームの詳細に立ち入ることはしません。もしあなたがバイナリのコンポーネントを持っているなら、 :ref:`cibuildwheel` にある GitHub Action の例を調べてみてください。
pt_br: Este guia *presume* que você já tem um projeto para o qual sabe como construir distribuições e *ele reside no GitHub*. Este guia também evita detalhes da construção de projetos específicos da plataforma. Se você tiver componentes binários, confira os exemplos de GitHub Action do :ref:`cibuildwheel`.
ru: Это руководство *предполагает*, что у вас уже есть проект, для которого вы знаете, как собирать дистрибутивы, и *он живет на GitHub*. Это руководство также избегает подробностей сборки проектов для конкретных платформ. Если у вас есть бинарные компоненты, посмотрите примеры GitHub Action от :ref:`cibuildwheel`.
ta: இந்த வழிகாட்டி *உங்களிடம் ஏற்கனவே ஒரு திட்டம் உள்ளது என்று கருதுகிறது. இந்த வழிகாட்டி தளமான குறிப்பிட்ட திட்டங்களை உருவாக்குவதற்கான விவரங்களையும் தவிர்க்கிறது. உங்களிடம் பைனரி கூறுகள் இருந்தால், பாருங்கள்: குறிப்பு: `cibuildwheel` இன் அறிவிலிமையம் அதிரடி எடுத்துக்காட்டுகள்.

source: If you followed earlier versions of this guide, you have created the secrets ``PYPI_API_TOKEN`` and ``TEST_PYPI_API_TOKEN`` for direct PyPI and TestPyPI access. These are obsolete now and you should remove them from your GitHub repository and revoke them in your PyPI and TestPyPI account settings in case you are replacing your old setup with the new one.
ja: このガイドの以前のバージョンを読み通したことがあるのであれば、PyPI や TestPyPI への直接のアクセスをするために ``PYPI_API_TOKEN`` と ``TEST_PYPOI_API_TOKEN`` という秘密のトークンを作成したことでしょう。今ではこれらは過去のものとなっていて、旧来の設定を新しいものに置き換える際に GitHub リポジトリから削除し、 PyPI や TestPyPI のアカウント設定から取り除くべきです。
pt_br: Se você seguiu versões anteriores deste guia, você criou os segredos ``PYPI_API_TOKEN`` e ``TEST_PYPI_API_TOKEN`` para acesso direto ao PyPI e TestPyPI. Eles estão descontinuados agora e você deve removê-los de seu repositório GitHub e revogá-los nas configurações de sua conta PyPI e TestPyPI, caso esteja substituindo sua configuração antiga pela nova.
ru: Если вы следовали предыдущим версиям этого руководства, вы создали секреты ``PYPI_API_TOKEN`` и ``TEST_PYPI_API_TOKEN`` для прямого доступа к PyPI и TestPyPI. Теперь они устарели, и вам следует удалить их из вашего репозитория GitHub и отозвать их в настройках ваших аккаунтов PyPI и TestPyPI, если вы заменяете старую настройку на новую.
ta: இந்த வழிகாட்டியின் முந்தைய பதிப்புகளை நீங்கள் பின்பற்றினால், நேரடி பைபி மற்றும் டெச்ட்பிஐ அணுகலுக்காக `` pypi_api_token`` மற்றும் `` test_pypi_api_token` ஆகியவற்றை நீங்கள் உருவாக்கியுள்ளீர்கள். இவை இப்போது வழக்கற்றுப் போய்விட்டன, அவற்றை உங்கள் அறிவிலிமையம் களஞ்சியத்திலிருந்து அகற்றி, உங்கள் பழைய அமைப்பை புதியதாக மாற்றினால் அவற்றை உங்கள் பைபி மற்றும் டெச்ட்பிஐ கணக்கு அமைப்புகளில் ரத்து செய்ய வேண்டும்.

source: Let's begin! 🚀
eo: Ek! 🚀
ja: 始めましょう! 🚀
pt_br: Vamos começar! 🚀
ru: Давайте начнем! 🚀
ta: ஆரம்பிக்கலாம்! .

source: Go to https://pypi.org/manage/account/publishing/.
eo: Iru al https://pypi.org/manage/account/publishing/.
ja: https://pypi.org/manage/account/publishing/ へ行く。
pt_br: Acesse https://pypi.org/manage/account/publishing/.
ru: Зайдите на сайт https://pypi.org/manage/account/publishing/.
ta: Https://pypi.org/manage/account/publishing/ க்குச் செல்லவும்.

source: Fill in the name you wish to publish your new :term:`PyPI project <Project>` under (the ``name`` value in your ``setup.cfg`` or ``pyproject.toml``), the GitHub repository owner's name (org or user), and repository name, and the name of the release workflow file under the ``.github/`` folder, see :ref:`workflow-definition`. Finally, add the name of the GitHub Environment (``pypi``) we're going set up under your repository. Register the trusted publisher.
ja: 新しい :term:`PyPI プロジェクト <Project>` 向けに発行したいと思う名前を (``setup.cfg`` か ``pyproject.toml`` の中の ``名称 <name>`` の値として)、GitHub のリポジトリ所有者の名称 (org または user) と、リポジトリの名称と、 ``.github/`` フォルダの下のリリースワークフローの名称を記入するには、 :ref:`ワークフロー定義 <workflow-definition>` をみてください。最後に、これからリポジトリ内に設定しようとするGutHub 環境 (``pypi``) の名称を追加してください。トラステッドパブリッシャを登録してください。
pt_br: Preencha o nome com o qual deseja publicar seu novo :term:`projeto PyPI <Project>` em (o valor ``name`` em seu ``setup.cfg`` ou ``pyproject.toml``), o nome do proprietário do repositório no GitHub (organização ou usuário), e nome do repositório, e o nome do arquivo de fluxo de trabalho de lançamento na pasta ``.github/``, consulte :ref:`workflow-definition`. Por fim, adicione o nome do ambiente do GitHub (``pypi``) que iremos configurar em seu repositório. Registre o publicador confiável.
ru: Введите имя, под которым вы хотите опубликовать свой новый :term:`PyPI-проект <Project>` (значение ``name`` в вашем ``setup.cfg`` или ``pyproject.toml``), имя владельца репозитория GitHub (org или user), имя репозитория, а также имя файла рабочего процесса релиза в папке ``.github/``, см. :ref:`workflow-definition``. Наконец, добавьте имя окружения GitHub (``pypi``), которое мы собираемся установить под вашим репозиторием. Зарегистрируйте доверенного издателя.
ta: உங்கள் புதியதை வெளியிட விரும்பும் பெயரை நிரப்பவும்: கால: `பைபி திட்டம் <திட்டம்>` கீழ் (உங்கள் `` setup.cfg`` அல்லது `` pyproject.toml``), Kithub களஞ்சிய உரிமையாளரின் பெயர் (org அல்லது பயனர்), மற்றும் களஞ்சிய பெயர், மற்றும் `` .github/`` இன் கீழ் வெளியீட்டு பணிப்பாய்வு கோப்பின் பெயர் கோப்புறை, காண்க: குறிப்பு: `பணிப்பாய்வு-வரையறை`. இறுதியாக, அறிவிலிமையம் சூழலின் பெயரைச் சேர்க்கவும் (`` பைபி``) நாங்கள் உங்கள் களஞ்சியத்தின் கீழ் அமைக்கப் போகிறோம். நம்பகமான வெளியீட்டாளரை பதிவு செய்யுங்கள்.

source: Now, go to https://test.pypi.org/manage/account/publishing/ and repeat the second step, but this time, enter ``testpypi`` as the name of the GitHub Environment.
eo: Nun iru al https://test.pypi.org/manage/account/publishing/ kaj ripetu la duan paŝon, sed tajpante ``testpypi`` kiel la nomon de la GitHub-medio.
ja: ここで https://test.pypi.org/manage/account/publishing/ へ行って第２のステップを繰り返してください、ただし、今回は GitHub 環境の名称として ``testpypi`` を入力します。
pt_br: Agora, acesse https://test.pypi.org/manage/account/publishing/ e repita a segunda etapa, mas desta vez, insira ``testpypi`` como o nome do ambiente do GitHub.
ru: Теперь перейдите на https://test.pypi.org/manage/account/publishing/ и повторите второй шаг, но на этот раз введите ``testpypi`` в качестве имени среды GitHub.
ta: இப்போது, https://test.pypi.org/manage/account/publishing/ க்குச் சென்று இரண்டாவது படியை மீண்டும் செய்யவும், ஆனால் இந்த நேரத்தில், அறிவிலிமையம் சூழலின் பெயராக `` டெச்ட்பைபி`` ஐ உள்ளிடவும்.

source: Your "pending" publishers are now ready for their first use and will create your projects automatically once you use them for the first time.
eo: Viaj «estontaj» eldonantoj nun pretas por unua uzo kaj kreos viajn projektojn aŭtomate post unua uzo.
ja: ペンディングされたパブリッシャは今やその初回使用の準備ができており、初回使用を行えば自動的にあなたのプロジェクトを生成します。
pt_br: Seus publicadores "pendentes" agora estão prontos para o primeiro uso e criarão seus projetos automaticamente assim que você usá-los pela primeira vez.
ru: Ваши "ожидающие" издатели теперь готовы к первому использованию и будут создавать ваши проекты автоматически, как только вы впервые их используете.
ta: உங்கள் "நிலுவையில் உள்ள" வெளியீட்டாளர்கள் இப்போது அவர்களின் முதல் பயன்பாட்டிற்கு தயாராக உள்ளனர், மேலும் நீங்கள் முதல் முறையாக அவற்றைப் பயன்படுத்தியவுடன் உங்கள் திட்டங்களை தானாக உருவாக்கும்.

source: If you don't have a TestPyPI account, you'll need to create it. It's not the same as a regular PyPI account.
eo: Se vi ne havas konton ĉe Prova PyPI, vi devas krei ĝin. Ĝi ne estas sama kiel konto ĉe ordinara PyPI.
ja: TestPyPI のアカウントを持っていなければ、新たに作成する必要があります。これは通常の PyPI のアカウントとは別のものです。
pt_br: Se você não tiver uma conta TestPyPI, precisará criá-la. Não é o mesmo que uma conta do PyPI comum.
ru: Если у вас нет учетной записи TestPyPI, вам нужно ее создать. Это не то же самое, что обычная учетная запись PyPI.
ta: உங்களிடம் டெச்ட்பை கணக்கு இல்லையென்றால், நீங்கள் அதை உருவாக்க வேண்டும். இது வழக்கமான PYPI கணக்கைப் போலவே இல்லை.

source: Creating a workflow definition
eo: Krei laborfluan difinon
ja: ワークフロー定義を作成する
pt_br: Criando uma definição de fluxo de trabalho
ru: Создание определения рабочего процесса
ta: பணிப்பாய்வு வரையறையை உருவாக்குதல்

source: GitHub CI/CD workflows are declared in YAML files stored in the ``.github/workflows/`` directory of your repository.
eo: Laborfluoj por kontinuaj integrado kaj disponigo ĉe GitHub estas deklaritaj en YAML-dosieroj en la dosiero ``.gitub/workflows/`` de via deponejo.
ja: GitHub CI/CD ワークフローは、リポジトリの ``.github/workflows/`` ディレクトリに置かれた YAML ファイルで宣言されます。
pt_br: Os fluxos de trabalho de CI/CD do GitHub são declarados em arquivos YAML armazenados no diretório ``.github/workflows/`` do seu repositório.
ru: Рабочие процессы GitHub CI/CD объявляются в файлах YAML, хранящихся в директории ``.github/workflows/`` вашего репозитория.
ta: Kithub CI/CD பணிப்பாய்வுகள் `` .github/பணிப்பாய்வு/`` உங்கள் களஞ்சியத்தின் கோப்பகத்தில் சேமிக்கப்பட்ட YAML கோப்புகளில் அறிவிக்கப்படுகின்றன.

source: Let's create a ``.github/workflows/publish-to-test-pypi.yml`` file.
eo: Ni kreu dosieron ``.github/workflows/publish-to-test-pypi.yml``.
ja: ``.github/workflows/publish-to-test-pypi.yml`` ファイルを作成しましょう。
pt_br: Vamos criar um arquivo chamado ``.github/workflows/publish-to-test-pypi.yml``.
ru: Давайте создадим файл ``.github/workflows/publish-to-test-pypi.yml``.
ta: `` .Github/பணிப்பாய்வு/வெளியீடு-க்கு-சோதனை-pypi.yml`` கோப்பை உருவாக்குவோம்.

source: Start it with a meaningful name and define the event that should make GitHub run this workflow:
eo: Uzu signifan nomon, kaj difinu tiun eventon, kiu igos GitHub ruli la laborfluon:
ja: 意味のある名前で始めて、 GitHub がこのワークフローを走らせるべきイベントを定義しましょう:
pt_br: Comece com um nome significativo e defina o evento que deve fazer o GitHub executar este fluxo de trabalho:
ru: Начните его с осмысленного имени и определите событие, которое должно заставить GitHub запустить этот рабочий процесс:
ta: இதை ஒரு அர்த்தமுள்ள பெயருடன் தொடங்கி, இந்த பணிப்பாய்வுகளை அறிவிலிமையம் இயக்க வேண்டிய நிகழ்வை வரையறுக்கவும்:

source: Checking out the project and building distributions
eo: Elpreni la projekton kaj konstrui distribuojn
ja: プロジェクトをチェックアウトして配布物をビルドする
pt_br: Fazendo checkout do projeto e construindo as distribuições
ru: Проверка проекта и сборка дистрибутивов
ta: திட்டத்தை சரிபார்த்து, கட்டிட விநியோகங்களை உருவாக்குதல்

source: We will have to define two jobs to publish to PyPI and TestPyPI respectively, and an additional job to build the distribution packages.
eo: Ni difinus du taskojn por eldoni al PyPI kaj Prova PyPI respektive kaj ekstran taskon por konstrui la distribuajn pakojn.
ja: PyPI と TestPyPI に向けて出版 <publish> するためには、二つのジョブを定義しなければならず、また、配布物のパッケージ群をビルドするための追加のジョブも定義しなければなりません。
pt_br: Teremos que definir dois trabalhos ("jobs") para publicar em PyPI e TestPyPI respectivamente, e um trabalho adicional para construir os pacotes de distribuição.
ru: Нам нужно будет определить два задания для публикации в PyPI и TestPyPI соответственно, а также дополнительное задание для сборки дистрибутива.
ta: முறையே PYPI மற்றும் TestPypi க்கு வெளியிட இரண்டு வேலைகள் மற்றும் விநியோக தொகுப்புகளை உருவாக்க கூடுதல் வேலை ஆகியவற்றை வரையறுக்க வேண்டும்.
