Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The :file:`appveyor.yml` file relies on a single support script, which sets up the environment to use the SDK compiler for 64-bit builds on Python 3.3 and 3.4. For projects which do not need a compiler, or which don't support 3.3 or 3.4 on 64-bit Windows, only the :file:`appveyor.yml` file is needed.
eo: La dosiero :file:`appveyor.yml` dependas de unu helpa programeto, kiu agordas la medion por uzi la SDK-tradukilon por 64-bitaj konstruoj je Python 3.3 kaj 3.4. Tiuj projektoj, kiuj ne bezonas tradukilon aŭ ne subtenas 3.3 aŭ 3.4 sur 64-bita Windows, nur bezonas la dosieron :file:`appveyor.yml`.
ja: :file:`appveyor.yml` ファイルは、Python 3.3 と 3.4 上で 64 ビットでのビルドを行うために SDK のコンパイラを使う環境を構築するためのひとつのサポートスクリプトに依存しています。コンパイラを必要としないプロジェクトや64 ビット版の Windows 上の 3.3 や 3.4 をサポートしないプロジェクトでは、 :file:`appveyor.yml` ファイルさえあれば良いことになります。
pt_br: O arquivo :file:`appveyor.yml` depende de um único script de suporte, que configura o ambiente para usar o compilador SDK para compilações de 64 bits no Python 3.3 e 3.4. Para projetos que não precisam de um compilador, ou que não oferecem suporte a 3.3 ou 3.4 em Windows 64 bits, apenas o arquivo :file:`appveyor.yml` é necessário.
ru: Файл :file:`appveyor.yml` опирается на единственный скрипт поддержки, который настраивает среду для использования компилятора SDK для 64-битных сборок на Python 3.3 и 3.4. Для проектов, которым не нужен компилятор или которые не поддерживают 3.3 или 3.4 на 64-битной Windows, необходим только файл :file:`appveyor.yml`.
ta: தி: கோப்பு: `appveyor.yml` கோப்பு ஒரு உதவி ச்கிரிப்டை நம்பியுள்ளது, இது பைதான் 3.3 மற்றும் 3.4 இல் 64-பிட் கட்டமைப்புகளுக்கு SDK கம்பைலரைப் பயன்படுத்த சூழலை அமைக்கிறது. ஒரு கம்பைலர் தேவையில்லை, அல்லது 64-பிட் சாளரங்களில் 3.3 அல்லது 3.4 ஐ ஆதரிக்காத திட்டங்களுக்கு, மட்டுமே: கோப்பு: `appveyor.yml` கோப்பு தேவை.

source: `build.cmd <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/build.cmd>`__ is a Windows batch script that runs a single command in an environment with the appropriate compiler for the selected Python version. All you need to do is to set the single environment variable ``DISTUTILS_USE_SDK`` to a value of ``1`` and the script does the rest. It sets up the SDK needed for 64-bit builds of Python 3.3 or 3.4, so don't set the environment variable for any other builds.
eo: `build.cmd <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/build.cmd>`__ estas programeto por Windows rulanta unu komandon en medio kun la taŭga tradukilo por la elektita versio de Python. Oni nur bezonas difini la median variablon ``DISTUTILS_USE_SDK`` kiel ``1``, kaj la programeto aŭtomatigas ĉion. Tio starigas la SDK por 64-bita Python 3.3 or 3.4; tial ne difinu la median variablon por alia konstruo.
ja: `build.cmd <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/build.cmd>`__ は、選択されたバージョンの Python 用の適切なコンパイラが存在する環境内で単一のコマンドを実行するような Windows のバッチスクリプトです。やらなければならないことはたった一個の環境変数 ``DISTUTILS_USE_SDK`` の値を ``1`` に設定することだけで、残りはすべてこのスクリプトがやってくれます。スクリプトが Python 3.3 ないし 3.4 を 64 ビットでビルドするのに必要な SDK 環境を構築するので、他のビルドに使う環境変数を設定してはいけません。
pt_br: `build.cmd <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/build.cmd>`__ é um script em lote do Windows que executa um único comando em um ambiente com o compilador apropriado para a versão Python selecionada. Tudo que você precisa fazer é definir a única variável de ambiente ``DISTUTILS_USE_SDK`` para um valor de ``1`` e o script faz o resto. Ele configura o SDK necessário para compilações de 64 bits de Python 3.3 ou 3.4, portanto, não defina a variável de ambiente para quaisquer outras compilações.
ru: ``build.cmd <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/build.cmd>``__ - это пакетный скрипт для Windows, который запускает единственную команду в среде с компилятором, соответствующим выбранной версии Python. Все, что вам нужно сделать, это установить единственную переменную окружения ``DISTUTILS_USE_SDK`` в ``1``, а все остальное сделает скрипт. Он устанавливает SDK, необходимый для 64-битных сборок Python 3.3.3 или 3.4, поэтому не устанавливайте переменную окружения для других сборок.
ta: . தேர்ந்தெடுக்கப்பட்ட பைதான் பதிப்பிற்கு பொருத்தமான தொகுப்பாளருடன் சூழலில் கட்டளையிடவும். நீங்கள் செய்ய வேண்டியதெல்லாம், ஒற்றை சூழல் மாறியை `` Distutils_use_sdk`` `` 1`` மதிப்புக்கு அமைப்பதோடு, மீதமுள்ள ச்கிரிப்ட் செய்கிறது. இது பைதான் 3.3 அல்லது 3.4 இன் 64-பிட் கட்டங்களுக்கு தேவையான SDK ஐ அமைக்கிறது, எனவே வேறு எந்த கட்டமைப்பிற்கும் சூழல் மாறியை அமைக்க வேண்டாம்.

source: You can simply download the batch file and include it in your project unchanged.
eo: Vi povas simple elŝuti la ``cmd``-dosieron kaj senŝanĝe inkluzivi ĝin en vian projekton.
ja: このバッチファイルは単純にダウンロードして修正なしにプロジェクト内に置くことができます。
pt_br: Você pode simplesmente baixar o arquivo em lote e incluí-lo em seu projeto inalterado.
ru: Вы можете просто загрузить пакетный файл и включить его в свой проект без изменений.
ta: நீங்கள் வெறுமனே தொகுதி கோப்பை பதிவிறக்கம் செய்து அதை மாற்றாமல் உங்கள் திட்டத்தில் சேர்க்கலாம்.

source: Access to the built wheels
eo: Aliro al la konstruitaj wheel-oj
ja: ビルドされたwheelファイルへのアクセス
pt_br: Acesso aos wheels construídos
ru: Доступ к собранным колёсам
ta: கட்டப்பட்ட சக்கரங்களுக்கான அணுகல்

source: When your build completes, the built wheels will be available from the Appveyor control panel for your project. They can be found by going to the build status page for each build in turn. At the top of the build output there is a series of links, one of which is "Artifacts". That page will include a list of links to the wheels for that Python version / architecture. You can download those wheels and upload them to PyPI as part of your release process.
eo: Post fino de konstruado, la konstruitaj wheel-dosieroj estos haveblaj ĉe la stirpanelo de Appveyor por via projekto. Ili troviĝas ĉe la konstruo-statopaĝo por ĉiu konstruo. Ĉe la supro de la eligaĵo de la konstruo estas hiperligoj, unu el kiuj estas «Artefaktoj». Tiu paĝo inkluzivas hiperligojn al la wheel-oj por la Python-versio kaj arĥikteturo. Vi povas elŝuti tiujn wheel-ojn kaj alŝuti ilin al PyPI dum via eldona procedo.
ja: ビルドが終わると、出来上がった wheel ファイルは Appveyor のコントロールパネルの当該プロジェクトのページから取り出せるでしょう。ビルドのたびに生成されるビルド状況のページからも取り出せます。ビルド結果の出力ページの先頭には一連のリンクがあって、そのうちの "Artifacts" がそれです。そのページに行くと該当するバージョンの Python / アーキテクチャに応じた wheel ファイルへのリンクがあるはずです。ここから wheel ファイルをダウンロードして、あなたのリリース作業の一環として PyPI へアップロードすることができるでしょう。
pt_br: Quando sua construção for concluída, os wheels construídos estarão disponíveis no painel de controle do Appveyor para o seu projeto. Eles podem ser encontrados acessando a página de status de construção de cada construção por vez. No topo da saída de construção, há uma série de links, um dos quais é "Artifacts" (Artefatos). Essa página incluirá uma lista de links para os wheels dessa versão Python / arquitetura. Você pode baixar esses wheels e enviá-los para PyPI como parte de seu processo de lançamento.
ru: Когда сборка завершится, построенные колеса будут доступны в панели управления Appveyor для вашего проекта. Их можно найти, перейдя на страницу состояния сборки для каждой сборки по очереди. В верхней части результатов сборки есть ряд ссылок, одна из которых - "Артефакты". На этой странице будет список ссылок на колеса для данной версии/архитектуры Python. Вы можете скачать эти колеса и загрузить их в PyPI как часть вашего процесса выпуска.
ta: உங்கள் உருவாக்கம் முடிந்ததும், உங்கள் திட்டத்திற்கான AppWayer கட்டுப்பாட்டு குழுவிலிருந்து கட்டப்பட்ட சக்கரங்கள் கிடைக்கும். ஒவ்வொரு கட்டமைப்பிற்கும் உருவாக்க நிலை பக்கத்திற்குச் செல்வதன் மூலம் அவற்றைக் காணலாம். உருவாக்க வெளியீட்டின் உச்சியில் தொடர்ச்சியான இணைப்புகள் உள்ளன, அவற்றில் ஒன்று "கலைப்பொருட்கள்". அந்த பக்கத்தில் அந்த பைதான் பதிப்பு / கட்டிடக்கலைக்கான சக்கரங்களுக்கான இணைப்புகளின் பட்டியல் இருக்கும். உங்கள் வெளியீட்டு செயல்முறையின் ஒரு பகுதியாக அந்த சக்கரங்களை பதிவிறக்கம் செய்து அவற்றை PYPI இல் பதிவேற்றலாம்.

source: Testing with tox
eo: Testado per tox
ja: tox を用いてテストする
pt_br: Testando com tox
ru: Тестирование с помощью tox
ta: டாக்சுடன் சோதனை

source: Many projects use the :doc:`Tox <tox:index>` tool to run their tests. It ensures that tests are run in an isolated environment using the exact files that will be distributed by the project.
eo: Multaj projektoj uzas la ilon :doc:`Tox <tox:index>` por testado. Tio certigas, ke testoj ruliĝu en izolita medio uzante la ekzaktajn dosierojn distribuotajn de la projekto.
ja: 多くのプロジェクトで :doc:`Tox <tox:index>` ツールを用いてテストを行っています。これを使えば、プロジェクトで配布するであろうファイル群そのものを使った独立した環境下でテストを実行することができます。
pt_br: Muitos projetos usam a ferramenta :doc:`Tox <tox:index>` para executar seus testes. Ele garante que os testes sejam executados em um ambiente isolado usando os arquivos exatos que serão distribuídos pelo projeto.
ru: Многие проекты используют инструмент :doc:`Tox <tox:index>` для запуска своих тестов. Он обеспечивает запуск тестов в изолированном окружении с использованием именно тех файлов, которые будут распространяться проектом.
ta: பல திட்டங்கள்: DOC: `TOX <TOX: INDEX>` அவர்களின் சோதனைகளை இயக்க கருவி பயன்படுத்துகின்றன. திட்டத்தால் விநியோகிக்கப்படும் சரியான கோப்புகளைப் பயன்படுத்தி தனிமைப்படுத்தப்பட்ட சூழலில் சோதனைகள் இயக்கப்படுவதை இது உறுதி செய்கிறது.

source: In order to use ``tox`` on Appveyor there are a couple of additional considerations (in actual fact, these issues are not specific to Appveyor, and may well affect other CI systems).
eo: Por uzi ``tox`` sur Appveyor, ekzistas kelkaj pliaj konsideroj (fakte tiaj problemoj ne estas specifaj al Appveyor kaj povas ekzisti en aliaj sistemoj de kontinua integrado).
ja: Appveyor 上で ``tox`` を使うためには、(実際のところは、Appveyor に限ったことではなく、他の CI システムにも影響します) いくつかの追加的な事項を検討しなければなりません。
pt_br: Para usar o ``tox`` no Appveyor, há algumas considerações adicionais (na verdade, esses problemas não são específicos do Appveyor e podem afetar outros sistemas de CI).
ru: Для использования ``tox`` в Appveyor есть пара дополнительных соображений (на самом деле, эти вопросы не относятся к Appveyor и вполне могут затрагивать другие CI-системы).
ta: AppWeyor இல் `` டோக்ச்`` ஐப் பயன்படுத்துவதற்கு இரண்டு கூடுதல் பரிசீலனைகள் உள்ளன (உண்மையில், இந்த சிக்கல்கள் AppWeyor க்கு குறிப்பிட்டவை அல்ல, மேலும் பிற தொஒ அமைப்புகளை பாதிக்கலாம்).

source: By default, ``tox`` only passes a chosen subset of environment variables to the test processes. Because ``distutils`` uses environment variables to control the compiler, this "test isolation" feature will cause the tests to use the wrong compiler by default.
eo: Apriore ``tox`` nur liveras subaron da mediaj variablojn al la testo-procezoj. Ĉar ``distutils`` uzas mediajn variablojn por regi la tradukilon, tia «testo-izolanta» funkcio kaŭzos miselektadon de tradukilo en testo.
ja: デフォルトでは ``tox`` は、環境変数のうちのいくつかの選択されたサブセットだけをテストプロセスに渡します。 ``distutils`` がコンパイラを制御するのに環境変数を用いるので、この "テスト環境分離" の機能がデフォルトではテストに誤ったコンパイラを使ってしまう問題を引き起こすでしょう。
pt_br: Por padrão, ``tox`` apenas passa um subconjunto escolhido de variáveis de ambiente para os processos de teste. Como ``distutils`` usa variáveis de ambiente para controlar o compilador, este recurso de "isolamento de teste" fará com que os testes usem o compilador errado por padrão.
ru: По умолчанию ``tox`` передает тестовым процессам только выбранное подмножество переменных окружения. Поскольку ``distutils`` использует переменные окружения для управления компилятором, эта функция "изоляции тестов" приведет к тому, что тесты по умолчанию будут использовать неправильный компилятор.
ta: இயல்பாக, `` டோக்ச்`` சோதனை செயல்முறைகளுக்கு சுற்றுச்சூழல் மாறிகளின் தேர்ந்தெடுக்கப்பட்ட துணைக்குழுவை மட்டுமே அனுப்புகிறது. கம்பைலரைக் கட்டுப்படுத்த `` டிச்ட்டில்ச்`` சுற்றுச்சூழல் மாறிகளைப் பயன்படுத்துவதால், இந்த "சோதனை தனிமைப்படுத்தல்" நற்பொருத்தம் சோதனைகள் இயல்புநிலையாக தவறான தொகுப்பைப் பயன்படுத்தும்.

source: To force ``tox`` to pass the necessary environment variables to the subprocess, you need to set the ``tox`` configuration option ``passenv`` to list the additional environment variables to be passed to the subprocess. For the SDK compilers, you need
eo: Por devigi ``tox`` pasi la necesajn mediajn variablojn al subprocezo, oni devas agordi la opcion ``passenv`` de ``tox`` inkluzivante la necesajn mediajn variablojn liverotajn al subprocezo. Por la SDK-tradukilo, oni uzas la jenon:
ja: ``tox`` がサブプロセスに必要な環境変数を渡すように強制するためには、 ``tox`` の設定オプションである ``passenv`` に追加的にサブプロセスに渡すべき環境変数のリストを設定する必要があります。SDK コンパイラを使うのであれば、このような設定が必要です
pt_br: Para forçar o ``tox`` passar as variáveis de ambiente necessárias para o subprocesso, você precisa definir a opção de configuração ``passenv`` do ``tox`` para listar as variáveis de ambiente adicionais a serem passadas para o subprocesso. Para os compiladores SDK, você precisa
ru: Чтобы заставить ``tox`` передавать подпроцессу необходимые переменные окружения, нужно установить в конфигурационной опции ``tox`` ``passenv`` список дополнительных переменных окружения, которые нужно передать подпроцессу. Для компиляторов SDK необходимо
ta: தேவையான சுற்றுச்சூழல் மாறிகளை துணை செயலாக்கத்திற்கு அனுப்ப `` டோக்ச்`` கட்டாயப்படுத்த, துணை செயலாக்கத்திற்கு அனுப்பப்பட வேண்டிய கூடுதல் சுற்றுச்சூழல் மாறிகள் பட்டியலிட `` டோக்ச்` உள்ளமைவு விருப்பத்தை `` பயணிகள்`` அமைக்க வேண்டும். SDK கம்பைலர்களுக்கு, உங்களுக்கு தேவை

source: ``INCLUDE``
ta: `` சேர்க்கவும்``

source: ``LIB``
ta: `` லிப்``

source: The ``passenv`` option can be set in your :file:`tox.ini`, or if you prefer to avoid adding Windows-specific settings to your general project files, it can be set by setting the ``TOX_TESTENV_PASSENV`` environment variable. The supplied :file:`build.cmd` script does this by default whenever ``DISTUTILS_USE_SDK`` is set.
eo: La opcio ``passenv`` estas agordebla en :file:`tox.ini`, aŭ (se oni preferas ne inkluzivi Windows-specifajn agordojn en ĝeneralaj projektaj dosieroj) per la media variablo ``TOX_TESTENV_PASSENV``. La provizita programeto :file:`build.cmd` faras tion implicite, se ``DISTUTILS_USE_SDK`` ekzistas.
ja: ``passenv`` オプションは、 :file:`tox.ini` ファイルでも設定可能で、あるいは、Windows 特有の設定をプロジェクト全体のファイル群に追加したくなければ ``TOX_TESTENV_PASSENV`` 環境変数でも設定できます。 ``DISTUTILS_USE_SDK`` が設定されていればいつでも、与えられた :file:`build.cmd` スクリプトがこの動作をデフォルトで実行します。
pt_br: A opção ``passenv`` pode ser definida em seu :file:`tox.ini`, ou se você preferir evitar adicionar configurações específicas do Windows aos seus arquivos de projeto gerais, pode ser definida configurando a variável de ambiente ``TOX_TESTENV_PASSENV``. O script :file:`build.cmd` fornecido faz isso por padrão sempre que ``DISTUTILS_USE_SDK`` é definida.
ru: Опция ``passenv`` может быть задана в вашем :file:`tox.ini`, или, если вы предпочитаете не добавлять специфические для Windows настройки в общие файлы проекта, ее можно задать, установив переменную окружения ``TOX_TESTENV_PASSENV``. Поставляемый в комплекте скрипт :file:`build.cmd` делает это по умолчанию, когда установлено значение ``DISTUTILS_USE_SDK``.
ta: `` பயணிகள்`` விருப்பத்தை உங்கள்: கோப்பில் அமைக்கலாம்: `Tox.ini`, அல்லது உங்கள் பொதுவான திட்டக் கோப்புகளில் விண்டோச்-குறிப்பிட்ட அமைப்புகளைச் சேர்ப்பதைத் தவிர்க்க விரும்பினால்,` `Tox_testenv_passenv`` சுற்றுச்சூழல் மாறி. வழங்கப்பட்ட: கோப்பு: `` `` `distutils_use_sdk`` அமைக்கும்போதெல்லாம் இயல்புநிலையாக இதைச் செய்கிறது.

source: When used interactively, ``tox`` allows you to run your tests against multiple environments (often, this means multiple Python versions). This feature is not as useful in a CI environment like Travis or Appveyor, where all tests are run in isolated environments for each configuration. As a result, projects often supply an argument ``-e ENVNAME`` to ``tox`` to specify which environment to use (there are default environments for most versions of Python).
eo: Dum interaga uzado, `` tokso`` ebligas ruli testojn en pluraj medioj (ofte, inkluzive de pluraj versioj de Python). Tiu funkcio ne tre utilas en medio de kontinua integrado kiel Travis aŭ Appveyor, je kio ĉiuj testoj ruliĝas en izolita medio por ĉiu agordo. Tial, projekto ofte donas argumenton ``-e MEDIO`` al ``tox`` por specifi la uzotan medion (ekzistas aprioraj medioj por la plejparto de versioj de Python).
ja: ``tox`` を対話的に使うと、複数の環境 (これはしばしば複数のバージョンの Python を意味します) でテストを実行することができます。設定ごとに独立した環境ですべてのテストを実行する Travis や Appveyor のような CI 環境で見られるほどには、この機能は有用ではありません。結果として、しばしばプロジェクト側から ``-e ENVNAME`` 引数を ``tox`` に与えてどの環境を使うべきか (ほとんどのバージョンの Python に対応したデフォルトの環境群があります) を指定します。
pt_br: Quando usado interativamente, ``tox`` permite que você execute seus testes em vários ambientes (frequentemente, isso significa várias versões do Python). Este recurso não é tão útil em um ambiente de CI como Travis ou Appveyor, onde todos os testes são executados em ambientes isolados para cada configuração. Como resultado, os projetos geralmente fornecem um argumento ``-e NOMEENV`` para ``tox`` para especificar qual ambiente usar (há ambientes padrão para a maioria das versões do Python).
ru: При интерактивном использовании ``tox`` позволяет запускать тесты в нескольких окружениях (часто это означает несколько версий Python). Эта возможность не так полезна в среде CI, такой как Travis или Appveyor, где все тесты запускаются в изолированных окружениях для каждой конфигурации. В результате проекты часто передают аргумент ``-e ENVNAME`` в ``tox``, чтобы указать, какое окружение использовать (есть окружения по умолчанию для большинства версий Python).
ta: ஊடாடும் வகையில் பயன்படுத்தும்போது, `` டோக்ச்`` பல சூழல்களுக்கு எதிராக உங்கள் சோதனைகளை இயக்க உங்களை அனுமதிக்கிறது (பெரும்பாலும், இதன் பொருள் பல பைதான் பதிப்புகள்). டிராவிச் அல்லது ஆப்சியர் போன்ற தொஒ சூழலில் இந்த நற்பொருத்தம் பயனுள்ளதாக இருக்காது, அங்கு அனைத்து சோதனைகளும் ஒவ்வொரு உள்ளமைவுக்கும் தனிமைப்படுத்தப்பட்ட சூழல்களில் இயக்கப்படுகின்றன. இதன் விளைவாக, எந்த சூழலைப் பயன்படுத்த வேண்டும் என்பதைக் குறிப்பிடுவதற்கு திட்டங்கள் பெரும்பாலும் `` -e envname`` க்கு `` டோக்ச்`` க்கு வழங்குகின்றன (பைத்தானின் பெரும்பாலான பதிப்புகளுக்கு இயல்புநிலை சூழல்கள் உள்ளன).

source: However, this does *not* work well with a Windows CI system like Appveyor, where there are (for example) two installations of Python 3.4 (32-bit and 64-bit) available, but only one ``py34`` environment in ``tox``.
eo: Tamen, tio *ne* funkcias bone kun sistemo de kontinua integrado por Windows, kiel ekzemple Appveyor, en kiu ekzistas du instaloj de Python 3.4 (32-bita kaj 64-bita), sed nur unu medio ``py34`` en ``tox``.
ja: しかしながら、このやり方は、 Appveyor のような Windows 上の CI システムでは (例えば) Python 3.4 の (32 版ビットと64ビット版の) ふたつの実装が利用できるのに、 ``tox`` では ``py34`` 環境がひとつしかないので、うまく動きません。
pt_br: No entanto, isso *não* funciona bem com um sistema de CI no Windows como o Appveyor, onde há (por exemplo) duas instalações de Python 3.4 (32 bits e 64 bits) disponíveis, mas apenas um ambiente ``py34`` no ``tox``.
ru: Однако это *не* хорошо работает с системой Windows CI, такой как Appveyor, где (например) доступны две установки Python 3.4 (32-битная и 64-битная), но только одно окружение ``py34`` в ``tox``.
ta: இருப்பினும், இது APPWEYOR போன்ற சாளரங்கள் தொஒ அமைப்புடன் நன்றாக வேலை செய்யாது, அங்கு பைதான் 3.4 (32-பிட் மற்றும் 64-பிட்) இரண்டு நிறுவல்கள் உள்ளன, ஆனால் ஒரு `` py34`` சூழல் மட்டுமே `` டாக்ச்``.

source: In order to run tests using ``tox``, therefore, projects should probably use the default ``py`` environment in ``tox``, which uses the Python interpreter that was used to run ``tox``. This will ensure that when Appveyor runs the tests, they will be run with the configured interpreter.
eo: Por ruli testojn per ``tox``, tial, projekto uzu la aprioran medion ``py`` en ``tox``, kiu uzas la Python-interpretilon interpretantan ``tox``. Tio certigas, ke kiam Appveyor rulos testojn, ilin interpretos la agordita interpretilo.
ja: ``tox`` を使ってテストを実行するためには、したがって、プロジェクトがおそらくは ``tox`` のデフォルトの ``py`` 環境、ここでは ``tox`` を実行するために使われた Python インタープリタを使うことになりますが、その環境を使うべきでしょう。
pt_br: Para executar testes usando o ``tox``, portanto, os projetos provavelmente devem usar o ambiente padrão ``py`` no ``tox``, que usa o interpretador Python que foi usado para executar ``tox`` . Isso garantirá que, quando o Appveyor executar os testes, eles serão executados com o interpretador configurado.
ru: Поэтому для запуска тестов с помощью ``tox`` проектам, вероятно, следует использовать стандартное окружение ``py`` в ``tox``, которое использует интерпретатор Python, использовавшийся для запуска ``tox``. Это гарантирует, что когда Appveyor запустит тесты, они будут запущены с настроенным интерпретатором.
ta: எனவே, `` டோக்ச்`` ஐப் பயன்படுத்தி சோதனைகளை இயக்குவதற்கு, திட்டங்கள் இயல்புநிலை `` பை`` சூழலை `` டோக்ச்`` இல் பயன்படுத்த வேண்டும், இது பைதான் மொழிபெயர்ப்பாளரைப் பயன்படுத்துகிறது, இது `` டாக்ச்`` ஐ இயக்க பயன்படுத்தப்பட்டது. AppWeyor சோதனைகளை இயக்கும்போது, அவை உள்ளமைக்கப்பட்ட மொழிபெயர்ப்பாளருடன் இயக்கப்படும் என்பதை இது உறுதி செய்யும்.

source: In order to support running under the ``py`` environment, it is possible that projects with complex ``tox`` configurations might need to modify their :file:`tox.ini` file. Doing so is, however, outside the scope of this document.
eo: Por subteni ruladon en la medio ``py``, projekto de komplika agordo por ``tox`` eble devas modifi la dosieron :file:`tox.ini`. Tio, tamen, estas ekster la temo de ĉi tiu dokumento.
ja: ``py`` 環境下での動作をサポートするためには、複雑な ``tox`` 設定を持つプロジェクトでは :file:`tox.ini` を修正する必要があるかもしれません。そのようにすることは、しかしながら、この文書の範囲を越えます。
pt_br: Para oferecer suporte à execução no ambiente ``py``, é possível que projetos com configurações complexas de ``tox`` precisem modificar seu arquivo :file:`tox.ini`. Fazer isso está, no entanto, fora do escopo deste documento.
ru: Для поддержки работы в среде ``py``, возможно, проектам со сложной конфигурацией ``tox`` потребуется изменить свой файл :file:`tox.ini`. Однако это выходит за рамки данного документа.
ta: `` பை`` சூழலின் கீழ் இயங்குவதை ஆதரிக்க, சிக்கலான `` டோக்ச்`` உள்ளமைவுகளைக் கொண்ட திட்டங்கள் அவற்றின்: கோப்பு: `Tox.ini` கோப்பை மாற்ற வேண்டியிருக்கலாம். இருப்பினும், அவ்வாறு செய்வது இந்த ஆவணத்தின் எல்லைக்கு வெளியே உள்ளது.

source: Automatically uploading wheels
eo: Aŭtomate elŝuti wheel
ja: 自動的に wheel ファイルをアップロードする
pt_br: Enviando automaticamente wheels
ru: Автоматическая загрузка колёс
ta: தானாகவே சக்கரங்களை பதிவேற்றும்

source: It is possible to request Appveyor to automatically upload wheels. There is a ``deployment`` step available in :file:`appveyor.yml` that can be used to (for example) copy the built artifacts to a FTP site, or an Amazon S3 instance. Documentation on how to do this is included in the Appveyor guides.
ja: Appveyor に自動的に wheel ファイルをアップロードさせることができます。 :file:`appveyor.yml` ファイルの中に ``deployment`` 段階があって、(例えば) ビルドした生成物を FTP サイトや Amazon S3 インスタンスへコピーするために使うことができます。これをやるにはどうすれば良いかについては、 Appveyor ガイドに説明があります。
pt_br: É possível solicitar que o Appveyor envie automaticamente os wheels. Há uma etapa ``deployment`` disponível no :file:`appveyor.yml` que pode ser usada para, por exemplo, copiar os artefatos construídos para um site FTP ou uma instância do Amazon S3. A documentação sobre como fazer isso está incluída nos guias do Appveyor.
ru: Можно попросить Appveyor автоматически загружать колеса. В :file:`appveyor.yml` есть шаг ``развертывания``, который можно использовать, чтобы (например) скопировать собранные артефакты на FTP-сайт или в экземпляр Amazon S3. Документация о том, как это сделать, включена в руководства по Appveyor.
ta: சக்கரங்களை தானாக பதிவேற்ற AppWeyor ஐக் கோர முடியும். ஒரு `` வரிசைப்படுத்தல்`` படி கிடைக்கிறது: கோப்பு: `appveyor.yml` இது பயன்படுத்தப்படலாம் (எடுத்துக்காட்டாக) கட்டமைக்கப்பட்ட கலைப்பொருட்களை ஒரு FTP தளத்திற்கு நகலெடுக்கவும் அல்லது அமேசான் S3 உதாரணமாகவோ. இதை எப்படி செய்வது என்பது குறித்த ஆவணங்கள் AppWayer வழிகாட்டிகளில் சேர்க்கப்பட்டுள்ளன.
