Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: One recommended, simple, and straightforward method of building :term:`source distributions <Source Distribution (or "sdist")>` and :term:`wheels <Wheel>` is to use the :ref:`build` tool with a command like ``python -m build`` which triggers the generation of both distribution formats. If necessary the ``--sdist`` and ``--wheel`` options can be used to generate only one or the other. Note that the build tool needs to be installed separately.
eo: Unu rekomendata kaj simpla metodo por konstrui :term:`fontan distribuon <Source Distribution (or "sdist")>` kaj :term:`wheel <Wheel>` estas uzi la ilon :ref:`build` kun komando kiel ``python -m build``, kiu generas ambaŭ distribuajn formojn. Laŭbezone oni povas uzi la flagojn ``--sdist`` kaj ``--wheel`` por nur generi unu aŭ la alian. Notu, ke la ilo ``build`` devas esti aparte instalita.
ja: :term:`ソースコード配布物 <Source Distribution (or "sdist")>` および :term:`wheels <Wheel>` をビルドする方法で推奨されていて単純かつ直截なひとつのやり方は、 :ref:`build` ツールを ``python -m build`` のようなコマンドから使って両方の配布物フォーマットの生成を開始することです。いずれか片方の配布物だけを生成するのであれば、必要に応じて ``--sdist`` や ``--wheel`` のオプションを使うことができます。build ツールは個別にインストールする必要があることに注意してください。
pt_br: Um método recomendado, simples e direto para construir :term:`distribuições fonte <Source Distribution (or "sdist")>` e :term:`wheels <Wheel>` é usar a ferramenta :ref:`build` com um comando como ``python -m build``, que aciona a geração de ambos os formatos de distribuição. Se necessário, as opções ``--sdist`` e ``--wheel`` podem ser usadas para gerar apenas um ou outro. Observe que a ferramenta de construção precisa ser instalada separadamente.
ru: Один из рекомендуемых, простых и понятных методов сборки :term:`source дистрибутивов <Source Distribution (или "sdist")>` и :term:`wheels <Wheel>` заключается в использовании инструмента :ref:`build` с командой типа ``python -m build``, которая запускает генерацию обоих форматов дистрибутивов. При необходимости опции ``--sdist`` и ``--wheel`` могут быть использованы для генерации только одного или другого. Обратите внимание, что инструмент сборки должен быть установлен отдельно.
ta: ஒரு பரிந்துரைக்கப்பட்ட, எளிமையான மற்றும் நேரடியான கட்டிடம்: கால: `மூல வழங்கல் <மூல வழங்கல் (அல்லது" SDIST ")>` மற்றும்: கால: `சக்கரங்கள் <shewel>` பயன்படுத்த வேண்டும்: ref: `உருவாக்கு` கருவி a `` பைதான் -எம் பில்ட்` போன்ற கட்டளை இரண்டு விநியோக வடிவங்களின் தலைமுறையையும் தூண்டுகிறது. தேவைப்பட்டால் ``--ச்டிச்ட்`` மற்றும் ``-வீல்`` விருப்பங்கள் ஒன்று அல்லது மற்றொன்றை மட்டுமே உருவாக்க பயன்படுத்தப்படலாம். உருவாக்க கருவி தனித்தனியாக நிறுவப்பட வேண்டும் என்பதை நினைவில் கொள்க.

source: The command ``python setup.py install`` was deprecated in setuptools version *58.3.0*.
eo: La komando ``python setup.py install`` evitindiĝis en setuptools versio *58.3.0*.
ja: コマンド ``python setup.py install`` は、setuptools のバージョン *58.3.0* で非推奨になりました。
pt_br: O comando ``python setup.py install`` foi descontinuado na versão *58.3.0* do setuptools.
ru: Команда ``python setup.pyinstall`` была обесценена в setuptools версии *58.3.0*.
ta: `` பைதான் அமைவு.

source: What about other commands?
eo: Kio pri aliaj komandoj?
ja: 他のコマンドについてはどうでしょうか？
pt_br: E quanto a outros comandos?
ru: Как насчет других команд?
ta: மற்ற கட்டளைகளைப் பற்றி என்ன?

source: What are some replacements for the other ``python setup.py`` commands?
eo: Kiuj estas anstataŭaĵoj por la aliaj komandoj ``python setup.py``?
ja: 他の ``python setup.py`` コマンドを置き換えるものは何でしょうか？
pt_br: Quais são algumas substituições para os outros comandos ``python setup.py``?
ru: Каковы некоторые замены для других команд ``python setup.py``?
ta: மற்ற `` பைதான் அமைவு.பை`` கட்டளைகளுக்கு சில மாற்றீடுகள் யாவை?

source: ``python setup.py test``
ta: `` பைதான் setup.py test``

source: The recommendation is to use a test runner such as pytest_.
eo: Ni rekomendas uzi testilon kiel pytest_.
ja: 推奨されるものは、pytest_ のようなテストランナーを使うことです。
pt_br: A recomendação é usar um executor de testes como pytest_.
ru: Рекомендация заключается в использовании тестового бегуна, такого как pytest_.
ta: Pytest_ போன்ற சோதனை ரன்னரைப் பயன்படுத்த வேண்டும் என்று பரிந்துரை.

source: ``python setup.py check``, ``python setup.py register``, and ``python setup.py upload``
eo: ``python setup.py check``, ``python setup.py register``, kaj ``python setup.py upload``
ja: ``python setup.py check``, ``python setup.py register``, および ``python setup.py upload``
pt_br: ``python setup.py check``, ``python setup.py register`` e ``python setup.py upload``
ru: ``python setup.py check``, ``python setup.py register`` и ``python setup.py upload``
ta: `` பைதான் அமைவு.

source: A trusted replacement is :ref:`twine`:
eo: Fidinda anstataŭaĵo estas :ref:`twine`:
ja: 信頼されている代替物は :ref:`twine` です:
pt_br: Um substituto confiável é :ref:`twine`:
ru: Доверенная замена:ref:`twine':
ta: நம்பகமான மாற்றீடு: ref: `ட்வைன்`:

source: ``python -m twine check --strict dist/*``
ta: `` பைதான் -எம் கயிறு காசோலை - -ச்ட்ரிக்ட் டிச்ட்/*``

source: ``python -m twine register dist/*.whl`` [#not-pypi]_
ta: `` பைதான் -எம் ட்வைன் பதிவு Dist/*.

source: ``python -m twine upload dist/*``
ta: `` பைதான் -எம் கயிறு பதிவேற்றியது dist/*``

source: Not necessary, nor supported on :term:`PyPI <Python Package Index (PyPI)>`. But might be necessary on other :term:`package indexes <package index>` (for example :ref:`devpi`).
eo: Ne necesa nek subtenata ĉe :term:`PyPI <Python Package Index (PyPI)>`. Tamen ĝi eble necesas ĉe aliaj :term:`pakindeksoj <package index>` (ekzemple :ref:`devpi`).
ja: 必ずしもそうではなく、 :term:`PyPI <Python Package Index (PyPI)>` でもサポートされていません。しかし、(例えば :ref:`devpi` のような) 他の :term:`パッケージインデックス <package index>` では必要になるかもしれません。
pt_br: Não é necessário, nem suportado em :term:`PyPI <Python Package Index (PyPI)>`. Mas pode ser necessário em outros :term:`índices de pacotes <package index>` (por exemplo, :ref:`devpi`).
ru: Не требуется и не поддерживается на:term:`PyPI <Python Package Index (PyPI)>`. Но может потребоваться и в других :термин:`package index>` (например:ref:`devpi`).
ta: தேவையில்லை, அல்லது ஆதரிக்கப்படவில்லை: கால: `பைபி <பைதான் தொகுப்பு அட்டவணை (பைபி)>`. ஆனால் மற்றவற்றில் அவசியமாக இருக்கலாம்: கால: `தொகுப்பு குறியீடுகள் <தொகுப்பு குறியீட்டு>` (எடுத்துக்காட்டாக: குறிப்பு: `தேவ்பி`).

source: ``python setup.py --version``
ta: `` பைதான் setup.py --version``

source: A possible replacement solution (among others) is to rely on setuptools-scm_:
eo: Ebla solvo (interalie) estas anstataŭe uzi setuptools-scm_:
ja: 実行可能な代替案は (他にもありますが) setuptools-scm_ に頼ることでしょう:
pt_br: Uma possível solução de substituição (entre outras) é contar com setuptools-scm_:
ru: Возможное заменяющее решение (среди прочих) - полагаться на setuptools-scm_:
ta: சாத்தியமான மாற்று தீர்வு (மற்றவற்றுடன்) Setuptools-SCM_ ஐ நம்புவதாகும்:

source: ``python -m setuptools_scm``
ta: `` பைதான் -எம் செட்டப்டூல்ச்_எச்சிஎம்``

source: Remaining commands
eo: Aliaj komandoj
ja: 残りのコマンド群
pt_br: Comandos restantes
ru: Оставшиеся команды
ta: மீதமுள்ள கட்டளைகள்

source: This guide does not make suggestions of replacement solutions for those commands:
eo: Ĉi tiu gvidilo ne sugestas anstataŭaĵojn por la ĉi-subaj komandoj:
ja: このガイド文書では、それらコマンド群の代替案について示唆しません:
pt_br: Este guia não faz sugestões de soluções de substituição para esses comandos:
ru: В настоящем руководстве не предлагаются решения для замены этих команд:
ta: இந்த வழிகாட்டி அந்த கட்டளைகளுக்கு மாற்று தீர்வுகளின் பரிந்துரைகளை வழங்காது:

source: ``alias``
ta: `` மாற்றுப்பெயர்``

source: ``build``
ta: `` பில்ட்``

source: ``clean``
ta: `` சுத்தம்`

source: ``easy_install``
ta: `` ஈசி_இன்ச்டால்``

source: ``editable_wheel``
ta: `` எடிபிள்_வீல்``

source: ``egg_info``
ta: `` முட்டை_இன்ஃபோ``

source: ``rotate``
ta: `` சுழற்றுங்கள்``

source: ``saveopts``
ta: `` சேமிஆப்ச்``

source: ``setopt``
ta: `` Setoptt "`

source: ``upload_docs``
ta: `` பதிவேற்றம்_டாக்ச்``

source: What about custom commands?
eo: Kio pri propraj komandoj?
ja: カスタムコマンドについてはどうでしょうか？
pt_br: E quanto aos comandos personalizados?
ru: Что насчет пользовательских команд?
ta: தனிப்பயன் கட்டளைகள் பற்றி என்ன?

source: Likewise, custom :file:`setup.py` commands are deprecated. The recommendation is to migrate those custom commands to a task runner tool or any other similar tool. Some examples of such tools are: chuy, make, nox or tox, pydoit, pyinvoke, taskipy, and thx.
eo: Same, propra :file:`setup.py`-komando estas evitinda. Ni rekomendas migri tiajn proprajn komandojn al tasko-rulilo aŭ io simila. Jen kelkaj tiaj iloj: chuy, make, nox aŭ tox, pydoit, pyinvoke, taskipy, kaj thx.
ja: 同様に、カスタムコマンドの :file:`setup.py` も非推奨になっています。そのようなカスタムコマンドについては、タスクランナーツールか他の類似ツールに移植することをお勧めします。そのようなツールの例を挙げれば: chuy、 make、 nox もしくは tox、 pydoit、 pyinvoke、 taskipy、 そして thx。
pt_br: Da mesma forma, os comandos personalizados no :file:`setup.py` foram descontinuados. A recomendação é migrar esses comandos personalizados para uma ferramenta executora de tarefas ou qualquer outra ferramenta semelhante. Alguns exemplos de tais ferramentas são: chuy, make, nox ou tox, pydoit, pyinvoke, taskipy e thx.
ru: Аналогично, пользовательские :file:`setup.py' команды депрецируются. Рекомендация состоит в том, чтобы перенести эти пользовательские команды на инструмент для выполнения задач или любой другой аналогичный инструмент. Некоторые примеры таких инструментов: chuy, make, nox или tox, pydoit, pyinvoke, taskipy и thx.
ta: அதேபோல், தனிப்பயன்: கோப்பு: `setup.py` கட்டளைகள் நீக்கப்படுகின்றன. அந்த தனிப்பயன் கட்டளைகளை ஒரு பணி ரன்னர் கருவி அல்லது வேறு எந்த இதே போன்ற கருவிக்கு மாற்றுவதே பரிந்துரை. அத்தகைய கருவிகளின் சில எடுத்துக்காட்டுகள்: சூய், மேக், நோக்ச் அல்லது டாக்ச், பைடோயிட், பைன்வோக், டாச்கிபி மற்றும் Thx.

source: What about custom build steps?
eo: Kio pri propraj konstruaj paŝoj?
ja: カスタムビルドステップについてはどうでしょうか？
pt_br: E quanto às etapas personalizadas de construção?
ru: Как насчет пользовательских шагов?
ta: தனிப்பயன் உருவாக்க படிகள் பற்றி என்ன?

source: Custom build steps that for example either overwrite existing steps such as ``build_py``, ``build_ext``, and ``bdist_wheel`` or add new build steps are not deprecated. Those will be automatically called as expected.
eo: Ne evitindaj estas propraj konstrupaŝoj, kiuj ekzemple aŭ anstataŭigas ekzistantaj paŝojn kiel ``build_py``, ``build_ext`` kaj ``bdist_wheel``, aŭ aldonas novajn konstrupaŝojn. Tiuj estos aŭtomate alvokitaj.
ja: 例えば、 ``build_py`` 、 ``build_ext`` や ``bdist_wheel`` のように既存のステップを上書きしたり新しいビルドステップを追加したりするカスタムビルドステップは、非推奨にはなっていません。そのようなステップは期待通りに自動的に呼び出されるでしょう。
pt_br: Etapas personalizadas de construção que, por exemplo, sobrescrevem etapas existentes como ``build_py``, ``build_ext`` e ``bdist_wheel`` ou adicionam novas etapas de compilação não foram descontinuadas. Eles serão chamados automaticamente conforme o esperado.
ru: Настроить шаги, которые, например, либо переписать существующие шаги, такие как ``build_py``, ``build_ext`` и ``bdist_wheel`` или добавить новые шаги сборки, не обесцениваются. Они будут автоматически называться, как и ожидалось.
ta: தனிப்பயன் உருவாக்க படிகள் எடுத்துக்காட்டாக, `` `பில்ட்_பி``,` `பில்ட்_எக்ச்ட்``, மற்றும்` `bdist_wheel`` போன்ற படிகளை மேலெழுதும் அல்லது புதிய உருவாக்க படிகளைச் சேர்க்காது. அவை தானாகவே எதிர்பார்த்தபடி அழைக்கப்படும்.

source: Should ``setup.py`` be deleted?
eo: Ĉu forviŝi ``setup.py``?
ja: ``setup.py`` は削除されるべきですか？
pt_br: Deve o ``setup.py`` ser excluído?
ru: Следует ли исключить ``setup.py``?
ta: `` Setup.py`` நீக்கப்பட வேண்டுமா?

source: Although the usage of :file:`setup.py` as an executable script is deprecated, its usage as a configuration file for setuptools is absolutely fine. There is likely no modification needed in :file:`setup.py`.
eo: Kvankam la uzado de :file:`setup.py` kiel ruleblaĵo estas evitinda, ĝia uzado kiel agorda dosiero por setuptools estas absolute bona. Probable neniu modifo necesas pri :file:`setup.py`.
ja: :file:`setup.py` を実行可能なスクリプトとして使うことは非推奨になりましたが、しかし、setuptools に対する設定ファイルとして使うことは完全に正当です。:file:`setup.py` を修正する必要はないでしょう。
pt_br: Embora o uso de :file:`setup.py` como um script executável tenha sido descontinuado, seu uso como um arquivo de configuração para setuptools é absolutamente aceitável. Provavelmente não há necessidade de modificação em :file:`setup.py`.
ru: Хотя использование :file:`setup.py' в качестве исполняемого скрипта депрецируется, его использование в качестве файла конфигурации для setuptools абсолютно нормально. :file:`setup.py`, вероятно, не требуется никаких изменений.
ta: இதன் பயன்பாடு: கோப்பு: `setup.py` ஒரு இயங்கக்கூடிய ச்கிரிப்டாக நீக்கப்பட்டாலும், செட்டுப்டூல்களுக்கான உள்ளமைவு கோப்பாக அதன் பயன்பாடு முற்றிலும் நன்றாக உள்ளது. இதில் எந்த மாற்றமும் தேவையில்லை: கோப்பு: `setup.py`.

source: Is ``pyproject.toml`` mandatory?
eo: Ĉu ``pyproject.toml`` estas deviga?
ja: ``pyproject.toml`` は必須ですか？
pt_br: ``pyproject.toml`` é obrigatório?
ru: Является ли ``pyproject.toml`` обязательным?
ta: `` Pyproject.toml`` கட்டாயமா?

source: While it is not technically necessary yet, it is **STRONGLY RECOMMENDED** for a project to have a :file:`pyproject.toml` file at the root of its source tree with a content like this:
eo: Kvankam ĝi ankoraŭ ne absolute necesas, estas **REKOMENDEGATA** havi dosieron :file:`pyproject.toml` ĉe la radiko de fontarbo de projekto, kies enhavo estas jena:
ja: 技術的には無くてはならないというわけではありませんが、プロジェクトがそのソースコードツリーのルート部分に :file:`pyproject.toml` ファイルを持つことは **強く推奨** されています:
pt_br: Embora ainda não seja tecnicamente necessário, é **FORTEMENTE RECOMENDADO** que um projeto tenha um arquivo :file:`pyproject.toml` na raiz de sua árvore de fontes com um conteúdo como este:
ru: Хотя это еще не технически необходимо, это **STRONGLY RECOMMENDED** для проекта иметь :file:`pyproject. toml' файл в корне своего исходного дерева с таким контентом:
ta: இது தொழில்நுட்ப ரீதியாக இன்னும் அவசியமில்லை என்றாலும், ஒரு திட்டத்தை ஒரு திட்டத்தை வைத்திருப்பது ** ** ** ** ஒரு: கோப்பு: `pyproject.toml` கோப்பு அதன் மூல மரத்தின் மூலத்தில் இது போன்ற உள்ளடக்கத்துடன்:

source: The guide :ref:`modernize-setup-py-project` has more details about this.
eo: La gvidilo :ref:`modernize-setup-py-project` havas pliajn detalojn pri tio.
ja: これについては、説明文書の :ref:`setup.py 近代化プロジェクト <modernize-setup-py-project>` にもっと詳しい説明があります。
pt_br: O guia :ref:`modernize-setup-py-project` tem mais detalhes sobre isso.
ru: Руководство:ref: " Modernize-setup-py-project " имеет больше деталей об этом.
ta: வழிகாட்டி: ref: `நவீனமயமாக்கல்-செட்டப்-ப்-திட்டத்தை 'இது குறித்த கூடுதல் விவரங்கள் உள்ளன.

source: The standard fallback behavior for a :term:`build frontend <Build Frontend>` in the absence of a :file:`pyproject.toml` file and its ``[build-system]`` table is to assume that the :term:`build backend <Build Backend>` is setuptools.
eo: La norma implicita konduto de :term:`konstrua fasado <Build Frontend>`, se dosiero :file:`pyproject.toml` kaj ĝia tabelo ``[build-system]`` mankas, estas supozi, ke :term:`la konstrua malfasado <Build Backend>` estas setuptools.
ja: :file:`pyproject.toml` ファイルとその ``[build-system]`` テーブルが存在しない場合、 :term:`ビルドフロントエンド <Build Frontend>` にとって標準的なフォールバックの振る舞いは、 :term:`ビルドバックエンド <Build Backend>` が setuptools であると仮定することです。
pt_br: O comportamento de fallback padrão para um :term:`frontend de construção <Build Frontend>` na ausência de um arquivo :file:`pyproject.toml` e sua tabela ``[build-system]`` é assumir que o :term:`backend de construção <Build Backend>` é o setuptools.
ru: Стандартное обратное поведение для :term:`build frontend <Build Frontend>` в отсутствие :file:`pyproject.toml' файла и его ``[build-system]`` таблица предполагает, что :term:`build backend <Build Backend>` является setuptools.
ta: ஒரு: காலத்திற்கான நிலையான குறைவடையும் நடத்தை: `பில்ட் ஃபிரான்டென்ட் <பில்ட் ஃபிரான்டெண்ட்>` ஒரு: கோப்பு: `pyproject.toml` கோப்பு மற்றும் அதன்` `[பில்ட்-சிச்டம்]` `அட்டவணை என்று கருதுவது: காலமானது : `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>` என்பது setuptools.

source: Why? What does it all mean?
eo: Kial? Kio tio signifas?
ja: どうして？一体全体どういうこと？
pt_br: Por que? O que isso tudo quer dizer?
ru: Почему? Что все это значит?
ta: ஏன்? இது என்ன அர்த்தம்?

source: One way to look at it is that the scope of setuptools has now been reduced to the role of a build backend.
eo: Se mallonge diri, la rolo de setuptools reduktiĝis al nura konstrua malfasado.
ja: ひとつの見方は、setuptools のスコープが、いまや、ビルドバックエンドの役割に限定されているということです。
pt_br: Uma maneira de ver isso é que o escopo do setuptools agora foi reduzido à função de um backend de construção.
ru: Один из способов взглянуть на это заключается в том, что сфера setuptools теперь была сведена к роли опоры.
ta: அதைப் பார்ப்பதற்கான ஒரு வழி என்னவென்றால், செடுப்டூல்களின் நோக்கம் இப்போது ஒரு கட்டமைப்பை பின்தளத்தில் குறைத்துள்ளது.

source: Where to read more about this?
eo: Kie mi povas legi plu pri tio?
ja: これについて、どこでもっと読めますか？
pt_br: Onde posso ler mais sobre isso?
ru: Где почитать об этом?
ta: இதைப் பற்றி மேலும் படிக்க எங்கே?

source: `Why you shouldn't invoke setup.py directly <https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html>`__ by Paul Ganssle
eo: `Kial vi ne rulu setup.py rekte (anglalingva) <https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html>`__ far Paul Ganssle
ja: Paul Ganssle による `setup.py を直接に起動するべきではないのは何故か <https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html>`__
ru: `Почему не следует вызывать setup.py напрямую <https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html>`__ by Paul Ganssle
ta: `நீங்கள் ஏன் setup.py ஐ நேரடியாக அழைக்கக்கூடாது <https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html>` __ பால் கன்ச்லே

source: :doc:`setuptools:deprecated/commands`
ta: : டாக்: `செட்ப்டூல்ச்: நீக்கப்பட்ட/கட்டளைகள்`

source: Single-sourcing the Project Version
eo: Unufontigi la Projektan Version
ja: プロジェクトのバージョン番号をひとつの源から取得する
ru: Единая версия проекта
ta: திட்ட பதிப்பில் ஒற்றை-மூல

source: Complete
eo: Kompleta
ja: 完了
ru: Выполнено
ta: முழுமையானது

source: Many Python :term:`distribution packages <Distribution Package>` publish a single Python :term:`import package <Import Package>` where it is desired that the runtime ``__version__`` attribute on the import package report the same version specifier as :func:`importlib.metadata.version` reports for the distribution package (as described in :ref:`runtime-version-access`).
eo: Ofte :term:`distribua Python-pako <Distribution Package>` provizas unu :term:`importan pakon <Import Package>`, kaj oni deziras, ke la rultempa atributo ``__version__`` de la importa pako estu sama kiel :func:`importlib.metadata.version` por la distribua pako (laŭ :ref:`runtime-version-access`).
ja: 多くの Python :term:`配布パッケージ <Distribution Package>` は、インポートパッケージのランタイムにある ``__version__`` アトリビュートが、 (:ref:`runtime-version-access` に述べられているように) :func:`importlib.metadata.version` 関数が報告する配布パッケージのバージョンと同じバージョン指定子を報告することが求められているところの、単一の Python :term:`インポートパッケージ <Import Package>` を公開します。
ru: Многие Python :term:`distribution packages <Distribution Package>` публикуют один Python :term:`import package <Import Package>`, где желательно, чтобы атрибут runtime ``__version__`` на импортном пакете сообщал тот же спецификатор версии, что и :func:`importlib.metadata.version` сообщает для дистрибутивного пакета (как описано в :ref:`runtime-version-access`).
ta: பல பைதான்: கால: `விநியோக தொகுப்புகள் <விநியோக தொகுப்பு>` ஒரு பைதானை வெளியிடுங்கள்: கால: `இறக்குமதி தொகுப்பு <இறக்குமதி தொகுப்பு>` அங்கு இயக்க நேரம் `__ வழிமுறை__`` இறக்குமதி தொகுப்பில் பண்புக்கூறு அதே பதிப்பு விவரக்குறிப்பை அறிக்கையிட வேண்டும் AS: func: `importlib.metadata.version` விநியோக தொகுப்புக்கான அறிக்கைகள் (விவரிக்கப்பட்டுள்ளபடி: குறிப்பு:` இயக்க நேர-பதிப்பு-அணுகல்`).

source: It is also frequently desired that this version information be derived from a version control system *tag* (such as ``v1.2.3``) rather than being manually updated in the source code.
eo: Ofte oni deziras derivi la versian informon el versikontrolsistema *etikedo* (kiel ``v1.2.3``) anstataŭ malaŭtomata ĝisdatigo en la fontkodo.
ja: このバージョン番号の情報が、ソースコード内で手動で更新するものではない、 (``v1.2.3`` のような) バージョン管理システムの *タグ* から派生したものになってほしいと、繰り返し要望されます。
ru: Также часто бывает желательно, чтобы эта информация о версии была получена из *метки* системы контроля версий (например, ``v1.2.3``), а не обновлялась вручную в исходном коде.
ta: மூலக் குறியீட்டில் கைமுறையாக புதுப்பிக்கப்படுவதை விட இந்த பதிப்பு செய்தி பதிப்பு கட்டுப்பாட்டு அமைப்பு * குறிச்சொல் * (`` v1.2.3`` போன்றவை) இலிருந்து பெறப்பட வேண்டும் என்பதும் அடிக்கடி விரும்பப்படுகிறது.

source: Some projects may choose to simply live with the data entry duplication, and rely on automated testing to ensure the different values do not diverge.
eo: Kelkaj projektoj povas elekti simple ignori la obligon de datenoj, kaj dependi de aŭtomata testado por certigi, ke la valoroj ne diverĝas.
ja: プロジェクトの中には、単純に重複したデータエントリを抱えたまま進行することを選択し、異なる値に分岐しないことを保証する自動テストに依存するものもあってよいでしょう。
ru: Некоторые проекты могут просто смириться с дублированием ввода данных и полагаться на автоматизированное тестирование, чтобы убедиться, что различные значения не расходятся.
ta: சில திட்டங்கள் தரவு நுழைவு நகலுடன் வாழ தேர்வு செய்யலாம், மேலும் வெவ்வேறு மதிப்புகள் வேறுபடுவதில்லை என்பதை உறுதிப்படுத்த தானியங்கு சோதனையை நம்பியிருக்கலாம்.

source: Alternatively, a project's chosen build system may offer a way to define a single source of truth for the version number.
eo: Alternative, la konstrua sistemo de projekto povas ebligi difinadon de unu fonto de vero pri la versia numero.
ja: 別のやり方としては、プロジェクトが選択したビルドシステムは、バージョン番号について唯一の源を定義する方法を提案しても構いません。
ru: В качестве альтернативы, выбранная проектом система сборки может предложить способ определения единого источника истины для номера версии.
ta: மாற்றாக, ஒரு திட்டத்தின் தேர்ந்தெடுக்கப்பட்ட உருவாக்க அமைப்பு பதிப்பு எண்ணுக்கு உண்மையின் ஒரு மூலத்தை வரையறுக்க ஒரு வழியை வழங்கக்கூடும்.

source: In general, the options are:
eo: Ĝenerale, jen la opcioj:
ja: 一般的に、取りうる選択肢は:
ru: В общем, возможны следующие варианты:
ta: பொதுவாக, விருப்பங்கள்:

source: If the code is in a version control system (VCS), such as Git, then the version can be extracted from the VCS.
eo: Se la kodo estas en versikontrola sistemo (VKS), kiel ekzemple Git, do la versio povas esti eltirita el la VKS.
ja: ソースコードが Git のようなバージョン管理システム (VCS) の中にあるなら、バージョン番号は VCS から取り出すことできます。
ru: Если код находится в системе контроля версий (VCS), например Git, то версию можно извлечь из VCS.
ta: குறியீடு ஒரு பதிப்பு கட்டுப்பாட்டு அமைப்பில் (VCS), அதாவது git போன்றவை என்றால், பதிப்பை பகஅ இலிருந்து பிரித்தெடுக்க முடியும்.

source: The version can be hard-coded into the :file:`pyproject.toml` file -- and the build system can copy it into other locations it may be required.
eo: La versio povas esti malaŭtomate enmetita en la dosieron :file:`pyproject.toml` – kaj la konstrua sistemo povas kopii ĝin al aliaj postulataj lokoj.
ja: バージョン番号は、 :file:`pyproject.toml` ファイルにハードコードすることが可能です -- そして、ビルドシステムがそれを要求される他の場所にコピーすることができます。
ru: Версия может быть жестко задана в файле :file:`pyproject.toml`, а система сборки может скопировать ее в другие места, которые могут потребоваться.
ta: பதிப்பை: கோப்பு: `pyproject.toml` கோப்பில் கடினமாக குறியிடப்படலாம்-மேலும் கட்டட அமைப்பு அதை தேவைப்படக்கூடிய பிற இடங்களுக்கு நகலெடுக்க முடியும்.
