Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: To learn more about Python in Fedora, please visit the `official Fedora docs`_, `Python Classroom`_ or `Fedora Loves Python`_.
eo: Por lerni pli pri Python en Fedora, bonvolu legi `la oficialan dokumentaron de Fedora <official Fedora docs>`_, `Python Classroom`_ aŭ `Fedora Loves Python`_.
ja: Fedora における Python についてもっと学ぶには、 `official Fedora docs`_ ・ `Python Classroom`_ ・ `Fedora Loves Python`_ を見てください。
pt_br: Para saber mais sobre Python no Fedora, visite os `documentos oficiais do Fedora`_, `Python Classroom`_ ou `Fedora Loves Python`_.
ru: Чтобы узнать больше о Python в Fedora, посетите `официальную документацию Fedora`_, `Python Classroom`_ или `Fedora Loves Python`_.
ta: ஃபெடோராவில் பைதான் பற்றி மேலும் அறிய, தயவுசெய்து `அதிகாரப்பூர்வ ஃபெடோரா டாக்ச்`_,` பைதான் வகுப்பறை`_ அல்லது `ஃபெடோரா பைதான்`_ ஐ நேசிக்கவும்.

source: CentOS/RHEL
ta: சென்டோச்/ரெல்

source: CentOS and RHEL don't offer :ref:`pip` or :ref:`wheel` in their core repositories, although :ref:`setuptools` is installed by default.
eo: CentOS kaj RHEL ne ofertas :ref:`pip` nek :ref:`wheel` en siaj ĉefdeponejoj, kvankam :ref:`setuptools` estas apriore instalita.
ja: CentOS と RHEL は、そのコアリポジトリでは :ref:`pip` や :ref:`wheel` を提供していませんが、 :ref:`setuptools` はデフォルトでインストールされます。
pt_br: CentOS e RHEL não oferecem :ref:`pip` ou :ref:`wheel` em seus repositórios principais, embora :ref:`setuptools` seja instalado por padrão.
ru: CentOS и RHEL не предлагают :ref:`pip` или :ref:`wheel` в своих основных репозиториях, хотя :ref:`setuptools` установлен по умолчанию.
ta: சென்டோச் மற்றும் ரெல் வழங்கவில்லை: குறிப்பு: `பிப்` அல்லது: Ref:` வீல்` அவர்களின் முக்கிய களஞ்சியங்களில், இருப்பினும்: Ref: `setuptools` இயல்பாக நிறுவப்பட்டுள்ளது.

source: To install pip and wheel for the system Python, there are two options:
eo: Por instali pip kaj wheel por la sistema Python, ekzistas du opcioj:
ja: システムに付属の Python 用に pip や wheel をインストールするには、二つのやり方があります:
pt_br: Para instalar pip e wheel para o sistema Python, existem duas opções:
ru: Чтобы установить pip и wheel для системы Python, есть два варианта:
ta: கணினி பைத்தானுக்கு பிஐபி மற்றும் சக்கரத்தை நிறுவ, இரண்டு விருப்பங்கள் உள்ளன:

source: Enable the `EPEL repository <https://fedoraproject.org/wiki/EPEL>`_ using `these instructions <https://docs.fedoraproject.org/en-US/epel/getting-started/>`__. On EPEL 7, you can install pip and wheel like so:
eo: Ŝaltu la `deponejon EPEL <https://fedoraproject.org/wiki/EPEL>`_ laŭ `la jenaj instrukcioj <https://docs.fedoraproject.org/en-US/epel/getting-started/>`__. Sur EPEL 7, vi povas instali pip kaj wheel jene:
ja: `これらの指示 <https://docs.fedoraproject.org/en-US/epel/getting-started>`__ を使って、 `EPEL リポジトリ <https://fedoraproject.org/wiki/EPEL>`_ を有効にしてください。 EPEL 7 では、pip と wheel をこんなふうにインストールできます:
ru: Включите `репозиторий EPEL <https://fedoraproject.org/wiki/EPEL>`_, используя `эти инструкции <https://docs.fedoraproject.org/en-US/epel/getting-started/>`__. На EPEL 7 вы можете установить pip и wheel следующим образом:
ta: `எபல் களஞ்சியத்தை <https://fedoraproject.org/wiki/epel>` _ இந்த வழிமுறைகளைப் பயன்படுத்தி <https://docs.fedoraproject.org/en-us/epel/egetting-started/> __. எபல் 7 இல், நீங்கள் பிப் மற்றும் வீலை நிறுவலாம்:

source: Since EPEL only offers extra, non-conflicting packages, EPEL does not offer setuptools, since it's in the core repository.
eo: EPEL nur ofertas ekstrajn, senkonfliktajn pakojn. Tial EPEL ne ofertas setuptools, ĉar ĝi estas en la ĉefdeponejo.
ja: EPEL はシステムに欠けていて衝突しないパッケージだけを提供しているので、コアリポジトリに入っている setuptools は EPEL にはありません。
pt_br: Como a EPEL oferece apenas pacotes extras não conflitantes, a EPEL não oferece setuptools, pois está no repositório central.
ru: Поскольку EPEL предлагает только дополнительные, не противоречащие друг другу пакеты, EPEL не предлагает setuptools, поскольку он находится в основном репозитории.
ta: எபல் கூடுதல், மோதல் அல்லாத தொகுப்புகளை மட்டுமே வழங்குவதால், எபல் செட்டுப்லூல்களை வழங்காது, ஏனெனில் இது முக்கிய களஞ்சியத்தில் உள்ளது.

source: Enable the `PyPA Copr Repo <https://copr.fedorainfracloud.org/coprs/pypa/pypa/>`_ using `these instructions <https://fedoraproject.org/wiki/Infrastructure/Fedorahosted-retirement>`__ [1]_. You can install pip and wheel like so:
eo: Ŝaltu la `Copr-deponejon de PyPA <https://copr.fedorainfracloud.org/coprs/pypa/pypa/>`_ laŭ `tiuj instrukcioj <https://fedoraproject.org/wiki/Infrastructure/Fedorahosted-retirement>`__ [1]_. Vi povas instali pip kaj wheel jene:
ja: `これらの指示 <https://fedoraproject.org/wiki/Infrastructure/Fedorahosted-retirement>`__ [1]_ に従って `PyPA Copr Repo <https://copr.fedorainfracloud.org/coprs/pypa/pypa/>`_ を有効にしてください。 pip と wheel はこうやってインストールできます:
pt_br: Habilite o `Copr Repo do PyPA <https://copr.fedorainfracloud.org/coprs/pypa/pypa/>`_ usando `estas instruções <https://fedoraproject.org/wiki/Infrastructure/Fedorahosted-retirement>`__ [1]_. Você pode instalar pip e wheel desta forma:
ru: Включите `PyPA Copr Repo <https://copr.fedorainfracloud.org/coprs/pypa/pypa/>`_, используя `эти инструкции <https://fedoraproject.org/wiki/Infrastructure/Fedorahosted-retirement>`__ [1]_. Вы можете установить pip и wheel следующим образом:
ta: `பைபா கோப்ர் ரெப்போ <https://copr.fedorainfracloud.org/coprs/pypa/pypa/>` _ `இந்த வழிமுறைகளைப் பயன்படுத்துதல் <https://fedoraprogict. 1] _. நீங்கள் குழாய் மற்றும் சக்கரத்தை நிறுவலாம்:

source: To additionally upgrade setuptools, run:
eo: Por ankaŭ ĝisdatigi setuptools, rulu la jenon:
ja: さらに setuptools を更新するには、次のようにしてください:
pt_br: Para adicionalmente atualizar setuptools, execute:
ru: Чтобы дополнительно обновить setuptools, запустите:
ta: கூடுதலாக செட்டுப்டூல்சை மேம்படுத்த, இயக்கவும்:

source: To install pip, wheel, and setuptools, in a parallel, non-system environment (using yum) then there are two options:
eo: Por instali pip, wheel kaj setuptools en paralela, nesistema medio (uzante yum), ekzistas du opcioj:
ja: システムの環境とは別に (yum を使って) pip ・ wheel ・ setuptools をインストールするには、ふたつのやり方があります:
pt_br: Para instalar pip, wheel e setuptools, em um ambiente paralelo, sem sistema (usando yum), existem duas opções:
ru: Чтобы установить pip, wheel и setuptools в параллельном, несистемном окружении (с помощью yum), есть два варианта:
ta: பிஐபி, வீல் மற்றும் செட்டுப்டூல்களை நிறுவ, ஒரு இணையான, அமைப்பு அல்லாத சூழலில் (YUM ஐப் பயன்படுத்தி) இரண்டு விருப்பங்கள் உள்ளன:

source: Use the "Software Collections" feature to enable a parallel collection that includes pip, setuptools, and wheel.
eo: Uzu la funkcion «Software Collections» por ŝalti paralelan kolekton inkluzivantan pip, setuptools kaj wheel.
ja: pip ・ setuptools ・ wheel を含むコレクションを (システムとは) 並行に有効化して "ソフトウェアコレクション" 機能を使ってください。
pt_br: Use o recurso "Coleções de software" para habilitar uma coleção paralela que inclui pip, setuptools e wheel.
ru: Используйте функцию "Коллекции программ", чтобы включить параллельную коллекцию, включающую pip, setuptools и wheel.
ta: PIP, Setuptools மற்றும் whel ஆகியவற்றை உள்ளடக்கிய ஒரு இணையான சேகரிப்பை இயக்க "மென்பொருள் சேகரிப்புகள்" அம்சத்தைப் பயன்படுத்தவும்.

source: For Redhat, see here: https://developers.redhat.com/products/softwarecollections/overview
eo: Por Red Hat, vidu la jenon: https://developers.redhat.com/products/softwarecollections/overview
ja: Red Hat についてはこちらを見てください: https://developers.redhat.com/products/softwarecollections/overview
pt_br: Para Redhat, veja aqui: https://developers.redhat.com/products/softwarecollections/overview
ru: Для Redhat смотрите здесь: https://developers.redhat.com/products/softwarecollections/overview
ta: ரெட்ஆட்டைப் பொறுத்தவரை, இங்கே காண்க: https://developers.redhat.com/products/softwarecollections/overview

source: For CentOS, see here: https://github.com/sclorg
eo: Por CentOS, vidu la jenon: https://github.com/sclorg
ja: CentOS の場合は、こちらを見てください: https://github.com/sclorg
pt_br: Para CentOS, veja aqui: https://github.com/sclorg
ru: Для CentOS смотрите здесь: https://github.com/sclorg
ta: சென்டோசுக்கு, இங்கே காண்க: https://github.com/sclorg

source: Be aware that collections may not contain the most recent versions.
eo: Konsciu, ke kolektoj eble ne havas la plej novajn versiojn.
ja: コレクションに含まれているバージョンが最新版であるとは限らない点に注意してください。
pt_br: Esteja ciente de que as coleções podem não conter as versões mais recentes.
ru: Помните, что коллекции могут содержать не самые последние версии.
ta: சேகரிப்புகளில் மிக அண்மைக் கால பதிப்புகள் இல்லை என்பதை அறிந்து கொள்ளுங்கள்.

source: Enable the `IUS repository <https://ius.io/setup>`_ and install one of the `parallel-installable <https://ius.io/usage#parallel-installable-packages>`_ Pythons, along with pip, setuptools, and wheel, which are kept fairly up to date.
eo: Ŝaltu la `deponejon IUS <https://ius.io/setup>`_, kaj instalu unu el la `paralele instaleblaj <https://ius.io/usage#parallel-installable-packages>`_ Python-oj kune kun pip, setuptools, kaj wheel, kiuj estas plejparte ĝisdataj.
ja: `IUS リポジトリ <https://ius.io/setup>`_ を有効にして、かなり最新版に近い状態に維持されている pip ・ setuptools ・ wheel と一緒に `並列インストール可能 <https://ius.io/usage#parallel-installable-packages>`_ な Python の内のひとつをインストールしてください。
pt_br: Habilite o `repositório do IUS <https://ius.io/setup>`_ e instale um dos Pythons `pré-instaláveis <https://ius.io/usage#parallel-installable-packages>`_, junto com pip, setuptools e wheel, que são mantidos razoavelmente atualizados.
ru: Включите `IUS-репозиторий <https://ius.io/setup>`_ и установите один из `параллельно устанавливаемых <https://ius.io/usage#parallel-installable-packages>`_ Pythons, а также pip, setuptools и wheel, которые поддерживаются в актуальном состоянии.
ta: `Ius களஞ்சியத்தை <https://ius.io/setup> _ _ _` இணையாக-உள்ள-நிறுவல் <https://ius.io/usage#parallel-installable-packages> `_ பைதான்ச் ஆகியவற்றில் ஒன்றை நிறுவவும் பிப், செடுப்டூல்கள் மற்றும் சக்கரம், அவை மிகவும் புதுப்பித்த நிலையில் உள்ளன.

source: For example, for Python 3.4 on CentOS7/RHEL7:
eo: Ekzemple, por Python 3.4 sur CentOS 7 / RHEL 7:
ja: 例えば、CentOS7/RHEL7 での Python 3.4 については:
pt_br: Por exemplo, para Python 3.4 no CentOS7/RHEL7:
ru: Например, для Python 3.4 на CentOS7/RHEL7:
ta: எடுத்துக்காட்டாக, centos7/Rhel7 இல் பைதான் 3.4 க்கு:

source: Debian/Ubuntu and derivatives
eo: Debian/Ubuntu kaj idoj
ja: Debian/Ubuntu とその派生物
pt_br: Debian/Ubuntu e derivados
ru: Debian/Ubuntu и производные
ta: டெபியன்/உபுண்டு மற்றும் வழித்தோன்றல்கள்

source: Firstly, update and refresh repository lists by running this command:
eo: Unue, ĝisdatigu la liston de deponejoj per la jena komando:
ja: 第一に、このコマンドを実行してリポジトリリストを更新し情報を新しくしてください。
pt_br: Em primeiro lugar, atualize as listas de repositórios executando este comando:
ru: Во-первых, обновите и дополните списки репозиториев, выполнив эту команду:
ta: முதலாவதாக, இந்த கட்டளையை இயக்குவதன் மூலம் களஞ்சிய பட்டியல்களைப் புதுப்பித்து புதுப்பிக்கவும்:

source: Recent Debian/Ubuntu versions have modified pip to use the `"User Scheme" <https://pip.pypa.io/en/stable/user_guide/#user-installs>`_ by default, which is a significant behavior change that can be surprising to some users.
eo: Novaj versioj de Debian/Ubuntu modifis pip apriore uzante la `«Uzanto-Skemon» <https://pip.pypa.io/en/stable/user_guide/#user-installs>`_, kio estas signifa konduta ŝanĝo eble surprizanta kelkajn uzantojn.
ja: 最近のバージョンの Debian/Ubuntu は、 pip がデフォルトで `"User Scheme" <https://pip.pypa.io/en/stable/user_guide/#user-installs>`_ を使うように修正されていますが、これはユーザの一部を驚かせるような重要な動作の変更に当たるでしょう。
pt_br: Versões recentes do Debian/Ubuntu modificaram o pip para usar o `"User Scheme" <https://pip.pypa.io/en/stable/user_guide/#user-installs>`_ (Esquema de usuário) por padrão, que é um mudança significativa de comportamento que pode surpreender alguns usuários.
ru: В последних версиях Debian/Ubuntu pip был модифицирован, чтобы по умолчанию использовать `"Схему пользователя" <https://pip.pypa.io/en/stable/user_guide/#user-installs>`_, что является значительным изменением поведения, которое может быть неожиданным для некоторых пользователей.
ta: அண்மைக் கால டெபியன்/உபுண்டு பதிப்புகள் `" பயனர் திட்டத்தை "<https://pip.pypa.io/en/stable/user_guide/#user-installs>` _ இயல்பாக மாற்றியமைத்த பிஐபி மாற்றியமைத்துள்ளன, இது முன்னிருப்பாக, இது ஒரு குறிப்பிடத்தக்க நடத்தை மாற்றமாகும் சில பயனர்களுக்கு ஆச்சரியமாக இருக்கும்.

source: Arch Linux
ta: ஆர்ச் லினக்ச்

source: Currently, there is no "copr" yum plugin available for CentOS/RHEL, so the only option is to manually place the repo files as described.
eo: Aktuale ne ekzistas ``yum``-kromprogramo por ``copr`` havebla ĉe CentOS/RHEL. Tial, oni devas malaŭtomate enmetu deponejajn dosierojn laŭ la ĉi-supra maniero.
ja: 現時点では、 CentOS/RHEL には yum プラグインの "copr" が存在しないので、後述するように手動でリポジトリファイルを配置するしかありません。
pt_br: Atualmente, não há plug-in do yum para "copr" disponível para CentOS/RHEL, então a única opção é colocar manualmente os arquivos de repositório conforme descrito.
ru: В настоящее время для CentOS/RHEL не существует плагина yum "copr", поэтому единственным вариантом является ручное размещение файлов репо, как описано выше.
ta: தற்போது, சென்டோச்/ஆர்.எச்.இ.எல் -க்கு "கோப்ஆர்" யூம் சொருகி கிடைக்கவில்லை, எனவே விவரிக்கப்பட்டுள்ளபடி ரெப்போ கோப்புகளை கைமுறையாக வைப்பதே ஒரே வழி.

source: Install packages in a virtual environment using pip and venv
eo: Instali pakojn en virtuala medio per pip kaj venv
ja: pip と venv を使って仮想環境にパッケージをインストールする
pt_br: Instalar pacotes em um ambiente virtual usando pip e venv
ru: Установка пакетов в виртуальной среде с использованием pip и venv
ta: PIP மற்றும் WENV ஐப் பயன்படுத்தி மெய்நிகர் சூழலில் தொகுப்புகளை நிறுவவும்

source: This guide discusses how to create and activate a virtual environment using the standard library's virtual environment tool :ref:`venv` and install packages. The guide covers how to:
eo: Ĉi tiu estas gvidilo pri kiel krei kaj aktivigi virtualan medion per la ilo :ref:`venv` en la norma biblioteko kaj instali pakojn tien. La gvidilo diskutas la jenon:
ja: このガイド文書では、標準ライブラリの仮想環境ツール :ref:`venv` を使って仮想環境を作成し活性化する方法と、パッケージをインストールする方法について議論します。このガイド文書は次のようなことを行う方法をカバーします:
pt_br: Este guia discute como criar e ativar um ambiente virtual usando a ferramenta de ambiente virtual da biblioteca padrão :ref:`venv` e instalar pacotes. O guia aborda como:
ru: В этом руководстве рассказывается о том, как создать и активировать виртуальную среду с помощью инструмента виртуальной среды стандартной библиотеки :ref:`venv` и установить пакеты. В руководстве рассказывается о том, как:
ta: இந்த வழிகாட்டி நிலையான நூலகத்தின் மெய்நிகர் சூழல் கருவியைப் பயன்படுத்தி ஒரு மெய்நிகர் சூழலை எவ்வாறு உருவாக்குவது மற்றும் செயல்படுத்துவது என்பதை விவாதிக்கிறது: ref: `VEV` மற்றும் தொகுப்புகளை நிறுவுதல். வழிகாட்டி எப்படி என்பதை உள்ளடக்கியது:

source: Create and activate a virtual environment
eo: Krei kaj aktivigi virtualan medion
ja: 仮想環境を作成し活性化する
pt_br: Criar e ativar um ambiente virtual
ru: Создание и активация виртуальной среды
ta: மெய்நிகர் சூழலை உருவாக்கி செயல்படுத்தவும்

source: Prepare pip
eo: Prepari pip
ja: pip の準備をする
pt_br: Preparar o pip
ru: Подготовьте pip
ta: பிப் தயாரிக்கவும்

source: Install packages into a virtual environment using the ``pip`` command
eo: Instali pakojn en virtualan medion per la komando ``pip``
ja: ``pip`` コマンドを使って仮想環境にパッケージをインストールする
pt_br: Instalar pacotes em um ambinente virtual usando o comando ``pip``
ru: Установка пакетов в виртуальную среду с помощью команды ``pip``
ta: `` பிப்`` கட்டளையைப் பயன்படுத்தி மெய்நிகர் சூழலில் தொகுப்புகளை நிறுவவும்

source: Use and create a requirements file
eo: Uzi kaj krei postulo-dosieron
ja: requirements ファイルを使う、作成する
pt_br: Usar e criar o arquivo de requisitos
ru: Использование и создание файла требований
ta: தேவைகள் கோப்பைப் பயன்படுத்தவும் உருவாக்கவும்

source: This guide applies to supported versions of Python, currently 3.8 and higher.
eo: Ĉi tiu gvidilo validas pri subtenataj versioj de Python, aktuale 3.8 kaj pli novaj.
ja: このガイド文書は、サポートされている Python のバージョン、現時点では 3.8 およびこれ以降のものに適用されます。
pt_br: Este guia se aplica a versões suportadas do Python, atualmente 3.8 e superior.
ru: Это руководство относится к поддерживаемым версиям Python, в настоящее время 3.8 и выше.
ta: இந்த வழிகாட்டி தற்போது 3.8 மற்றும் அதற்கு மேற்பட்ட பைத்தானின் ஆதரிக்கப்பட்ட பதிப்புகளுக்கு பொருந்தும்.

source: This guide uses the term **package** to refer to a :term:`Distribution Package`, which commonly is installed from an external host. This differs from the term :term:`Import Package` which refers to import modules in your Python source code.
eo: Ĉi tiu gvidilo uzas la terminon **pako** por signifi :term:`Distribuan Pakon <Distribution Package>`, instalitan el ekstera gastiganto. Tio diferencas de la termino :term:`Importa Pako <Import Package>`, kiu estas importebla modulo en Python-fontokodo.
ja: この文書では、 **パッケージ** という用語を通常は外部のホストからインストールされる :term:`配布パッケージ <Distribution Package>` の意味で使います。これは Python ソースコードでモジュールをインポートするという意味で使われる :term:`インポートパッケージ <Import Package>` とは異なります。
pt_br: Este guia usa o termo **pacote** para se referir a um :term:`Pacote de Distribuição`, o qual é comumente instalado a partir de um host externo. Ele é diferente do termo :term:`Pacote de Importação` que se refere a importar módulos em seu código-fonte do Python.
ru: В этом руководстве используется термин **упаковка** для обозначения термина :термин: " Пакет распределения " , который обычно устанавливается из внешнего хоста. Это отличается от термина :term:`Import Package', который относится к модулям импорта в исходном коде Python.
ta: இந்த வழிகாட்டி ஒரு: கால: `விநியோக தொகுப்பு` ஐக் குறிக்க ** தொகுப்பு ** என்ற வார்த்தையைப் பயன்படுத்துகிறது, இது பொதுவாக வெளிப்புற ஓச்டிலிருந்து நிறுவப்படுகிறது. இது வார்த்தையிலிருந்து வேறுபடுகிறது: சொல்: `இறக்குமதி தொகுப்பு` இது உங்கள் பைதான் மூலக் குறியீட்டில் தொகுதிகளை இறக்குமதி செய்வதைக் குறிக்கிறது.

source: This guide has the prerequisite that you are using an official Python version obtained from <https://www.python.org/downloads/>. If you are using your operating system's package manager to install Python, please ensure that Python is installed before proceeding with these steps.
eo: Ĉi tiu gvidilo supozas, ke vi uzas oficialan version de Python el <https://www.python.org/downloads/>. Se vi uzas la pakadministrilon de via mastruma sistemo por instali Python, bonvolu certigi, ke Python estas instalita, antaŭ ol sekvi la ĉi-subajn paŝojn.
ja: このガイド文書は、 <https://www.python.org/downloads/> から取得する公式の Python を使っていることを前提条件にしています。Python をインストールするのにオペレーティングシステムのパッケージマネージャを使っているのであれば、ここに述べるようなステップを進める前に、Python がインストールされていることを確実にしてください。
pt_br: Este guia tem como pré-requisito que você esteja usando uma versão oficial do Python obtida em <https://www.python.org/downloads/>. Se você estiver usando o gerenciador de pacotes do seu sistema operacional para instalar o Python, certifique-se de que o Python esteja instalado antes de prosseguir com estas etapas.
ru: Это руководство содержит обязательное условие - использование официальной версии Python, полученной по адресу <https://www.python.org/downloads/>. Если вы используете менеджер пакетов вашей операционной системы для установки Python, пожалуйста, убедитесь, что Python установлен, прежде чем приступать к выполнению этих шагов.
ta: இந்த வழிகாட்டியில் <https://www.python.org/downloads/> இலிருந்து பெறப்பட்ட அதிகாரப்பூர்வ பைதான் பதிப்பைப் பயன்படுத்துகிறீர்கள் என்ற முன்நிபந்தனை உள்ளது. பைத்தானை நிறுவ உங்கள் இயக்க முறைமையின் தொகுப்பு மேலாளரைப் பயன்படுத்துகிறீர்கள் என்றால், இந்த படிகளைத் தொடர முன் பைதான் நிறுவப்பட்டிருப்பதை உறுதிப்படுத்தவும்.

source: Create and Use Virtual Environments
eo: Krei kaj Uzi Virtualajn Mediojn
ja: 仮想環境を構築し使用する
pt_br: Criar e usar ambientes virtuais
ru: Создание и использование виртуальных сред
ta: மெய்நிகர் சூழல்களை உருவாக்கி பயன்படுத்தவும்

source: Create a new virtual environment
eo: Krei novan virtualan medion
ja: 新しい仮想環境を作成する
pt_br: Criar um novo ambiente virtual
ru: Создайте новую виртуальную среду
ta: புதிய மெய்நிகர் சூழலை உருவாக்கவும்

source: :ref:`venv` (for Python 3) allows you to manage separate package installations for different projects. It creates a "virtual" isolated Python installation. When you switch projects, you can create a new virtual environment which is isolated from other virtual environments. You benefit from the virtual environment since packages can be installed confidently and will not interfere with another project's environment.
ja: :ref:`venv` (Python 3 用) を使うと、異なるプロジェクトにそれぞれ別のパッケージをインストールして管理できます。(仮想環境は) 互いに影響を与えない"仮想的な" Python インストール環境を生成します。別のプロジェクトに移動すると、他の仮想環境から隔離された新しい仮想環境を作成することができます。仮想環境を使うことで、パッケージ群を自信を持ってインストールすることができ、他のプロジェクトの環境には干渉しないであろうことから、あなたは利益を得ることができます。
pt_br: :ref:`venv` (para Python 3) permite gerenciar instalações de pacotes separadas para projetos diferentes. Ele cria uma instalação Python "virtual" e isolada. Ao alternar projetos, você pode criar um novo ambiente virtual isolado de outros ambientes virtuais. Você se beneficia do ambiente virtual, pois os pacotes podem ser instalados com segurança e não interferirão no ambiente de outro projeto.
ru: :ref:`venv` (для Python 3) позволяет управлять отдельными установками пакетов для разных проектов. Она создает "виртуальную" изолированную установку Python. При смене проекта вы можете создать новую виртуальную среду, изолированную от других виртуальных сред. Вы получаете преимущество от виртуальной среды, так как пакеты можно устанавливать уверенно и они не будут мешать среде другого проекта.
ta: . இது ஒரு "மெய்நிகர்" தனிமைப்படுத்தப்பட்ட பைதான் நிறுவலை உருவாக்குகிறது. நீங்கள் திட்டங்களை மாற்றும்போது, பிற மெய்நிகர் சூழல்களிலிருந்து தனிமைப்படுத்தப்பட்ட புதிய மெய்நிகர் சூழலை உருவாக்கலாம். மெய்நிகர் சூழலில் இருந்து நீங்கள் பயனடைகிறீர்கள், ஏனெனில் தொகுப்புகள் நம்பிக்கையுடன் நிறுவப்படலாம், மேலும் மற்றொரு திட்டத்தின் சூழலில் தலையிடாது.

source: It is recommended to use a virtual environment when working with third party packages.
eo: Estas rekomendate uzi virtualan medion dum laborado kun triapartiaj pakoj.
ja: 第三者のパッケージ群を使う時には仮想環境を用いることが推奨されます。
pt_br: Recomenda-se usar um ambiente virtual ao trabalhar com pacotes de terceiros.
ru: При работе с пакетами сторонних производителей рекомендуется использовать виртуальную среду.
ta: மூன்றாம் தரப்பு தொகுப்புகளுடன் பணிபுரியும் போது மெய்நிகர் சூழலைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது.

source: To create a virtual environment, go to your project's directory and run the following command. This will create a new virtual environment in a local folder named ``.venv``:
eo: Por krei virtualan medion, iru al la dosierujo de via projekto, kaj rulu la jenan komandon. Tio kreos novan virtualan medion en loka dosierujo nomita ``.venv``:
ja: 仮想環境を作成するには、プロジェクトのディレクトリへ行って次のようなコマンドを実行してください。これによって、ローカルの ``.venv`` フォルダに新しい仮想環境ができるでしょう:
pt_br: Para criar um ambiente virtual, acesse o diretório do seu projeto e execute o comando a seguir. Isso criará um novo ambiente virtual em uma pasta local chamada ``.venv``:
ru: Чтобы создать виртуальную среду, перейдите в каталог вашего проекта и выполните следующую команду. Это создаст новое виртуальное окружение в локальной папке с именем ``.venv``:
ta: மெய்நிகர் சூழலை உருவாக்க, உங்கள் திட்டத்தின் கோப்பகத்திற்குச் சென்று பின்வரும் கட்டளையை இயக்கவும். இது `` .venv`` என்ற உள்ளக கோப்புறையில் புதிய மெய்நிகர் சூழலை உருவாக்கும்:

source: The second argument is the location to create the virtual environment. Generally, you can just create this in your project and call it ``.venv``.
eo: La dua argumento estas la loko de la virtuala medio. Ĝenerale, oni povas simpli krei ĝin en sia projekto kaj nomi ĝin ``.venv``.
ja: 二つ目の引数は、仮想環境を作成するべき場所の指定です。一般的には、プロジェクトのルートディレクトリに ``.venv`` という名前で作成します。
pt_br: O segundo argumento é o local para criar o ambiente virtual. Geralmente, você pode apenas criar isso em seu projeto e chamá-lo de ``.venv``.
ru: Второй аргумент - это место создания виртуального окружения. Как правило, вы можете просто создать его в своем проекте и назвать ``.venv``.
ta: இரண்டாவது உரையாடல் மெய்நிகர் சூழலை உருவாக்குவதற்கான இடம். பொதுவாக, இதை உங்கள் திட்டத்தில் உருவாக்கி `` .venv`` என்று அழைக்கலாம்.
