Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If you're planning on releasing to these new frontiers, you'll want to check out the following frameworks, and refer to their packaging guides:
eo: Se vi planas eldonadon al tiuj novaj limoj, vi volas esplori la jenajn kadrojn kaj iliajn gvidilojn pri pakado:
ja: このような新しい未開拓分野でリリースを計画しているのであれば、以下のフレームワークに興味が湧いて、それぞれのパッケージングガイドを参照したくなるかもしれません。
pt_br: Se você está planejando lançar para essas novas fronteiras, convém verificar as seguintes estruturas e consultar seus guias de empacotamento:
ru: Если вы планируете выходить на эти новые рубежи, вам стоит обратить внимание на следующие фреймворки и ознакомиться с их руководствами по упаковке:
ta: இந்த புதிய எல்லைகளுக்கு வெளியிட நீங்கள் திட்டமிட்டால், நீங்கள் பின்வரும் கட்டமைப்பைப் பார்க்க வேண்டும், மேலும் அவற்றின் பேக்கேசிங் வழிகாட்டிகளைப் பார்க்கவும்:

source: `Brython <https://brython.info/>`_
ta: `பிரைதான் <https://brython.info/>` _

source: If you are *not* interested in using a framework or platform, or just wonder about some of the technologies and techniques utilized by the frameworks above, continue reading below.
eo: Se vi *ne* interesiĝas pri kadro aŭ platformo, aŭ simple scivolas pri la teĥnikoj uzitaj de la ĉi-supraj kadroj, legu plu.
ja: フレームワークやプラットフォームに興味がなければ、あるいは、上記のフレームワークが利用している技術や手練手管について不思議に思うのであれば、このまま読み進めてください。
pt_br: Se você *não* está interessado em usar um framework ou plataforma, ou apenas quer saber sobre algumas das tecnologias e técnicas utilizadas pelos frameworks acima, continue lendo abaixo.
ru: Если вы *не* заинтересованы в использовании фреймворка или платформы, или вам просто интересно узнать о некоторых технологиях и методах, используемых в вышеперечисленных фреймворках, продолжайте читать ниже.
ta: நீங்கள் ஒரு கட்டமைப்பை அல்லது தளத்தைப் பயன்படுத்துவதில் ஆர்வம் காட்டவில்லை என்றால், அல்லது மேலே உள்ள கட்டமைப்பால் பயன்படுத்தப்படும் சில தொழில்நுட்பங்கள் மற்றும் நுட்பங்களைப் பற்றி ஆச்சரியப்படுகிறீர்கள் என்றால், கீழே படிக்கவும்.

source: Depending on a pre-installed Python
eo: Dependi de antaŭinstalita Python
ja: インストール済みの Python に依存する
pt_br: Dependendo de um Python pré-instalado
ru: В зависимости от предустановленного Python'а
ta: முன்பே நிறுவப்பட்ட பைத்தானைப் பொறுத்து

source: Pick an arbitrary computer, and depending on the context, there's a very good chance Python is already installed. Included by default in most Linux and Mac operating systems for many years now, you can reasonably depend on Python preexisting in your data centers or on the personal machines of developers and data scientists.
eo: Elektu iun ajn komputilo. Depende de la kunteksto, ekzistas bona ŝanco, ke Python estas jam instalita. Ĝi estas apriore inkluzivita en la plejparto de Linux kaj Mac mastrumaj sistemoj dum multaj jaroj, kaj oni povas racie supozi, ke Python jam ekzistas en datencentro aŭ persona komputilo de programisto aŭ datensciencisto.
ja: 任意のコンピュータを選んだ時に、もちろんその環境にもよりますが、 Python が既にインストールされている確率は相当に高いでしょう。 Linux や Mac オペレーティングシステムではもう多年にわたってデフォルトでインストールされているので、データセンタの機材や、開発者やデータ科学者の個人用の機材には Python が入っているものと思っても構わないでしょう。
pt_br: Escolha um computador arbitrário e, dependendo do contexto, há uma boa chance do Python já estar instalado. Incluído por padrão na maioria dos sistemas operacionais Linux e Mac por muitos anos, você pode depender razoavelmente do Python preexistente em seus datacenters ou nas máquinas pessoais de desenvolvedores e cientistas de dados.
ru: Выберите произвольный компьютер, и, в зависимости от контекста, с большой вероятностью Python уже установлен. Уже много лет он включен по умолчанию в большинство операционных систем Linux и Mac, поэтому вы можете с уверенностью рассчитывать на то, что Python уже есть в ваших центрах обработки данных или на персональных компьютерах разработчиков и специалистов по обработке данных.
ta: ஒரு தன்னிச்சையான கணினியைத் தேர்ந்தெடுத்து, சூழலைப் பொறுத்து, பைதான் ஏற்கனவே நிறுவப்பட்ட ஒரு நல்ல வாய்ப்பு உள்ளது. இப்போது பல ஆண்டுகளாக பெரும்பாலான லினக்ச் மற்றும் மேக் இயக்க முறைமைகளில் இயல்பாகவே சேர்க்கப்பட்டுள்ளது, உங்கள் தரவு மையங்களில் அல்லது உருவாக்குபவர்கள் மற்றும் தரவு விஞ்ஞானிகளின் தனிப்பட்ட இயந்திரங்களை முன்கூட்டியே முன்கூட்டியே நீங்கள் நியாயமான முறையில் சார்ந்து இருக்க முடியும்.

source: Technologies which support this model:
eo: Jen teĥnikoj subtenantaj tiun modelon:
ja: このモデルを支える技術:
pt_br: Tecnologias que oferecem suporte a este modelo:
ru: Технологии, поддерживающие эту модель:
ta: இந்த மாதிரியை ஆதரிக்கும் தொழில்நுட்பங்கள்:

source: :doc:`zipapp <python:library/zipapp>` (does not help manage dependencies, requires Python 3.5+)
eo: :doc:`zipapp <python:library/zipapp>` (ne helpas mastrumi dependecojn, postulas Python 3.5+)
ja: :doc:`zipapp <python:library/zipapp>` (依存関係を管理する助けにはならない。Python 3.5+ が必要。)
pt_br: :doc:`zipapp <python:library/zipapp>` (não ajuda a gerenciar dependências, requer Python 3.5+)
ru: :doc:`zipapp <python:library/zipapp>` (не помогает управлять зависимостями, требует Python 3.5+)
ta: :doc:`zipapp <python:library/zipapp>` (does not உதவி manage dependencies, requires பைதான் 3.5+)

source: :gh:`shiv <linkedin/shiv#user-content-shiv>` (requires Python 3)
eo: :gh:`shiv <linkedin/shiv#user-content-shiv>` (postulas Python 3)
ja: :gh:`shiv <linkedin/shiv#user-content-shiv>` (Python 3 が必要)
pt_br: :gh:`shiv <linkedin/shiv#user-content-shiv>` (requer Python 3)
ru: :gh:`shiv <linkedin/shiv#user-content-shiv>` (требуется Python 3)
ta: :gh:`shiv <linkedin/shiv#user-content-shiv>` (requires பைதான் 3)

source: Of all the approaches here, depending on a pre-installed Python relies the most on the target environment. Of course, this also makes for the smallest package, as small as single-digit megabytes, or even kilobytes.
eo: El tiuj metodoj, dependado de antaŭinstalita Python-interpretilo plej dependas de la cela medio. Tio ankaŭ signifas, ke tiu metodo rezultigas la plej malgrandan pakon, de kelkaj megabajtoj aŭ eĉ kilobajtoj.
ja: ここでのすべてのアプローチでは、ほとんどのインストール先となる環境にインストール済みの Python があるものと当てにしています。もちろん、これは、一桁メガバイト規模やさらにはキロバイト規模の最小のパッケージを作ることになります。
pt_br: De todas as abordagens aqui, depender de um Python pré-instalado depende mais do ambiente de destino. Claro, isso também contribui para o menor pacote, tão pequeno quanto megabytes de um dígito, ou mesmo kilobytes.
ru: Из всех представленных здесь подходов зависимость от предустановленного Python в наибольшей степени зависит от целевого окружения. Конечно, при этом получается и самый маленький пакет, размером в одну цифру мегабайта или даже килобайта.
ta: இங்குள்ள அனைத்து அணுகுமுறைகளிலும், முன்பே நிறுவப்பட்ட பைத்தானைப் பொறுத்து இலக்கு சூழலை மிகவும் நம்பியுள்ளது. நிச்சயமாக, இது ஒற்றை இலக்க மெகாபைட்டுகள் அல்லது கிலோபைட்டுகள் போன்ற சிறிய தொகுப்பையும் உருவாக்குகிறது.

source: In general, decreasing the dependency on the target system increases the size of our package, so the solutions here are roughly arranged by increasing size of output.
eo: Ĝenerale, ju malpli la pako dependas de la cela sistemo, des pli granda estas la pako. Tial, la opcioj estas ordigitaj proksimume laŭ kreskanta grando de la eligaĵo.
ja: 一般に、インストール先の環境に対する依存を減少させるとパッケージ側のサイズは大きくなるので、ここで述べる解決策は、おおまかに出力となるパッケージのサイズの増える順番に整理しています。
pt_br: Em geral, diminuir a dependência do sistema de destino aumenta o tamanho do nosso pacote, portanto, as soluções aqui são organizadas de forma grosseira pelo aumento do tamanho da saída.
ru: В общем случае уменьшение зависимости от целевой системы увеличивает размер нашего пакета, поэтому решения здесь расположены примерно по возрастанию размера выхода.
ta: பொதுவாக, இலக்கு அமைப்பின் சார்புநிலையைக் குறைப்பது எங்கள் தொகுப்பின் அளவை அதிகரிக்கிறது, எனவே இங்குள்ள தீர்வுகள் வெளியீட்டின் அளவை அதிகரிப்பதன் மூலம் தோராயமாக ஏற்பாடு செய்யப்படுகின்றன.

source: Depending on a separate software distribution ecosystem
eo: Dependi de aparta programdistribua ekosistemo
ja: 個別のソフトウェア配布エコシステムに依存する
pt_br: Dependendo de um ecossistema separado de distribuição de software
ru: В зависимости от отдельной экосистемы распространения программного обеспечения
ta: ஒரு தனி மென்பொருள் விநியோக சுற்றுச்சூழல் அமைப்பைப் பொறுத்து

source: For a long time many operating systems, including Mac and Windows, lacked built-in package management. Only recently did these OSes gain so-called "app stores", but even those focus on consumer applications and offer little for developers.
eo: Delonge je multaj mastrumaj sistemoj, inkluzive de macOS kaj Windows, mankis enkonstruita pakadministrilo. Nur ĵus tiuj mastrumaj sistemoj ekhavas la tiel nomitajn «programbutikojn», sed eĉ tiaj programbutikoj temas pri programoj por ordinaraj uzantoj kaj ne por programistoj.
ja: 長い間、Mac や Windows を含むさまざまなオペレーティングシステムは、組み込みのパッケージ管理システムを欠いてきました。ごく最近になって、これらの OS にも所謂「アプリストア (app stores)」が追加されましたが、しかし、まだ消費者向けのアプリケーションを扱っているだけであり、開発者の役に立つものは少ないのが現状です。
pt_br: Por um longo tempo, muitos sistemas operacionais, incluindo Mac e Windows, não tinham gerenciamento de pacotes integrado. Apenas recentemente esses sistemas operacionais ganharam as chamadas "*app store*", mas mesmo aqueles se concentram em aplicações de consumo e oferecem pouco para os desenvolvedores.
ru: Долгое время многие операционные системы, включая Mac и Windows, не имели встроенных средств управления пакетами. Лишь недавно в этих ОС появились так называемые "магазины приложений", но даже они ориентированы на потребительские приложения и мало что предлагают разработчикам.
ta: மேக் மற்றும் சாளரங்கள் உள்ளிட்ட பல இயக்க முறைமைகள் நீண்ட காலமாக உள்ளமைக்கப்பட்ட தொகுப்பு மேலாண்மை இல்லை. அண்மைக் காலத்தில் தான் இந்த OS கள் "பயன்பாட்டுக் கடைகள்" என்று அழைக்கப்படுவதைப் பெற்றன, ஆனால் அவை நுகர்வோர் பயன்பாடுகளில் கவனம் செலுத்துகின்றன, மேலும் டெவலப்பர்களுக்கு சிறிதளவே வழங்குகின்றன.

source: Developers long sought remedies, and in this struggle, emerged with their own package management solutions, such as `Homebrew <https://brew.sh/>`_. The most relevant alternative for Python developers is a package ecosystem called `Anaconda <https://en.wikipedia.org/wiki/Anaconda_(Python_distribution)>`_. Anaconda is built around Python and is increasingly common in academic, analytical, and other data-oriented environments, even making its way `into server-oriented environments <https://web.archive.org/web/20190403064038/https://www.paypal-engineering.com/2016/09/07/python-packaging-at-paypal/>`_.
ja: 長い間、開発者が解決方法を探し求めてきており、この格闘の中から `Homebrew <https://brew.sh/>`_ のような独自のパッケージ管理手法が勃興した。 Python 開発者にとっての最も適切な代替方法は、 `Anaconda <https://en.wikipedia.org/wiki/Anaconda_(Python_distribution)>`_ と呼ばれるパッケージエコシステムです。 Anaconda は Python を中核として作成されており、学術や分析やデータ主導の環境でより一層一般的になってきていて、`サーバ中心の環境に <https://web.archive.org/web/20190403064038/https://www.paypal-engineering.com/2016/09/07/python-packaging-at-paypal/>`_ さえ入り込んでいます。
pt_br: Os desenvolvedores buscaram soluções por muito tempo e, nessa luta, surgiram com suas próprias soluções de gerenciamento de pacotes, como o `Homebrew <https://brew.sh/>`_. A alternativa mais relevante para desenvolvedores Python é um ecossistema de pacotes chamado `Anaconda <https://en.wikipedia.org/wiki/Anaconda_(Python_distribution)>`_. O Anaconda é construído em torno do Python e é cada vez mais comum em ambientes acadêmicos, analíticos e outros ambientes orientados a dados, chegando até a ambientes orientados a servidor <https://web.archive.org/web/20190403064038/https://www.paypal-engineering.com/2016/09/07/python-packaging-at-paypal/>`_.
ru: Разработчики долго искали выход из ситуации, и в этой борьбе появились собственные решения по управлению пакетами, такие как `Homebrew <https://brew.sh/>`_. Наиболее актуальной альтернативой для разработчиков Python является экосистема пакетов под названием `Anaconda <https://en.wikipedia.org/wiki/Anaconda_(Python_distribution)>`_. Anaconda построена на основе Python и получает все большее распространение в академических, аналитических и других средах, ориентированных на работу с данными, и даже пробивается `в серверно-ориентированные среды` <https://web.archive.org/web/20190403064038/https://www.paypal-engineering.com/2016/09/07/python-packaging-at-paypal/>`_.
ta: உருவாக்குபவர்கள் நீண்டகாலமாக தீர்வுகளைத் தேடினர், இந்த போராட்டத்தில், `ஓம் ப்ரூ <https://brew.sh/>` _ போன்ற தங்கள் சொந்த தொகுப்பு மேலாண்மை தீர்வுகளுடன் வெளிப்பட்டனர். பைதான் டெவலப்பர்களுக்கு மிகவும் பொருத்தமான மாற்று `அனகோண்டா <https://en.wikipedia.org/wiki/anaconda_ (python_distribution)>` _. அனகோண்டா பைத்தானைச் சுற்றி கட்டப்பட்டுள்ளது மற்றும் கல்வி, பகுப்பாய்வு மற்றும் பிற தரவு சார்ந்த சூழல்களில் பெருகிய முறையில் பொதுவானது, சேவையக சார்ந்த சூழல்களில் கூட அதன் வழியை உருவாக்குகிறது <https://web.archive.org/web/20190403064038/https://www.paypal-nengineering.

source: Instructions on building and publishing for the Anaconda ecosystem:
eo: Instrukcioj pri konstruado kaj eldonado por la ekosistemo Anaconda:
ja: Anaconda エコシステム向けにビルドし公開するための指示書き:
pt_br: Instruções sobre como construir e publicar para o ecossistema do Anaconda:
ru: Инструкции по созданию и публикации для экосистемы Anaconda:
ta: அனகோண்டா சுற்றுச்சூழல் அமைப்பிற்கான கட்டிடம் மற்றும் வெளியீடு குறித்த வழிமுறைகள்:

source: `Building libraries and applications with conda <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html>`_
eo: `Kontrui bibliotekojn kaj aplikprogramojn per conda <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html>`_
ja: `conda でライブラリやアプリケーションをビルドする <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html>`_
ru: `Создание библиотек и приложений с помощью conda <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html>`_
ta: `காண்டாவுடன் நூலகங்கள் மற்றும் பயன்பாடுகளை உருவாக்குதல் <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html>` _

source: `Transitioning a native Python package to Anaconda <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`_
eo: `Migrigi indiĝenan Python-pakon al Anaconda <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`_
ja: `Python 由来のパッケージを Anaconda へ移行する <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`_
ru: `Переход родного пакета Python на Anaconda <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`_
ta: `ஒரு சொந்த பைதான் தொகுப்பை அனகோண்டா <https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>` _

source: A similar model involves installing an alternative Python distribution, but does not support arbitrary operating system-level packages:
eo: Simila modelo uzas instalado de alternativa Python-distribuo, sed ne subtenas arbitrajn mastrumasistemo-nivelajn pakojn:
ja: よく似たモデルが Python 配布物の代替物をインストールする際にも適用されますが、オペレーティングシステムレベルのパッケージはサポートしていません。
pt_br: Um modelo semelhante envolve a instalação de uma distribuição alternativa Python, mas não oferece suporte a pacotes arbitrários em nível de sistema operacional:
ru: Аналогичная модель предполагает установку альтернативного дистрибутива Python, но не поддерживает произвольные пакеты на уровне операционной системы:
ta: இதேபோன்ற மாதிரி மாற்று பைதான் விநியோகத்தை நிறுவுவதை உள்ளடக்கியது, ஆனால் தன்னிச்சையான இயக்க முறைமை-நிலை தொகுப்புகளை ஆதரிக்காது:

source: `ActiveState ActivePython <https://www.activestate.com/products/python/>`_
ta: `ஆக்டிவ்ச்டேட் ஆக்டிவ் பைதான் <https://www.activestate.com/products/python/>` _

source: Bringing your own Python executable
eo: Alporti vian propran Python-ruleblaĵon
ja: 自分の Python 実行形式を持ち込む
pt_br: Trazendo seu próprio executável Python
ru: Поставка собственного исполняемого файла Python'а
ta: உங்கள் சொந்த பைதான் இயங்கக்கூடியது

source: Computing as we know it is defined by the ability to execute programs. Every operating system natively supports one or more formats of programs they can natively execute.
eo: Komputadon difinas la kapablo ruli programojn. Ĉiu mastruma sistemo difinas unu aŭ plurajn formojn de indiĝene ruleblaj programoj.
ja: 我々が知るところのコンピューティングは、プログラムを実行する能力として定義されます。それぞれのオペレーティングシステムは、そのまま実行することが可能なひとつかもっと多くのプログラムフォーマットを元々サポートしています。
pt_br: A computação como a conhecemos é definida pela capacidade de executar programas. Cada sistema operacional oferece suporte nativamente a um ou mais formatos de programas que eles podem executar nativamente.
ru: Вычислительная техника, как мы ее знаем, определяется способностью выполнять программы. Каждая операционная система поддерживает один или несколько форматов программ, которые она может выполнять.
ta: கணக்கிடுவது எங்களுக்குத் தெரியும், இது நிரல்களை இயக்கும் திறனால் வரையறுக்கப்படுகிறது. ஒவ்வொரு இயக்க முறைமையும் அவர்கள் சொந்தமாக செயல்படுத்தக்கூடிய திட்டங்களின் ஒன்று அல்லது அதற்கு மேற்பட்ட வடிவங்களை ஆதரிக்கிறது.

source: There are many techniques and technologies which turn your Python program into one of these formats, most of which involve embedding the Python interpreter and any other dependencies into a single executable file.
eo: Ekzistas multaj teĥnikoj por paki Python-programon en unu el tiuj formoj, kiuj ofte enkorpigas la Python-interpretilon kaj aliajn dependaĵojn en unu ruleblan dosieron.
ja: そのようなフォーマットにあなたの Python プログラムを変換する数多くの手練手管や技術が存在していて、そのほとんどでは Python インタープリタやその他の依存先を単一の実行形式のファイルに組み込むことになるでしょう。
pt_br: Existem muitas técnicas e tecnologias que transformam seu programa Python em um desses formatos, a maioria das quais envolve a incorporação do interpretador Python e quaisquer outras dependências em um único arquivo executável.
ru: Существует множество методик и технологий, позволяющих превратить вашу программу на Python в один из этих форматов. Большинство из них подразумевает встраивание интерпретатора Python и других зависимостей в один исполняемый файл.
ta: உங்கள் பைதான் திட்டத்தை இந்த வடிவங்களில் ஒன்றாக மாற்றும் பல நுட்பங்கள் மற்றும் தொழில்நுட்பங்கள் உள்ளன, அவற்றில் பெரும்பாலானவை பைதான் மொழிபெயர்ப்பாளர் மற்றும் வேறு எந்த சார்புகளையும் ஒற்றை இயங்கக்கூடிய கோப்பில் உட்பொதிப்பது அடங்கும்.

source: This approach, called *freezing*, offers wide compatibility and seamless user experience, though often requires multiple technologies, and a good amount of effort.
eo: Tio, nomita «frostigo», provizas larĝan kongruecon kaj senjuntan sperton, kvankam tio ofte postulas plurajn teĥnikojn kaj multon da klopodo.
ja: *フリージング* と呼ばれるこの方法論は、しばしば複数の技術と共にかなりの努力を要求しますが、幅広い互換性と継ぎ目のないユーザ経験を提供します。
pt_br: Essa abordagem, chamada *congelamento*, oferece ampla compatibilidade e experiência perfeita do usuário, embora muitas vezes exija múltiplas tecnologias e uma boa quantidade de esforço.
ru: Такой подход, называемый *заморозкой*, обеспечивает широкую совместимость и беспроблемный пользовательский опыт, хотя зачастую требует использования нескольких технологий и значительных усилий.
ta: *முடக்கம் *என அழைக்கப்படும் இந்த அணுகுமுறை, பரந்த பொருந்தக்கூடிய தன்மை மற்றும் தடையற்ற பயனர் அனுபவத்தை வழங்குகிறது, இருப்பினும் பெரும்பாலும் பல தொழில்நுட்பங்கள் மற்றும் நல்ல முயற்சி தேவை.

source: A selection of Python freezers:
eo: Jen kelkaj Python-frostigiloj:
ja: Python フリーザの選択肢:
pt_br: Uma seleção de congeladores Python:
ru: Выбор морозильных камер Python:
ta: பைதான் உறைவிப்பான் தேர்வு:

source: `pyInstaller <https://pyinstaller.readthedocs.io/en/stable/>`_ - Cross-platform
eo: `pyInstaller <https://pyinstaller.readthedocs.io/en/stable/>`_ - Plurplatforma
ja: `pyInstaller <https://pyinstaller.readthedocs.io/en/stable/>`_ - クロスプラットフォーム
pt_br: `pyInstaller <https://pyinstaller.readthedocs.io/en/stable/>`_ - Multiplataforma
ru: `pyInstaller <https://pyinstaller.readthedocs.io/en/stable/>`_ – кроссплатформенный
ta: `pyinstaller <https://pyinstaller.readthedocs.io/en/stable/>` _ - குறுக்கு -தளம்

source: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ - Cross-platform
eo: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ - Plurplatforma
ja: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ - クロスプラットフォーム
pt_br: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ - Multiplataforma
ru: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ - Кроссплатформенный
ta: `cx_freeze <https://marcelotduarte.github.io/cx_freeze/>` _ - குறுக்கு -தளம்

source: `constructor <https://github.com/conda/constructor>`_ - For command-line installers
eo: `constructor <https://github.com/conda/constructor>`_ – Por komandliniaj instaliloj
ja: `constructor <https://github.com/conda/constructor>`_ - コマンドラインインストーラ向け
pt_br: `constructor <https://github.com/conda/constructor>`_ - Para instaladores de linha de comando
ru: `constructor <https://github.com/conda/constructor>`_ - Для инсталляторов командной строки
ta: கட்டளை -வரி நிறுவிகளுக்கு `கட்டமைப்பாளர் <https://github.com/conda/constructor>` _ -

source: `py2exe <http://www.py2exe.org/>`_ - Windows only
eo: `py2exe <http://www.py2exe.org/>`_ - nur Windows
ja: `py2exe <http://www.py2exe.org/>`_ - Windows 限定
pt_br: `py2exe <http://www.py2exe.org/>`_ - Windows apenas
ru: `py2exe <http://www.py2exe.org/>`_ - только для Windows
ta: `py2exe <http://www.py2exe.org/>` _ - சாளரங்கள் மட்டும்

source: `py2app <https://py2app.readthedocs.io/en/latest/>`_ - Mac only
eo: `py2app <https://py2app.readthedocs.io/en/latest/>`_ - nur Mac
ja: `py2app <https://py2app.readthedocs.io/en/latest/>`_ - Mac 限定
pt_br: `py2app <https://py2app.readthedocs.io/en/latest/>`_ - Mac apenas
ru: `py2app <https://py2app.readthedocs.io/en/latest/>`_ - только для Mac
ta: `py2app <https://py2app.readthedocs.io/en/latest/>` _ - மேக் மட்டும்

source: `osnap <https://github.com/jamesabel/osnap>`_ - Windows and Mac
eo: `osnap <https://github.com/jamesabel/osnap>`_ - Windows kaj Mac
ja: `osnap <https://github.com/jamesabel/osnap>`_ - Windows と Mac
pt_br: `osnap <https://github.com/jamesabel/osnap>`_ - Windows e Mac
ru: `osnap <https://github.com/jamesabel/osnap>`_ - Windows и Mac
ta: `osnap <https://github.com/jamesabel/osnap>` _ - சாளரங்கள் மற்றும் மேக்

source: `pynsist <https://pypi.org/project/pynsist/>`_ - Windows only
eo: `pynsist <https://pypi.org/project/pynsist/>`_ - nur Windows
ja: `pynsist <https://pypi.org/project/pynsist/>`_ - Windows 限定
pt_br: `pynsist <https://pypi.org/project/pynsist/>`_ - Windows apenas
ru: `pynsist <https://pypi.org/project/pynsist/>`_ - только для Windows
ta: `pynsist <https://pypi.org/project/pynsist/>` _ - சாளரங்கள் மட்டும்

source: Most of the above imply single-user deployments. For multi-component server applications, see :gh:`Chef Omnibus <chef/omnibus#user-content--omnibus>`.
eo: La ĉi-supraĵoj implicas disponigon por unu uzanto. Por plurkomponantaj servilaj programoj, vidu :gh:`Chef Omnibus <chef/omnibus#user-content--omnibus>`.
ja: 上記のものはほとんどが単独のユーザでの配置です。複数部分から構成されるサーバアプリケーション向けには :gh:`Chef Omnibus <chef/omnibus#user-content--omnibus>` を見てください。
pt_br: A maioria dos itens acima implica em implantações de um único usuário. Para aplicações de servidor com vários componentes, consulte :gh:`Chef Omnibus <chef/omnibus#user-content--omnibus>`.
ru: Большинство из вышеперечисленного подразумевает однопользовательское развертывание. Для многокомпонентных серверных приложений смотрите :gh:`Chef Omnibus <chef/omnibus#user-content--omnibus>`.
ta: மேலே உள்ள பெரும்பாலானவை ஒற்றை-பயனர் வரிசைப்படுத்தல்களைக் குறிக்கின்றன. பல-கூறு சேவையக பயன்பாடுகளுக்கு, காண்க: GH: `செஃப் ஆம்னிபச் <செஃப்/ஓம்னிபச்#பயனர்-உள்ளடக்கம்-ஓம்னிபச்>`.

source: Bringing your own userspace
eo: Alporti vian propran uzantospacon
ja: 自分自身のユーザスペースを持ち込む
pt_br: Trazendo seu próprio espaço de usuário
ru: Поставка собственного пользовательского пространства
ta: உங்கள் சொந்த பயனர்களைக் கொண்டுவருகிறது
