Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: So much of Python's practical power comes from its ability to integrate with the software ecosystem, in particular libraries written in C, C++, Fortran, Rust, and other languages.
eo: Multo da praktika potenco de Python devenas de la kapablo integriĝi al la programa ekosistemo, speciale bibliotekoj verkitaj en C, C++, Fortrano, Rust kaj aliaj lingvoj.
ja: Python の実際的な力の多くは、ソフトウェアのエコシステム、とりわけ C ・ C++ ・ Fortran ・ Rust ・その他の言語で書かれたライブラリと統合できる能力からもたらされます。
pt_br: Grande parte do poder prático do Python vem de sua capacidade de integração com o ecossistema de software, em particular bibliotecas escritas em C, C++, Fortran, Rust e outras linguagens.
ru: Практическая мощь Python во многом обусловлена его способностью интегрироваться с экосистемой программного обеспечения, в частности с библиотеками, написанными на C, C++, Fortran, Rust и других языках.
ta: சி, சி ++, ஃபோர்டிரான், ரச்ட் மற்றும் பிற மொழிகளில் எழுதப்பட்ட குறிப்பாக நூலகங்களில், மென்பொருள் சுற்றுச்சூழல் அமைப்புடன் ஒருங்கிணைக்கும் திறனில் இருந்து பைத்தானின் நடைமுறை ஆற்றல் அதிகம்.

source: Not all developers have the right tools or experiences to build these components written in these compiled languages, so Python created the :term:`Wheel`, a package format designed to ship libraries with compiled artifacts. In fact, Python's package installer, ``pip``, always prefers wheels because installation is always faster, so even pure-Python packages work better with wheels.
ja: このようなコンパイルを必要とする言語で書かれた部品をビルドするのに適切なツールや経験をすべての開発者が持っているわけではないので、ライブラリをコンパイル済みの状態で出荷するように設計された :term:`Wheel` を Python は作りました。実際に、 Python のパッケージインストーラである ``pip`` は、インストールが素早くできるので常に wheel ファイルを選好するし、純 Python のパッケージでさえも wheel ファイルの方がうまく動作します。
pt_br: Nem todos os desenvolvedores têm as ferramentas ou experiências certas para construir esses componentes escritos nessas linguagens compiladas, então Python criou o :term:`Wheel`, um formato de pacote projetado para enviar bibliotecas com artefatos compilados. Na verdade, o instalador do pacote Python, ``pip``, sempre prefere wheels porque a instalação é sempre mais rápida, então mesmo os pacotes puro Python funcionam melhor com wheels.
ru: Не у всех разработчиков есть нужные инструменты или опыт для создания компонентов, написанных на этих компилируемых языках, поэтому Python создал :term:`Wheel`, формат пакета, предназначенный для поставки библиотек со скомпилированными артефактами. На самом деле, программа установки пакетов Python, ``pip``, всегда предпочитает wheels, потому что установка всегда быстрее, поэтому даже чисто питоновские пакеты лучше работают с wheels.
ta: இந்த தொகுக்கப்பட்ட மொழிகளில் எழுதப்பட்ட இந்த கூறுகளை உருவாக்க எல்லா டெவலப்பர்களுக்கும் சரியான கருவிகள் அல்லது அனுபவங்கள் இல்லை, எனவே பைதான் உருவாக்கியது: கால: `வீல்`, தொகுக்கப்பட்ட கலைப்பொருட்களுடன் நூலகங்களை அனுப்ப வடிவமைக்கப்பட்ட ஒரு தொகுப்பு வடிவமாகும். உண்மையில், பைத்தானின் தொகுப்பு நிறுவி, `` பிப்``, எப்போதும் சக்கரங்களை விரும்புகிறது, ஏனெனில் நிறுவல் எப்போதும் வேகமாக இருக்கும், எனவே தூய-பைதான் தொகுப்புகள் கூட சக்கரங்களுடன் சிறப்பாக செயல்படுகின்றன.

source: Binary distributions are best when they come with source distributions to match. Even if you don't upload wheels of your code for every operating system, by uploading the sdist, you're enabling users of other platforms to still build it for themselves. Default to publishing both sdist and wheel archives together, *unless* you're creating artifacts for a very specific use case where you know the recipient only needs one or the other.
eo: Duuma distribuo plej taŭgas, kiam ĝi venas kun respondanta fonta distribuo. Eĉ se vi ne alŝutas wheel de via kodo por ĉiu mastruma sistemo, se vi alŝutas fontan distribuon, vi ebligas uzantojn de aliaj platformoj konstrui wheel por si. Eldonu kaj fontan distribuon kaj wheel-arĥivon kune, *krom se* vi kreas artefaktojn por tiu kliento, kiu specife nur bezonas unu el la duo.
ja: バイナリ配布物は、対応するソースコード配布物と一緒に配布されるのが最良です。 あらゆるオペレーティングシステム用のソースコードの wheel ファイルをアップロードしていないとしても、sdist をアップロードすることで他のプラットフォームのユーザたちがビルドすることができるかもしれません。あなたが極めて特殊なユースケース向けにプログラムを作成していて、受け取る人たちがいずれか一方しか必要としないことを熟知しているので *ない限り* 、 sdist と wheel の両方を一緒に公開することをデフォルトにしてください。
pt_br: As distribuições binárias são melhores quando vêm com distribuições de fonte correspondentes. Mesmo que você não envie wheels do seu código para todos os sistemas operacionais, ao enviar o sdist, você permite que usuários de outras plataformas ainda o construam por conta própria. O padrão é publicar arquivos sdist e wheel juntos, *a menos* que você esteja criando artefatos para um caso de uso muito específico, onde sabe que o destinatário só precisa de um ou de outro.
ru: Лучше всего, когда бинарные дистрибутивы сопровождаются дистрибутивами с исходным кодом. Даже если вы не выкладываете "колеса" своего кода для каждой операционной системы, выкладывая sdist, вы даете возможность пользователям других платформ собрать его для себя. По умолчанию рекомендуется публиковать архивы sdist и wheel вместе, *за исключением случаев, когда вы создаете артефакты для очень специфического случая использования, когда вы знаете, что получателю нужно только одно или другое.
ta: பொருந்தக்கூடிய மூல விநியோகங்களுடன் வரும்போது பைனரி விநியோகங்கள் சிறந்தவை. ஒவ்வொரு இயக்க முறைமைக்கும் உங்கள் குறியீட்டின் சக்கரங்களை நீங்கள் பதிவேற்றாவிட்டாலும், SDIST ஐப் பதிவேற்றுவதன் மூலம், பிற தளங்களின் பயனர்களை தங்களைத் தாங்களே உருவாக்கிக் கொள்ள உதவுகிறீர்கள். SDIST மற்றும் சக்கர காப்பகங்கள் இரண்டையும் ஒன்றாக வெளியிடுவதற்கான இயல்புநிலை, * இல்லையென்றால் * நீங்கள் ஒரு குறிப்பிட்ட பயன்பாட்டு வழக்குக்கு கலைப்பொருட்களை உருவாக்குகிறீர்கள், அங்கு பெறுநருக்கு ஒன்று அல்லது மற்றொன்று மட்டுமே தேவை என்பதை நீங்கள் அறிவீர்கள்.

source: Python and PyPI make it easy to upload both wheels and sdists together. Just follow the :doc:`tutorials/packaging-projects` tutorial.
eo: Python kaj PyPI faciligas kune alŝuti kaj fontan distribuon kaj wheel. Sekvu la lernilon :doc:`tutorials/packaging-projects`.
ja: Python と PyPI を使えば、wheel ファイルと sdist ファイルを一緒にアップロードするのが簡単になります。 :doc:`tutoeials/packaging-projects` のチュートリアルに従うだけです。
pt_br: Python e PyPI facilitam o envio de wheels e sdists juntos. Basta seguir o tutorial :doc:`tutorials/packaging-projects`.
ru: Python и PyPI позволяют легко загружать и wheels, и sdists вместе. Просто следуйте руководству :doc:`tutorials/packaging-projects`.
ta: பைதான் மற்றும் பைபி சக்கரங்கள் மற்றும் எச்.டிச்ட்ச் இரண்டையும் ஒன்றாக பதிவேற்றுவதை எளிதாக்குகின்றன. பின்வருமாறு: டாக்: `டுடோரியல்கள்/பேக்கேசிங்-திட்டங்கள்` டுடோரியல்.

source: A summary of Python's packaging capabilities for tools and libraries.
eo: Resumo pri la pakaj kapabloj de Python por iloj kaj bibliotekoj.
ja: ツールやライブラリ向けの Python のパッケージング機能の概要。
pt_br: Um resumo das capacidades de empacotamento do Python para ferramentas e bibliotecas.
ru: Краткое описание возможностей Python по упаковке инструментов и библиотек.
ta: கருவிகள் மற்றும் நூலகங்களுக்கான பைத்தானின் பேக்கேசிங் திறன்களின் சுருக்கம்.

source: Python's recommended built-in library and tool packaging technologies. Excerpted from `The Packaging Gradient (2017) <https://www.youtube.com/watch?v=iLVNWfPWAC8>`_.
eo: La rekomendataj aprioraj biblioteko- kaj ilo-pakadaj teĥnikoj por Python. El `The Packaging Gradient (2017) <https://www.youtube.com/watch?v=iLVNWfPWAC8>`_.
ja: Python が推奨するライブラリやツールをパッケージングする技術。`パッケージングの変遷 (2017) <https://www.youtube.com/watch?v=iLVNWfPWAC8>`_ から抜粋。
pt_br: Bibliotecas embutidas recomendadas e tecnologias de empacotamento de ferramentas do Python. Extraído de `The Packaging Gradient (2017) <https://www.youtube.com/watch?v=iLVNWfPWAC8>`_.
ru: Рекомендуемые в Python технологии упаковки встроенных библиотек и инструментов. Отрывок из книги `Градиент упаковки (2017) <https://www.youtube.com/watch?v=iLVNWfPWAC8>`_.
ta: பைத்தானின் பரிந்துரைக்கப்பட்ட உள்ளமைக்கப்பட்ட நூலகம் மற்றும் கருவி பேக்கேசிங் தொழில்நுட்பங்கள். `தி பேக்கேசிங் சாய்வு (2017) <https://www.youtube.com/watch?v=ilvnwfpwac8>` _ இலிருந்து எடுக்கப்பட்டது.

source: Packaging Python applications
eo: Paki Python-aplikprogramojn
ja: Python アプリケーションをパッケージングする
pt_br: Empacotando aplicações do Python
ru: Упаковка Python'ьих приложений
ta: பைதான் பயன்பாடுகள் பேக்கேசிங்

source: So far we've only discussed Python's native distribution tools. Based on our introduction, you would be correct to infer these built-in approaches only target environments which have Python, and an audience who knows how to install Python packages.
eo: Ĝis nun ni nur diskutis la indiĝenajn distribuilojn de Python. Tiuj indiĝenaj manieroj nur celas mediojn jam havantajn Python kaj tiujn uzantojn, kiuj scias kiel instali Python-pakon.
ja: ここまで、 Python に元々組み込まれている配布ツールについてだけ議論してきました。この導入部分に基づいて、これらのビルトインされたアプローチが Python のある環境だけを対象にしたもので、聞き手は Python パッケージのインストール方法を知っているものと推測するのは正しいでしょう。
pt_br: Até agora, discutimos apenas as ferramentas de distribuição nativas do Python. Com base em nossa introdução, você estaria correto em inferir que essas abordagens embutidas têm como alvo apenas ambientes que possuem Python e um público que sabe como instalar pacotes Python.
ru: До сих пор мы обсуждали только встроенные средства распространения Python. Исходя из нашего вступления, вы можете сделать вывод, что эти встроенные подходы предназначены только для сред, в которых есть Python, и для аудитории, которая знает, как устанавливать пакеты Python.
ta: இதுவரை நாங்கள் பைத்தானின் சொந்த விநியோக கருவிகளைப் பற்றி மட்டுமே விவாதித்தோம். எங்கள் அறிமுகத்தின் அடிப்படையில், இந்த உள்ளமைக்கப்பட்ட அணுகுமுறைகளை பைதான் கொண்ட இலக்கு சூழல்களையும், பைதான் தொகுப்புகளை எவ்வாறு நிறுவுவது என்று தெரிந்த பார்வையாளர்களையும் ஊகிப்பது சரியானதாக இருக்கும்.

source: With the variety of operating systems, configurations, and people out there, this assumption is only safe when targeting a developer audience.
eo: Pro la diverseco de mastrumaj sistemoj, agordoj, kaj homoj, oni nur povas supozi tion celante programistojn.
ja: 多様なオペレーティングシステム・設定・そこに居る人々を想定すると、聞き手が開発者である場合にだけこの仮定が正当であると言えます。
pt_br: Com a variedade de sistemas operacionais, configurações e pessoas por aí, essa suposição só é segura quando se destina a um público de desenvolvedores.
ru: Учитывая разнообразие операционных систем, конфигураций и людей, это предположение безопасно только при ориентации на аудиторию разработчиков.
ta: பல்வேறு இயக்க முறைமைகள், உள்ளமைவுகள் மற்றும் அங்குள்ள நபர்களுடன், உருவாக்குபவர் பார்வையாளர்களை குறிவைக்கும் போது மட்டுமே இந்த அனுமானம் பாதுகாப்பானது.

source: Python's native packaging is mostly built for distributing reusable code, called libraries, between developers. You can piggyback **tools**, or basic applications for developers, on top of Python's library packaging, using technologies like :doc:`setuptools entry_points <setuptools:userguide/entry_point>`.
eo: La indiĝena pakada meĥanismo de Python estas plejparte por distribui reuzeblan kodon (t.e. bibliotekon) inter programistoj. Oni povas ankaŭ distribui **ilojn** (bazajn programojn por programistoj) per la pakada meĥanismo por bibliotekoj uzante teĥnikojn kiel :doc:`entry_points de setuptools <setuptools:userguide/entry_point>`.
ja: Python に元々組み込まれているパッケージング機能は、ほとんどの場合には、開発者間で再利用可能なソースコードや呼び出されるライブラリを配布するために作られています。 :doc:`setuptools のエントリポイント <setuptools:userguide/entry_point>` のような技術を用いることで、 Python の packaging ライブラリの上に構築されている **ツール類** や開発者向けの基本的なアプリケーションに便乗することができます。
pt_br: O empacotamento nativo do Python é construído principalmente para distribuir código reutilizável, chamado de bibliotecas, entre os desenvolvedores. Você pode adicionar **ferramentas** ou aplicações básicas para desenvolvedores ao pacote de biblioteca do Python, usando tecnologias como :doc:`entry_points do setuptools <setuptools:userguide/entry_point>`.
ru: Собственная упаковка Python в основном создана для распространения многократно используемого кода, называемого библиотеками, между разработчиками. Вы можете создавать **инструменты**, или базовые приложения для разработчиков, поверх упаковки библиотек Python, используя такие технологии, как :doc:`setuptools entry_points <setuptools:userguide/entry_point>`.
ta: டெவலப்பர்களுக்கு இடையில் நூலகங்கள் எனப்படும் மறுபயன்பாட்டு குறியீட்டை விநியோகிப்பதற்காக பைதானின் சொந்த பேக்கேசிங் பெரும்பாலும் கட்டப்பட்டுள்ளது. பைத்தானின் நூலக பேக்கேசிங்கின் மேல், டெவலப்பர்களுக்கான அடிப்படை பயன்பாடுகளை நீங்கள் பிக்பேக் ** கருவிகள் ** அல்லது டெவலப்பர்களுக்கான அடிப்படை பயன்பாடுகள், இது போன்ற தொழில்நுட்பங்களைப் பயன்படுத்தலாம்: டாக்: `செட்டப்டூல்ச் என்ட்ரிச் <செட்டப்டூல்ச்: யூசர்சூட்/என்ட்ரி_போன்ட்>`.

source: Libraries are building blocks, not complete applications. For distributing applications, there's a whole new world of technologies out there.
eo: Biblioteko estas konstrua bloko, ne kompleta aplikprogramo. Por distribui aplikprogramon, ekzistas mondo da teĥnikoj.
ja: ライブラリは部品であって完成したアプリケーションではありません。アプリケーションを配布するには、全く新しい技術の世界が広がっています。
pt_br: Bibliotecas são blocos de construção, não aplicações completas. Para distribuir aplicações, existe um novo mundo de tecnologias por aí.
ru: Библиотеки - это строительные блоки, а не готовые приложения. Для распространения приложений существует целый мир новых технологий.
ta: நூலகங்கள் கட்டும் தொகுதிகள், முழுமையான பயன்பாடுகள் அல்ல. பயன்பாடுகளை விநியோகிக்க, தொழில்நுட்பங்களின் புதிய உலகம் அங்கே உள்ளது.

source: The next few sections organize these application packaging options according to their dependencies on the target environment, so you can choose the right one for your project.
eo: La sekvaj paragrafoj organizas tiujn opciojn pri pakado de programo laŭ la dependeco de la cela medio, por helpi vin elekti taŭgan opcion por via projekto.
ja: ここからのいくつかの節では、ターゲットとなる環境への依存関係に従ってこのようなアプリケーションをパッケージングする選択肢を整理し、あなたのプロジェクトに最適なものを選択できるようにしましょう。
pt_br: As próximas seções organizam essas opções de pacote de aplicações de acordo com suas dependências no ambiente de destino, para que você possa escolher o certo para o seu projeto.
ru: В следующих нескольких разделах эти варианты упаковки приложений расположены в соответствии с их зависимостью от целевой среды, чтобы вы могли выбрать подходящий для своего проекта.
ta: அடுத்த சில பிரிவுகள் இந்த பயன்பாட்டு பேக்கேசிங் விருப்பங்களை இலக்கு சூழலில் அவற்றின் சார்புகளுக்கு ஏற்ப ஒழுங்கமைக்கின்றன, எனவே உங்கள் திட்டத்திற்கான சரியானதை நீங்கள் தேர்வு செய்யலாம்.

source: Depending on a framework
eo: Dependi de kadro
ja: フレームワークに依存する
pt_br: Dependendo de um framework
ru: В зависимости от фреймворка
ta: ஒரு கட்டமைப்பைப் பொறுத்து

source: Some types of Python applications, like web site backends and other network services, are common enough that they have frameworks to enable their development and packaging. Other types of applications, like dynamic web frontends and mobile clients, are complex enough to target that a framework becomes more than a convenience.
eo: Kelkaj specoj de Python-programoj, kiel reteja malfasado aŭ alia reta servo, estas tiel oftaj, ke kadroj ebligas la verkadon kaj pakadon de tiaj programoj. Aliaj specoj de programoj, kiel dinamika TTT-fasado aŭ poŝaparata kliento, estas tiel komplikaj, ke kadro necesas.
ja: ウェブサイトのバックエンドやその他のネットワークサービスのような、いくつかの種類の Python アプリケーションでは、その開発とパッケージングを可能にするフレームワークが存在することは極めてありふれたことです。動的ウェブのフロントエンドやモバイルクライアントのような他の種類のアプリケーションはとても複雑で、フレームワークが単に便利という以上の存在になっています。
pt_br: Alguns tipos de aplicações Python, como backends de sites e outros serviços de rede, são comuns o suficiente para que tenham estruturas para permitir seu desenvolvimento e empacotamento. Outros tipos de aplicações, como frontends web dinâmicos e clientes móveis, são complexos o suficiente para fazer com que uma estrutura se torne mais do que uma conveniência.
ru: Некоторые типы приложений Python, такие как бэкенды веб-сайтов и другие сетевые сервисы, достаточно распространены, чтобы для их разработки и упаковки существовали фреймворки. Другие типы приложений, такие как динамические веб-фронтенды и мобильные клиенты, достаточно сложны, чтобы фреймворк стал не просто удобством.
ta: வலைத்தள பின்தளத்தில் மற்றும் பிற பிணையம் சேவைகள் போன்ற சில வகையான பைதான் பயன்பாடுகள் அவற்றின் வளர்ச்சி மற்றும் பேக்கேசிங் செயல்படுத்த கட்டமைப்பைக் கொண்டிருக்கும் அளவுக்கு பொதுவானவை. மாறும் வெப் ஃபிரண்டண்ட்ச் மற்றும் மொபைல் கிளையண்டுகள் போன்ற பிற வகையான பயன்பாடுகள், ஒரு கட்டமைப்பை ஒரு வசதியை விட அதிகமாக மாறுகின்றன என்பதை குறிவைக்க போதுமான சிக்கலானவை.

source: In all these cases, it makes sense to work backwards, from the framework's packaging and deployment story. Some frameworks include a deployment system which wraps the technologies outlined in the rest of the guide. In these cases, you'll want to defer to your framework's packaging guide for the easiest and most reliable production experience.
ja: これら全てのケースで、フレームワークのパッケージングと配置の物語から振り返ってみるのが妥当でしょう。いくつかのフレームワークは、このガイドの残りの部分で概要を描き出す技術を内包する配置システムを含んでいます。このような場合には、最も簡単で最も信頼できる製品レベルの経験を積むまで、あなたのフレームワークのパッケージングガイドを延期しておきたくなるでしょう。
pt_br: Em todos esses casos, faz sentido trabalhar de trás para frente, a partir da história de empacotamento e implantação da estrutura. Algumas estruturas incluem um sistema de implantação que envolve as tecnologias descritas no restante do guia. Nesses casos, você desejará consultar o guia de empacotamento de sua estrutura para obter a experiência de produção mais fácil e confiável.
ru: Во всех этих случаях имеет смысл работать в обратном направлении, начиная с истории упаковки и развертывания фреймворка. Некоторые фреймворки включают в себя систему развертывания, в которой используются технологии, описанные в остальной части руководства. В этих случаях вам лучше обратиться к руководству по упаковке вашего фреймворка, чтобы получить наиболее простой и надежный опыт производства.
ta: இந்த எல்லா சந்தர்ப்பங்களிலும், கட்டமைப்பின் பேக்கேசிங் மற்றும் வரிசைப்படுத்தல் கதையிலிருந்து பின்னோக்கி வேலை செய்வது அர்த்தமுள்ளதாக இருக்கிறது. சில கட்டமைப்புகளில் ஒரு வரிசைப்படுத்தல் அமைப்பு அடங்கும், இது வழிகாட்டியின் மற்ற பகுதிகளில் கோடிட்டுக் காட்டப்பட்ட தொழில்நுட்பங்களை மூடுகிறது. இந்த சந்தர்ப்பங்களில், உங்கள் கட்டமைப்பின் பேக்கேசிங் வழிகாட்டியை எளிதான மற்றும் மிகவும் நம்பகமான விளைவாக்கம் அனுபவத்திற்காக ஒத்திவைக்க விரும்புவீர்கள்.

source: If you ever wonder how these platforms and frameworks work under the hood, you can always read the sections beyond.
eo: Se vi scivolas, kiel tiuj platformoj kaj kadroj interne funkcias, legu la ĉi-subajn paragrafojn.
ja: このようなプラットフォームやフレームワークが内部でどのように動作しているのかと不思議に思うのであれば、いつでもその先の節を読めば良いでしょう。
pt_br: Se você já se perguntou como essas plataformas e estruturas funcionam nos bastidores, você sempre pode ler as seções seguintes.
ru: Если вам интересно, как эти платформы и фреймворки работают "под капотом", вы всегда можете прочитать разделы дальше.
ta: இந்த தளங்களும் கட்டமைப்புகளும் பேட்டைக்கு அடியில் எவ்வாறு செயல்படுகின்றன என்பதை நீங்கள் எப்போதாவது ஆச்சரியப்படுகிறீர்கள் என்றால், நீங்கள் எப்போதும் அப்பால் உள்ள பிரிவுகளை படிக்கலாம்.

source: Service platforms
eo: Servaj platformoj
ja: サービスプラットフォーム
pt_br: Plataformas de serviço
ru: Сервисные платформы
ta: பணி தளங்கள்

source: If you're developing for a "`Platform-as-a-Service <https://en.wikipedia.org/wiki/Platform_as_a_service>`_" or "PaaS", you are going to want to follow their respective packaging guides. These types of platforms take care of packaging and deployment, as long as you follow their patterns. Most software does not fit one of these templates, hence the existence of all the other options below.
eo: Se oni programas por «`Platformo-kiel-Servo <https://en.wikipedia.org/wiki/Platform_as_a_service>`_» (mallongigite PaaS), oni sekvu la pakadan gvidilon de la platformo. Tia platformo prizorgas pakadon kaj disponigon, se oni sekvas la gvidnormojn. La plejmulto da programoj ne estas por tia platformo; tial ekzistas la aliaj opcioj ĉi-subaj.
ja: "`Platform-as-a-Service <https://en.wikipedia.org/wiki/Platform_as_a_service>`_" もしくは "PaaS" 上で開発を行っているのであれば、当該 PaaS のパッケージガイドに従う方が良いと思うようになることでしょう。このようなタイプのプラットフォームは、彼らの流儀に従っている限りはパッケージングやデプロイメントの面倒を見てくれます。後述する他のすべてのオプションが存在するので、ほとんどのソフトウェアはこれらのテンプレートのひとつにはうまく合致しません。
ru: Если вы разрабатываете для "Платформы как сервиса <https://en.wikipedia.org/wiki/Platform_as_a_service>`_" или "PaaS", вам следует следовать соответствующим руководствам по упаковке. Эти типы платформ берут на себя заботу об упаковке и развертывании, если вы следуете их шаблонам. Большинство программ не подходит ни под один из этих шаблонов, поэтому существуют все остальные варианты, описанные ниже.
ta: நீங்கள் ஒரு "இயங்குதள-அச்-அச்-எ-சர்வீச் <https://en.wikipedia.org/wiki/platform_as_a_service>` _ "அல்லது" பாச் "க்கு வளர்ந்து வருகிறீர்கள் என்றால், நீங்கள் அந்தந்த பேக்கேசிங் வழிகாட்டிகளைப் பின்பற்ற விரும்புகிறீர்கள் . இந்த வகையான தளங்கள் நீங்கள் அவற்றின் வடிவங்களைப் பின்பற்றும் வரை, பேக்கேசிங் மற்றும் வரிசைப்படுத்தலை கவனித்துக்கொள்கின்றன. பெரும்பாலான மென்பொருள்கள் இந்த வார்ப்புருக்களில் ஒன்றுக்கு பொருந்தாது, எனவே கீழே உள்ள மற்ற எல்லா விருப்பங்களின் இருப்பு.

source: If you're developing software that will be deployed to machines you own, users' personal computers, or any other arrangement, read on.
eo: Se vi evoluigas programon disponigotan al maŝinoj posedataj de vi, aŭ la personaj komputiloj de uzantoj, aŭ alia loko, legu plu.
ja: 自分の機材やユーザのパーソナルコンピュータやその他の機材に配置することを想定するソフトウェアを開発しているのであれば、このまま読み進めてください。
pt_br: Se você estiver desenvolvendo um software que será implantado em suas máquinas, computadores pessoais de usuários ou qualquer outro arranjo, continue lendo.
ru: Если вы разрабатываете программное обеспечение, которое будет развернуто на машинах, принадлежащих вам, персональных компьютерах пользователей или в любом другом месте, читайте дальше.
ta: நீங்கள் வைத்திருக்கும் இயந்திரங்கள், பயனர்களின் தனிப்பட்ட கணினிகள் அல்லது வேறு எந்த ஏற்பாட்டிற்கும் பயன்படுத்தப்படும் மென்பொருளை நீங்கள் உருவாக்குகிறீர்கள் என்றால் படிக்கவும்.

source: Web browsers and mobile applications
eo: TTT-legiloj kaj poŝaparatoj
ja: ウェブブラウザとモバイルアプリケーション
pt_br: Navegadores web e aplicações móveis
ru: Веб-браузеры и мобильные приложения
ta: வலை உலாவிகள் மற்றும் மொபைல் பயன்பாடுகள்

source: Python's steady advances are leading it into new spaces. These days you can write a mobile app or web application frontend in Python. While the language may be familiar, the packaging and deployment practices are brand new.
eo: La progresado de Python gvidas ĝin en novajn spacojn. Nuntempe oni povas verki poŝaparatan programon aŭ retprograman fasadon per Python. Dum la lingvo estas konata, la praktiko pri pakado kaj disponigado estas nova.
ja: Python は着実に前進して新しい世界に突入しています。最近では、モバイルアプリやウェブアプリケーションのフロントエンドを Python で書くことができるようになっています。言語自体には慣れていても、パッケージングや配置の実務は全く新しいものになっています。
pt_br: Os avanços constantes do Python estão levando-o a novos espaços. Hoje em dia, você pode escrever uma aplicação móvel ou frontend de aplicação web no Python. Embora a linguagem possa ser familiar, as práticas de empacotamento e implantação são novas.
ru: Постоянное развитие Python приводит его в новые пространства. В наши дни на Python можно написать мобильное приложение или фронтенд веб-приложения. Хотя язык может быть знакомым, практика упаковки и развертывания совершенно новая.
ta: பைத்தானின் நிலையான முன்னேற்றங்கள் அதை புதிய இடங்களுக்கு இட்டுச் செல்கின்றன. இந்த நாட்களில் நீங்கள் பைத்தானில் மொபைல் பயன்பாடு அல்லது வலை பயன்பாட்டு முன்பக்கத்தை எழுதலாம். மொழி தெரிந்திருக்கலாம் என்றாலும், பேக்கேசிங் மற்றும் வரிசைப்படுத்தல் நடைமுறைகள் புத்தம் புதியவை.
