Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Both `Travis CI`_ and Appveyor_ require a `YAML <https://yaml.org>`_-formatted file as specification for the instructions for testing. If any tests fail, the output log for that specific configuration can be inspected.
eo: Kaj `Travis CI`_ kaj Appveyor_ postulas `YAML <https://yaml.org>`_-dosieron specifantan la instrukciojn pri testado. Se iu testo malsukcesos, la eliga protokolo pri tiu estas inspektebla.
ja: `Travis CI`_ も Appveyor_ も、 `YAML <https://yaml.org>`_ 形式のテスト仕様書を必要とします。いずれかのテストが失敗したら、そのテスト指示設定に関するログ出力を調査することができます。
pt_br: Tanto o `Travis CI`_ quanto o Appveyor_ exigem um arquivo formatado em `YAML <https://yaml.org>`_ como especificação para as instruções de teste. Se algum teste falhar, o log de saída para essa configuração específica pode ser inspecionado.
ru: И `Travis CI`_, и Appveyor_ требуют файл формата `YAML <https://yaml.org>`_ в качестве спецификации инструкций для тестирования. Если какие-либо тесты провалены, можно просмотреть журнал вывода для данной конкретной конфигурации.
ta: `டிராவிச் சிஐ`_ மற்றும் அப்சேயர்_ இருவருக்கும் ஒரு` யாம் <https://yaml.org> _ _ வடிவமைக்கப்பட்ட கோப்பு சோதனைக்கான வழிமுறைகளுக்கான விவரக்குறிப்பாக தேவைப்படுகிறது. ஏதேனும் சோதனைகள் தோல்வியுற்றால், அந்த குறிப்பிட்ட உள்ளமைவுக்கான வெளியீட்டு பதிவை ஆய்வு செய்யலாம்.

source: For Python projects that are intended to be deployed on both Python 2 and 3 with a single-source strategy, there are a number of options.
eo: Por Python-projekto disponigota sur kaj Python 2 kaj Python 3 per unufonta strategio, ekzistas kelkaj opcioj.
ja: 単一のソースコードを Python 2 と 3 の両方で稼働させる戦略を目指す Python プロジェクトには、いくつかの方法論があります。
pt_br: Para projetos Python que devem ser implantados em Python 2 e 3 com uma estratégia de única fonte, há uma série de opções.
ru: Для проектов на Python, которые предполагается развернуть как на Python 2, так и на Python 3 с использованием стратегии единого источника, есть несколько вариантов.
ta: ஒற்றை மூல மூலோபாயத்துடன் பைதான் 2 மற்றும் 3 இரண்டிலும் பயன்படுத்தப்பட வேண்டிய பைதான் திட்டங்களுக்கு, பல விருப்பங்கள் உள்ளன.

source: Tools for single-source Python packages
eo: Iloj por unufontaj Python-pakoj
ja: 単一ソースコード Python パッケージのためのツール
pt_br: Ferramentas para pacotes Python de única fonte
ru: Инструменты для создания пакетов Python с одним источником
ta: ஒற்றை மூல பைதான் தொகுப்புகளுக்கான கருவிகள்

source: `six <https://pypi.org/project/six/>`_ is a tool developed by Benjamin Peterson for wrapping over the differences between Python 2 and Python 3. The six_ package has enjoyed widespread use and may be regarded as a reliable way to write a single-source Python module that can be use in both Python 2 and 3. The six_ module can be used from as early as Python 2.5. A tool called `modernize <https://pypi.org/project/modernize>`_, developed by Armin Ronacher, can be used to automatically apply the code modifications provided by six_.
eo: 'six <https://pypi.org/project/six/>'_ estas ilo verkita de Benjamin Peterson por glatigi la diferencojn inter Python 2 kaj Python 3. La pako six_ ĝuas vastan uzadon kaj estas rigardata kiel fidinda maniero verki unu-fontan Python-modulon por kaj Python 2 kaj Python 3. La modulo six_ estas uzebla ekde Python 2.5. Ilo nomita `modernize <https://pypi.org/project/modernize>`_, verkita de Armin Ronacher, povas aŭtomate efektivigi la kodo-modifojn per six_.
ja: `six <https://pypi.org/project/six/>`_ は、ベンジャミン・ピーターソン (Benjamin Peterson) が開発した Python 2 と Python 3 の間の差異を吸収するためのツールです。 six_ パッケージは広範囲に受け入れられていて、単一ソースコードの Python パッケージが Python 2 と Python 3 の両方で使えるようにするための信頼できる方法であるとみなされています。 six_ モジュールは早くも Python 2.5 から使えます。アーミン・ロンチャー (Armin Ronacher) が開発した `modernize <https://pypi.org/project/modernize>`_ という名前のツールは、 six_ が提供する修正を自動的にソースコードに適用するために使うことができます。
pt_br: `six <https://pypi.org/project/six/>`_ é uma ferramenta desenvolvida por Benjamin Peterson para resolver as diferenças entre Python 2 e Python 3. O pacote six_ desfrutou de uso generalizado e pode ser considerado como uma maneira confiável de escrever um módulo Python de fonte única que pode ser usado em Python 2 e 3. O módulo six_ pode ser usado a partir de Python 2.5. Uma ferramenta chamada `modernize <https://pypi.org/project/modernize>`_, desenvolvida por Armin Ronacher, pode ser usada para aplicar automaticamente as modificações de código fornecidas por six_.
ru: `six <https://pypi.org/project/six/>`_ - это инструмент, разработанный Бенджамином Петерсоном для преодоления различий между Python 2 и Python 3. Пакет six_ получил широкое распространение и может рассматриваться как надежный способ написать модуль Python с одним исходным кодом, который можно использовать как в Python 2, так и в Python 3. Модуль six_ можно использовать уже в Python 2.5. Инструмент под названием `modernize <https://pypi.org/project/modernize>`_, разработанный Армином Ронахером, может быть использован для автоматического применения модификаций кода, предоставляемых six_.
ta: `ஆறு <https://pypi.org/project/six/>` _ என்பது பைதான் 2 மற்றும் பைதான் 3 க்கு இடையிலான வேறுபாடுகளை மடக்குவதற்காக பெஞ்சமின் பீட்டர்சன் உருவாக்கிய ஒரு கருவியாகும். சிக்ச்_ தொகுப்பு பரவலான பயன்பாட்டை அனுபவித்துள்ளது மற்றும் ஒரு பைதான் 2 மற்றும் 3 இரண்டிலும் பயன்படுத்தக்கூடிய ஒற்றை மூல பைதான் தொகுதியை எழுத நம்பகமான வழி. சிக்ச்_ தொகுதி பயன்படுத்தப்படலாம் பைதான் 2.5 வரை. `நவீனமயமாக்கல் <https://pypi.org/project/modernize>` _, அர்மின் ரோனாச்சரால் உருவாக்கப்பட்டது, ஆறு_ வழங்கிய குறியீடு மாற்றங்களை தானாகவே பயன்படுத்த பயன்படுத்தலாம்.

source: Similar to six_, `python-future <http://python-future.org/overview.html>`_ is a package that provides a compatibility layer between Python 2 and Python 3 source code; however, unlike six_, this package aims to provide interoperability between Python 2 and Python 3 with a language syntax that matches one of the two Python versions: one may use
eo: Simile al six_, `python-future <http://python-future.org/overview.html>`_ estas pako por kongrueco inter Python 2 kaj Python 3. Malkiel six_, tiu pako celas kunfunkciigi Python 2 kaj Python 3 per lingva sintakso de unu el la du Python-versioj: oni povas uzi
ja: six_ と同様に、`python-future <http://python-future.org/overview.html>`_ もソースコード上で Python 2 と Python 3 の間の互換を保つ層を提供するパッケージです; しかしながら、 six_ とは異なり、このパッケージでは、ふたつの Python バージョンのうちの片方の言語文法で Python 2 と Python 3 の間の相互互換性を提供しようとしています: 片方しか使えません
pt_br: Semelhante a six_, `python-future <http://python-future.org/overview.html>`_ é um pacote que fornece uma camada de compatibilidade entre o código-fonte de Python 2 e Python 3; no entanto, ao contrário do six_, este pacote visa fornecer interoperabilidade entre Python 2 e Python 3 com uma sintaxe de linguagem que corresponda a uma das duas versões Python: pode-se usar
ru: Как и six_, `python-future <http://python-future.org/overview.html>`_ - это пакет, обеспечивающий слой совместимости между исходным кодом Python 2 и Python 3; однако, в отличие от six_, этот пакет направлен на обеспечение совместимости между Python 2 и Python 3 с синтаксисом языка, соответствующим одной из двух версий Python: можно использовать
ta: சிக்ச்_, `பைதான்-ஃபியூச்சர் <http://python-future.org/overview.html>` _ என்பது பைதான் 2 மற்றும் பைதான் 3 மூலக் குறியீட்டிற்கு இடையில் பொருந்தக்கூடிய அடுக்கை வழங்கும் ஒரு தொகுப்பு; இருப்பினும், சிக்ச்_ போலல்லாமல், இந்த தொகுப்பு பைதான் 2 மற்றும் பைதான் 3 க்கு இடையில் இரண்டு பைதான் பதிப்புகளில் ஒன்றோடு பொருந்தக்கூடிய மொழி தொடரியல் மூலம் இயங்குதளத்தை வழங்குவதை நோக்கமாகக் கொண்டுள்ளது: ஒருவர் பயன்படுத்தலாம்

source: a Python 2 (by syntax) module in a Python 3 project.
eo: modulon de sintakso Python 2 en projekto de Python 3.
ja: Python 3 のプロジェクトにおける Python 2 (文法による) モジュール。
pt_br: um módulo Python 2 (por sintaxe) em um projeto Python 3.
ru: модуль Python 2 (по синтаксису) в проекте Python 3.
ta: பைதான் 3 திட்டத்தில் ஒரு பைதான் 2 (தொடரியல் மூலம்) தொகுதி.

source: a Python 3 (by syntax) module in a *Python 2* project.
eo: modulon de sintakso Python 3 en projekto de *Python 2*.
ja: *Python 2* で書かれたプロジェクトにおける、 Python 3 (文法による) モジュール。
pt_br: um módulo Python 3 (por sintaxe) em um projeto *Python 3*.
ru: модуль Python 3 (по синтаксису) в проекте *Python 2*.
ta: * பைதான் 2 * திட்டத்தில் ஒரு பைதான் 3 (தொடரியல் மூலம்) தொகுதி.

source: Because of the bi-directionality, python-future_ offers a pathway to converting a Python 2 package to Python 3 syntax module-by-module. However, in contrast to six_, python-future_ is supported only from Python 2.6. Similar to modernize_ for six_, python-future_ comes with two scripts called ``futurize`` and ``pasteurize`` that can be applied to either a Python 2 module or a Python 3 module respectively.
eo: Per la dudirekteco, python-future_ ofertas manieron konverti pakon de Python 2 al la sintakso de Python 3 modulon post modulo. Tamen, malkiel six_, python_future_ nur subtenas Python 2.6+. Kiel six_, python_future_ provizas du programetojn, ``futurize`` kaj ``pasteurize``, por modulo de Python 2 kaj de Python 3 respektive.
ja: 双方向性の故に、 python-future_ は Python 2 で書かれたパッケージをモジュール毎に Python 3 の文法に変換する通路を提供します。しかしながら、 six_ とは異なり、 python-future_ は Python 2.6 からしかサポートされていません。 six_ に対する modernize_ と同様に、 python-future_ は、Python 2 のモジュールに適用できる ``futurize`` と Python 3 モジュールに適用できる ``pasteurize`` と呼ばれるふたつのスクリプトを備えています。
pt_br: Por causa da bidirecionalidade, python-future_ oferece um caminho para converter um pacote Python 2 na sintaxe de Python 3, módulo por módulo. No entanto, em contraste com six_, python-future_ é compatível apenas com Python 2.6. Semelhante a modernize_ para six_, python-future_ vem com dois scripts chamados ``futurize`` e ``pasteurize`` que podem ser aplicados a um módulo Python 2 ou um módulo Python 3 respectivamente.
ru: Благодаря двунаправленности, python-future_ предлагает путь к преобразованию пакета Python 2 в синтаксис Python 3 модуль за модулем. Однако, в отличие от six_, python-future_ поддерживается только начиная с Python 2.6. Подобно modernize_ для six_, python-future_ поставляется с двумя скриптами ``futurize`` и ``pasteurize``, которые могут быть применены как к модулю Python 2, так и к модулю Python 3 соответственно.
ta: இரு திசை காரணமாக, பைதான் 2 தொகுப்பை பைதான் 3 தொடரியல் தொகுதி-மூலம்-தொகுதிக்கு மாற்றுவதற்கான பாதையை பைதான்-ஃபியூட்ர்_ வழங்குகிறது. இருப்பினும், சிக்ச்_ க்கு மாறாக, பைதான்-ஃபியூச்சர்_ பைதான் 2.6 இலிருந்து மட்டுமே ஆதரிக்கப்படுகிறது. சிக்ச்_ க்கு நவீனமயமாக்கல்_ ஐப் போலவே, பைதான்-ஃபியூட்யூர்_ இரண்டு ச்கிரிப்டுகளுடன் `` எதிர்காலம்`` மற்றும் `` பேசூரைச்`` என அழைக்கப்படுகிறது, இது முறையே பைதான் 2 தொகுதி அல்லது பைதான் 3 தொகுதிக்கு பயன்படுத்தப்படலாம்.

source: Use of six_ or python-future_ adds an additional runtime dependency to your package: with python-future_, the ``futurize`` script can be called with the ``--stage1`` option to apply only the changes that Python 2.6+ already provides for forward-compatibility to Python 3. Any remaining compatibility problems would require manual changes.
eo: Uzo de six_ aŭ python_future_ aldonas ekstran rultempan dependecon al la pako: kun python-future_, oni rulu la programon ``futurize`` kun la flago ``--stage1`` por efektivigi nur tiajn ŝanĝojn, kiajn Python 2.6+ jam provizas por kongrueco kun Python 3. Ajna restanta problemo pri kongrueco postulas malaŭtomatan modifon.
ja: six_ ないし python-future_ を使用すると、追加的な動作時依存性がパッケージに追加されます: python-future_ では ``futurist`` スクリプトを ``--stage1`` オプションとともに呼び出すことで Python 2.6 以降に既に備えられた Python 3 との前方互換性を用いる修正だけを行うことができます。残りの互換性問題は、手作業で修正しなければなりません。
pt_br: O uso de six_ ou python-future_ adiciona uma dependência adicional de tempo de execução ao seu pacote: com python-future_, o script ``futurize`` pode ser chamado com a opção ``--stage1`` para aplicar apenas as mudanças que Python 2.6+ já fornece compatibilidade com versões futuras para Python 3. Quaisquer problemas de compatibilidade remanescentes exigiriam alterações manuais.
ru: Использование six_ или python-future_ добавляет дополнительную зависимость от времени выполнения: при использовании python-future_ скрипт ``futurize`` может быть вызван с опцией ``--stage1`` для применения только тех изменений, которые Python 2.6+ уже обеспечивает для прямой совместимости с Python 3. Любые оставшиеся проблемы совместимости потребуют внесения изменений вручную.
ta: சிக்ச்_ அல்லது பைதான்-ஃபுட்யூர்_ இன் பயன்பாடு உங்கள் தொகுப்புக்கு கூடுதல் இயக்க நேர சார்புநிலையைச் சேர்க்கிறது: பைதான்-ஃபியூட்யூர்_ உடன், `` எதிர்காலம்` ச்கிரிப்டை ``-ச்டேச் 1`` விருப்பத்துடன் அழைக்கலாம், இது ஒரு பைதான் 2.6+ மாற்றங்களை மட்டுமே பயன்படுத்துகிறது பைதானுக்கு முன்னோக்கி-இணக்கத்தன்மைக்கு ஏற்கனவே வழங்குகிறது. மீதமுள்ள பொருந்தக்கூடிய சிக்கல்களுக்கு கையேடு மாற்றங்கள் தேவைப்படும்.

source: What's in which Python?
eo: Kio estas en kiu Python?
ja: どの Python に何がある？
pt_br: O que há em cada Python?
ru: Что находится в каком Python?
ta: எந்த பைதான் என்ன?

source: Ned Batchelder provides a list of changes in each Python release for `Python 2 <https://nedbatchelder.com/blog/201109/whats_in_which_python.html>`__, `Python 3.0-3.3 <https://nedbatchelder.com/blog/201310/whats_in_which_python_3.html>`__ and `Python 3.4-3.6 <https://nedbatchelder.com/blog/201803/whats_in_which_python_3436.html>`__. These lists may be used to check whether any changes between Python versions may affect your package.
eo: Ned Batchelder listigas la ŝanĝojn en ĉiu eldono de Python por `Python 2 <https://nedbatchelder.com/blog/201109/whats_in_which_python.html>`__, `Python 3.0–3.3 <https://nedbatchelder.com/blog/201310/whats_in_which_python_3.html>`__ kaj `Python 3.4-3.6 <https://nedbatchelder.com/blog/201803/whats_in_which_python_3436.html>`__. Per tiuj listoj oni povas kontroli, ĉu ŝanĝoj inter versioj de Python gravas pri onia pako.
ja: Ned Batchelder は、Python の各リリースのそれぞれに一連の修正、つまり、 `Python 2 <https://nedbatchelder.com/blog/201109/whats_in_which_python.html>`__、 `Python 3.0-3.3 <https://nedbatchelder.com/blog/201310/whats_in_which_python_3.html>`__、 そして `Python 3.4-3.6 <https://nedbatchelder.com/blog/201803/whats_in_which_python_3436.html>`__ を加えることができます。これらのリストは、 Python のバージョン間の変更が特定のパッケージに影響を与えるか否かを確認するためにも使えることでしょう。
pt_br: Ned Batchelder fornece uma lista de alterações em cada versão Python para `Python 2 <https://nedbatchelder.com/blog/201109/whats_in_which_python.html>`__, `Python 3.0-3.3 <https://nedbatchelder.com/blog/201310/whats_in_which_python_3.html>`__ e `Python 3.4-3.6 <https://nedbatchelder.com/blog/201803/whats_in_which_python_3436.html>`__. Essas listas podem ser usadas para verificar se quaisquer mudanças entre as versões Python podem afetar seu pacote.
ru: Нед Батчелдер приводит список изменений в каждом выпуске Python для `Python 2 <https://nedbatchelder.com/blog/201109/whats_in_which_python.html>`__, `Python 3.0-3.3 <https://nedbatchelder.com/blog/201310/whats_in_which_python_3.html>`__ и `Python 3.4-3.6 <https://nedbatchelder.com/blog/201803/whats_in_which_python_3436.html>`__. Эти списки можно использовать для проверки того, могут ли какие-либо изменения между версиями Python повлиять на ваш пакет.
ta: `பைதான் 2 <https://nedbatchelder.com/blog/201109/whats_in_which_python.html>` __, __, `பைதான் 3.0-3.3 இப்போது பைதான் பதிப்புகளுக்கு இடையில் ஏதேனும் மாற்றங்கள் உங்கள் தொகுப்பைப் பாதிக்குமா என்பதைச் சரிபார்க்க இந்த பட்டியல்கள் பயன்படுத்தப்படலாம்.

source: Supporting Windows using Appveyor
eo: Subteni Windows per Appveyor
ja: Appveyor を用いて Windows をサポートする
pt_br: Oferece suporte a Windows usando Appveyor
ru: Поддержка Windows с помощью Appveyor
ta: AppWeyor ஐப் பயன்படுத்தி சாளரங்களை ஆதரித்தல்

source: This section covers how to use the free `Appveyor`_ continuous integration service to provide Windows support for your project. This includes testing the code on Windows, and building Windows-targeted binaries for projects that use C extensions.
eo: Tiu paragrafo temas pri kiel uzi la senkostan servon `Appveyor`_ de kontinua integrado, por subteni Windows por via projekto. Tio inkluzivas testi la kodon sur Windows, kaj konstrui Windows -duumaĵojn por projektoj uzantaj C-etendaĵojn.
ja: この節では、無料の `Appveyor`_ 継続的インテグレーションサービスを使ってあなたのプロジェクトで Windows をサポートする方法について議論します。これには、 Windows におけるソースコードのテストや、 C 言語拡張を含むプロジェクトの Windows 向けのバイナリへのビルドを含みます。
pt_br: Esta seção cobre como usar o serviço gratuito de integração contínua `Appveyor`_ para fornecer suporte a Windows para seu projeto. Isso inclui testar o código no Windows e construir binários direcionados para Windows para projetos que usam extensões C.
ru: В этом разделе рассказывается о том, как использовать бесплатную службу непрерывной интеграции `Appveyor`_ для обеспечения поддержки Windows в вашем проекте. Сюда входит тестирование кода под Windows и сборка двоичных файлов, ориентированных на Windows, для проектов, использующих расширения C.
ta: உங்கள் திட்டத்திற்கான சாளரங்கள் ஆதரவை வழங்க இலவச `AppVeyor`_ தொடர்ச்சியான ஒருங்கிணைப்பு சேவையை எவ்வாறு பயன்படுத்துவது என்பதை இந்த பிரிவு உள்ளடக்கியது. சாளரங்களில் குறியீட்டைச் சோதிப்பது மற்றும் சி நீட்டிப்புகளைப் பயன்படுத்தும் திட்டங்களுக்கான விண்டோச்-இலக்கு பைனரிகளை உருவாக்குவது இதில் அடங்கும்.

source: Many projects are developed on Unix by default, and providing Windows support can be a challenge, because setting up a suitable Windows test environment is non-trivial, and may require buying software licenses.
eo: Multaj projektoj estas verkitaj sur Unikso, kaj subteni Windows povas esti malfacile, ĉar starigado de taŭga Windows-testmedio estas malsimpla kaj povas postuli aĉetadon de programaj licencoj.
ja: 多くのプロジェクトが当然のように Unix 上で開発されており、適切なWindows のテスト環境を準備することが簡単ではないこととソフトウェアライセンスを購入しなければならないであろうことから Windows へのサポートを提供することはある種のチャレンジになっています。
pt_br: Muitos projetos são desenvolvidos em Unix por padrão, e fornecer suporte ao Windows pode ser um desafio, porque configurar um ambiente de teste adequado no Windows não é trivial e pode exigir a compra de licenças de software.
ru: Многие проекты по умолчанию разрабатываются на Unix, и обеспечение поддержки Windows может быть сложной задачей, поскольку создание подходящей тестовой среды Windows нетривиально и может потребовать покупки лицензий на программное обеспечение.
ta: பல திட்டங்கள் இயல்பாக யூனிக்சில் உருவாக்கப்பட்டுள்ளன, மேலும் சாளரங்கள் ஆதரவை வழங்குவது ஒரு சவாலாக இருக்கும், ஏனெனில் பொருத்தமான சாளரங்கள் சோதனை சூழலை அமைப்பது அற்பமானது அல்ல, மேலும் மென்பொருள் உரிமங்களை வாங்க வேண்டியிருக்கும்.

source: The Appveyor service is a continuous integration service, much like the better-known `Travis`_ service that is commonly used for testing by projects hosted on `GitHub`_. However, unlike Travis, the build workers on Appveyor are Windows hosts and have the necessary compilers installed to build Python extensions.
eo: La servo Appveyor estas servo por kontinua integrado simile al la pli bone konata servo `Travis`_ ofte uzata por testado de projektoj sur `GitHub`_. Tamen, malkiel Travis, la konstruaj procezoj sur Appveyor gastigas Windows kaj havas taŭgajn tradukilojn por konstrui Python-etendaĵojn.
ja: Appveyor サービスは継続的インテグレーションのサービスであり、 `GitHub`_ にホストされたプロジェクトをテストするのによく使われよりよく知られている `Travis`_ サービスによく似ています。しかし、 Travis とは異なり、 Appveyor のビルドワーカーは Windows であり、 Python の拡張モジュールをビルドするために必要なコンパイラもインストール済みです。
pt_br: O serviço Appveyor é um serviço de integração contínua, muito parecido com o serviço `Travis`_ mais conhecido que é comumente usado para testes por projetos hospedados no `GitHub`_. No entanto, ao contrário do Travis, os workers de construção no Appveyor são hosts Windows e têm os compiladores necessários instalados para construir extensões Python.
ru: Сервис Appveyor - это сервис непрерывной интеграции, подобный более известному сервису `Travis`_, который обычно используется для тестирования проектов, размещенных на `GitHub`_. Однако, в отличие от Travis, рабочие сборщики Appveyor являются хостами Windows и имеют необходимые компиляторы для сборки расширений Python.
ta: AppVeair பணி என்பது தொடர்ச்சியான ஒருங்கிணைப்பு சேவையாகும், இது நன்கு அறியப்பட்ட `டிராவிச்`_ சேவையைப் போன்றது, இது பொதுவாக` கிதுப்`_ இல் வழங்கப்பட்ட திட்டங்களால் சோதனைக்கு பயன்படுத்தப்படுகிறது. இருப்பினும், டிராவிசைப் போலல்லாமல், ஆப்சியரில் உள்ள தொழிலாளர்கள் சாளரங்கள் ஓச்ட்கள் மற்றும் பைதான் நீட்டிப்புகளை உருவாக்க தேவையான கம்பைலர்கள் நிறுவப்பட்டுள்ளன.

source: Windows users typically do not have access to a C compiler, and therefore are reliant on projects that use C extensions distributing binary wheels on PyPI in order for the distribution to be installable via ``python -m pip install <dist>``. By using Appveyor as a build service (even if not using it for testing) it is possible for projects without a dedicated Windows environment to provide Windows-targeted binaries.
eo: Uzantoj de Windows ofte ne havas C-tradukilon kaj tial dependas de la distribuado de duumaj wheel-oj ĉe PyPI de projektoj uzantaj C-etendaĵojn por instali la distribuon per ``python -m pip install <dist>``. Uzante Appveyor kiel konstruservon (eĉ se oni ne uzas ĝin por testado), oni povas disponigi Windows-duumaĵojn sen dediĉita Windows-medio.
ja: Windows のユーザは C 言語のコンパイラを持っていないのが普通で、従って、C 言語拡張を使うプロジェクトについては PyPI でバイナリ wheel を配布していなければ ``python -m pip install <dist>`` 経由で配布物をインスールすることができません。 (たとえテスト目的では利用しなかったとしても) Appveyor をビルドサービスとして利用することで、専用の Windows 環境がなくても Windows 上で動作するバイナリを準備することができます。
pt_br: Os usuários do Windows normalmente não têm acesso a um compilador C e, portanto, dependem de projetos que usam extensões C distribuindo wheels binárias no PyPI para que a distribuição seja instalável via ``python -m pip install <dist>``. Ao usar o Appveyor como um serviço de construção (mesmo que não seja para teste), é possível para projetos sem um ambiente Windows dedicado fornecer binários direcionados ao Windows.
ru: Пользователи Windows, как правило, не имеют доступа к компилятору языка C, поэтому проекты, использующие расширения C, должны распространять бинарные колеса на PyPI, чтобы дистрибутив можно было установить с помощью ``python -m pip install <dist>``. Использование Appveyor в качестве сервиса сборки (даже если он не используется для тестирования) позволяет проектам, не имеющим выделенной среды Windows, предоставлять двоичные файлы, ориентированные на Windows.
ta: சாளரங்கள் பயனர்களுக்கு பொதுவாக சி கம்பைலருக்கு அணுகல் இல்லை, எனவே `` பைதான் -எம் பிஐபி நிறுவல் <st> `` வழியாக வழங்கல் நிறுவக்கூடிய வகையில் பைபியில் பைனரி சக்கரங்களை விநியோகிக்கும் சி நீட்டிப்புகளைப் பயன்படுத்தும் திட்டங்களை நம்பியுள்ளது. AppWeyor ஐ உருவாக்க சேவையாகப் பயன்படுத்துவதன் மூலம் (அதை சோதனைக்கு பயன்படுத்தாவிட்டாலும் கூட) பிரத்யேக சாளரங்கள் சூழல் இல்லாத திட்டங்களுக்கு விண்டோச்-இலக்கு கொண்ட இருமங்களை வழங்க முடியும்.

source: Setting up
eo: Eki
ja: 設定する
pt_br: Configurando
ru: Настройка
ta: அமைத்தல்
