Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: :doc:`discussions/pip-vs-easy-install`
ja: :doc:`議論/pip対easy-install <discussions/pip-vs-easy-install>`
ru: : документ:`обсуждения/pip-vs-easy-install`
ta: : டாக்: `விவாதங்கள்/பிஐபி-விஎச்-ஈசி-இன்ச்டால்`

source: Reference
eo: Referenco
ja: 参考文献
pt_br: Referência
ru: Ссылка
ta: குறிப்பு

source: The :doc:`specifications/index` section for packaging interoperability specifications.
eo: La paragrafo :doc:`specifications/index` por specifoj pri pakada kunfunkcipovo.
ja: パッケージングに関する相互運用性の仕様については、 :doc:`仕様 <specifications/index>` を見てください。
pt_br: A seção :doc:`specifications/index` para especificações de interoperabilidade de empacotamento.
ru: Раздел :doc:`specifications/index` для спецификаций совместимости упаковки.
ta: தி: டாக்: `விவரக்குறிப்புகள்/குறியீட்டு` பிரிவு இயங்கக்கூடிய விவரக்குறிப்புகளை பேக்கேசிங் செய்வதற்கான பிரிவு.

source: The list of :doc:`other projects <key_projects>` maintained by members of the Python Packaging Authority.
eo: La listo de :doc:`aliaj projektoj <key_projects>` mastrumataj de anoj de la Python-Pakada Aŭtoritato.
ja: Python パッケージングオーソリティのメンバーが維持管理している :doc:`他のプロジェクト群 <key_projects>` のリスト。
pt_br: A lista de :doc:`outros projetos <key_projects>` mantidos por membros da Python Packaging Authority.
ru: Список :doc:`других проектов <key_projects>`, поддерживаемых членами Python Packaging Authority.
ta: பட்டியல்: DOC: `பிற திட்டங்கள் <KEY_PROJECTS>` பைதான் பேக்கேசிங் அதிகாரசபையின் உறுப்பினர்களால் பராமரிக்கப்படுகிறது.

source: The :doc:`glossary` for definitions of terms used in Python packaging.
eo: La :doc:`terminaro <glossary>` pri difinoj de terminoj pri pakado de Python.
ja: Python パッケージングで使われる用語の定義についての :doc:`語彙集 <glossary>` 。
pt_br: O :doc:`glossary` para definições de termos usados em empacotamento do Python.
ru: В :doc:`глоссарии` содержатся определения терминов, используемых в упаковке Python.
ta: தி: டாக்: `சொற்களஞ்சியம்` பைதான் பேக்கேசிங்கில் பயன்படுத்தப்படும் சொற்களின் வரையறைகளுக்கு.

source: Project Summaries
eo: Projektaj Resumoj
ja: プロジェクト概要
pt_br: Resumos de projetos
ru: Обзор проектов
ta: திட்ட சுருக்கங்கள்

source: Summaries and links for the most relevant projects in the space of Python installation and packaging.
eo: Resumoj kaj hiperligoj pri la plej gravaj projektoj rilataj al instalado kaj pakado de Python.
ja: Python の実装やパッケージングの領域で最も関連があるプロジェクト群へのまとめとリンク。
pt_br: Resumos e links para os projetos mais relevantes no espaço de instalação e empacotamento do Python.
ru: Краткие обзоры и ссылки на самые актуальные проекты в области установки и упаковки Python.
ta: பைதான் நிறுவல் மற்றும் பேக்கேசிங் இடைவெளியில் மிகவும் பொருத்தமான திட்டங்களுக்கான சுருக்கங்கள் மற்றும் இணைப்புகள்.

source: PyPA Projects
eo: Projektoj de PyPA
ja: PyPA プロジェクト群
pt_br: Projetos do PyPA
ru: Проекты PyPA
ta: பைபா திட்டங்கள்

source: `Docs <https://bandersnatch.readthedocs.io>`__ | `Issues <https://github.com/pypa/bandersnatch/issues>`__ | `GitHub <https://github.com/pypa/bandersnatch>`__ | `PyPI <https://pypi.org/project/bandersnatch>`__
eo: `Dokumentaro <https://bandersnatch.readthedocs.io>`__ | `Cimoj <https://github.com/pypa/bandersnatch/issues>`__ | `GitHub <https://github.com/pypa/bandersnatch>`__ | `PyPI <https://pypi.org/project/bandersnatch>`__
ja: `説明文書 <https://bandersnatch.readthedocs.io>`__ | `課題リスト <https://github.com/pypa/bandersnatch/issues>`__ | `GitHub <https://github.com/pypa/bandersnatch>`__ | `PyPI <https://pypi.org/project/bandersnatch>`__
ru: `Документы <https://bandersnatch.readthedocs.io>`__ | `Выпуски <https://github.com/pypa/bandersnatch/issues>`__ | `GitHub <https://github.com/pypa/bandersnatch>`__ | `PyPI <https://pypi.org/project/bandersnatch>`__
ta: `டாக்ச் <https://bandersnatch.readthedocs.io>` __ | `சிக்கல்கள் <https://github.com/pypa/bandersnatch/issues> __ | `Github <https://github.com/pypa/bandersnatch>` __ | `Pypi <https://pypi.org/project/bandersnatch> ____

source: ``bandersnatch`` is a PyPI mirroring client designed to efficiently create a complete mirror of the contents of PyPI. Organizations thus save bandwidth and latency on package downloads (especially in the context of automated tests) and to prevent heavily loading PyPI's Content Delivery Network (CDN). Files can be served from a local directory or `AWS S3`_.
ja: ``bandersnatch`` は、PyPI をミラーリングするクライアントで、PyPI のコンテンツの完全なコピーを効率よく作成するように設計されています。組織から見ると、これによってパッケージのダウンロードに必要な帯域幅とレイテンシーを (とりわけ自動化されたテストの文脈で) 節約することができ、PyPI のコンテンツデリバリネットワーク (CDN) への負荷を軽減します。ローカルのディレクトリからでも `AWS S3`_ からでもファイル群を提供するようにできます。
ru: ``bandersnatch`` - это клиент зеркалирования PyPI, предназначенный для эффективного создания полного зеркала содержимого PyPI. Таким образом, организации экономят пропускную способность и задержки при загрузке пакетов (особенно в контексте автоматизированных тестов), а также предотвращают сильную загрузку сети доставки контента PyPI (CDN). Файлы могут обслуживаться из локальной директории или из `AWS S3`_.
ta: `` bandersnatch`` என்பது PYPI இன் உள்ளடக்கங்களின் முழுமையான கண்ணாடியை திறம்பட உருவாக்க வடிவமைக்கப்பட்ட ஒரு PYPI பிரதிபலிக்கும் கிளையன்ட் ஆகும். நிறுவனங்கள் இவ்வாறு தொகுப்பு பதிவிறக்கங்களில் அலைவரிசை மற்றும் தாமதத்தை சேமிக்கின்றன (குறிப்பாக தானியங்கி சோதனைகளின் சூழலில்) மற்றும் PYPI இன் உள்ளடக்க விநியோக நெட்வொர்க்கை (சி.டி.என்) பெரிதும் ஏற்றுவதைத் தடுக்கவும். கோப்புகளை உள்ளக கோப்பகத்திலிருந்து அல்லது `AWS S3`_ இலிருந்து வழங்கலாம்.

source: build
ja: ビルド
pt_br: construir
ru: построить
ta: உருவாக்கு

source: :any:`Docs <build:index>` | `Issues <https://github.com/pypa/build/issues>`__ | `GitHub <https://github.com/pypa/build>`__ | `PyPI <https://pypi.org/project/build>`__
eo: :any:`Dokumentaro <build:index>` | `Cimoj <https://github.com/pypa/build/issues>`__ | `GitHub <https://github.com/pypa/build>`__ | `PyPI <https://pypi.org/project/build>`__
ja: :any:`文書 <build:index>` | `課題リスト <https://github.com/pypa/build/issues>`__ | `GitHub <https://github.com/pypa/build>`__ | `PyPI <https://pypi.org/project/build>`__
pt_br: :any:`Documentação <build:index>` | `Issues <https://github.com/pypa/build/issues>`__ | `GitHub <https://github.com/pypa/build>`__ | `PyPI <https://pypi.org/project/build>`__
ru: :any:`Docs <build:index>` | `Проблемы <https://github.com/pypa/build/issues>`__ | `GitHub <https://github.com/pypa/build>`__ | `PyPI <https://pypi.org/project/build>`__
ta: : ஏதேனும்: `டாக்ச் <உருவாக்க: குறியீட்டு>` | `சிக்கல்கள் <https://github.com/pypa/build/issues>` __ | `Github <https://github.com/pypa/build>` __ | `Pypi <https://pypi.org/project/build>` __

source: ``build`` is a :pep:`517` compatible Python package builder. It provides a CLI to build packages, as well as a Python API.
eo: ``build`` estas :pep:`517`-kongrua Python-pakokonstruilo. Ĝi provizas kaj komandlinian fasadon kaj Python-API por konstrui pakojn.
ja: ``build`` は :pep:`517` 互換の Python パッケージビルダです。Python API と同様に、パッケージをビルドする CLI を提供します。
pt_br: ``build`` é um construtor de pacotes Python compatível com a :pep:`517`. Ele fornece uma CLI para construir pacotes, bem como uma API Python.
ru: ``build`` - это совместимый с :pep:`517` сборщик пакетов на Python. Он предоставляет CLI для создания пакетов, а также Python API.
ta: `` பில்ட்`` என்பது ஒரு: பெப்: `517` இணக்கமான பைதான் தொகுப்பு பில்டர். இது தொகுப்புகளை உருவாக்க ஒரு சி.எல்.ஐ மற்றும் ஒரு பைதான் பநிஇ ஆகியவற்றை வழங்குகிறது.

source: `Docs <https://cibuildwheel.readthedocs.io/>`__ | `Issues <https://github.com/pypa/cibuildwheel/issues>`__ | `GitHub <https://github.com/pypa/cibuildwheel>`__ | `PyPI <https://pypi.org/project/cibuildwheel>`__ | `Discussions <https://github.com/pypa/cibuildwheel/discussions>`__ | `Discord #cibuildwheel <https://discord.com/invite/pypa>`__
eo: `Dokumentaro <https://cibuildwheel.readthedocs.io/>`__ | `Cimoj <https://github.com/pypa/cibuildwheel/issues>`__ | `GitHub <https://github.com/pypa/cibuildwheel>`__ | `PyPI <https://pypi.org/project/cibuildwheel>`__ | `Diskutoj <https://github.com/pypa/cibuildwheel/discussions>`__ | `Discord #cibuildwheel <https://discord.com/invite/pypa>`__
ja: `説明文書 <https://cibuildwheel.readthedocs.io/>`__ | `課題リスト <https://github.com/pypa/cibuildwheel/issues>`__ | `GitHub <https://github.com/pypa/cibuildwheel>`__ | `PyPI <https://pypi.org/project/cibuildwheel>`__ | `議論 <https://github.com/pypa/cibuildwheel/discussions>`__ | `Discord #cibuildwheel <https://discord.com/invite/pypa>`__
pt_br: `Documentação <https://cibuildwheel.readthedocs.io/>`__ | `Issues <https://github.com/pypa/cibuildwheel/issues>`__ | `GitHub <https://github.com/pypa/cibuildwheel>`__ | `PyPI <https://pypi.org/project/cibuildwheel>`__ | `Discussões <https://github.com/pypa/cibuildwheel/discussions>`__ | `Discord #cibuildwheel <https://discord.com/invite/pypa>`__
ru: `Документы <https://cibuildwheel.readthedocs.io/>`__ | `Проблемы <https://github.com/pypa/cibuildwheel/issues>`__ | `GitHub <https://github.com/pypa/cibuildwheel>`__ | `PyPI <https://pypi.org/project/cibuildwheel>`__ | `Обсуждения <https://github.com/pypa/cibuildwheel/discussions>`__ | `Discord #cibuildwheel <https://discord.com/invite/pypa>`__
ta: `டாக்ச் <https://cibuildwheel.readthedocs.io/>` __ | `சிக்கல்கள் <https://github.com/pypa/cibuildwheel/issues>` __ | `Github <https://github.com/pypa/cibuildwheel> __ | `Pypi <https://pypi.org/project/cibuildwheel>` __ | `விவாதங்கள் <https://github.com/pypa/cibuildwheel/discussions>` __ | `டிச்கார்ட் #cibuildwheel <https://discord.com/invite/pypa>` __

source: ``cibuildwheel`` is a Python package that builds :term:`wheels <Wheel>` for all common platforms and Python versions on most CI systems. Also see :ref:`multibuild`.
eo: ``cibuildwheel`` estas Python-pako konstruanta :term:`wheel-ojn <Wheel>` por ĉiuj oftaj platformoj kaj versioj de Python sur multaj sistemoj de kontinua integrado. Ankaŭ vidu :ref:`multibuild`.
ja: ``cibuildwheel`` は、プラットフォーム・ Python バージョン・ CIシステムのよくある組み合わせの全部について :term:`wheels <Wheel>` をビルドする Python パッケージです。
pt_br: ``cibuildwheel`` é um pacote Python que constrói :term:`wheels <Wheel>` para todas as plataformas comuns e versões Python na maioria dos sistemas CI. Veja também :ref:`multibuild`.
ru: ``cibuildwheel`` - это Python-пакет, который собирает :term:`колеса <Wheel>` для всех распространенных платформ и версий Python на большинстве CI-систем. Также смотрите :ref:`multibuild`.
ta: `` cibuildwheel`` என்பது ஒரு பைதான் தொகுப்பாகும்: கால: `சக்கரங்கள் <hewhel>` அனைத்து பொதுவான தளங்களுக்கும் பெரும்பாலான தொஒ அமைப்புகளில் பைதான் பதிப்புகளுக்கும். மேலும் காண்க: குறிப்பு: `மல்டிபில்ட்`.

source: distlib
ta: தொலைதூர

source: :doc:`Docs <distlib:index>` | `Issues <https://github.com/pypa/distlib/issues>`__ | `GitHub <https://github.com/pypa/distlib>`__ | `PyPI <https://pypi.org/project/distlib>`__
eo: :doc:`Dokumentaro <distlib:index>` | `Cimoj <https://github.com/pypa/distlib/issues>`__ | `GitHub <https://github.com/pypa/distlib>`__ | `PyPI <https://pypi.org/project/distlib>`__
ja: :doc:`文書 <distlib:index>` | `課題リスト <https://github.com/pypa/distlib/issues>`__ | `GitHub <https://github.com/pypa/build>`__ | `PyPI <https://pypi.org/project/distlib>`__
pt_br: :doc:`Documentação <distlib:index>` | `Issues <https://github.com/pypa/distlib/issues>`__ | `GitHub <https://github.com/pypa/distlib>`__ | `PyPI <https://pypi.org/project/distlib>`__
ru: :doc:`Документы <distlib:index>` | `Проблемы <https://github.com/pypa/distlib/issues>`__ | `GitHub <https://github.com/pypa/distlib>`__ | `PyPI <https://pypi.org/project/distlib>`__
ta: : டாக்: `டாக்ச் <டிச்ட்லிப்: குறியீட்டு>` | `சிக்கல்கள் <https://github.com/pypa/distlib/issues> __ | `Github <https://github.com/pypa/distlib>` __ | `Pypi <https://pypi.org/project/distlib>` __

source: ``distlib`` is a library which implements low-level functions that relate to packaging and distribution of Python software. ``distlib`` implements several relevant PEPs (Python Enhancement Proposal standards) and is useful for developers of third-party packaging tools to make and upload binary and source :term:`distributions <Distribution Package>`, achieve interoperability, resolve dependencies, manage package resources, and do other similar functions.
eo: ``distlib`` estas biblioteko de malaltnivelaj funkcioj pri pakado kaj distribuado de Python-programoj. ``distlib`` realigas plurajn rilatajn PEP-ojn (normojn Python Enhancement Proposal) kaj utilas por verki triapartian pakilon, kiu faras kaj alŝutas duumajn kaj fontajn :term:`distribuojn <Distribution Package>` kunfunkcipove, solvas dependecojn, administras pakajn resursojn, ktp.
ja: ``distlib`` は、 Python ソフトウェアのパッケージングや配布に関係する低レベルの機能を実装しているライブラリです。 ``distlib`` はいくつかの関連する PEP (Python Enhancement Proposal standards) を実装していて、サードパーティのパッケージングツールの開発者にとってバイナリやソースコードの :term:`配布物 <Distribution Package>` を作成・アップロードしたり、相互運用性を確保したり、依存関係を解決したり、パッケージリソースを管理したり、その他の類似の機能を実行したりするのに便利です。
pt_br: ``distlib`` é uma biblioteca que implementa funções de baixo nível relacionadas ao empacotamento e distribuição de software Python. ``distlib`` implementa várias PEPs relevantes (padrões de proposta de aprimoramento do Python) e é útil para desenvolvedores de ferramentas de empacotamento de terceiros para fazer e enviar :term:`distribuições <Pacote de Distribuição>` binária e fonte, alcançar interoperabilidade, resolver dependências, gerenciar recursos de pacote e executar outras funções semelhantes.
ru: ``distlib`` - это библиотека, реализующая низкоуровневые функции, связанные с упаковкой и распространением программ на Python. ``distlib`` реализует несколько соответствующих PEP (стандарты Python Enhancement Proposal) и полезна разработчикам сторонних средств упаковки для создания и загрузки бинарных и исходных :term:`distributions <Distribution Package>`, достижения совместимости, разрешения зависимостей, управления ресурсами пакета и выполнения других подобных функций.
ta: `` டிச்ட்லிப்`` என்பது பைதான் மென்பொருளின் பேக்கேசிங் மற்றும் விநியோகத்துடன் தொடர்புடைய குறைந்த அளவிலான செயல்பாடுகளை செயல்படுத்தும் ஒரு நூலகம். `` டிச்ட்லிப்`` பல தொடர்புடைய PEP களை (பைதான் மேம்பாட்டு முன்மொழிவு தரநிலைகள்) செயல்படுத்துகிறது மற்றும் மூன்றாம் தரப்பு பேக்கேசிங் கருவிகளை உருவாக்கி பைனரி மற்றும் மூலத்தை உருவாக்குவதற்கும் பதிவேற்றுவதற்கும் இது பயனுள்ளதாக இருக்கும்: கால: `விநியோகங்கள் <விநியோக தொகுப்பு>`, இயங்குதளங்களை அடையலாம், சார்புகளைத் தீர்க்கவும், தொகுப்பு வளங்களை நிர்வகிக்கவும், பிற ஒத்த செயல்பாடுகளைச் செய்யவும்.

source: Unlike the stricter :ref:`packaging` project (below), which specifically implements modern Python packaging interoperability standards, ``distlib`` also attempts to provide reasonable fallback behaviours when asked to handle legacy packages and metadata that predate the modern interoperability standards and fall into the subset of packages that are incompatible with those standards.
ja: 近代的な Python パッケージングにおける相互運用性標準に特に気を配って実装された、より厳格な :ref:`packaging` プロジェクト (後述) とは異なり、 ``distlib`` は近代的な相互運用性標準ができる前の昔ながらのパッケージやメタデータで今となってはその標準に外れたことになっているものを扱うように言われた時には合理的なフォールバック動作も提供しようとしています。
pt_br: Ao contrário do projeto :ref:`packaging` mais estrito (abaixo), que implementa especificamente padrões modernos de interoperabilidade de pacotes Python, ``distlib`` também tenta fornecer comportamentos de fallback razoáveis quando solicitados a lidar com pacotes legados e metadados anteriores à interoperabilidade moderna padrões e se enquadram no subconjunto de pacotes que são incompatíveis com esses padrões.
ru: В отличие от более строгого проекта :ref:`packaging` (см. ниже), который специально реализует современные стандарты совместимости упаковки Python, ``distlib`` также пытается обеспечить разумное обратное поведение, когда требуется работать со старыми пакетами и метаданными, которые появились до современных стандартов совместимости и попадают в подмножество пакетов, несовместимых с этими стандартами.
ta: நவீன பைதான் பேக்கேசிங் இயங்குதள தரங்களை குறிப்பாக செயல்படுத்தும் கடுமையான: ref: `பேக்கேசிங்` திட்டம் (கீழே) போலல்லாமல், நவீன இயங்குதன்மை தரநிலைகள் மற்றும் மரபு தொகுப்புகள் மற்றும் மெட்டாடேட்டாவைக் கையாளும்படி கேட்கும்போது நியாயமான குறைவடையும் நடத்தைகளை வழங்க முயற்சிக்கிறது. அந்த தரங்களுடன் பொருந்தாத தொகுப்புகளின் துணைக்குழுவில் விழுங்கள்.

source: distutils
ta: சரிவு

source: The original Python packaging system, added to the standard library in Python 2.0 and removed in 3.12.
eo: La origina Python-pakada sistemo, aldonita al la norma biblioteko en Python 2.0 kaj forigita en 3.12.
ja: Python の元々のパッケージングシステムで、Python 2.0 の時点で標準ライブラリに追加され 3.12 で削除されました。
pt_br: O sistema de empacotamento original do Python, adicionado à biblioteca padrão no Python 2.0 e removido no 3.12.
ru: Оригинальная система упаковки Python, добавленная в стандартную библиотеку в Python 2.0 и удаленная в 3.12.
ta: அசல் பைதான் பேக்கேசிங் அமைப்பு, பைதான் 2.0 இல் உள்ள நிலையான நூலகத்தில் சேர்க்கப்பட்டு 3.12 இல் அகற்றப்பட்டது.

source: Due to the challenges of maintaining a packaging system where feature updates are tightly coupled to language runtime updates, direct usage of :ref:`distutils` has been actively discouraged, with :ref:`Setuptools` being the preferred replacement. :ref:`Setuptools` not only provides features that plain :ref:`distutils` doesn't offer (such as dependency declarations and entry point declarations), it also provides a consistent build interface and feature set across all supported Python versions.
ja: パッケージングシステムを維持管理する際の難題には機能向上が言語ラインタイムの更新と密接に結びついていることが挙げられますが、そのせいで :ref:`distutils` を直接に使用することは強い非推奨事項にずっとなり続けてきており、代わりに :ref:`Setuptools` を使うことが望ましいとされています。 :ref:`Setuptools` は、 :ref:`distutils` そのものが提供していない機能 (例えば依存関係の宣言やエントリポイントの宣言) を提供できるだけでなく、守備一貫したビルド用のインタフェイスやサポートするすべてのバージョンの Python のすべてについて設定できる機能を提供しています。
pt_br: Devido aos desafios de manter um sistema de empacotamento onde as atualizações de recursos estão fortemente acopladas às atualizações de tempo de execução da linguagem, o uso direto de :ref:`distutils` foi ativamente desencorajado, com :ref:`Setuptools` sendo o substituto preferido. :ref:`Setuptools` não apenas fornece recursos que o :ref:`distutils` simples não oferece (como declarações de dependência e declarações de ponto de entrada), ele também fornece uma interface de construção consistente e conjunto de recursos em todas as versões Python suportadas .
ru: Из-за сложностей, связанных с поддержкой системы упаковки, в которой обновления функций тесно связаны с обновлениями времени выполнения языка, прямое использование :ref:`distutils` активно не рекомендуется, а предпочтительной заменой является :ref:`Setuptools`. :ref:`Setuptools` не только предоставляет возможности, которых нет в обычном :ref:`distutils` (такие как объявление зависимостей и объявление точек входа), но и обеспечивает согласованный интерфейс сборки и набор функций для всех поддерживаемых версий Python.
ta: அம்ச புதுப்பிப்புகள் மொழி இயக்க நேர புதுப்பிப்புகளுடன் இறுக்கமாக இணைக்கப்படும் ஒரு பேக்கேசிங் முறையை பராமரிப்பதில் உள்ள சவால்கள் காரணமாக, நேரடி பயன்பாடு: ref: `தொலைதூரங்கள்` தீவிரமாக ஊக்கமளிக்கப்பட்டுள்ளன, இதனுடன்: குறிப்பு:` செடிப்டூல்ச்` விருப்பமான மாற்றாக இருப்பது. .

source: Consequently, :ref:`distutils` was deprecated in Python 3.10 by :pep:`632` and has been :doc:`removed <python:whatsnew/3.12>` from the standard library in Python 3.12. Setuptools bundles the standalone copy of distutils, and it is injected even on Python < 3.12 if you import setuptools first or use pip.
eo: Tial :ref:`distutils` iĝis evitinda ekde Python 3.10 per :pep:`632` kaj estis :doc:`forigita <python:whatsnew/3.12>` el la norma biblioteko je Python 3.12. Setuptools enhavas memstaran kopion de distutils kaj injektas ĝin, eĉ por Python < 3.12, kiam oni unue importas setuptools aŭ uzas pip.
ja: 従って、 :ref:`distutils` は :pep:`632` によって Python 3.10 で非推奨になり、 Python 3.12 で標準ライブラリから :doc:`削除 <python:whatsnew/3.12>` されました。Setuptools にはスタンドアローンの distutils が同梱されていて、< 3.12 の Python 上であっても setuptools をインポートするか pip を使うと注入されます。
pt_br: Consequentemente, :ref:`distutils` foi descontinuado no Python 3.10 por :pep:`632` e foi :doc:`removido <python:whatsnew/3.12>` da biblioteca padrão em Python 3.12. Setuptools inclui a cópia autônoma de distutils, e é injetado mesmo no Python < 3.12 se você importar setuptools primeiro ou usar pip.
ru: Следовательно, :ref:`distutils` был устаревшим в Python 3.10 с помощью :pep:`632` и был :doc:`удален <python:whatsnew/3.12>` из стандартной библиотеки в Python 3.12. Setuptools включает в себя автономную копию distutils, и она внедряется даже на Python < 3.12, если вы сначала импортируете setuptools или используете pip.
ta: இதன் விளைவாக, குறிப்பு: `தொலைதூரங்கள்` பைத்தானில் 3.10 இல் நீக்கப்பட்டன: PEP: `632` மற்றும் உள்ளது: DOC:` அகற்றப்பட்டது <பைத்தான்: வாட்ச்நியூ/3.12> `பைத்தானில் உள்ள நிலையான நூலகத்திலிருந்து 3.12. Setuptools டிச்டிடில்களின் முழுமையான நகலை மூட்டுகிறது, மேலும் நீங்கள் முதலில் செட்டப்டூல்களை இறக்குமதி செய்தால் அல்லது PIP ஐப் பயன்படுத்தினால் இது பைதான் <3.12 இல் கூட செலுத்தப்படுகிறது.

source: flit
ta: ஃபிளிட்

source: `Docs <https://flit.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/flit/issues>`__ | `PyPI <https://pypi.org/project/flit>`__
eo: `Dokumentaro <https://flit.readthedocs.io/en/latest/>`__ | `Cimoj <https://github.com/pypa/flit/issues>`__ | `PyPI <https://pypi.org/project/flit>`__
ja: `説明文書 <https://flit.readthedocs.io/en/latest/>`__ | `課題リスト <https://github.com/pypa/flit/issues>`__ | `PyPI <https://pypi.org/project/flit>`__
pt_br: `Documentação <https://flit.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/flit/issues>`__ | `PyPI <https://pypi.org/project/flit>`__
ru: `Документы <https://flit.readthedocs.io/en/latest/>`__ | `Проблемы <https://github.com/pypa/flit/issues>`__ | `PyPI <https://pypi.org/project/flit>`__
ta: `டாக்ச் <https://flit.readthedocs.io/en/latest/> __ | `சிக்கல்கள் <https://github.com/pypa/flit/issues>` __ | `Pypi <https://pypi.org/project/flit>` __

source: Flit provides a simple way to create and upload pure Python packages and modules to PyPI. It focuses on `making the easy things easy <flit-rationale_>`_ for packaging. Flit can generate a configuration file to quickly set up a simple project, build source distributions and wheels, and upload them to PyPI.
eo: Flit estas simpla maniero por krei kaj alŝuti pakon aŭ modulon konsistantan nur el Python al PyPI. Ĝi celas `faciligi facilaĵojn <flit-rationale_>`_ pri pakado. Flit povas generi agordan dosieron por rapide starigi simplan projekton, konstrui fontajn distribuojn kaj wheel-ojn, kaj alŝuti ilin al PyPI.
ja: Flit は、純 Python のパッケージやモジュールを作成して PyPI へアップロードする簡単な手段を提供します。パッケージングに関して `簡単なことを簡単に実現する <flit-rationale_>`_ ことに注力しています。これを使えば単純なプロジェクトやソースコード配布物とwheelsについて素早くセットアップするための設定ファイルを生成し、PyPI にアップロードすることができます。
pt_br: O Flit fornece uma maneira simples de criar e enviar pacotes e módulos puro Python para o PyPI. Ele se concentra em `facilitar as coisas fáceis <flit-rationale_>`_ para empacotar. O Flit pode gerar um arquivo de configuração para configurar rapidamente um projeto simples, construir distribuições fonte e wheels e enviá-los para PyPI.
ru: Flit предоставляет простой способ создания и загрузки пакетов и модулей на чистом Python в PyPI. Он фокусируется на том, чтобы "сделать легкие вещи легкими <flit-rationale_>`_ для упаковки". Flit может сгенерировать конфигурационный файл для быстрой настройки простого проекта, собрать исходные дистрибутивы и колеса и загрузить их в PyPI.
ta: தூய பைதான் தொகுப்புகள் மற்றும் தொகுதிகளை PYPI க்கு உருவாக்கி பதிவேற்ற ஒரு எளிய வழியை FLIT வழங்குகிறது. இது `எளிதான விசயங்களை எளிதாக்குவதில் கவனம் செலுத்துகிறது <ஃபிளிட்-ரேசன்_>` _ பேக்கேசிங்கிற்கு. ஒரு எளிய திட்டத்தை விரைவாக அமைக்கவும், மூல விநியோகங்கள் மற்றும் சக்கரங்களை உருவாக்கவும், அவற்றை PYPI இல் பதிவேற்றவும் ஃபிளிட் ஒரு உள்ளமைவு கோப்பை உருவாக்க முடியும்.
