Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: All projects should contain a readme file that covers the goal of the project. The most common format is `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ with an "rst" extension, although this is not a requirement; multiple variants of `Markdown <https://daringfireball.net/projects/markdown/>`_ are supported as well (look at ``setup()``'s :ref:`long_description_content_type <description>` argument).
eo: Ĉiu projekto enhavo readme-dosieron pri la celoj de la projekto. La plej ofta dosierformo estas `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ kun dosiersufikso ``.rst``, sed tio ne estas deviga. Pluraj variantoj de `Markdown <https://daringfireball.net/projects/markdown/>`_ estas ankaŭ subtenataj (vidu la argumenton :ref:`long_description_content_type <description>` de ``setup()``).
ja: すべてのプロジェクトは、プロジェクトのゴールを記したreadmeファイルを備えるべきです。一番良くあるフォーマットは拡張子が "rst" の `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ ですが、これは(訳註、必須の)要求事項というわけではありません。他にも複数の種類の `マークダウン <https://daringfireball.net/projects/markdown/>`_ フォーマットがサポートされています(``setup()`` の :ref:`long_description_content_type <description>` 引数を見てください)。
pt_br: Todos os projetos devem conter um arquivo leia-me que cubra o objetivo do projeto. O formato mais comum é `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ com uma extensão "rst", embora isso não seja um requisito; múltiplas variantes do `Markdown <https://daringfireball.net/projects/markdown/>`_ também são suportadas (veja o argumento :ref:`long_description_content_type <description>` do ``setup()``).
ru: Все проекты должны содержать файл readme, в котором описывается цель проекта. Наиболее распространенным форматом является `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ с расширением "rst", хотя это не является обязательным условием; также поддерживаются различные варианты `Markdown <https://daringfireball.net/projects/markdown/>`_ (посмотрите на аргумент ``setup()`` :ref:`long_description_content_type <description>`).
ta: எல்லா திட்டங்களிலும் திட்டத்தின் இலக்கை உள்ளடக்கிய README கோப்பு இருக்க வேண்டும். மிகவும் பொதுவான வடிவம் `மறுசீரமைக்கப்பட்ட டெக்ச்ட் <https://docutils.sourceforge.io/rst.html>` _ ஒரு "rst" நீட்டிப்புடன், இது ஒரு தேவையில்லை என்றாலும்; `மார்க் பேரூர் <https://daringfireball.net/projects/markdown/> _ _ ஆகியவற்றின் பல வகைகளும் ஆதரிக்கப்படுகின்றன (` `அமைவு ()` `கள்: ref:` long_description_content_type <criptry> `வாதம்).

source: For an example, see `README.md <https://github.com/pypa/sampleproject/blob/main/README.md>`_ from the `PyPA sample project <https://github.com/pypa/sampleproject>`_.
eo: Por ekzemplo, vidu `README.md <https://github.com/pypa/sampleproject/blob/main/README.md>`_ en la `ekzempla projekto de PyPA <https://github.com/pypa/sampleproject>`_.
ja: `PyPA sample project <https://github.com/pypa/sampleproject>`_ の中の `README.md <https://github.com/pypa/sampleproject/blob/main/README.md>`_ に例が出ています。
pt_br: Para obter um exemplo, consulte o `README.md <https://github.com/pypa/sampleproject/blob/main/README.md>`_ do `projeto de exemplo PyPA <https://github.com/pypa/sampleproject>`_.
ru: Для примера смотрите `README.md <https://github.com/pypa/sampleproject/blob/main/README.md>`_ из проекта-образца `PyPA <https://github.com/pypa/sampleproject>`_.
ta: எடுத்துக்காட்டுக்கு, `Readme.md <https://github.com/pypa/sampleproject/blob/main/readme.md>` _ `pypa மாதிரி திட்டத்திலிருந்து <https://github.com/pypa/sampleproject ஐப் பார்க்கவும் > `_.

source: Projects using :ref:`setuptools` 0.6.27+ have standard readme files (:file:`README.rst`, :file:`README.txt`, or :file:`README`) included in source distributions by default. The built-in :ref:`distutils` library adopts this behavior beginning in Python 3.7. Additionally, :ref:`setuptools` 36.4.0+ will include a :file:`README.md` if found. If you are using setuptools, you don't need to list your readme file in :file:`MANIFEST.in`. Otherwise, include it to be explicit.
eo: Projekto uzanta :ref:`setuptools` 0.6.27+ havas normajn README-dosierojn (:file:`README.rst`, :file:`README.txt`, aŭ :file:`README`) inkluzivitajn en fonta distribuo implicite. La norma biblioteok :ref:`distutils` adoptas tiun konduton ekde Python 3.7. Plie, :ref:`setuptools` 36.4.0+ inkluzivas :file:`README.md`, se ĝi troviĝas. Se oni uzas setuptools, oni ne bezonas inkluzivi la README-dosieron en :file:`MANIFEST.in`. Se ne, inkluzivu ĝin eksplicite.
ja: :ref:`setuptools`の0.6.27およびそれ以降のバージョンを使っているプロジェクトでは、標準のreadmeファイル(:file:`README.rst`、 :file:`README.txt`、または :file:`README`)がデフォルトでソースコード配布物に含まれるようになっています。標準ライブラリの :ref:`distutils` では、Python 3.7からこの動作を採用しました。さらに、:ref:`setuptools` の36.4.0およびそれ以降のバージョンでは、もし見つかれば :file:`README.md` を含めるようになっています。もしあなたがsetuptoolsを使っているのであれば、あなたはreadmeファイルを :file:`MANIFEST.in` に明記する必要はありません。そうでないなら、明示的に書いてください。
pt_br: Projetos usando :ref:`setuptools` 0.6.27+ têm arquivos leia-me padrão (:file:`README.rst`, :file:`README.txt` ou :file:`README`) incluídos nas distribuições de código-fonte por padrão. A biblioteca interna :ref:`distutils` adota este comportamento a partir do Python 3.7. Adicionalmente, :ref:`setuptools` 36.4.0+ incluirá um :file:`README.md` se encontrado. Se você estiver usando setuptools, você não precisa listar seu arquivo leia-me em :file:`MANIFEST.in`. Caso contrário, inclua para ser explícito.
ru: В проектах, использующих :ref:`setuptools` 0.6.27+, стандартные файлы readme (:file:`README.rst`, :file:`README.txt` или :file:`README`) по умолчанию включены в дистрибутивы исходных текстов. Встроенная библиотека :ref:`distutils` перенимает это поведение начиная с Python 3.7. Кроме того, :ref:`setuptools` 36.4.0+ будет включать :file:`README.md`, если он будет найден. Если вы используете setuptools, вам не нужно указывать свой файл readme в :file:`MANIFEST.in`. В противном случае включите его в явном виде.
ta: பயன்படுத்தும் திட்டங்கள்: ref: `setuptools` 0.6.27+ நிலையான README கோப்புகளைக் கொண்டுள்ளன (: கோப்பு:` readme.rst`,: கோப்பு: `ReadMe.txt`, அல்லது: கோப்பு:` README`) மூல விநியோகங்களில் இயல்பாகவே. உள்ளமைக்கப்பட்ட: ref: `தொலைதூரங்கள்` நூலகம் இந்த நடத்தையை பைத்தான் 3.7 இல் தொடங்குகிறது. கூடுதலாக, குறிப்பு: `setuptools` 36.4.0+ ஒரு: கோப்பு:` Readme.md` கிடைத்தால் அடங்கும். நீங்கள் செட்டுப்டூல்களைப் பயன்படுத்துகிறீர்கள் என்றால், உங்கள் README கோப்பை அதில் பட்டியலிட தேவையில்லை: கோப்பு: `manifest.in`. இல்லையெனில், அதை வெளிப்படையாகச் சேர்க்கவும்.

source: A :file:`MANIFEST.in` is needed when you need to package additional files that are not automatically included in a source distribution. For details on writing a :file:`MANIFEST.in` file, including a list of what's included by default, see ":ref:`Using MANIFEST.in`".
eo: :file:`MANIFEST.in` necesas, kiam oni bezonas paki pliajn dosierojn ne aŭtomate inkluzivotajn en fontan distribuon. Por detaloj pri verkado de :file:`MANIFEST.in`, inkluzive de listo de aŭtomate inkluzivotaj dosieroj, vidu :ref:`Uzi MANIFEST.in <Using MANIFEST.in>`.
ja: 自動的に追加されるファイル以外のファイルをソースコード配布物に追加したい場合には、 :file:`MANIFEST.in` が必要になります。 どんなファイルがデフォルトで自動的に追加されるのかも含めて、 :file:`MANIFEST.in` の書き方の詳細については「 :ref:`MANIFEST.in の使い方 <Using MANIFEST.in>`」を見てください。
pt_br: Um :file:`MANIFEST.in` é necessário quando você precisa empacotar arquivos adicionais que não são incluídos automaticamente em uma distribuição de código-fonte. Para obter detalhes sobre como escrever um arquivo :file:`MANIFEST.in`, incluindo uma lista do que é incluído por padrão, consulte ":ref:`Using MANIFEST.in`".
ru: Файл :file:`MANIFEST.in` необходим, когда вам нужно упаковать дополнительные файлы, которые не включены автоматически в дистрибутив. Подробнее о написании файла :file:`MANIFEST.in`, включая список того, что включается по умолчанию, смотрите в разделе ":ref:`Using MANIFEST.in`".
ta: ப: கோப்பு: மூல விநியோகத்தில் தானாக சேர்க்கப்படாத கூடுதல் கோப்புகளை நீங்கள் தொகுக்க வேண்டியிருக்கும் போது `மேனிஃபெச்ட்.இன்` தேவை. ஒரு: கோப்பு: `manifest.in` கோப்பு, இயல்புநிலையாக சேர்க்கப்பட்டவற்றின் பட்டியல் உட்பட,": ref: `Manifest.in`" ஐப் பயன்படுத்துதல் "ஐப் பார்க்கவும்.

source: However, you may not have to use a :file:`MANIFEST.in`. For an example, the `PyPA sample project <https://github.com/pypa/sampleproject>`_ has removed its manifest file, since all the necessary files have been included by :ref:`setuptools` 43.0.0 and newer.
eo: Tamen, oni ne devas uzi :file:`MANIFEST.in`. Ekzemple, la `ekzempla projekto de PyPA <https://github.com/pypa/sampleproject>`_ ne plu havas :file:`MANIFEST.in`, ĉar ĉiaj necesaj dosieroj inkluziviĝas en :ref:`setuptools` ekde versio 43.0.0.
ja: しかしながら、あなたは必ずしも :file:`MANIFEST.in` を使わなくても構いません。一つの例として`PyPA サンプルプロジェクト <https://github.com/pypa/sampleproject>`_ では、必要なファイルがすべて 43.0.0およびこれ以降の:ref:`setuptools`に含まれているので、マニフェストファイルを削除しています。
pt_br: No entanto, você pode não ter que usar um :file:`MANIFEST.in`. Por exemplo, o `projeto de amostra PyPA <https://github.com/pypa/sampleproject>`_ removeu seu arquivo de manifesto, uma vez que todos os arquivos necessários foram incluídos pelo :ref:`setuptools` 43.0.0 e mais recentes.
ru: Однако вы можете не использовать :file:`MANIFEST.in`. Для примера, проект примера `PyPA <https://github.com/pypa/sampleproject>`_ удалил свой файл манифеста, так как все необходимые файлы были включены в :ref:`setuptools` 43.0.0 и новее.
ta: இருப்பினும், நீங்கள் ஒரு: கோப்பு: `manifest.in` ஐப் பயன்படுத்த வேண்டியதில்லை. எடுத்துக்காட்டுக்கு, `பைபா மாதிரி திட்டம் <https://github.com/pypa/sampleproject>` _ அதன் வெளிப்படையான கோப்பை நீக்கிவிட்டது, ஏனெனில் தேவையான அனைத்து கோப்புகளும் இவற்றில் சேர்க்கப்பட்டுள்ளன: ref: `setuptools` 43.0.0 மற்றும் புதியது .

source: :file:`MANIFEST.in` does not affect binary distributions such as wheels.
eo: :file:`MANIFEST.in` ne rilatas al duuma distribuo kiel wheel.
ja: :file:`MANIFEST.in` は、wheelなどのバイナリ配布物には影響を与えません。
pt_br: :file:`MANIFEST.in` não afeta distribuições binárias como wheels.
ru: :file:`MANIFEST.in' не влияет на бинарные дистрибутивы, такие как колеса.
ta: : கோப்பு: `manifest.in` சக்கரங்கள் போன்ற பைனரி விநியோகங்களை பாதிக்காது.

source: LICENSE.txt
ta: உரிமம்

source: Every package should include a license file detailing the terms of distribution. In many jurisdictions, packages without an explicit license can not be legally used or distributed by anyone other than the copyright holder. If you're unsure which license to choose, you can use resources such as `GitHub's Choose a License <https://choosealicense.com/>`_ or consult a lawyer.
eo: Ĉiu pako havu licenco-dosieron pri la kondiĉoj de distribuado. En multaj jurisdikcioj, pako sen eksplicita licenco ne estas uzebla nek distribuebla far iu alia ol la kopirajto-posedanto. Se vi ne certas pri la licenco, vidu `Choose a License <https://choosealicense.com/>`_ de GitHub, aŭ konsultu advokaton.
ja: 各パッケージは、配布の条件を指定するライセンスファイルを含んでいるべきです。多くの司法管轄区域(訳註、大雑把にいうと「多くの国」)では、明示的なライセンス条項がないと、著作権保持者でなければ誰も適法にパッケージを使用したり配布したりすることができません。どのライセンスを選択すればよいか分からない場合には、`GitHubの「オープンソースライセンスを選ぶには」 <https://choosealicense.com/>`_ などのリソースを見ることも、弁護士に相談することもできます。
pt_br: Cada pacote deve incluir um arquivo de licença detalhando os termos de distribuição. Em muitas jurisdições, os pacotes sem uma licença explícita não podem ser legalmente usados ou distribuídos por ninguém que não seja o detentor dos direitos autorais. Se não tiver certeza de qual licença escolher, você pode usar recursos como `Escolha uma licença do GitHub <https://choosealicense.com/>`_ ou consultar um advogado.
ru: Каждый пакет должен содержать файл лицензии с подробным описанием условий распространения. Во многих юрисдикциях пакеты без явной лицензии не могут быть законно использованы или распространены кем-либо, кроме правообладателя. Если вы не уверены, какую лицензию выбрать, вы можете воспользоваться такими ресурсами, как `GitHub's Choose a License <https://choosealicense.com/>`_ или проконсультироваться с юристом.
ta: ஒவ்வொரு தொகுப்பிலும் விநியோக விதிமுறைகளை விவரிக்கும் உரிமக் கோப்பு இருக்க வேண்டும். பல அதிகார வரம்புகளில், வெளிப்படையான உரிமம் இல்லாத தொகுப்புகளை பதிப்புரிமைதாரரைத் தவிர வேறு யாராலும் சட்டப்பூர்வமாக பயன்படுத்தவோ அல்லது விநியோகிக்கவோ முடியாது. எந்த உரிமத்தை தேர்வு செய்வது என்று உங்களுக்குத் தெரியாவிட்டால், `கிட்அப் போன்ற ஆதாரங்களை நீங்கள் பயன்படுத்தலாம் <https://choosealicense.com/> _ _ அல்லது ஒரு வழக்கறிஞரை அணுகவும்.

source: For an example, see the `LICENSE.txt <https://github.com/pypa/sampleproject/blob/main/LICENSE.txt>`_ from the `PyPA sample project <https://github.com/pypa/sampleproject>`_.
eo: Por ekzemplo, vidu `LICENSE.txt <https://github.com/pypa/sampleproject/blob/main/LICENSE.txt>`_ en la `ekzempla projekto de PyPA <https://github.com/pypa/sampleproject>`_.
ja: `PyPAサンプルプロジェクト <https://github.com/pypa/sampleproject>`_ の `LICENSE.txt <https://github.com/pypa/sampleproject/blob/master/LICENSE.txt>`_ に例がでています。
pt_br: Para obter um exemplo, consulte o `LICENSE.txt <https://github.com/pypa/sampleproject/blob/main/LICENSE.txt>`_ do `projeto de exemplo PyPA <https://github.com/pypa/ sampleproject>`_.
ru: Для примера смотрите `LICENSE.txt <https://github.com/pypa/sampleproject/blob/main/LICENSE.txt>`_ из проекта-образца `PyPA <https://github.com/pypa/sampleproject>`_.
ta: எடுத்துக்காட்டுக்கு, `பைபா மாதிரி திட்டத்திலிருந்து <https://github.com/pypa/ இலிருந்து` உரிமம். மாதிரி தயாரிப்பு> `_.

source: <your package>
eo: <via pako>
ja: <あなたのパッケージ>
pt_br: <seu pacote>
ru: <ваш пакет>
ta: <உங்கள் தொகுப்பு>

source: Although it's not required, the most common practice is to include your Python modules and packages under a single top-level package that has the same :ref:`name <setup() name>` as your project, or something very close.
eo: Tamen tio ne necesas, la ofta praktiko estas inkluzivi Python-modulojn kaj pakojn sub unu supranivela pako, kies nomo estas sama kiel (aŭ tre proksima al) la :ref:`nomo <setup() name>` de via projekto.
ja: 必ずそうしなければならないというわけではありませんが、あなたのプロジェクトと同じか非常に近い :ref:`名前 <setup() name>` の単一のプロジェクトをPythonのモジュールやパッケージのトップレベルに配置するということが共通の慣習になっています。
pt_br: Embora não seja obrigatório, a prática mais comum é incluir seus módulos e pacotes Python em um único pacote de nível superior que tem o mesmo :ref:`name <setup() name>` do seu projeto, ou algo muito próximo.
ru: Хотя это и не обязательно, наиболее распространенной практикой является включение ваших модулей и пакетов Python в один пакет верхнего уровня, который имеет то же :ref:`имя <setup() name>`, что и ваш проект, или что-то очень близкое.
ta: இது தேவையில்லை என்றாலும், உங்கள் பைதான் தொகுதிகள் மற்றும் தொகுப்புகளை ஒரே ஒரு உயர் மட்ட தொகுப்பின் கீழ் சேர்ப்பது மிகவும் பொதுவான நடைமுறை: ref: `பெயர் <அமைவு () பெயர்>` உங்கள் திட்டமாக அல்லது மிக நெருக்கமான ஒன்று.

source: For an example, see the `sample <https://github.com/pypa/sampleproject/tree/main/src/sample>`_ package that's included in the `PyPA sample project <https://github.com/pypa/sampleproject>`_.
eo: Por ekzemplo, vidu la pakon `sample <https://github.com/pypa/sampleproject/tree/main/src/sample>`_ en la `ekzempla projekto de PyPA <https://github.com/pypa/sampleproject>`_.
ja: `PyPAサンプルプロジェクト <https://github.com/pypa/sampleproject>`_ に含まれる `サンプル <https://github.com/pypa/sampleproject/blob/main/src/sample>`_ パッケージに例が出ています。
pt_br: Para obter um exemplo, consulte o pacote de `exemplo <https://github.com/pypa/sampleproject/tree/main/src/sample>`_ que está incluído no `projeto de exemplo PyPA <https://github.com/pypa/sampleproject>`_.
ru: В качестве примера можно привести пакет `sample <https://github.com/pypa/sampleproject/tree/main/src/sample>`_, который входит в состав проекта-образца PyPA <https://github.com/pypa/sampleproject>`_.
ta: எடுத்துக்காட்டுக்கு, `மாதிரி <https://github.com/pypa/sampleproject/tree/main/src/sample>` _ PYPA மாதிரி திட்டத்தில் சேர்க்கப்பட்டுள்ள தொகுப்பு <https://github.com/pypa /salemProject> `_.

source: setup() args
eo: argumentoj por setup()
ja: setup() の引数
pt_br: Argumentos de setup()
ru: Аргументы ``setup()``
ta: அமைவு () ஆர்க்ச்

source: As mentioned above, the primary feature of :file:`setup.py` is that it contains a global ``setup()`` function. The keyword arguments to this function are how specific details of your project are defined.
eo: Kiel menciite ĉi-supre, la ĉeftrajto de :file:`setup.py` estas, ke ĝi enhavas mallokan funkcion ``setup()``. La ŝlosilvortaj argumentoj de tiu funkcio difinas la detalojn de la projekto.
ja: 上述の通り、:file:`setup.py` の第一の機能は、グローバルスコープの ``setup()`` 関数を含むことです。この関数に与えるキーワード引数は、あなたのプロジェクトの特定の細部がどのように定義されているかを示すものです。
pt_br: Como mencionado acima, o principal recurso do :file:`setup.py` é que ele contém uma função global ``setup()``. Os argumentos nomeados para esta função são como os detalhes específicos do seu projeto são definidos.
ru: Как уже говорилось выше, главная особенность :file:`setup.py` заключается в том, что он содержит глобальную функцию ``setup()``. Ключевые слова-аргументы этой функции определяют конкретные детали вашего проекта.
ta: மேலே குறிப்பிட்டுள்ளபடி, இதன் முதன்மை அம்சம்: கோப்பு: `setup.py` என்னவென்றால், அதில் உலகளாவிய` `அமைவு ()` `செயல்பாடு உள்ளது. இந்த செயல்பாட்டிற்கான முக்கிய வாதங்கள் உங்கள் திட்டத்தின் குறிப்பிட்ட விவரங்கள் எவ்வாறு வரையறுக்கப்படுகின்றன என்பதுதான்.

source: Some are temporarily explained below until their information is moved elsewhere. The full list can be found :doc:`in the setuptools documentation <setuptools:references/keywords>`.
eo: Kelkaj estas provizore klarigitaj ĉi-sube, ĝis kiam la informoj moviĝas aliloken. La plena listo ĉeestas :doc:`ĉe la dokumentaro de setuptools <setuptools:references/keywords>`.
ja: いくつかについては、情報がどこか他の場所に移されるまでの一時的な説明が以下にあります。すべてを列挙したものは :doc:`setuptools の説明文書 <setuptools:references/keywords>` で見つかるでしょう。
pt_br: Alguns são temporariamente explicados abaixo até que suas informações sejam movidas em outros lugares. A lista completa pode ser encontrada :doc:`na documentação setuptools <setuptools:references/keywords>`.
ru: Некоторые из них временно описаны ниже, пока информация о них не будет перенесена в другое место. Полный список можно найти :doc:`в документации по setuptools <setuptools:references/keywords>`.
ta: சிலர் தங்கள் தகவல்கள் வேறு இடத்திற்கு நகர்த்தப்படும் வரை தற்காலிகமாக கீழே விளக்கப்படுகிறார்கள். முழு பட்டியலையும் காணலாம்: டிஓசி: `செட்டுப்டூல்ச் ஆவணத்தில் <செட்டுப்டூல்ச்: குறிப்புகள்/முக்கிய வார்த்தைகள்>`.

source: Most of the snippets given are taken from the `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ contained in the `PyPA sample project <https://github.com/pypa/sampleproject>`_.
eo: Plejparto de la ekzemploj devenas de `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ en la `ekzempla projekto de PyPA <https://github.com/pypa/sampleproject>`_.
ja: ほとんどのソースコード断片(スニペット)は、`PyPA サンプルプロジェクト <https://github.com/pypa/sampleproject>`_ の中の `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ から取られたものです。
pt_br: A maioria dos fragmentos fornecidos são retirados do `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ contido no `projeto de exemplo do PyPA <https://github.com/pypa/sampleproject>`_.
ru: Большинство приведенных фрагментов взяты из файла `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_, содержащегося в проекте-образце `PyPA <https://github.com/pypa/sampleproject>`_.
ta: கொடுக்கப்பட்ட பெரும்பாலான துணுக்குகள் `setup.py <https://github.com/pypa/sampleproject/blob/db5806e3204034c51b1c00dde7dde7dde7ba2532e/setup.py.py> _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ com/pypa/salemProject> `_.

source: See :ref:`Choosing a versioning scheme` for more information on ways to use versions to convey compatibility information to your users.
eo: Vidu :ref:`Elekti versian skemon <Choosing a versioning scheme>` por pli pri kiel uzi version por komuniki informojn pri kongrueco al uzantoj.
ja: あなたのユーザへ互換性情報を伝える方法としてバージョン番号を使うやり方については、 :ref:`バージョンをつける規則を選択するには <Choosing a versioning scheme>` をご覧ください。
pt_br: Veja :ref:`Escolhendo um esquema de versionamento <Choosing a versioning scheme>` para mais informações sobre maneiras de usar versões para transmitir informações de compatibilidade para seus usuários.
ru: Дополнительные сведения о том, как использовать версии для передачи информации о совместимости пользователям, см. в :ref:`Выбор схемы версионирования`.
ta: காண்க: குறிப்பு: `ஒரு பதிப்பு திட்டத்தைத் தேர்ந்தெடுப்பது` உங்கள் பயனர்களுக்கு பொருந்தக்கூடிய தகவல்களை தெரிவிக்க பதிப்புகளைப் பயன்படுத்துவதற்கான வழிகள் பற்றிய கூடுதல் தகவலுக்கு.

source: ``packages``
ru: ``пакеты``
ta: `` தொகுப்புகள்``

source: Set ``packages`` to a list of all :term:`packages <Import Package>` in your project, including their subpackages, sub-subpackages, etc. Although the packages can be listed manually, ``setuptools.find_packages()`` finds them automatically. Use the ``include`` keyword argument to find only the given packages. Use the ``exclude`` keyword argument to omit packages that are not intended to be released and installed.
ja: ``packages`` には、あなたのプロジェクトにある :term:`パッケージ <Import Package>` を子パッケージや孫パッケージなども含めてすべて列挙してください。パッケージは手動で列挙することもできますが、 ``setuptools.find_packages()`` を使えば自動で列挙することができます。 ``include`` キーワード引数を使うと、ここに与えられた特定のパッケージだけを探索することができます。 ``exclude`` キーワード引数を使うと、公開したりインストールしたりする意図のないパッケージを除外することができます。
pt_br: Defina ``packages`` para uma lista de todos :term:`pacotes <Import Package>` em seu projeto, incluindo seus subpacotes, sub-subpacotes, etc. Embora os pacotes possam ser listados manualmente, ``setuptools.find_packages()`` encontra-os automaticamente. Use o argumento nomeado ``include`` para encontrar apenas os pacotes fornecidos. Use o argumento nomeado ``exclude`` para omitir pacotes que não devem ser lançados e instalados.
ru: Установите ``packages`` в список всех :term:`packages <Import Package>` в вашем проекте, включая их подпакеты, подсубпакеты и т.д. Хотя пакеты можно перечислить вручную, ``setuptools.find_packages()`` находит их автоматически. Используйте ключевой аргумент ``include`` для поиска только заданных пакетов. Используйте ключевой аргумент ``exclude`` для исключения пакетов, которые не предназначены для выпуска и установки.
ta: எல்லாவற்றின் பட்டியலுக்கும் `` தொகுப்புகள்`` அமைக்கவும்: கால: `தொகுப்புகள் <இறக்குமதி தொகுப்பு>`, உங்கள் திட்டத்தில், அவற்றின் துணைப் பேக்குகள், துணை துணைப்பிரிவுகள் போன்றவை உட்பட. தொகுப்புகளை கைமுறையாக பட்டியலிட முடியும் என்றாலும், `` setuptools.find_packages () `` அவற்றை தானாகவே கண்டுபிடிக்கும். கொடுக்கப்பட்ட தொகுப்புகளை மட்டுமே கண்டுபிடிக்க `` `` முக்கிய வாதத்தை சேர்க்கவும். விடுவிக்கப்பட்டு நிறுவப்பட விரும்பாத தொகுப்புகளைத் தவிர்க்க `` விலக்கு `முக்கிய வாதத்தைப் பயன்படுத்தவும்.
