Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The inclusion of the local version label makes it possible to differentiate upstream releases from potentially altered rebuilds by downstream integrators. The use of a local version identifier does not affect the kind of a release but, when applied to a source distribution, does indicate that it may not contain the exact same code as the corresponding upstream release.
ja: ローカルバージョンラベルを包含することで、上流側のリリースを下流側のインテグレータによる潜在的に修正されたリビルドから区別することが可能になります。ローカルバージョン識別子の使用はこの種のリリースには影響を与えませんが、ソースコード配布物に適用した場合には、対応する上流のリリースと正確に同じコードを含んでいないかもしれないということを示します。
ru: Включение метки локальной версии позволяет отличить релизы восходящего потока от потенциально измененных перестроек, сделанных интеграторами нисходящего потока. Использование идентификатора локальной версии не влияет на вид релиза, но при применении к дистрибутиву исходного кода указывает на то, что он может содержать не совсем тот же код, что и соответствующий релиз восходящего потока.
ta: உள்ளக பதிப்பு லேபிளைச் சேர்ப்பது, கீழ்நிலை ஒருங்கிணைப்பாளர்களால் மாற்றப்பட்ட மறுகட்டமைப்புகளிலிருந்து மேலோடை வெளியீடுகளை வேறுபடுத்துவதை சாத்தியமாக்குகிறது. உள்ளக பதிப்பு அடையாளங்காட்டியின் பயன்பாடு ஒரு வெளியீட்டைப் பாதிக்காது, ஆனால், மூல விநியோகத்திற்குப் பயன்படுத்தப்படும்போது, அதனுடன் தொடர்புடைய மேலோடை வெளியீட்டின் சரியான குறியீட்டைக் கொண்டிருக்கவில்லை என்பதைக் குறிக்கிறது.

source: To ensure local version identifiers can be readily incorporated as part of filenames and URLs, and to avoid formatting inconsistencies in hexadecimal hash representations, local version labels MUST be limited to the following set of permitted characters:
eo: Por certigi, ke loka versio-identigilo estu facile enmetebla en dosiernomojn kaj retadresojn, kaj por eviti aranĝan malkoherecon pri deksesumaj prezentoj de haketaĵoj, loka versio-etikedo DEVAS konsisti nur el la ĉi-subaj permesataj skribsignoj:
ja: ローカルのバージョン指定子を確かなものにすることは、ファイル名や URL の一部として難なく統合することができ、16進数のハッシュ値での表現でフォーマットが不統一になることを避けるには、ローカルバージョンラベルは、以下に示す許容される一連の文字群に限定されなければなりません。
ru: Чтобы идентификаторы локальных версий могли быть легко включены в имена файлов и URL-адреса, а также чтобы избежать несоответствий в форматировании шестнадцатеричных хэш-представлений, метки локальных версий ДОЛЖНЫ быть ограничены следующим набором разрешенных символов:
ta: உள்ளக பதிப்பு அடையாளங்காட்டிகளை கோப்பு பெயர்கள் மற்றும் முகவரி களின் ஒரு பகுதியாக உடனடியாக இணைக்க முடியும் என்பதை உறுதிப்படுத்தவும், மற்றும் எக்சாடெசிமல் ஆச் பிரதிநிதித்துவங்களில் முரண்பாடுகளை வடிவமைப்பதைத் தவிர்க்கவும், உள்ளக பதிப்பு லேபிள்கள் பின்வரும் அனுமதிக்கப்பட்ட எழுத்துக்களின் தொகுப்பிற்கு மட்டுப்படுத்தப்பட வேண்டும்:

source: ASCII letters (``[a-zA-Z]``)
eo: Askiaj literoj (``[a-zA-Z]``)
ja: ASCII 文字 (``[a-zA-Z]``)
pt_br: Letras ASCII (``[a-zA-Z]``)
ru: Буквы ASCII (``[a-zA-Z]``)
ta: ASCII கடிதங்கள் (`` [a-za-z] ``)

source: ASCII digits (``[0-9]``)
eo: Askiaj ciferoj (``[0-9]``)
ja: ASCII 数字 (``[0-9]``)
pt_br: Dígitos ASCII (``[0-9]``)
ru: Цифры ASCII (``[0-9]``)
ta: ASCII இலக்கங்கள் (`` [0-9] ``)

source: periods (``.``)
eo: punktoj (``.``)
ja: ピリオド (``.``)
pt_br: períodos (``.``)
ru: периоды (``.``)
ta: காலங்கள் (`` .``)

source: Local version labels MUST start and end with an ASCII letter or digit.
eo: Loka versia etikedo DEVAS komenciĝi kaj finiĝi per Askiaj literoj aŭ ciferoj.
ja: ローカルバージョンラベルは、 ASCII 文字ないし ASCII 数字で始まり、かつ、終わらなければなりません。
ru: Метки локальных версий ДОЛЖНЫ начинаться и заканчиваться буквой или цифрой ASCII.
ta: உள்ளக பதிப்பு லேபிள்கள் ASCII கடிதம் அல்லது இலக்கத்துடன் தொடங்கி முடிவடைய வேண்டும்.

source: Comparison and ordering of local versions considers each segment of the local version (divided by a ``.``) separately. If a segment consists entirely of ASCII digits then that section should be considered an integer for comparison purposes and if a segment contains any ASCII letters then that segment is compared lexicographically with case insensitivity. When comparing a numeric and lexicographic segment, the numeric section always compares as greater than the lexicographic segment. Additionally a local version with a great number of segments will always compare as greater than a local version with fewer segments, as long as the shorter local version's segments match the beginning of the longer local version's segments exactly.
eo: Komparo kaj ordigo de lokaj versioj temas pri ĉiu individua segmento de la loka versio (apartigita de ``.``). Se segmento konsistas tute el Askiaj ciferoj, tiu sekcio estas konsiderata kiel entjero por komparo; se segmento enhavas ajnan Askian literon, tiu segmento estas komparata leksikografie usklecblinde. Dum komparo inter numera kaj leksikografia segmentoj, la numera sekcio ĉiam estas pli granda ol la leksikografia segmento. Plie, loka versio kun pli granda nombro de segmentoj ĉiam estas pli granda ol loka versio kun malpli da segmentoj, se la segmentoj de la pli mallonga loka versio ekzakte egalas la komencon de la pli longa loka versio.
ja: ローカルバージョンの比較や順序付けでは、ローカルバージョンの (``.`` で分割される)各部分を別々に考えます。ある部分がすべて ASCII 数字でできているなら比較の目的においてはその部分は整数だと見做すべきであり、ある部分が一つでも ASCII 文字を含むのであれば大文字小文字を無視して辞書学的に比較されます。数字だけの部分と辞書学的な部分を比較する時には、常に、数字だけの部分が辞書学的な部分よりも大きいものとして比較されます。さらに、多数の部分を持つローカルバージョンは、短い方のローカルバージョンの部分部分が長い方のローカルバージョンの先頭の対応する部分と正確に一致する限り、常に、それより少ない数の部分を持つローカルバージョンよりも大きいものとして比較されます。
ru: При сравнении и упорядочивании локальных версий каждый сегмент локальной версии (разделенный символом ``.``) рассматривается отдельно. Если сегмент полностью состоит из ASCII-цифр, то для целей сравнения этот сегмент следует считать целым числом, а если сегмент содержит какие-либо ASCII-буквы, то этот сегмент сравнивается лексикографически с нечувствительностью к регистру. При сравнении числового и лексикографического сегментов числовой сегмент всегда сравнивается как больший, чем лексикографический. Кроме того, локальная версия с большим количеством сегментов всегда будет сравниваться как большая, чем локальная версия с меньшим количеством сегментов, при условии, что более короткие сегменты локальной версии точно совпадают с началом более длинных сегментов локальной версии.
ta: உள்ளக பதிப்புகளின் ஒப்பீடு மற்றும் வரிசைப்படுத்தல் உள்ளக பதிப்பின் ஒவ்வொரு பகுதியையும் (`` .``) தனித்தனியாகக் கருதுகிறது. ஒரு பிரிவு முழுவதுமாக ASCII இலக்கங்களைக் கொண்டிருந்தால், அந்த பிரிவு ஒப்பீட்டு நோக்கங்களுக்காக ஒரு முழு எண்ணாக கருதப்பட வேண்டும், மேலும் ஒரு பிரிவில் ஏதேனும் ASCII எழுத்துக்கள் இருந்தால், அந்த பிரிவு அகராதிக் முறையில் வழக்கு உணர்வற்ற தன்மையுடன் ஒப்பிடப்படுகிறது. ஒரு எண் மற்றும் அகராதி பிரிவை ஒப்பிடும் போது, எண் பிரிவு எப்போதும் லெக்சிகோகிராஃபிக் பிரிவை விட அதிகமாக ஒப்பிடுகிறது. கூடுதலாக, ஏராளமான பிரிவுகளைக் கொண்ட உள்ளக பதிப்பு எப்போதும் உள்ளக பதிப்பை விட குறைவான பிரிவுகளுடன் ஒப்பிடப்படும், குறுகிய உள்ளக பதிப்பின் பிரிவுகள் நீண்ட உள்ளக பதிப்பின் பிரிவுகளின் தொடக்கத்துடன் சரியாக பொருந்தும் வரை.

source: An "upstream project" is a project that defines its own public versions. A "downstream project" is one which tracks and redistributes an upstream project, potentially backporting security and bug fixes from later versions of the upstream project.
eo: «Suprula projekto» estas projekto, kiu difinas siajn publikajn versiojn. «Malsuprula projekto» estas projekto, kiu spuras kaj redistribuas suprulan projekton, eble kun sekurigaj flikoj kaj cimriparoj el pli novaj versioj de la suprula projekto.
ja: "上流プロジェクト" とは、それ自身のパブリックバージョンを定義するプロジェクトです。"下流プロジェクト" とは、上流プロジェクトに追随し再配布するプロジェクトで、潜在的には、上流プロジェクトのその後のバージョンからセキュリティ上の修正やバグ修正をバックポートします。
ru: Восходящий проект" - это проект, который определяет свои собственные публичные версии. Проект "downstream" - это проект, который отслеживает и распространяет проект "upstream", потенциально перенося исправления безопасности и ошибок из более поздних версий проекта "upstream".
ta: ஒரு "மேலோடை திட்டம்" என்பது அதன் சொந்த பொது பதிப்புகளை வரையறுக்கும் ஒரு திட்டமாகும். ஒரு "கீழ்நிலை திட்டம்" என்பது ஒரு மேலோடை திட்டத்தை கண்காணித்து மறுபகிர்வு செய்யும் ஒன்றாகும், இது மேலோடை திட்டத்தின் பிற்கால பதிப்புகளிலிருந்து பாதுகாப்பு மற்றும் பிழை திருத்தங்களை பின்னுக்குத் தள்ளும்.

source: Local version identifiers SHOULD NOT be used when publishing upstream projects to a public index server, but MAY be used to identify private builds created directly from the project source. Local version identifiers SHOULD be used by downstream projects when releasing a version that is API compatible with the version of the upstream project identified by the public version identifier, but contains additional changes (such as bug fixes). As the Python Package Index is intended solely for indexing and hosting upstream projects, it MUST NOT allow the use of local version identifiers.
eo: Oni NE UZU lokan versio-identigilon por eldoni originan projekton al publika indeksoservilo, sed POVAS uzi ĝin por identigi privatan konstruon kreitan rekte el la projekta fonto. Repaka projekto UZU lokan versio-identigilon por versio API-kongrua kun la versio de la origina projekto de la publika versio-identigilo, sed kun pliaj ŝanĝoj (kiel cimriparoj). Ĉar la Python-Pakindekso celas sole indeksi kaj gastigi originajn projektojn, ĝi DEVAS NE permesi la uzon de loka versio-identigilo.
ja: ローカルバージョン指定子は、上流プロジェクトを公開のインデックスサーバで公開する際に使用するべきではありませんが、プロジェクトのソースコードから直接に作成されたプライベートのビルド群を識別するために使っても構いません。ローカルバージョン指定子は、公開バージョン識別子で識別される上流プロジェクトのあるバージョンと API レベルで互換性を保つような、しかし、 (バグ修正などの) 追加の変更を含む下流プロジェクトのバージョンをリリースする時に用いられるべきです。Python パッケージインデックスは上流プロジェクトを列挙しホストすることだけを意図していますので、ローカルバージョン指定子の使用を許してはなりません。
ru: Локальные идентификаторы версий НЕ ДОЛЖНЫ использоваться при публикации восходящих проектов на публичном индексном сервере, но МОГУТ использоваться для идентификации частных сборок, созданных непосредственно из источника проекта. Идентификаторы локальных версий ДОЛЖНЫ использоваться нижестоящими проектами при выпуске версии, которая совместима по API с версией вышестоящего проекта, идентифицируемой идентификатором публичной версии, но содержит дополнительные изменения (например, исправления ошибок). Поскольку Python Package Index предназначен исключительно для индексирования и размещения upstream-проектов, он НЕ ДОЛЖЕН разрешать использование локальных идентификаторов версий.
ta: மேலோடை திட்டங்களை ஒரு பொது குறியீட்டு சேவையகத்திற்கு வெளியிடும்போது உள்ளக பதிப்பு அடையாளங்காட்டிகள் பயன்படுத்தப்படக்கூடாது, ஆனால் திட்ட மூலத்திலிருந்து நேரடியாக உருவாக்கப்பட்ட தனியார் கட்டடங்களை அடையாளம் காண பயன்படுத்தப்படலாம். பொது பதிப்பு அடையாளங்காட்டியால் அடையாளம் காணப்பட்ட மேலோடை திட்டத்தின் பதிப்போடு இணக்கமான பநிஇ பதிப்பை வெளியிடும் போது உள்ளக பதிப்பு அடையாளங்காட்டிகள் கீழ்நிலை திட்டங்களால் பயன்படுத்தப்பட வேண்டும், ஆனால் கூடுதல் மாற்றங்களைக் கொண்டுள்ளது (பிழை திருத்தங்கள் போன்றவை). பைதான் தொகுப்பு குறியீடு மேலோடை திட்டங்களை அட்டவணைப்படுத்துவதற்கும் ஓச்டிங் செய்வதற்கும் மட்டுமே நோக்கம் கொண்டதாக இருப்பதால், உள்ளக பதிப்பு அடையாளங்காட்டிகளைப் பயன்படுத்த அனுமதிக்கக்கூடாது.

source: Source distributions using a local version identifier SHOULD provide the ``python.integrator`` extension metadata (as defined in :pep:`459`).
eo: Fonta distribuo uzanta lokan versian identigilon PROVIZU la etendaĵan metadatenon ``python.integrator`` (laŭ :pep:`459`).
ja: ローカルバージョン識別子を使うソースコード配布物は、 (:pep:`459` で定義される通り) ``python.integrator`` 拡張メタデータを提供するべきです。
ru: Исходные дистрибутивы, использующие локальный идентификатор версии, ДОЛЖНЫ предоставлять метаданные расширения ``python.integrator`` (как определено в :pep:`459`).
ta: உள்ளக பதிப்பு அடையாளங்காட்டியைப் பயன்படுத்தும் மூல விநியோகங்கள் `` பைதான்.இண்டெக்ரேட்டர்` `நீட்டிப்பு மெட்டாடேட்டாவை வழங்க வேண்டும் (வரையறுக்கப்பட்டுள்ளபடி: PEP:` 459`).

source: Final releases
eo: Finaj eldonoj
ja: 最終リリース
ru: Финальные релизы
ta: இறுதி வெளியீடுகள்

source: A version identifier that consists solely of a release segment and optionally an epoch identifier is termed a "final release".
eo: Versia identigilo konsistanta nur el eldona segmento kaj nedeviga epok-identigilo nomiĝas «fina eldono».
ja: リリース部分だけか、オプションとしてエポック識別子を加えたものから構成されているバージョン識別子は、 "最終リリース <final release>" という用語で呼ばれます。
ru: Идентификатор версии, состоящий только из сегмента выпуска и, опционально, идентификатора эпохи, называется "финальным выпуском".
ta: ஒரு வெளியீட்டு பிரிவு மற்றும் விருப்பமாக ஒரு சகாப்த அடையாளங்காட்டியைக் கொண்ட ஒரு பதிப்பு அடையாளங்காட்டி "இறுதி வெளியீடு" என்று அழைக்கப்படுகிறது.

source: The release segment consists of one or more non-negative integer values, separated by dots::
eo: La eldona segmento konsistas el unu aŭ pluraj nenegativaj entjeraj valoroj, apartigitaj per punktoj::
ja: ひとつかそれ以上の非負整数をピリオドで区切って構成されるリリース部分::
ru: Сегмент освобождения состоит из одного или нескольких неотрицательных целых значений, разделенных точками::
ta: வெளியீட்டு பிரிவு ஒன்று அல்லது அதற்கு மேற்பட்ட எதிர்மறை அல்லாத முழு எண் மதிப்புகளைக் கொண்டுள்ளது, இது புள்ளிகளால் பிரிக்கப்படுகிறது ::

source: Final releases within a project MUST be numbered in a consistently increasing fashion, otherwise automated tools will not be able to upgrade them correctly.
eo: Finaj eldonoj por iu projekto DEVAS esti numeritaj alkremente. Alie, aŭtomata ilo ne povus ĝisdatigi versiojn ĝuste.
ja: あるプロジェクトの最終リリースは、首尾一貫して増加する形で番号付けされなければならず、そうでなければ自動化ツール <Automated tools> がそれらを正しくアップグレードすることができないでしょう。
ru: Финальные релизы в рамках проекта ДОЛЖНЫ иметь последовательно возрастающую нумерацию, иначе автоматизированные инструменты не смогут правильно их обновить.
ta: ஒரு திட்டத்திற்குள் இறுதி வெளியீடுகள் தொடர்ந்து அதிகரித்து வரும் பாணியில் எண்ணப்பட வேண்டும், இல்லையெனில் தானியங்கி கருவிகள் அவற்றை சரியாக மேம்படுத்த முடியாது.

source: Comparison and ordering of release segments considers the numeric value of each component of the release segment in turn. When comparing release segments with different numbers of components, the shorter segment is padded out with additional zeros as necessary.
eo: Komparado kaj ordigado de eldonsegmentoj uzas la nombran valoron de ĉiu komponanto de la eldonsegmento. Dum komparado de eldonsegmentoj kun malsamaj nombroj da komponantoj, la pli mallonga segmento plilongiĝas per nuloj por egallongeco.
ja: リリース部分の比較と整序は、リリース部分の各部分の数としての値を順に比較します。リリース部分の構成要素の数が異なるものを比較するときは、必要に応じて短い方にゼロの部分を追加する形で補足します。
ru: При сравнении и упорядочивании сегментов релиза учитывается числовое значение каждого компонента сегмента релиза по очереди. При сравнении сегментов выпуска с разным количеством компонентов более короткий сегмент при необходимости дополняется нулями.
ta: வெளியீட்டுப் பிரிவுகளின் ஒப்பீடு மற்றும் வரிசைப்படுத்தல் வெளியீட்டு பிரிவின் ஒவ்வொரு கூறுகளின் எண் மதிப்பையும் கருதுகிறது. வெளியீட்டு பிரிவுகளை வெவ்வேறு எண்ணிக்கையிலான கூறுகளுடன் ஒப்பிடும்போது, குறுகிய பிரிவு தேவையான கூடுதல் பூச்சியங்களுடன் திணிக்கப்படுகிறது.

source: While any number of additional components after the first are permitted under this scheme, the most common variants are to use two components ("major.minor") or three components ("major.minor.micro").
eo: Dum la skemo permesas ajnan nombron da komponantoj post la unua, plej ofte oni uzas du komponantojn («maĵora.minora») aŭ tri («maĵora.minora.mikroa»).
ja: この枠組みの下では、最初の構成部分の後にいくつの追加部分があっても構いませんが、最も一般的な変種は、構成部分２個 ("メジャー.マイナー") のものか、または、構成部分３個 ("メジャー.マイナー.マイクロ") のものです。
ru: Хотя по этой схеме допускается любое количество дополнительных компонентов после первого, наиболее распространенными вариантами являются использование двух компонентов ("major.minor") или трех компонентов ("major.minor.micro").
ta: இந்த திட்டத்தின் கீழ் முதல் கூடுதல் கூறுகள் அனுமதிக்கப்பட்டாலும், மிகவும் பொதுவான வகைகள் இரண்டு கூறுகளை ("மேசர்.மினோர்") அல்லது மூன்று கூறுகளை ("மேசர்.மினோர்.மிக்ரோ") பயன்படுத்த வேண்டும்.

source: For example::
eo: Ekzemple::
ja: 例えば::
pt_br: Por exemplo::
ru: Например::
ta: உதாரணமாக ::

source: A release series is any set of final release numbers that start with a common prefix. For example, ``3.3.1``, ``3.3.5`` and ``3.3.9.45`` are all part of the ``3.3`` release series.
eo: Eldona serio estas aro de finaj eldonnumeroj komenciĝantaj per komuna prefikso. Ekzemple, ``3.3.1``, ``3.3.5`` kaj ``3.3.9.45`` estas partoj de la eldona serio ``3.3``.
ja: リリースシリーズとは、共通の前置部分で始まる任意の最終リリース番号の集合です。例えば、 ``3.3.1`` ・ ``3.3.5`` ・ ``3.3.9.45`` は、すべて、 ``3.3`` リリースシリーズの一部です。
ru: Серия релизов - это любой набор номеров финальных релизов, которые начинаются с общего префикса. Например, ``3.3.1``, ``3.3.5`` и ``3.3.9.45`` являются частью серии релизов ``3.3``.
ta: வெளியீட்டுத் தொடர் என்பது பொதுவான முன்னொட்டுடன் தொடங்கும் இறுதி வெளியீட்டு எண்களின் தொகுப்பாகும். எடுத்துக்காட்டாக, `` 3.3.1``, `` 3.3.5`` மற்றும் `` 3.3.9.45`` அனைத்தும் `` 3.3`` வெளியீட்டுத் தொடரின் ஒரு பகுதியாகும்.

source: ``X.Y`` and ``X.Y.0`` are not considered distinct release numbers, as the release segment comparison rules implicit expand the two component form to ``X.Y.0`` when comparing it to any release segment that includes three components.
eo: ``X.Y`` kaj ``X.Y.0`` ne distingiĝas kiel versiaj numeroj, ĉar la reguloj pri komparado de eldonsegmentoj implicite plilongigas la du-komponantan formon al ``X.Y.0`` por komparado al ajna eldonsegmento inkluzivanta tri komponantojn.
ja: リリース構成部分比較のルールでは、３個の構成部分を持つリリース番号と比較する時には、構成部分が２個のものを ``X.Y.0`` へ暗黙裡に拡張するので、 ``X.Y`` と ``X.Y.0`` は、相異なるリリース番号とは見做されません。
ru: ``X.Y`` и ``X.Y.0`` не считаются отдельными номерами релизов, поскольку правила сравнения сегментов релизов неявно расширяют двухкомпонентную форму до ``X.Y.0``, когда сравнивают ее с любым сегментом релиза, включающим три компонента.
ta: `` X.y`` மற்றும் `` x.y.0`` ஆகியவை தனித்துவமான வெளியீட்டு எண்களாகக் கருதப்படுவதில்லை, ஏனெனில் வெளியீட்டு பிரிவு ஒப்பீட்டு விதிகள் மறைமுகமாக இரண்டு கூறு படிவத்தை `` x.y.0`` என விரிவாக்குகின்றன.

source: Pre-releases
eo: Antaŭeldonoj
ja: プレリリース
ru: Предварительные выпуски
ta: முன் வெளியீடுகள்

source: Some projects use an "alpha, beta, release candidate" pre-release cycle to support testing by their users prior to a final release.
eo: Kelkaj projektoj uzas la antaŭeldonan ciklon «alfa, beta, eldonkandidato» por helpi testadon far uzantoj antaŭ fina eldonado.
ja: プロジェクトの中には、最終リリースに先立ってユーザによるテストを行えるように、 "alpha, beta, release candidate" のプレリリースサイクルを使うものがあります。
ru: Некоторые проекты используют цикл "альфа-версия, бета-версия, релиз-кандидат" для поддержки тестирования пользователями перед выпуском финального релиза.
ta: சில திட்டங்கள் "ஆல்பா, பீட்டா, வெளியீட்டு வேட்பாளர்" முன் வெளியீட்டுக்கு முந்தைய சுழற்சியைப் பயன்படுத்துகின்றன.

source: If used as part of a project's development cycle, these pre-releases are indicated by including a pre-release segment in the version identifier::
eo: Se antaŭeldono estas parto de la evolua ciklo de projekto, ĝi indikiĝas per antaŭeldona segmento en la versia identigilo::
ja: プロジェクトの開発サイクルの一部として使用されるなら、これらのプレリリースは、バージョン識別子のプレリリース構成部分を含めることによって表示されます::
ru: Если эти предварительные версии используются как часть цикла разработки проекта, они обозначаются включением сегмента pre-release в идентификатор версии::
ta: திட்டத்தின் மேம்பாட்டு சுழற்சியின் ஒரு பகுதியாகப் பயன்படுத்தப்பட்டால், இந்த முன் வெளியீடுகள் பதிப்பு அடையாளங்காட்டியில் ஒரு முன் வெளியீட்டுப் பகுதியைச் சேர்ப்பதன் மூலம் குறிக்கப்படுகின்றன ::

source: A version identifier that consists solely of a release segment and a pre-release segment is termed a "pre-release".
eo: Versia identigilo konsistanta nur el eldona segmento kaj antaŭeldona segmento nomiĝas «antaŭeldono».
ja: リリース構成部分とプレリリース構成部分だけから構成されるバージョン識別子は、 "プレリリース <pre-release>" という用語で呼ばれます。
ru: Идентификатор версии, состоящий только из сегмента релиза и сегмента предрелиза, называется "предрелизом".
ta: வெளியீட்டு பிரிவு மற்றும் வெளியீட்டுக்கு முந்தைய பிரிவு ஆகியவற்றைக் கொண்ட ஒரு பதிப்பு அடையாளங்காட்டி "வெளியீட்டுக்கு முந்தைய" என்று அழைக்கப்படுகிறது.

source: The pre-release segment consists of an alphabetical identifier for the pre-release phase, along with a non-negative integer value. Pre-releases for a given release are ordered first by phase (alpha, beta, release candidate) and then by the numerical component within that phase.
ja: プレリリース構成部分は、非負整数を伴ったプレリリースの局面を示すアルファベット文字の識別子から構成されます。あるリリースにおけるプレリリース群は、まず局面 (alpha, beta, release candidate) で順序付けられ、次いでその局面内の数字の部分で順序づけられます。
ru: Сегмент предрелиза состоит из алфавитного идентификатора фазы предрелиза и неотрицательного целочисленного значения. Предварительные выпуски для данного выпуска упорядочиваются сначала по фазе (альфа, бета, кандидат на выпуск), а затем по числовому компоненту в рамках этой фазы.
ta: வெளியீட்டுக்கு முந்தைய பிரிவு, வெளியீட்டுக்கு முந்தைய கட்டத்திற்கான அகரவரிசை அடையாளங்காட்டியைக் கொண்டுள்ளது, மேலும் எதிர்மறை அல்லாத முழு எண் மதிப்புடன். கொடுக்கப்பட்ட வெளியீட்டிற்கான முன் வெளியீடுகள் முதலில் கட்டம் (ஆல்பா, பீட்டா, வெளியீட்டு வேட்பாளர்) மற்றும் பின்னர் அந்த கட்டத்திற்குள் எண் கூறு மூலம் ஆர்டர் செய்யப்படுகின்றன.

source: Installation tools MAY accept both ``c`` and ``rc`` releases for a common release segment in order to handle some existing legacy distributions.
eo: Instalilo POVAS akcepti kaj ``c``- kaj ``rc``-eldonoj por la sama eldona segmento por kongrueco kun kelkaj ekzistantaj malnovaj distribuoj.
ja: インストールツール <Installation tools> は、既存のレガシーなディストリビューションのいくつかを取り扱うために、よくあるリリース構成部分に ``c`` と ``rc`` の両方を受け入れても構いません。
ru: Утилиты установки МОГУТ принимать выпуски ``c`` и ``rc`` для общего сегмента выпуска, чтобы работать с некоторыми существующими устаревшими дистрибутивами.
ta: தற்போதுள்ள சில மரபு விநியோகங்களைக் கையாள்வதற்காக பொதுவான வெளியீட்டு பிரிவுக்கான `` சி`` மற்றும் `` rc`` வெளியீடுகளை நிறுவல் கருவிகள் ஏற்றுக்கொள்ளலாம்.

source: Installation tools SHOULD interpret ``c`` versions as being equivalent to ``rc`` versions (that is, ``c1`` indicates the same version as ``rc1``).
eo: Instalilo INTERPRETU ``c``-versiojn kiel ekvivalentojn de ``rc``-versioj (alivorte, ``c1`` indikas la saman version kiel ``rc1``).
ja: インストールツール <Installation tools> は、``c`` バージョンを ``rc`` バージョンと同じである (つまり、 ``c1`` が ``rc1`` と同じバージョンである) と解釈するべきです。
ru: Утилиты установки ДОЛЖНЫ интерпретировать версии ``c`` как эквивалентные версиям ``rc`` (то есть, ``c1`` означает ту же версию, что и ``rc1``).
ta: நிறுவல் கருவிகள் `` சி`` பதிப்புகள் `` rc`` பதிப்புகளுக்கு சமமானவை என்று விளக்க வேண்டும் (அதாவது, `` சி 1`` அதே பதிப்பைக் குறிக்கிறது `` rc1``).

source: Build tools, publication tools and index servers SHOULD disallow the creation of both ``rc`` and ``c`` releases for a common release segment.
eo: Konstruilo, eldonilo kaj indeksoservilo MALPERMESU la kreadon de kaj ``rc``- kaj ``c``-eldonoj por la sama eldona segmento.
ja: ビルドツール <Build tools> ・出版ツール <Publication tools> 、そして インデックスサーバ <Index servers> は、共通のリリース構成部分に ``rc`` と ``c`` の両方のリリースを作ることを禁止するべきです。
ru: Средства сборки, средства публикации и индексные серверы ДОЛЖНЫ запрещать создание релизов ``rc`` и ``c`` для общего сегмента релиза.
ta: ஒரு பொதுவான வெளியீட்டு பிரிவுக்கு `` rc`` மற்றும் `C`` இரண்டையும் உருவாக்க கருவிகள், வெளியீட்டு கருவிகள் மற்றும் குறியீட்டு சேவையகங்களை உருவாக்க அனுமதிக்க வேண்டும்.

source: Post-releases
eo: Posteldonoj
ja: ポストリリース
ru: Пост-релизы
ta: பிந்தைய வெளியீடுகள்

source: Some projects use post-releases to address minor errors in a final release that do not affect the distributed software (for example, correcting an error in the release notes).
eo: Kelkaj projektoj uzas posteldonon por korekti negravajn erarojn en fina eldono ne efikantajn sur la distribuita programo (ekzemple, por korekti eraron en la eldonaj notoj).
ja: プロジェクトの中には、最終リリースにおける軽微なエラーで配布されているソフトウェアには影響を与えないもの (例えば、リリースノートの誤りを訂正する) を修正するためにポストリリースを使うものがあります。
ru: Некоторые проекты используют пост-релизы для устранения мелких ошибок в финальном релизе, которые не влияют на распространяемое ПО (например, исправление ошибки в примечаниях к релизу).
ta: சில திட்டங்கள் விநியோகிக்கப்பட்ட மென்பொருளை பாதிக்காத இறுதி வெளியீட்டில் சிறிய பிழைகளை நிவர்த்தி செய்ய பிந்தைய வெளியீடுகளைப் பயன்படுத்துகின்றன (எடுத்துக்காட்டாக, வெளியீட்டுக் குறிப்புகளில் பிழையை சரிசெய்தல்).
