Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If you want to download packages from a different index than the :term:`Python Package Index (PyPI)`, you can use the ``--index-url`` flag:
eo: Por elŝuti el indekso alia ol :term:`PyPI <Python Package Index (PyPI)>`, uzu la flagon ``--index-url``:
ja: :term:`Python パッケージインデックス <Python Package Index (PyPI)>` 以外のところからパッケージをダウンロードしたいのであれば、 ``--index-url`` オプションでできます:
pt_br: Se você quiser baixar pacotes de um índice diferente do :term:`Python Package Index (PyPI)`, você pode usar o sinalizador ``--index-url``:
ru: Если вы хотите загрузить пакеты из индекса, отличного от индекса :term:`Python Package Index (PyPI)`, вы можете использовать флаг ``--index-url``:
ta: இதை விட வேறு குறியீட்டிலிருந்து தொகுப்புகளை பதிவிறக்கம் செய்ய விரும்பினால்: கால: `பைதான் தொகுப்பு குறியீட்டு (PYPI)`, நீங்கள் `` --index-url`` கொடியைப் பயன்படுத்தலாம்:

source: If you want to allow packages from both the :term:`Python Package Index (PyPI)` and a separate index, you can use the ``--extra-index-url`` flag instead:
eo: Se vi volas permesi pakojn el kaj :term:`PyPI <Python Package Index (PyPI)>` kaj aparta indekso, vi povas anstataŭe uzi la flagon ``--extra-index-url``:
ja: :term:`Python パッケージインデックス <Python Package Index (PyPI)>` と別のインデックスを同時に使いたいのであれば、 ``--extra-index-url`` オプションでできます:
pt_br: Se você deseja permitir pacotes do :term:`Python Package Index (PyPI)` e de um índice separado, você pode usar a sinalização ``--extra-index-url`` em seu lugar:
ru: Если вы хотите разрешить пакеты как из :term:`Python Package Index (PyPI)`, так и из отдельного индекса, вы можете использовать флаг ``--extra-index-url`` вместо этого:
ta: இரண்டிலிருந்தும் தொகுப்புகளை அனுமதிக்க விரும்பினால்: சொல்: `பைதான் தொகுப்பு குறியீட்டு (PYPI)` மற்றும் ஒரு தனி குறியீட்டை, அதற்கு பதிலாக `` --extra-index-url`` கொடியைப் பயன்படுத்தலாம்:

source: Upgrading packages
eo: Ĝisdatigi pakojn
ja: パッケージを更新する
pt_br: Atualizando pacotes
ru: Обновление пакетов
ta: தொகுப்புகளை மேம்படுத்துதல்

source: pip can upgrade packages in-place using the ``--upgrade`` flag. For example, to install the latest version of ``requests`` and all of its dependencies:
eo: pip povas ĝisdatigi pakon en loko uzante la flagon ``--upgrade``. Ekzemple, por instali la plej novan version de ``requests`` kaj ĉiuj ĝiaj dependaĵoj:
ja: pip に ``--upgrade`` オプションを与えるとパッケージの入れ替え更新ができます。例えば、 ``requests`` とその依存先パッケージの最新版をインストールしたいのなら:
pt_br: pip pode atualizar pacotes no local usando o sinalizador ``--upgrade``. Por exemplo, para instalar a versão mais recente de ``requests`` e todas as suas dependências:
ru: pip может обновлять пакеты на месте, используя флаг ``--upgrade``. Например, для установки последней версии ``requests`` и всех его зависимостей:
ta: பிஐபி `` --upgrade`` கொடியைப் பயன்படுத்தி தொகுப்புகளை மேம்படுத்தலாம். எடுத்துக்காட்டாக, `` கோரிக்கைகள்`` மற்றும் அதன் அனைத்து சார்புகளின் அண்மைக் கால பதிப்பையும் நிறுவ:

source: Using a requirements file
eo: Usi postulo-dosieron
ja: requirements ファイルを使う
pt_br: Usando um arquivo de requisitos
ru: Использование файла требований
ta: தேவைகள் கோப்பைப் பயன்படுத்துதல்

source: Instead of installing packages individually, pip allows you to declare all dependencies in a :ref:`Requirements File <pip:Requirements Files>`. For example you could create a :file:`requirements.txt` file containing:
eo: Anstataŭ instalado de pakoj unuope, pip ebligas deklaradon de ĉiuj dependecoj en :ref:`Postulo-Dosiero <pip:Requirements Files>`. Ekzemple oni povas krei :file:`requirements.txt` enhavantan la jenon:
ja: パッケージをひとつひとつインストールする代わりに、pip では :ref:`Requirements ファイル <pip:Requirements Files>` にすべての依存先パッケージを列挙しておくことができます。例えば、 :file:`requirements.txt` を下記を含むように作成しておいて:
pt_br: Em vez de instalar pacotes individualmente, pip permite que você declare todas as dependências em um :ref:`Arquivo de Requisitos <pip:Requirements Files>`. Por exemplo, você pode criar um arquivo :file:`requirements.txt` contendo:
ru: Вместо того чтобы устанавливать пакеты по отдельности, pip позволяет объявить все зависимости в :ref:`Requirements File <pip:Requirements Files>`. Например, вы можете создать файл :file:`requirements.txt`, содержащий:
ta: தொகுப்புகளை தனித்தனியாக நிறுவுவதற்கு பதிலாக, அனைத்து சார்புகளையும் A: Ref: `தேவைகள் கோப்பு <PIP: தேவைகள் கோப்புகள்>` இல் அறிவிக்க PIP உங்களை அனுமதிக்கிறது. எடுத்துக்காட்டாக, நீங்கள் ஒரு: கோப்பு: `தேவைகள். TXT` கோப்பு:

source: And tell pip to install all of the packages in this file using the ``-r`` flag:
eo: Kaj igi pip instali ĉiujn pakojn en ĉi tiu dosiero per la flago ``-r``:
ja: このファイルに書いてあるパッケージを全てインストールするようにと、 ``-r`` オプションを与えることで pip に指示します:
pt_br: E diga ao pip para instalar todos os pacotes neste arquivo usando o sinalizador ``-r``:
ru: И укажите pip установить все пакеты из этого файла, используя флаг ``-r``:
ta: `` -R`` கொடியைப் பயன்படுத்தி இந்த கோப்பில் உள்ள அனைத்து தொகுப்புகளையும் நிறுவ பைப்பிடம் சொல்லுங்கள்:

source: Freezing dependencies
eo: Frostigi dependecojn
ja: 依存関係を凍結する
pt_br: Congelando dependências
ru: Заморозка зависимостей
ta: உறைபனி சார்புகள்

source: Pip can export a list of all installed packages and their versions using the ``freeze`` command:
eo: Pip povas eksporti liston de ĉiuj instalitaj pakoj kaj iliaj versioj per la komando ``freeze``:
ja: Pip では、 ``freeze`` コマンドを使うことで、インストール済みの全パッケージのバージョン付きのリストを取り出すことができます:
pt_br: Pip pode exportar uma lista de todos os pacotes instalados e suas versões usando o comando ``freeze``:
ru: Pip может экспортировать список всех установленных пакетов и их версий с помощью команды ``freeze``:
ta: `` ஃப்ரீச்`` கட்டளையைப் பயன்படுத்தி நிறுவப்பட்ட அனைத்து தொகுப்புகளின் பட்டியலையும் அவற்றின் பதிப்புகளையும் பிஐபி ஏற்றுமதி செய்யலாம்:

source: Which will output a list of package specifiers such as:
eo: Tio eligos liston de pako-specifiloj jene:
ja: それは、次に挙げるようなパッケージ指定子のリストを出力します:
pt_br: O que resultará em uma lista de especificadores de pacote, como:
ru: Что выведет список спецификаторов пакетов, например:
ta: இது போன்ற தொகுப்பு குறிப்பான்களின் பட்டியலை வெளியிடும்:

source: The ``pip freeze`` command is useful for creating :ref:`pip:Requirements Files` that can re-create the exact versions of all packages installed in an environment.
eo: La komando ``pip freeze`` utilas por krei :ref:`Postulo-Dosieron <pip:Requirements Files>` kiu povas rekrei la ekzaktajn versiojn de ĉiuj pakoj instalitaj en iu medio.
ja: ``pip freeze`` コマンドは、環境内にインストール済みのすべてのパッケージの正確なバージョンを再生成することができる :ref:`pip:Requirements Files` を作成するのに便利に使えます。
pt_br: O comando ``pip freeze`` útil para criar :ref:`pip:Requirements Files` que podem recriar as versões exatas de todos os pacotes instalados em um ambiente.
ru: Команда ``pip freeze`` полезна для создания :ref:`pip:Requirements Files``, которые могут воссоздать точные версии всех пакетов, установленных в окружении.
ta: `` பிஐபி ஃப்ரீச்`` கட்டளை உருவாக்க பயனுள்ளதாக இருக்கும்: குறிப்பு: `பிஐபி: தேவைகள் கோப்புகள்` இது சூழலில் நிறுவப்பட்ட அனைத்து தொகுப்புகளின் சரியான பதிப்புகளை மீண்டும் உருவாக்க முடியும்.

source: Installing packages using virtualenv
eo: Instali pakojn per virtualenv
ja: virtualenv を使ってパッケージをインストールする
pt_br: Instalando pacotes usando virtualenv
ru: Установка пакетов с помощью virtualenv
ta: மெய்நிகர் ஈன்வி பயன்படுத்தி தொகுப்புகளை நிறுவுதல்

source: This guide discusses how to install packages using :ref:`pip` and :ref:`virtualenv`, a tool to create isolated Python environments.
eo: Jen gvidilo pri kiel instali pakojn per :ref:`pip` kaj :ref:`virtualenv`, kiu estas ilo por krei izolitajn Python-mediojn.
ja: このガイド文書では、:ref:`pip` と隔離された Python 環境を作成するツールであるところの :ref:`virtualenv` を使ってパッケージをインストールする方法について議論します。
pt_br: Este guia discute como instalar pacotes usando :ref:`pip` e :ref:`virtualenv`, uma ferramenta para criar ambientes Python isolados.
ru: В этом руководстве рассказывается о том, как устанавливать пакеты с помощью :ref:`pip` и :ref:`virtualenv`, инструмента для создания изолированных окружений Python.
ta: இந்த வழிகாட்டி பயன்படுத்தி தொகுப்புகளை எவ்வாறு நிறுவுவது என்பதை விவாதிக்கிறது: ref: `PIP` மற்றும்: Ref:` Virtualenv`, தனிமைப்படுத்தப்பட்ட பைதான் சூழல்களை உருவாக்குவதற்கான ஒரு கருவி.

source: This "how to" guide on installing packages and using :ref:`virtualenv` is under development. Please refer to the :ref:`virtualenv` documentation for details on installation and usage.
eo: Ĉi tiu gvidilo pri instalado de pakoj kaj uzado de :ref:`virtualenv` estas ankoraŭ verkata. Bonvolu vidi la dokumentaro de :ref:`virtualenv` por detaloj pri instalado kaj uzado.
ja: パッケージをインストールすることと :ref:`virtualenv` を使うことに関するこの "how to" ガイドは、作成途中です。:ref:`virtualenv` の説明文書にインストール方法や使い方について詳しく出ていますので、そちらもご覧ください。
pt_br: Este guia sobre como instalar pacotes e usar :ref:`virtualenv` está em desenvolvimento. Consulte a documentação do :ref:`virtualenv` para detalhes sobre instalação e uso.
ru: Это руководство по установке пакетов и использованию :ref:`virtualenv` находится в стадии разработки. Пожалуйста, обратитесь к документации по :ref:`virtualenv` для получения подробной информации об установке и использовании.
ta: தொகுப்புகளை நிறுவுவதற்கும் பயன்படுத்துவதற்கும் இந்த "எப்படி" வழிகாட்டுதல்: குறிப்பு: `மெய்நிகர்என்வ்` வளர்ச்சியில் உள்ளது. நிறுவல் மற்றும் பயன்பாடு குறித்த விவரங்களுக்கு: ref: `மெய்நிகர்என்வ்` ஆவணங்களை தயவுசெய்து பார்க்கவும்.

source: This doc uses the term **package** to refer to a :term:`Distribution Package` which is different from an :term:`Import Package` that which is used to import modules in your Python source code.
eo: Ĉi tiu dokumento uzas la terminon **pako** por signifi :term:`Distribuan Pakon <Distribution Package>`, kiu diferencas de :term:`Importa Pako <Import Package>` uzata por importi modulon al via Python-fontkodo.
ja: この文書では **パッケージ** という用語を :term:`配布パッケージ <Distribution Package>` の意味で使いますが、これは Python ソースコードでモジュールをインポートするという意味で使われる :term:`パッケージインポート <Import Package>` とは異なります。
pt_br: Este documento usa o termo **pacote** para se referir a um :term:`Pacote de Distribuição` que é diferente de um :term:`Pacote de Importação` que é usado para importar módulos em seu código-fonte do Python.
ru: В этом документе термин **пакет** используется для обозначения :term:`Distribution Package`, который отличается от :term:`Import Package`, который используется для импорта модулей в исходный код Python.
ta: இந்த ஆவணம் ** தொகுப்பு ** என்ற வார்த்தையைப் பயன்படுத்துகிறது: கால: `விநியோக தொகுப்பு` இது ஒரு: கால:` இறக்குமதி தொகுப்பு` உங்கள் பைதான் மூலக் குறியீட்டில் தொகுதிகளை இறக்குமதி செய்யப் பயன்படுகிறது.

source: Licensing examples and user scenarios
eo: Ekzemploj de licencoj kaj uzkazoj
ja: ライセンシングの例とユーザシナリオ
ru: Примеры лицензирования и пользовательские сценарии
ta: உரிமம் அளிக்கும் எடுத்துக்காட்டுகள் மற்றும் பயனர் காட்சிகள்

source: Licensing Examples
eo: Ekzemploj de Licencoj
ja: ライセンシングの例
ru: Примеры лицензирования
ta: உரிம எடுத்துக்காட்டுகள்

source: Basic example
eo: Baza ekzemplo
ja: 基本的な例
ru: Базовый пример
ta: அடிப்படை எடுத்துக்காட்டு

source: The Setuptools project itself, as of `version 75.6.0 <setuptools7560_>`__, does not use the ``License`` field in its own project source metadata. Further, it no longer explicitly specifies ``license_file``/``license_files`` as it did previously, since Setuptools relies on its own automatic inclusion of license-related files matching common patterns, such as the :file:`LICENSE` file it uses.
eo: La projekto Setuptools mem, je `versio 75.6.0 <setuptools7560_>`__, ne uzas la kampon ``License`` en siaj propraj projektaj fontaj metadatenoj. Ĝi ankaŭ ne plu eksplicas ``license_file``/``license_files`` malkiel antaŭe, ĉar ĝi uzas sian propran aŭtomatan inkluzivon de licenco-rilataj dosieroj, kies dosiernomoj estas kutimaj, ekzemple :file:`LICENSE`.
ja: Setuptools プロジェクトそれ自体は、 `version 75.6.0 <setuptools7560_>`__ 時点で、自身のプロジェクトソースコードのメタデータ内の ``License`` フィールドを使っていません。さらに、共通のパターンにマッチさせることで現在使用している :file:`LICENSE` のようなライセンスに関係するファイル群を自動的に含める自身の仕組みに立脚しているので、以前にはそうしていましたがもはや ``license_file`` / ``license_files`` を明示的に指定することもしていません。
ru: Сам проект Setuptools, начиная с `версии 75.6.0 <setuptools7560_>`__, не использует поле ``Лицензия`` в собственных метаданных источника проекта. Кроме того, он больше не указывает явно ``license_file``/ ``license_files``, как это было раньше, поскольку Setuptools полагается на собственное автоматическое включение файлов, связанных с лицензией, соответствующих общим шаблонам, таким как файл :file:`LICENSE``, который он использует.
ta: `பதிப்பு 75.6.0 <etuptools7560_> __ __, அதன் சொந்த திட்ட மூல மெட்டாடேட்டாவில்` `உரிமம்`` புலத்தைப் பயன்படுத்தாது. மேலும், இது முன்னர் செய்ததைப் போலவே `` உரிமம்_பீல்``/`உரிமம்_பில்கள்`` ஐ இனி வெளிப்படையாகக் குறிப்பிடவில்லை, ஏனெனில் செடுப்டூல்ச் அதன் சொந்த உரிமம் தொடர்பான கோப்புகளை தானாகவே சேர்ப்பதை நம்பியுள்ளது:` உரிமம்` கோப்பு போன்ற பொதுவான வடிவங்களுடன் பொருந்துகிறது இது பயன்படுத்துகிறது.

source: It includes the following license-related metadata in its :file:`pyproject.toml`:
eo: Ĝi inkluzivas la jenajn licencajn metadatenojn en :file:`pyproject.toml`:
ja: 以下のようなライセンスに関連するメタデータを :file:`pyproject.toml` の中に含みます:
ru: Он включает следующие связанные с лицензией метаданные в свой :file:`pyproject.toml`:
ta: இது அதன் பின்வரும் உரிமம் தொடர்பான மெட்டாடேட்டாவை உள்ளடக்கியது: கோப்பு: `pyproject.toml`:

source: The simplest migration to PEP 639 would consist of using this instead:
eo: La plej simpla migrado al PEP 639 uzos jenon anstataŭe:
ja: PEP 639 への最も単純な移行は、代わりにこれを使うことから構成されます:
ru: Самый простой переход на PEP 639 будет заключаться в использовании этого варианта:
ta: PEP 639 க்கு எளிமையான இடம்பெயர்வு இதற்கு பதிலாக இதைப் பயன்படுத்துவதைக் கொண்டிருக்கும்:

source: Or, if the project used :file:`setup.cfg`, in its ``[metadata]`` table:
eo: Aŭ, se la projekto uzis :file:`setup.cfg` en sia tabelo ``[metadata]``:
ja: あるいは、プロジェクトで :file:`setup.cfg` を使っているなら、その中の ``[metadata]`` テーブルで:
ru: Или, если проект использовал :file:`setup.cfg`, в его таблице ``[metadata]``:
ta: அல்லது, திட்டம் பயன்படுத்தப்பட்டால்: கோப்பு: `setup.cfg`, அதன்` `[மெட்டாடேட்டா]` `அட்டவணை:

source: The output Core Metadata for the distribution packages would then be:
eo: La eligitaj Kernaj Metdatenoj por la distribuaj pakoj estos jenaj:
ja: 配布物パッケージのためのコアとなるメタデータの出力はこんなふうになるでしょう:
ru: Выходные метаданные Core Metadata для дистрибутивных пакетов будут такими:
ta: விநியோக தொகுப்புகளுக்கான வெளியீட்டு கோர் மேனிலை தரவு பின்னர்:

source: The :file:`LICENSE` file would be stored at :file:`/setuptools-{VERSION}/LICENSE` in the sdist and :file:`/setuptools-{VERSION}.dist-info/licenses/LICENSE` in the wheel, and unpacked from there into the site directory (e.g. :file:`site-packages/`) on installation; :file:`/` is the root of the respective archive and ``{VERSION}`` the version of the Setuptools release in the Core Metadata.
eo: La dosiero :file:`LICENSE` troviĝus en :file:`/setuptools-{VERSIO}/LICENSE` en la fonta distribuo kaj :file:`/setuptools-{VERSIO}.dist-info/licenses/LICENSE` en la wheel, kaj malpakiĝus de tie al la dosierujo de la instalaĵo (ekz. :file:`site-packages/`) dum instalado; :file:`/` estas la radiko de la arĥivo, kaj ``{VERSIO}`` la versio de la eldono de Setuptools laŭ Kernaj Metadatenoj.
ja: :file:`LICENSE` ファイルは、 sdist 内なら :file:`/setuptools-{VERSION}/LICENSE` に、 wheel 内なら :file:`/setuptools-{VERSION}.dist-info/licenses/LICENSE` に、そこから展開されるとインストール先のサイトディレクトリ (例えば :file:`site-packages/`) に置かれることでしょう; ここで :file:`/` はそれぞれのアーカイブのルートディレクトリであり、 ``{VERSION}`` はコアとなるメタデータ内の Setuptools のリリースのバージョンです。
ru: Файл :file:`LICENSE` будет храниться по адресу :file:`/setuptools-{VERSION}/LICENSE` в sdist и :file:`/setuptools-{VERSION}.dist-info/licenses/LICENSE` в wheel, и распаковываться оттуда в каталог сайта (например, :file:`site-packages/`) при установке; :file:/` - корень соответствующего архива, а ``{VERSION}`` - версия выпуска Setuptools. например, :file:`site-packages/`) при установке; :file:`/` - корень соответствующего архива, а ``{VERSION}`` - версия релиза Setuptools в метаданных ядра.
ta: The: கோப்பு: `உரிமம்` கோப்பு இங்கே சேமிக்கப்படும்: கோப்பு:`/setuptools- {VERSION}/உரிமம்` SDIST இல் மற்றும்: கோப்பு: `/setuptools- {VERSION} .dist-info/உரிமங்கள்/உரிமம்` இல் சக்கரம், மற்றும் அங்கிருந்து தள கோப்பகத்தில் (எ.கா.: கோப்பு: `தள-பேக்கேச்கள்/`) நிறுவலில் திறக்கப்படவில்லை; .

source: Advanced example
eo: Altnivela ekzemplo
ja: 先進的な例
ru: Расширенный пример
ta: மேம்பட்ட எடுத்துக்காட்டு

source: Suppose Setuptools were to include the licenses of the third-party projects that are vendored in the :file:`setuptools/_vendor/` and :file:`pkg_resources/_vendor/` directories; specifically:
eo: Supozu, ke Setuptools inkluzivus la licencojn de la triapartiaj projektoj en la dosierujoj :file:`setuptools/_vendor/` kaj :file:`pkg_resources/_vendor/`; specife:
ja: 仮に Setuptools が、 :file:`setuptools/_vendor/` と :file:`pkg_resources/_vendor/` のディレクトリ内に第三者のプロジェクトのライセンスを包含していたとしましょう; 特にこの場合は:
ru: Предположим, что Setuptools должна включить лицензии сторонних проектов, которые хранятся в каталогах :file:`setuptools/_vendor/` и :file:`pkg_resources/_vendor/`; а именно:
ta: செடிப்டூல்ச் மூன்றாம் தரப்பு திட்டங்களின் உரிமங்களை உள்ளடக்கியது என்று வைத்துக்கொள்வோம்: கோப்பு: `setuptools/_vendor/` மற்றும்: கோப்பு: `pkg_resources/_vendor/` கோப்பகங்கள்; குறிப்பாக:

source: The license expressions for these projects are:
eo: Jen la licenco-esprimoj por tiuj projektoj:
ja: これらのプロジェクトに対するライセンス条項は:
ru: Лицензионные выражения для этих проектов следующие:
ta: இந்த திட்டங்களுக்கான உரிம வெளிப்பாடுகள்:

source: A comprehensive license expression covering both Setuptools proper and its vendored dependencies would contain these metadata, combining all the license expressions into one. Such an expression might be:
eo: Ampleksa licenco-esprimo pri kaj Setuptools mem kaj la inkluzivitaj dependaĵoj enhavus tiujn metadatenojn, kombinante ĉiujn licenco-esprimojn. Tia esprimo povas esti jena:
ja: Setuptools 純正のものとベンダーが取り込んだものの両方をカバーするこみいったライセンス条項をすべてひとつにまとめて、これらのメタデータを包含することになるでしょう。そのような条項はこんなものになるでしょう:
ru: Всеобъемлющее выражение лицензии, охватывающее как собственно Setuptools, так и его вендовые зависимости, будет содержать эти метаданные, объединяя все выражения лицензии в одно. Такое выражение может быть следующим:
ta: செட்ப்டூல்கள் இரண்டையும் உள்ளடக்கிய ஒரு விரிவான உரிம வெளிப்பாடு மற்றும் அதன் விற்பனையான சார்புநிலைகள் இந்த மெட்டாடேட்டாவைக் கொண்டிருக்கும், இது அனைத்து உரிம வெளிப்பாடுகளையும் ஒன்றாக இணைக்கிறது. அத்தகைய வெளிப்பாடு இருக்கலாம்:

source: In addition, per the requirements of the licenses, the relevant license files must be included in the package. Suppose the :file:`LICENSE` file contains the text of the MIT license and the copyrights used by Setuptools, ``pyparsing``, ``more_itertools`` and ``ordered-set``; and the :file:`LICENSE*` files in the :file:`setuptools/_vendor/packaging/` directory contain the Apache 2.0 and 2-clause BSD license text, and the Packaging copyright statement and `license choice notice <packaginglicense_>`__.
ja: 加えて、ライセンスの要求事項次第で、パッケージ内に適切なライセンスファイルが含まれていなければなりません。 :file:`LICENSE` ファイルには Setuptools や ``pyparsing`` や ``more_itertools`` や ``ordered-set`` が使用する MIT ライセンスとコピーライトが含まれているものと思ってください; そして、:file:`setuptools/_vendor/packaging/` ディレクトリの :file:`LICENSE*` ファイル群には Apache 2.0 と 2 項の BSD ライセンスの文言があり、Packaging コピーライト文言や `ライセンス選択通知 <packaginglicense_>`__ があるものと思ってください。
ru: Кроме того, согласно требованиям лицензий, в пакет должны быть включены соответствующие файлы лицензий. Допустим, файл :file:`LICENSE` содержит текст лицензии MIT и авторские права, используемые Setuptools, ``pyparsing``, ``more_itertools`` и ``ordered-set``; а файлы :file:`LICENSE*` в каталоге :file:`setuptools/_vendor/packaging/` содержат текст лицензии Apache 2.0 и 2 пункта лицензии BSD, а также заявление об авторских правах Packaging и уведомление о выборе лицензии <packaginglicense_>`__.
ta: கூடுதலாக, உரிமங்களின் தேவைகளின்படி, தொடர்புடைய உரிமக் கோப்புகள் தொகுப்பில் சேர்க்கப்பட வேண்டும். : கோப்பு: `உரிமம்` கோப்பில் எம்ஐடி உரிமத்தின் உரை மற்றும் செடுப்டூல்ச் பயன்படுத்தும் பதிப்புரிமை,` `பைபார்சிங்``,` `மோர்_ஐடெர்டூல்ச்`` மற்றும்` `ஆர்டர் செய்யப்பட்ட-செட்`; மற்றும் கோப்பு: `உரிமம்*` கோப்புகள்: கோப்பில்: `setuptools/_vendor/பேக்கேசிங்/` கோப்பகத்தில் அப்பாச்சி 2.0 மற்றும் 2-உட்பிரிவு பி.எச்.டி உரிம உரை உள்ளது, மற்றும் பேக்கேசிங் பதிப்புரிமை அறிக்கை மற்றும் `உரிமம் தேர்வு அறிவிப்பு <பேக்கேசிங் லிசன்ச்_>` __.

source: Specifically, we assume the license files are located at the following paths in the project source tree (relative to the project root and :file:`pyproject.toml`):
eo: Specife, ni supozas, ke la licenco-dosieroj troviĝas en la jenaj lokoj en la projekta fontarbo (relative al la projekta radiko kaj :file:`pyproject.toml`):
ja: 明確にいうと、ライセンスファイル群はプロジェクトソースコードツリー内の以下の (プロジェクトルートと :file:`pyproject.toml` からの相対) パスに位置するものと仮定しています:
ru: В частности, мы предполагаем, что файлы лицензий расположены по следующим путям в дереве исходных текстов проекта (относительно корня проекта и :file:`pyproject.toml`):
ta: குறிப்பாக, உரிமக் கோப்புகள் திட்ட மூல மரத்தில் பின்வரும் பாதைகளில் அமைந்துள்ளன என்று கருதுகிறோம் (திட்ட மூலத்துடன் தொடர்புடையது: கோப்பு: `pyproject.toml`):

source: Putting it all together, our :file:`pyproject.toml` would be:
eo: Resume, la dosiero :file:`pyproject.toml` estos jena:
ja: これらをすべて一緒にすると、 :file:`pyproject.toml` はこんなふうになるでしょう:
ru: Если собрать все это вместе, то наш :file:`pyproject.toml` будет иметь вид:
ta: அனைத்தையும் ஒன்றாக இணைத்து, எங்கள்: கோப்பு: `pyproject.toml` இருக்கும்:

source: Or alternatively, the license files can be specified explicitly (paths will be interpreted as glob patterns):
eo: Alternative, la licenco-dosiero povas esti specifita eksplicite (dosierloko interpretiĝas kiel patroneo):
ja: あるいは、別の方法としては、ライセンスファイル群を明示的に示すこともできます (パスはglobパターンとして解釈されるでしょう):
ru: Или же файлы лицензии можно указать явно (пути будут интерпретированы как glob-шаблоны):
ta: அல்லது மாற்றாக, உரிமக் கோப்புகளை வெளிப்படையாக குறிப்பிடலாம் (பாதைகள் குளோப் வடிவங்கள் என விளக்கப்படும்):

source: If our project used :file:`setup.cfg`, we could define this in :
eo: Se nia projekto uzus :file:`setup.cfg`, ni povus difini tion en:
ja: :file:`setup.cfg` をプロジェクトで使っているなら、こんなふうに定義することができます:
ru: Если бы наш проект использовал :file:`setup.cfg`, мы могли бы определить это в :
ta: எங்கள் திட்டம் பயன்படுத்தப்பட்டால்: கோப்பு: `setup.cfg`, இதை நாங்கள் வரையறுக்கலாம்:

source: With either approach, the output Core Metadata in the distribution would be:
eo: Per ambaŭ metodoj, la eligitaj Kernaj Metadatenoj en la distribuo estos jenaj:
ja: どちらのアプローチでも、配布物内のコアとなるメタデータの出力はこんな風になるでしょう:
ru: При любом из этих подходов выходные метаданные Core Metadata в дистрибутиве будут такими:
ta: எந்தவொரு அணுகுமுறையிலும், விநியோகத்தில் வெளியீட்டு கோர் மெட்டாடேட்டா:

source: In the resulting sdist, with :file:`/` as the root of the archive and ``{VERSION}`` the version of the Setuptools release specified in the Core Metadata, the license files would be located at the paths:
eo: En la rezulta fonta distribuo, kun :file:`/` kiel la radiko de la arĥivo kaj ``{VERSION}`` la versio de la eldono de Setuptools specifita en la Kernaj Metadatenoj, la licenco-dosieroj troviĝus ĉe:
ja: 結果として生成される sdist の中には、 :file:`/` をアーカイブのルートディレクトリとし、 ``{VERSION}`` をコアとなるメタデータの中で指定された Setuptools のバージョン番号として、ライセンスファイル群が次のようなパスに配置されるでしょう:
ru: В полученном sdist, с :file:`/` в качестве корня архива и ``{VERSION}`` версией выпуска Setuptools, указанной в Core Metadata, файлы лицензий будут расположены по путям:
ta: இதன் விளைவாக வரும் SDIST இல், உடன்: கோப்பு: `/` காப்பகத்தின் மூலமாகவும், `{{VERSION}` `கோர் மெட்டாடேட்டாவில் குறிப்பிடப்பட்டுள்ள செடிப்டூல்ச் வெளியீட்டின் பதிப்பாகவும், உரிமக் கோப்புகள் பாதைகளில் அமைந்திருக்கும்:
