Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Added a specification for the :file:`entry_points.txt` file. (:pr:`398`)
eo: Aldonis specifon pri la dosiero :file:`entry_points.txt`. (:pr:`398`)
ja: :file:`entry_points.txt` ファイルの仕様を追記した。 (:pr:`398`)
pt_br: Adicionada uma especificação para o arquivo :file:`entry_points.txt`. (:pr:`398`)
ru: Добавлена спецификация для файла :file:`entry_points.txt`. (:pr:`398`)
ta: இதற்கு ஒரு விவரக்குறிப்பைச் சேர்த்தது: கோப்பு: `entry_points.txt` கோப்பு. (: பி.ஆர்: `398`)

source: Created a new guide for managing packages using ``pip`` and ``virtualenv``. (:pr:`385`)
eo: Verkis novan gvidilon por administri pakojn per ``pip`` kaj ``virtualenv``. (:pr:`385`)
ja: ``pip`` や ``virtualenv`` を用いてパッケージを管理するためのガイドを新設した。 (:pr:`385`)
pt_br: Criado um novo guia para gerenciamento de pacotes usando ``pip`` e ``virtualenv``. (:pr:`385`)
ru: Создано новое руководство по управлению пакетами с помощью ``pip`` и ``virtualenv``. (:pr:`385`)
ta: `` பிப்`` மற்றும் `` மெய்நிகர்என்.வி`` ஐப் பயன்படுத்தி தொகுப்புகளை நிர்வகிப்பதற்கான புதிய வழிகாட்டியை உருவாக்கியது. (: பி.ஆர்: `385`)

source: Split the specifications page into multiple pages. (:pr:`386`)
eo: Disdividis la paĝon de specifoj en plurajn paĝojn. (:pr:`386`)
ja: 仕様のページを複数ページに分割した。 (:pr:`386`)
pt_br: Dividida a página de especificações em várias páginas. (:pr:`386`)
ru: Разделите страницу спецификаций на несколько страниц. (:pr:`386`)
ta: விவரக்குறிப்புகள் பக்கத்தை பல பக்கங்களாக பிரிக்கவும். (: பி.ஆர்: `386`)

source: September 2017
eo: Septembro 2017
ja: 2017年9月
pt_br: Setembro de 2017
ru: Сентябрь 2017
ta: செப்டம்பர் 2017

source: Encouraged using ``readme_renderer`` to validate :file:`README.rst`. (:pr:`379`)
eo: Instigis uzi ``readme_renderer`` por kontroli la validecon de :file:`README.rst`. (:pr:`379`)
ja: :file:`README.rst` を検証するために ``readme_renderer`` を使用することを推奨するようにした。 (:pr:`379`)
pt_br: Incentivado o uso de ``readme_renderer`` validar o :file:`README.rst`. (:pr:`379`)
ru: Рекомендовано использовать ``readme_renderer`` для проверки :file:`README.rst`. (:pr:`379`)
ta: சரிபார்க்க `` ReadMe_Renderer`` ஐப் பயன்படுத்தி ஊக்குவிக்கப்பட்டது: கோப்பு: `ReadMe.rst`. (: பி.ஆர்: `379`)

source: Recommended using the ``--user-base`` option. (:pr:`374`)
eo: Rekomendis uzi la opcion ``--user-base``. (:pr:`374`)
ja: ``--user-base`` オプションの使用を推奨するようにした。 (:pr:`374`)
pt_br: Recomendado o uso da opção ``--user-base``. (:pr:`374`)
ru: Рекомендуется использовать опцию ``--user-base``. (:pr:`374`)
ta: `` --User-base`` விருப்பத்தைப் பயன்படுத்தி பரிந்துரைக்கப்படுகிறது. (: பி.ஆர்: `374`)

source: August 2017
eo: Aŭgusto 2017
ja: 2017年8月
pt_br: Agosto de 2017
ru: Август 2017
ta: ஆகச்ட் 2017

source: Added a new, experimental tutorial on installing packages using ``Pipenv``. (:pr:`369`)
eo: Aldonis novan, eksperimentan lernilon pri instalado de pako per ``Pipenv``. (:pr:`369`)
ja: ``Pipenv`` を用いてパッケージをインストールする方法について新たに試験的なチュートリアルを追加した。 (:pr:`369`)
pt_br: Adicionado um novo tutorial experimental sobre a instalação de pacotes usando ``Pipenv``. (:pr:`369`)
ru: Добавлен новый, экспериментальный учебник по установке пакетов с помощью ``Pipenv``. (:pr:`369`)
ta: `` பைபென்வ்`` ஐப் பயன்படுத்தி தொகுப்புகளை நிறுவுவதில் புதிய, சோதனை டுடோரியலைச் சேர்த்தது. (: பி.ஆர்: `369`)

source: Added a new guide on how to use ``TestPyPI``. (:pr:`366`)
eo: Aldonis novan gvidilo pri la uzado de ``TestPyPI``. (:pr:`366`)
ja: ``TestPyPI`` を使う方法について新たにガイドを追加した。 (:pr:`366`)
pt_br: Adicionado um novo guia sobre como usar o ``TestPyPI``. (:pr:`366`)
ru: Добавлено новое руководство по использованию ``TestPyPI``. (:pr:`366`)
ta: `` TestPypi`` ஐ எவ்வாறு பயன்படுத்துவது என்பதற்கான புதிய வழிகாட்டியைச் சேர்த்தது. (: பி.ஆர்: `366`)

source: Added :file:`pypi.org` as a term. (:pr:`365`)
eo: Aldonis :file:`pypi.org` kiel terminon. (:pr:`365`)
ja: :file:`pypi.org` を用語として追加した。 (:pr:`365`)
pt_br: Adicionado :file:`pypi.org` como um termo. (:pr:`365`)
ru: Добавлен :file:`pypi.org` в качестве термина. (:pr:`365`)
ta: சேர்க்கப்பட்டது: கோப்பு: `pypi.org` ஒரு காலமாக. (: பி.ஆர்: `365`)

source: July 2017
eo: Julio 2017
ja: 2017年7月
pt_br: Julho de 2017
ru: Июль 2017
ta: சூலை 2017

source: Added ``flit`` to the key projects list. (:pr:`358`)
eo: Inkluzivis ``flit`` en la liston de ĉefprojektojn. (:pr:`358`)
ja: ``flit`` を鍵となるプロジェクト群のリストに追加した。 (:pr:`358`)
pt_br: Adicionado ``flit`` à lista de projetos principais. (:pr:`358`)
ru: Добавлен ``flit`` в список ключевых проектов. (:pr:`358`)
ta: முக்கிய திட்ட பட்டியலில் `` ஃபிளிட்`` சேர்க்கப்பட்டது. (: பி.ஆர்: `358`)

source: Added ``enscons`` to the list of key projects. (:pr:`357`)
eo: Inkluzivis ``enscons`` en la liston de ĉefprojektojn. (:pr:`357`)
ja: ``enscons `` を鍵となるプロジェクト群のリストに追加した。 (:pr:`357`)
pt_br: Adicionado ``enscons`` à lista de projetos principais. (:pr:`357`)
ru: В список ключевых проектов добавлен ``enscons``. (:pr:`357`)
ta: முக்கிய திட்டங்களின் பட்டியலில் `` என்கான்ச்`` சேர்க்கப்பட்டது. (: பி.ஆர்: `357`)

source: Updated this guide's ``readme`` with instructions on how to build the guide locally. (:pr:`356`)
eo: Ĝisdatigis la ``readme`` de ĉi tiu gvidilo per instrukcioj pri kiel konstrui la gvidilon loke. (:pr:`356`)
ja: 本ガイドの ``readme`` にローカル環境でこのガイドをビルドする方法を追加して更新した。 (:pr:`356`)
pt_br: Atualizado o ``readme`` deste guia com instruções sobre como construir o guia localmente. (:pr:`356`)
ru: Обновлено ``readme`` этого руководства с инструкциями о том, как собрать руководство локально. (:pr:`356`)
ta: வழிகாட்டியை உள்நாட்டில் எவ்வாறு உருவாக்குவது என்பதற்கான வழிமுறைகளுடன் இந்த வழிகாட்டியின் `` ரீட்மே`` புதுப்பிக்கப்பட்டது. (: பி.ஆர்: `356`)

source: Made the new ``TestPyPI`` URL more visible, adding note to homepage about pypi.org. (:pr:`354`)
eo: Reliefigis la novan retadreson ``TestPyPI``, aldonante noton pri pypi.org. (:pr:`354`)
ja: ホームページにpypi.org に関する注記を加えることで、新しい ``TestPyPI`` の URL がより目立つようにした。 (:pr:`354`)
pt_br: Melhorada a visibilidade da nova URL do ``TestPyPI``, adicionando uma nota à página inicial sobre pypi.org. (:pr:`354`)
ru: Сделали новый URL ``TestPyPI`` более заметным, добавив на главную страницу заметку о pypi.org. (:pr:`354`)
ta: புதிய `` டெச்ட்பை`` முகவரி ஐ மேலும் புலம்பும், pypi.org பற்றிய முகப்புப்பக்கத்தில் குறிப்பைச் சேர்த்தது. (: பி.ஆர்: `354`)

source: Added a note about the removal of the explicit registration API. (:pr:`347`)
eo: Aldonis noton pri la forigo de la API de eksplicita registrado. (:pr:`347`)
ja: 明示的な登録を行う API の削除について注記を追加した。 (:pr:`347`)
pt_br: Adicionada uma nota sobre a remoção da API de registro explícito. (:pr:`347`)
ru: Добавлено примечание об удалении API явной регистрации. (:pr:`347`)
ta: வெளிப்படையான பதிவு பநிஇ ஐ அகற்றுவது குறித்த குறிப்பைச் சேர்த்தது. (: பி.ஆர்: `347`)

source: June 2017
eo: Junio 2017
ja: 2017年6月
pt_br: Junho de 2017
ru: Июнь 2017
ta: சூன் 2017

source: Added a document on migrating uploads to :file:`PyPI.org`. (:pr:`339`)
eo: Aldonis dokumenton pri migrado de alŝutoj al :file:`PyPI.org`. (:pr:`339`)
ja: :file:`PyPI.org` へのアップロード方法の変更について説明を追加した。 (:pr:`339`)
pt_br: Adicionado um documento sobre a migração de envios para :file:`PyPI.org`. (:pr:`339`)
ru: Добавлен документ о переносе загрузок в :file:`PyPI.org`. (:pr:`339`)
ta: பதிவேற்றங்களை இடம்பெயர ஒரு ஆவணத்தைச் சேர்த்தது: கோப்பு: `pypi.org`. (: பி.ஆர்: `339`)

source: Added documentation for ``python_requires``. (:pr:`338`)
eo: Aldonis dokumentaron pri ``python_requires``. (:pr:`338`)
ja: ``python_requires`` について説明を追加した。 (:pr:`338`)
pt_br: Adicionada documentação para ``python_requires``. (:pr:`338`)
ru: Добавлена документация для ``python_requires``. (:pr:`338`)
ta: `` பைதான்_ரொக்வைர்ச்`` க்கான ஆவணங்களைச் சேர்த்தது. (: பி.ஆர்: `338`)

source: Added a note about PyPI migration in the *Tool Recommendations* tutorial. (:pr:`335`)
eo: Aldonis noton pri migrado de PyPI en la lernilo *Rekomendoj pri Iloj*. (:pr:`335`)
ja: *推奨されるツール* のチュートリアル内で PyPI の移転に関する注記を追加した。 (:pr:`335`)
pt_br: Adicionada uma nota sobre a migração do PyPI no tutorial *Recomendações de ferramentas*. (:pr:`335`)
ru: Добавлено примечание о миграции на PyPI в руководстве *Рекомендации инструментов*. (:pr:`335`)
ta: * கருவி பரிந்துரைகள் * டுடோரியலில் PYPI இடம்பெயர்வு பற்றிய குறிப்பைச் சேர்த்தது. (: பி.ஆர்: `335`)

source: Added a note that :file:`manifest.in` does not affect wheels. (:pr:`332`)
eo: Notis, ke :file:`manifest.in` ne rilatas al wheel. (:pr:`332`)
ja: :file:`manifest.in` が wheel には影響を与えないことを注記した。 (:pr:`332`)
pt_br: Adicionada uma nota de que o :file:`manifest.in` não afeta os wheels. (:pr:`332`)
ru: Добавлено примечание о том, что :file:`manifest.in` не влияет на колеса. (:pr:`332`)
ta: ஒரு குறிப்பைச் சேர்த்தது: கோப்பு: `manifest.in` சக்கரங்களை பாதிக்காது. (: பி.ஆர்: `332`)

source: Added a license section to the distributing guide. (:pr:`331`)
eo: Aldonis paragrafon pri licencoj al la gvidilo pri distribuado. (:pr:`331`)
ja: 配布ガイドにライセンスの節を追加した。 (:pr:`331`)
pt_br: Adicionada uma seção de licença ao guia de distribuição. (:pr:`331`)
ru: В руководство по распространению добавлен раздел о лицензии. (:pr:`331`)
ta: விநியோக வழிகாட்டியில் உரிமப் பிரிவைச் சேர்த்தது. (: பி.ஆர்: `331`)

source: Expanded the section on the ``name`` argument. (:pr:`329`)
eo: Pliigis la paragrafon pri la argumento ``name``. (:pr:`329`)
ja: ``name`` 引数に関する節を拡充した。 (:pr:`329`)
pt_br: Expandida a seção sobre o argumento ``name``. (:pr:`329`)
ru: Расширен раздел, посвященный аргументу ``имя``. (:pr:`329`)
ta: `` பெயர்`` வாதத்தில் உள்ள பகுதியை விரிவுபடுத்தியது. (: பி.ஆர்: `329`)

source: Adjusted the landing page. (:pr:`327`, :pr:`326`, :pr:`324`)
eo: Plibonigis la ĉefpaĝon. (:pr:`327`, :pr:`326`, :pr:`324`)
ja: ランディングページを調整した。 (:pr:`327`, :pr:`326`, :pr:`324`)
pt_br: Ajustada a página inicial. (:pr:`327`, :pr:`326`, :pr:`324`)
ru: Скорректирована целевая страница. (:pr:`327`, :pr:`326`, :pr:`324`)
ta: இறங்கும் பக்கத்தை சரிசெய்தது. .

source: Updated to Sphinx 1.6.2. (:pr:`323`)
eo: Ĝisdatigis al Sphinx 1.6.2. (:pr:`323`)
ja: Sphinx 1.6.2 にバージョンを上げた。 (:pr:`323`)
pt_br: Atualizado para Sphinx 1.6.2. (:pr:`323`)
ru: Обновление до Sphinx 1.6.2 (:pr:`323`)
ta: சூரரிமாச்சிலை 1.6.2 க்கு புதுப்பிக்கப்பட்டது. (: பி.ஆர்: `323`)

source: Switched to the PyPA theme. (:pr:`305`)
eo: Ŝanĝis al la etoso de PyPA. (:pr:`305`)
ja: PyPA のテーマに切り替えた。 (:pr:`305`)
pt_br: Trocado para o tema do PyPA. (:pr:`305`)
ru: Переключение на тему PyPA (:pr:`305`)
ta: PYPA கருப்பொருளுக்கு மாறியது. (: பி.ஆர்: `305`)

source: Re-organized the documentation into the new structure. (:pr:`318`)
eo: Reorganizis la dokumentaron laŭ la nova strukturo. (:pr:`318`)
ja: 説明文書を新しい構造に再編成した。 (:pr:`318`)
pt_br: Reorganizada a documentação na nova estrutura. (:pr:`318`)
ru: Реорганизовал документацию в соответствии с новой структурой. (:pr:`318`)
ta: புதிய கட்டமைப்பில் ஆவணங்களை மீண்டும் ஒழுங்கமைத்தது. (: பி.ஆர்: `318`)

source: May 2017
eo: Majo 2017
ja: 2017年5月
pt_br: Maio de 2017
ru: Май 2017
ta: மே 2017

source: Added documentation for the ``Description-Content-Type`` field. (:pr:`258`)
eo: Klarigis la kampon ``Description-Content-Type``. (:pr:`258`)
ja: ``Description-Content-Type`` 欄について説明を追加した。 (:pr:`258`)
pt_br: Adicionada documentação para o campo ``Description-Content-Type``. (:pr:`258`)
ru: Добавлена документация для поля ``Description-Content-Type``. (:pr:`258`)
ta: `` விளக்கம்-உள்ளடக்க வகை`` துறைக்கான ஆவணங்கள் சேர்க்கப்பட்டன. (: பி.ஆர்: `258`)

source: Added contributor and style guide. (:pr:`307`)
eo: Aldonis gvidilojn por kontribuantoj kaj pri stilo. (:pr:`307`)
ja: 貢献者向けのガイドとスタイルガイドを追加した。 (:pr:`307`)
pt_br: Adicionado guia de contribuidor e de estilo. (:pr:`307`)
ru: Добавлены контрибьютор и руководство по стилю. (:pr:`307`)
ta: கூடுதல் பங்களிப்பாளர் மற்றும் பாணி வழிகாட்டி. (: பி.ஆர்: `307`)

source: Documented ``pip`` and ``easy_install``'s differences for per-project indexes. (:pr:`233`)
eo: Dokumentis la diferencojn inter ``pip`` kaj ``easy_install`` pri unu-projektaj indeksoj. (:pr:`233`)
ja: プロジェクト単位の索引における ``pip`` と ``easy_install`` の差異について説明した。 (:pr:`233`)
pt_br: Documentadas as diferenças entre ``pip`` e ``easy_install`` para índices por projeto. (:pr:`233`)
ru: Документированы различия между ``pip`` и ``easy_install`` для индексов по проектам. (:pr:`233`)
ta: ஆவணப்படுத்தப்பட்ட `` பிப்`` மற்றும் `` ஈசி_இன்ச்டால்`` இன் வேறுபாடுகள். (: பி.ஆர்: `233`)

source: April 2017
eo: Aprilo 2017
ja: 2017年4月
pt_br: Abril de 2017
ru: Апрель 2017
ta: ஏப்ரல் 2017

source: Added travis configuration for testing pull requests. (:pr:`300`)
eo: Starigis agordojn pri travis por testi tirpetojn. (:pr:`300`)
ja: プルリクエストの試験のための travis 設定を追記した。 (:pr:`300`)
pt_br: Adicionada configuração de travis para testar pull requests. (:pr:`300`)
ru: Добавлена конфигурация travis для тестирования pull-запросов. (:pr:`300`)
ta: புல் கோரிக்கைகளை சோதிக்க டிராவிச் உள்ளமைவு சேர்க்கப்பட்டது. (: பி.ஆர்: `300`)

source: Mentioned the requirement of the ``wheel`` package for creating wheels (:pr:`299`)
eo: Menciis la postulon de la pako ``wheel`` por krei wheel (:pr:`299`)
ja: wheel ファイルを生成するための ``wheel`` パッケージへの要求条件に言及するようにした。 (:pr:`299`)
pt_br: Mencionado o requisito do pacote ``wheel`` para a criação de wheels (:pr:`299`)
ru: Упоминание о необходимости использования пакета ``wheel`` для создания колес (:pr:`299`)
ta: சக்கரங்களை உருவாக்குவதற்கான `` சக்கரம்`` தொகுப்பின் தேவையைக் குறிப்பிட்டுள்ளார் (: Pr: `299`)

source: Removed the ``twine register`` reference in the *Distributing Packages* tutorial. (:pr:`271`)
eo: Forigis la mencion de ``twine register`` en la lernilo *Distribui Pakojn*. (:pr:`271`)
ja: *パッケージを配布する* チュートリアルにおいて ``twine register`` への参照を削除した。 (:pr:`271`)
pt_br: Removida a referência a ``twine register`` no tutorial *Distribuindo pacotes*. (:pr:`271`)
ru: Удалена ссылка на ``twine register`` в руководстве *Распространение пакетов*. (:pr:`271`)
ta: * விநியோகிக்கும் தொகுப்புகளில் * டுடோரியலில் `` ட்வைன் பதிவு` `குறிப்பை அகற்றியது. (: பி.ஆர்: `271`)

source: Added a topic on plugin discovery. (:pr:`294`, :pr:`296`)
eo: Aldonis temon pri malkovrado de kromaĵoj. (:pr:`294`, :pr:`296`)
ja: プラグインの検索に関する話題を追加した。 (:pr:`294`, :pr:`296`)
pt_br: Adicionado um tópico sobre descoberta de plugins. (:pr:`294`, :pr:`296`)
ru: Добавлена тема по обнаружению плагинов. (:pr:`294`, :pr:`296`)
ta: சொருகி கண்டுபிடிப்பில் ஒரு தலைப்பைச் சேர்த்தது. (: pr: `294`,: pr:` 296`)

source: Added a topic on namespace packages. (:pr:`290`)
eo: Aldonis temon pri nomspacaj pakoj. (:pr:`290`)
ja: 名前空間パッケージの話題を追加した。 (:pr:`290`)
pt_br: Adicionado um tópico sobre pacotes de espaço de nomes. (:pr:`290`)
ru: Добавлена тема о пакетах пространств имен. (:pr:`290`)
ta: பெயர்வெளி தொகுப்புகளில் ஒரு தலைப்பைச் சேர்த்தது. (: பி.ஆர்: `290`)

source: Added documentation explaining prominently how to install ``pip`` in ``/usr/local``. (:pr:`230`)
eo: Aldonis dokumentaron reliefigante kiel instali ``pip`` en ``/usr/local``. (:pr:`230`)
ja: ``pip`` を ``/usr/local`` にインストールする方法を目立つように説明する文書を追加した。 (:pr:`230`)
pt_br: Adicionada documentação explicando em destaque como instalar ``pip`` em ``/usr/local``. (:pr:`230`)
ru: Добавлена документация, наглядно объясняющая, как установить ``pip`` в ``/usr/local``. (:pr:`230`)
ta: ``/Usr/local`` இல் `` பிப்`` ஐ எவ்வாறு நிறுவுவது என்பதை முக்கியமாக விளக்கும் ஆவணங்கள் சேர்க்கப்பட்டன. (: பி.ஆர்: `230`)

source: Updated development mode documentation to mention that order of local packages matters. (:pr:`208`)
eo: Ĝisdatigis la dokumentaron pri evoluada reĝimo menciante, ke la ordo de lokaj pakoj gravas. (:pr:`208`)
ja: 開発モードの説明文書を更新して、ローカルパッケージの記入順に意味があることに言及するようにした。 (:pr:`208`)
pt_br: Atualizada a documentação do modo de desenvolvimento para mencionar que a ordem dos pacotes locais é importante. (:pr:`208`)
ru: Обновлена документация по режиму разработки, чтобы упомянуть, что порядок локальных пакетов имеет значение. (:pr:`208`)
ta: புதுப்பிக்கப்பட்ட மேம்பாட்டு முறை ஆவணங்கள் உள்ளக தொகுப்புகளின் வரிசை விசயங்களைக் குறிப்பிட. (: பி.ஆர்: `208`)

source: Convert readthedocs link for their ``.org`` -> ``.io`` migration for hosted projects (:pr:`239`)
eo: Konverti ligilojn al readthedocs por la migrado ``.org`` → ``.io`` pri gastigitaj projektoj (:pr:`239`)
ja: ホストしているプロジェクトのところで readthedocs の引っ越しに合わせてリンクを ``.org`` から ``.io`` に変更した。 (:pr:`239`)
pt_br: Conversão de link do readthedocs para sua migração ``.org`` -> ``.io`` para projetos hospedados (:pr:`239`)
ru: Преобразование ссылки readthedocs для их миграции на ``.org`` -> ``.io`` для размещенных проектов (:pr:`239`)
ta: புரவலன் செய்யப்பட்ட திட்டங்களுக்கான `` .org`` -> `` .io`` இடம்பெயர்வு (: Pr: `239`) க்கான READTHEDOCS இணைப்பை மாற்றவும்

source: Swapped order of :file:`setup.py` arguments for the upload command, as order is significant. (:pr:`260`)
eo: Ŝanĝis la ordon de la argumentoj de :file:`setup.py` por la komando «upload», ĉar la ordo gravas. (:pr:`260`)
ja: 順序が意味を持つので、アップロードコマンドの :file:`setup.py` の引数の順序を入れ替えた。 (:pr:`260`)
pt_br: Trocada a ordem dos argumentos do :file:`setup.py` para o comando de envio, pois a ordem é significativa. (:pr:`260`)
ru: Поменяли местами порядок аргументов :file:`setup.py` для команды upload, так как порядок имеет значение. (:pr:`260`)
ta: இடமாற்றம் செய்யப்பட்ட ஆர்டர்: கோப்பு: பதிவேற்ற கட்டளைக்கான `setup.py` வாதங்கள் குறிப்பிடத்தக்கவை. (: பி.ஆர்: `260`)

source: Explained how to install from unsupported sources using a helper application. (:pr:`289`)
eo: Klarigis kiel instali el nesubtenata fonto per helpa programo. (:pr:`289`)
ja: サポートされていないソースからヘルパーアプリケーションを用いてインストールする方法について説明した。 (:pr:`289`)
pt_br: Explicado como instalar de fontes não suportadas usando uma aplicação auxiliar. (:pr:`289`)
ru: Объяснено, как устанавливать из неподдерживаемых источников с помощью вспомогательного приложения. (:pr:`289`)
ta: உதவி பயன்பாட்டைப் பயன்படுத்தி ஆதரிக்கப்படாத மூலங்களிலிருந்து எவ்வாறு நிறுவுவது என்பதை விளக்கினார். (: பி.ஆர்: `289`)

source: March 2017
eo: Marto 2017
ja: 2017年3月
pt_br: Março de 2017
ru: Март 2017
ta: மார்ச் 2017

source: Covered ``manylinux1`` in *Platform Wheels*. (:pr:`283`)
eo: Menciis ``manylinux1`` en *Platforma Wheel*. (:pr:`283`)
ja: *プラットフォームWheels* の項で ``manylinux1`` をカバーした。 (:pr:`283`)
pt_br: Coberto ``manylinux1`` em *wheels de plataforma*. (:pr:`283`)
ru: Покрытие ``manylinux1`` в *Platform Wheels*. (:pr:`283`)
ta: இயங்குதள சக்கரங்களில் *`` மேனிலினக்ச் 1`` உள்ளடக்கியது. (: பி.ஆர்: `283`)

source: February 2017
eo: Februaro 2017
ja: 2017年2月
pt_br: Fevereiro de 2017
ru: Февраль 2017
ta: பிப்ரவரி 2017

source: Added :pep:`518`. (:pr:`281`)
eo: Aldonis :pep:`518`. (:pr:`281`)
ja: :pep:`518` を追加した。 (:pr:`281`)
pt_br: Adicionada a :pep:`518`. (:pr:`281`)
ru: Добавлен :pep:`518` (:pr:`281`)
ta: சேர்க்கப்பட்டது: PEP: `518`. (: பி.ஆர்: `281`)

source: Overview of Python Packaging
eo: Superrigardo pri Pakado de Python
ja: Python におけるパッケージングに関する概要
pt_br: Visão geral do empacotamento para Python
ru: Обзор упаковки Python
ta: பைதான் பேக்கேசிங்கின் கண்ணோட்டம்

source: As a general-purpose programming language, Python is designed to be used in many ways. You can build web sites or industrial robots or a game for your friends to play, and much more, all using the same core technology.
eo: Kiel ĝeneralcela programlingvo, Python estas uzebla por multaj celoj. Vi povas verki retejon aŭ industrian roboton aŭ ludon por viaj amikoj, kaj multe pli, uzante la saman kernan teĥnikon.
ja: 汎用プログラミング言語として Python は数多くの用途に使えるように設計されています。ウェブサイト構築にも産業用ロボットにもあなたが友達と一緒に遊ぶゲームにももっと他の用途にも、同じコア技術が使えるのです。
pt_br: Como uma linguagem de programação de propósito geral, Python foi projetado para ser usado de várias maneiras. Você pode construir sites ou robôs industriais ou um jogo para seus amigos jogarem e muito mais, todos usando a mesma tecnologia básica.
ru: Будучи языком программирования общего назначения, Python предназначен для разнообразного использования. Вы можете создавать веб-сайты, промышленных роботов, игры для своих друзей и многое другое, используя одну и ту же базовую технологию.
ta: ஒரு பொது நோக்கம் கொண்ட நிரலாக்க மொழியாக, பைதான் பல வழிகளில் பயன்படுத்த வடிவமைக்கப்பட்டுள்ளது. வலைத்தளங்கள் அல்லது தொழில்துறை ரோபோக்கள் அல்லது உங்கள் நண்பர்கள் விளையாடுவதற்கான ஒரு விளையாட்டை நீங்கள் உருவாக்கலாம், மேலும் பலவற்றை ஒரே முக்கிய தொழில்நுட்பத்தைப் பயன்படுத்தலாம்.

source: Python's flexibility is why the first step in every Python project must be to think about the project's audience and the corresponding environment where the project will run. It might seem strange to think about packaging before writing code, but this process does wonders for avoiding future headaches.
ja: Python は自由度が高いので、プロジェクトの利用者について、また、それに対応してプロジェクトが動作するであろう環境について、すべての Python プロジェクトにおいて最初に考えなければなりません。コードを書く前にパッケージングについて考えておくというのは奇妙に見えるかもしれませんが、この作業こそが将来の頭痛の種を摘み取るという驚くべきことを起こすのです。
pt_br: A flexibilidade do Python é o porquê do primeiro passo em cada projeto Python deva ser pensar sobre o público do projeto e o ambiente correspondente onde o projeto será executado. Pode parecer estranho pensar em empacotamento antes de escrever o código, mas esse processo faz maravilhas para evitar dores de cabeça futuras.
ru: Гибкость Python - вот почему первым шагом в каждом проекте на Python должно быть обдумывание аудитории проекта и соответствующего окружения, в котором он будет работать. Может показаться странным думать об упаковке до написания кода, но этот процесс позволяет избежать головной боли в будущем.
ta: பைதானின் நெகிழ்வுத்தன்மை என்னவென்றால், ஒவ்வொரு பைதான் திட்டத்தின் முதல் படி திட்டத்தின் பார்வையாளர்களைப் பற்றியும், திட்டம் இயங்கும் அதனுடன் தொடர்புடைய சூழலைப் பற்றியும் சிந்திக்க வேண்டும். குறியீட்டை எழுதுவதற்கு முன்பு பேக்கேசிங் பற்றி சிந்திப்பது விசித்திரமாகத் தோன்றலாம், ஆனால் இந்த செயல்முறை எதிர்கால தலைவலியைத் தவிர்ப்பதற்கு அதிசயங்களை செய்கிறது.

source: This overview provides a general-purpose decision tree for reasoning about Python's plethora of packaging options. Read on to choose the best technology for your next project.
eo: Jen superrigardo de ĝeneralcela decidarbo por elekti inter la abundo da opcioj pri pakado de Python. Legu ĝin por elekti la plej bonan teĥnikon por via projekto.
ja: この概要文書は、 Python の過剰とも言える多数のパッケージング手段からどれを選択するかについての汎用の決定木を提供します。読み進めて、あなたの次のプロジェクトにとっての最適解を選んでください。
pt_br: Esta visão geral fornece uma árvore de decisão de propósito geral para raciocinar sobre a abundância de opções de empacotamento do Python. Continue lendo para escolher a melhor tecnologia para seu próximo projeto.
ru: В этом обзоре представлено дерево решений общего назначения для рассуждений о множестве вариантов упаковки Python. Читайте дальше, чтобы выбрать лучшую технологию для вашего следующего проекта.
ta: இந்த கண்ணோட்டம் பைத்தானின் ஏராளமான பேக்கேசிங் விருப்பங்களைப் பற்றிய பகுத்தறிவுக்காக ஒரு பொது நோக்க முடிவான மரத்தை வழங்குகிறது. உங்கள் அடுத்த திட்டத்திற்கான சிறந்த தொழில்நுட்பத்தைத் தேர்வுசெய்ய படிக்கவும்.

source: Thinking about deployment
eo: Pripensi disponigon
ja: デプロイメントについて検討する
pt_br: Pensando sobre a implantação
ru: Мысли о развёртывании
ta: வரிசைப்படுத்தல் பற்றி சிந்திப்பது

source: Packages exist to be installed (or *deployed*), so before you package anything, you'll want to have some answers to the deployment questions below:
eo: Pako ekzistas por instalado (aŭ *disponigado*). Tial, antaŭ ol paki ion ajn, oni havu respondojn al la jenaj demandoj pri disponigo:
ja: パッケージはインストールされる(あるいは *配置* される)ために存在しているので、なにかをパッケージ化する前に次のような配置のための質問にいくらかの答えを持っておきたいと思うでしょう:
pt_br: Os pacotes existem para serem instalados (ou *implantados*, *deployed*), portanto, antes de empacotar qualquer coisa, você vai querer ter algumas respostas para as perguntas de implantação abaixo:
ru: Пакеты существуют для того, чтобы их устанавливали (или *развертывали*), поэтому прежде чем упаковывать что-либо, вам нужно получить ответы на вопросы по развертыванию, приведенные ниже:
ta: தொகுப்புகள் நிறுவப்பட வேண்டும் (அல்லது *பயன்படுத்தப்பட்டவை *), எனவே நீங்கள் எதையும் தொகுக்க முன், கீழே உள்ள வரிசைப்படுத்தல் கேள்விகளுக்கு சில பதில்களை நீங்கள் பெற விரும்புவீர்கள்:
