Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: This tutorial walks you through how to package a simple Python project. It will show you how to add the necessary files and structure to create the package, how to build the package, and how to upload it to the Python Package Index (PyPI).
eo: Jen lernilo pri kiel paki simplan Python-projekton. Ĝi klarigas kiel aldoni la necesajn dosierojn kaj strukturon por krei la pakon, kiel konstrui la pakon, kaj kiel alŝuti ĝin al la Python-Pakindekso ( PyPI).
ja: このチュートリアルでは、簡単な Python プロジェクトをどのようにしてパッケージするのかについて、一通り見て回ります。パッケージを構成するために必要なファイルやディレクトリを追加する方法や、パッケージをビルドする方法、そして、Python パッケージインデックス (PyPI) にパッケージをアップロードする方法をお見せします。
pt_br: Este tutorial mostra como empacotar um projeto Python simples. Ele mostrará como adicionar os arquivos e a estrutura necessários para criar o pacote, como construir o pacote e como enviá-lo para o Índice de Pacotes do Python (PyPI).
ru: В этом уроке рассказывается о том, как упаковать простой проект на Python. В нем вы узнаете, как добавить необходимые файлы и структуру для создания пакета, как собрать пакет и как загрузить его в Python Package Index (PyPI).
ta: இந்த பயிற்சி ஒரு எளிய பைதான் திட்டத்தை எவ்வாறு தொகுத்தல் மூலம் உங்களை அழைத்துச் செல்கிறது. தொகுப்பை உருவாக்க தேவையான கோப்புகள் மற்றும் கட்டமைப்பை எவ்வாறு சேர்ப்பது, தொகுப்பை எவ்வாறு உருவாக்குவது, அதை பைதான் தொகுப்பு குறியீட்டில் (PYPI) எவ்வாறு பதிவேற்றுவது என்பதை இது காண்பிக்கும்.

source: If you have trouble running the commands in this tutorial, please copy the command and its output, then `open an issue`_ on the `packaging-problems`_ repository on GitHub. We'll do our best to help you!
eo: Se vi spertas problemon pri la komandoj en ĉi tiu lernilo, bonvolu kopii la komandon kaj ĝian eligaĵon, kaj `raportu problemon <open an issue>`_ pri la deponejo `packaging-problems`_ ĉe GitHub. Ni provos helpi vin!
ja: このチュートリアルに出てくるコマンドを実行したら問題が発生したという場合には、コマンドと結果出力をコピーして、 GitHub の `packaging-problems`_ リポジトリで `新たな課題 <open an issue>`_ を追加してください。我々が全力であなたをお助けします！
pt_br: Se você tiver problemas para executar os comandos neste tutorial, copie o comando e sua saída e, em seguida, `relate um problema`_ no repositório `packaging-problems`_ no GitHub. Faremos o nosso melhor para ajudá-lo!
ru: Если у вас возникли проблемы с выполнением команд в этом руководстве, скопируйте команду и ее вывод, а затем `откройте проблему`_ в репозитории `packaging-problems`_ на GitHub. Мы сделаем все возможное, чтобы помочь вам!
ta: இந்த டுடோரியலில் கட்டளைகளை இயக்குவதில் உங்களுக்கு சிக்கல் இருந்தால், தயவுசெய்து கட்டளையையும் அதன் வெளியீட்டையும் நகலெடுக்கவும், பின்னர் கிட்அப்பில் `பேக்கேசிங்-வெளியீடுகள்`_ களஞ்சியத்தில்` ஒரு சிக்கலைத் திறக்கவும். உங்களுக்கு உதவ நாங்கள் எங்களால் முடிந்த அனைத்தையும் செய்வோம்!

source: Some of the commands require a newer version of :ref:`pip`, so start by making sure you have the latest version installed:
eo: Kelkaj komandoj postulas novan version de :ref:`pip`. Tial, certigu, ke vi havas la plej novan version:
ja: コマンドの中のいくつかは新しめのバージョンの :ref:`pip` でないとだめなので、最新版をインストールして使っていることを最初に確認しておいてください:
pt_br: Alguns comandos exigem uma nova versão de :ref:`pip`, então comece certificando-se de que você tenha a versão mais recente instalada:
ru: Некоторые из команд требуют более новой версии :ref:`pip`, поэтому для начала убедитесь, что у вас установлена последняя версия:
ta: சில கட்டளைகளுக்கு புதிய பதிப்பு தேவைப்படுகிறது: குறிப்பு: `பிப்`, எனவே நீங்கள் அண்மைக் கால பதிப்பை நிறுவியுள்ளதா என்பதை உறுதிப்படுத்துவதன் மூலம் தொடங்கவும்:

source: A simple project
eo: Simpla projekto
ja: 単純なプロジェクト
pt_br: Um projeto simples
ru: Простой проект
ta: ஒரு எளிய திட்டம்

source: This tutorial uses a simple project named ``example_package_YOUR_USERNAME_HERE``. If your username is ``me``, then the package would be ``example_package_me``; this ensures that you have a unique package name that doesn't conflict with packages uploaded by other people following this tutorial. We recommend following this tutorial as-is using this project, before packaging your own project.
eo: Ĉi tiu lernilo uzas simplan projekton nomitan ``example_package_VIA_SALUTNOMO``. Se via salutnomo estus ``mi``, la pako estus ``example_package_mi``. Tio certigas, ke oni havas unikan paknomon ne konfliktantan kun pakoj alŝutitaj de aliuloj legintaj ĉi tiun lernilon. Ni rekomendas, ke vi sekvu ĉi tiun lernilon laŭvorte per ĉi tiu projekto antaŭ ol paki vian propran projekton.
ja: このチュートリアルは、 ``example_package_YOUR_USERNAME_HERE`` という名前の単純なプロジェクトを使っています。もしあなたのユーザ名が ``me`` であるなら、パッケージの名前は ``example_package_me`` となるでしょう; こうすることで、このチュートリアルに従っている他の人たちがアップロードするパッケージ群と名前が衝突することのない一意なパッケージ名を使っていることを保証できます。自分自身のプロジェクトのパッケージングを始める前に、このプロジェクト名を使ってこのチュートリアルに沿った練習をすることをお勧めします。
pt_br: Este tutorial usa um projeto simples chamado ``example_package_YOUR_USERNAME_HERE``. Se seu nome de usuário for ``me``, então o pacote seria ``example_package_me``; isso garante que você tenha um nome de pacote exclusivo que não entre em conflito com os pacotes carregados por outras pessoas seguindo este tutorial. Recomendamos seguir este tutorial como está usando este projeto, antes de empacotar seu próprio projeto.
ru: В этом руководстве используется простой проект с именем ``example_package_YOUR_USERNAME_HERE``. Если ваше имя пользователя ``me``, то пакет будет ``example_package_me``; это гарантирует, что у вас будет уникальное имя пакета, которое не будет конфликтовать с пакетами, загруженными другими людьми, следующими этому руководству. Мы рекомендуем следовать этому руководству как есть, используя этот проект, прежде чем упаковывать свой собственный проект.
ta: இந்த டுடோரியல் `` எடுத்துக்காட்டு_பேக்கேச்_யோர்_சர்ன்ம்_எர்`` என்ற எளிய திட்டத்தைப் பயன்படுத்துகிறது. உங்கள் பயனர்பெயர் `` me`` என்றால், தொகுப்பு `` example_package_me``; இந்த டுடோரியலைத் தொடர்ந்து மற்றவர்களால் பதிவேற்றப்பட்ட தொகுப்புகளுடன் முரண்படாத ஒரு தனித்துவமான தொகுப்பு பெயர் உங்களிடம் இருப்பதை இது உறுதி செய்கிறது. உங்கள் சொந்த திட்டத்தை பேக்கேசிங் செய்வதற்கு முன், இந்த திட்டத்தைப் பயன்படுத்த இந்த டுடோரியலைப் பின்பற்ற பரிந்துரைக்கிறோம்.

source: Create the following file structure locally:
eo: Kreu loke la jenan dosieran strukturon:
ja: ローカルに以下のファイル構造を作成する:
pt_br: Crie a seguinte estrutura de arquivos localmente:
ru: Создайте локально следующую структуру файлов:
ta: உள்நாட்டில் பின்வரும் கோப்பு கட்டமைப்பை உருவாக்கவும்:

source: The directory containing the Python files should match the project name. This simplifies the configuration and is more obvious to users who install the package.
eo: La nomo de la dosierujo enhavanta la Python-dosierojn estu la nomo de la projekto. Tio simpligas la agordadon kaj estas pli klara al instalantoj de la pako.
ja: Python ファイル群を格納するディレクトリは、プロジェクト名と同じ名前であるべきです。こうすることで設定が簡単になり、また、パッケージをインストールするユーザから見てより明白になります。
pt_br: O diretório que contém os arquivos Python deve corresponder ao nome do projeto. Isso simplifica a configuração e é mais óbvio para os usuários que instalam o pacote.
ru: Каталог, содержащий файлы Python, должен совпадать с именем проекта. Это упрощает настройку и более очевидно для пользователей, устанавливающих пакет.
ta: பைதான் கோப்புகளைக் கொண்ட அடைவு திட்ட பெயருடன் பொருந்த வேண்டும். இது உள்ளமைவை எளிதாக்குகிறது மற்றும் தொகுப்பை நிறுவும் பயனர்களுக்கு மிகவும் தெளிவாகத் தெரிகிறது.

source: Creating the file :file:`__init__.py` is recommended because the existence of an :file:`__init__.py` file allows users to import the directory as a regular package, even if (as is the case in this tutorial) :file:`__init__.py` is empty. [#namespace-packages]_
eo: Krei la dosieron :file:`__init__.py` estas rekomendate, ĉar la ekzisto de dosiero :file:`__init__.py` permesas al uzantoj importi la dosierujon kiel ordinaran pakon, eĉ se (kiel estas la kazo en ĉi tiu lernilo) :file:`__init__.py` estas malplena. [#namespace-packages]_
ja: :file:`__init__.py` ファイルを使用して、ユーザーはディレクトリを通常のパッケージとしてインポートできるため、 (このチュートリアルの場合のように) たとえ :file:`__init__.py` が空だとしても、 :file:`__init__.py` ファイルの作成が推奨されています。 [#namespace-packages]_
ru: Создание файла : файл:`__init__.py` рекомендуется, потому что наличие файла :файл:`__init__.py` позволяет пользователям импортировать каталог как обычный пакет, даже если (как в этом руководстве) :файл:`__init__.py` пуст. [#пространство имен-пакетов]_
ta: கோப்பை உருவாக்குதல்: கோப்பு: `__init __. பை` பரிந்துரைக்கப்படுகிறது, ஏனெனில் ஒரு: கோப்பு:` __init __. [#பெயர்வெளி-தொகுப்புகள்] _

source: :file:`example.py` is an example of a module within the package that could contain the logic (functions, classes, constants, etc.) of your package. Open that file and enter the following content:
eo: :file:`example.py` estas ekzemplo de modulo en la pako, kiu povas enhavi la logikon (funkciojn, klasojn, konstantojn ktp.) de via pako. Malfermu tiun dosieron, kaj tajpu la jenon:
ja: :file:`example.py` は、パッケージの中であなたのパッケージのロジック (関数・クラス・定数・その他) を含むであろうモジュールの例です。このファイルを開いて、以下の内容を入力してください:
pt_br: :file:`example.py` é um exemplo de módulo dentro do pacote que pode conter a lógica (funções, classes, constantes, etc.) do seu pacote. Abra esse arquivo e insira o seguinte conteúdo:
ru: Файл:`example.py` - это пример модуля внутри пакета, который может содержать логику (функции, классы, константы и т.д.) вашего пакета. Откройте этот файл и введите следующее содержимое:
ta: : கோப்பு: உங்கள் தொகுப்பின் வழக்கு (செயல்பாடுகள், வகுப்புகள், மாறிலிகள் போன்றவை) கொண்டிருக்கக்கூடிய தொகுப்புக்குள் உள்ள ஒரு தொகுதிக்கு `எடுத்துக்காட்டு. அந்த கோப்பைத் திறந்து பின்வரும் உள்ளடக்கத்தை உள்ளிடவும்:

source: If you are unfamiliar with Python's :term:`modules <Module>` and :term:`import packages <Import Package>`, take a few minutes to read over the `Python documentation for packages and modules`_.
eo: Se vi ne konas :term:`modulon <Module>` kaj :term:`importan pakon <Import Package>` de Python, bonvolu tralegi la `dokumentaron de Python pri pakoj kaj moduloj <Python documentation for packages and modules>`_.
ja: Python における :term:`モジュール <Module>` や :term:`パッケージのインポート <Import Package>` に馴染みがなければ、数分を費やして `パッケージとモジュールに関する Python の説明文書 <Python documentation for packages and modules>`_ を読み通してください。
pt_br: Se você não está familiarizado com :term:`módulos <Módulo>` e :term:`pacotes de importação <Pacote de Importação>` do Python, reserve alguns minutos para ler a `documentação do Python para pacotes e módulos`_.
ru: Если вы не знакомы с :term:`модулями <Module>` и :term:`импортными пакетами <Import Package>`, потратьте несколько минут на чтение `документации Python по пакетам и модулям`_.
ta: பைதான்: கால: `தொகுதிகள் <தொகுதி>` மற்றும்: கால: `இறக்குமதி தொகுப்புகள் <இறக்குமதி தொகுப்பு> உடன் உங்களுக்கு அறிமுகமில்லாதவராக இருந்தால், தொகுப்புகள் மற்றும் தொகுதிகள்`_ க்கான` பைதான் ஆவணங்களைப் படிக்க சில நிமிடங்கள் எடுத்துக் கொள்ளுங்கள்.

source: Once you create this structure, you'll want to run all of the commands in this tutorial within the ``packaging_tutorial`` directory.
eo: Post kiam vi kreas tiun strukturon, vi rulu ĉiujn komandojn en ĉi tiu lernilo ene de la dosierujo ``packaging_tutorial``.
ja: この構造さえ作れば、このチュートリアルに出てくるすべてのコマンドを ``packaging_tutorial`` ディレクトリで実行したくなるでしょう。
pt_br: Depois de criar esta estrutura, você desejará executar todos os comandos neste tutorial dentro do diretório ``packaging_tutorial``.
ru: Как только вы создадите эту структуру, вам нужно будет запустить все команды этого руководства в директории ``packaging_tutorial``.
ta: இந்த கட்டமைப்பை நீங்கள் உருவாக்கியதும், இந்த டுடோரியலில் உள்ள அனைத்து கட்டளைகளையும் `` பேக்கேசிங்_டூட்டோரியல்`` கோப்பகத்திற்குள் இயக்க விரும்புவீர்கள்.

source: Creating the package files
eo: Krei dosierojn de la pakaĵo
ja: パッケージファイルを作成する
pt_br: Criando arquivos do pacote
ru: Создание файлов пакета
ta: தொகுப்பு கோப்புகளை உருவாக்குதல்

source: You will now add files that are used to prepare the project for distribution. When you're done, the project structure will look like this:
eo: Vi nun aldonos dosierojn por prepari la projekton por distribuado. Post tio, la projekta strukturo aspektos jene:
ja: ここで、プロジェクトの配布を準備するために使われるファイル群を追加しましょう。それが終わったら、プロジェクトの構造はこんな風になっていることでしょう:
pt_br: Agora você adicionará arquivos que são usados para preparar o projeto para distribuição. Quando terminar, a estrutura do projeto ficará assim:
ru: Теперь вы будете добавлять файлы, которые используются для подготовки проекта к распространению. Когда вы закончите, структура проекта будет выглядеть следующим образом:
ta: விநியோகத்திற்காக திட்டத்தைத் தயாரிக்கப் பயன்படுத்தப்படும் கோப்புகளை இப்போது சேர்ப்பீர்கள். நீங்கள் முடித்ததும், திட்ட அமைப்பு இப்படி இருக்கும்:

source: Creating a test directory
eo: Krei elprovan dosierujon
ja: test ディレクトリを作成する
pt_br: Criando um diretório de teste
ru: Создание тестового каталога
ta: சோதனை கோப்பகத்தை உருவாக்குதல்

source: :file:`tests/` is a placeholder for test files. Leave it empty for now.
eo: :file:`tests/` estas loko por testaj dosieroj. Lasu ĝin malplena portempe.
ja: :file:`tests/` は、テスト用のファイルを置くためのプレースホルダーです。現段階では、空のままにしておいてください。
pt_br: :file:`tests/` é um espaço reservado, ou *placeholder*, para arquivos de teste. Deixe-o vazio por enquanto.
ru: :file:`tests/` - это заполнитель для тестовых файлов. Оставьте его пока пустым.
ta: : கோப்பு: `சோதனைகள்/` சோதனை கோப்புகளுக்கான ஒதுக்கிடமாகும். இப்போதைக்கு காலியாக விடவும்.

source: Choosing a build backend
eo: Elekti konstruan malfasadon
ja: ビルドバックエンドを選択する
pt_br: Escolhendo uma construção de backend
ru: Выбор бэкенда для сборки
ta: ஒரு கட்டமைப்பைத் தேர்ந்தெடுப்பது

source: Tools like :ref:`pip` and :ref:`build` do not actually convert your sources into a :term:`distribution package <Distribution Package>` (like a wheel); that job is performed by a :term:`build backend <Build Backend>`. The build backend determines how your project will specify its configuration, including metadata (information about the project, for example, the name and tags that are displayed on PyPI) and input files. Build backends have different levels of functionality, such as whether they support building :term:`extension modules <Extension Module>`, and you should choose one that suits your needs and preferences.
eo: Ilo kiel :ref:`pip` aŭ :ref:`build` ne fakte transformas viajn fontojn en :term:`distribuan pakon <Distribution Package>` (kiel radon); tiu tasko estas farita de :term:`konstrua malfasado <Build Backend>`. La konstrua malfasado determinas kiel specifi la projektajn agordojn, inkluzive de la metadatenoj (informoj pri la projekto, ekzemple, la nomo kaj etikedoj montrotaj ĉe PyPI) kaj enigaj dosieroj. Diversaj konstruaj malfasadoj havas diversajn nivelojn de funkcio, pri ĉu ili subtenas konstrui :term:`etendaĵan modulon <Extension Module>`, kaj oni elektu konstruan malfasadon taŭgan por viaj bezonoj.
ja: :ref:`pip` や :ref:`build` のようなツールは、実際にソースを :term:`配布パッケージ <Distribution Package>` (wheel のような) に変換するわけではありません。その作業は、 :term:`ビルドバックエンド <Build Backend>` によって行われます。ビルドバックエンドは、プロジェクトがメタデータ (プロジェクトについての情報、例えば PyPI に表示される名前やタグ) や入力ファイルを含むその構成を指定する方法を決定します。ビルドバックエンドは、 :term:`拡張モジュール <Extension Module>` のビルドをサポートするかどうかのような、異なる水準の機能性を持ち、必要性や好みに適切なものを選択するべきです。
ru: Такие инструменты, как :ref:`pip` и :ref:`build`, на самом деле не преобразуют ваши исходники в :term:`дистрибутивный пакет <Distribution Package>` (как колесо); эту работу выполняет :term:`build backend <Build Backend>`. Бэкенд сборки определяет, как ваш проект будет задавать свою конфигурацию, включая метаданные (информацию о проекте, например, название и теги, которые отображаются на PyPI) и входные файлы. Бэкенды сборки имеют различные уровни функциональности, например, поддерживают ли они сборку :term:`модулей расширения <Extension Module>`, и вы должны выбрать тот, который соответствует вашим потребностям и предпочтениям.
ta: போன்ற கருவிகள்: குறிப்பு: `பிப்` மற்றும்: குறிப்பு:` பில்ட்` உண்மையில் உங்கள் மூலங்களை ஒரு ஆக மாற்ற வேண்டாம்: கால: `விநியோக தொகுப்பு <விநியோக தொகுப்பு>` (ஒரு சக்கரம் போன்றது); அந்த வேலை ஒரு: கால: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>`. மேனிலை தரவு (திட்டத்தைப் பற்றிய தகவல்கள், எடுத்துக்காட்டாக, PYPI இல் காட்டப்படும் பெயர் மற்றும் குறிச்சொற்கள்) மற்றும் உள்ளீட்டு கோப்புகள் உள்ளிட்ட அதன் உள்ளமைவை உங்கள் திட்டம் எவ்வாறு குறிப்பிடும் என்பதை பில்ட் பின்தளத்தில் தீர்மானிக்கிறது. கட்டியெழுப்பும் பின்தளத்தில் அவை கட்டடத்தை ஆதரிக்கின்றனவா?

source: You can choose from a number of backends; this tutorial uses :ref:`Hatchling <hatch>` by default, but it will work identically with :ref:`setuptools`, :ref:`Flit <flit>`, :ref:`PDM <pdm>`, and others that support the ``[project]`` table for :ref:`metadata <configuring metadata>`.
eo: Vi povas elekti inter multaj malfasadoj. Ĉi tiu lernilo uzas :ref:`Hatchling <hatch>`, sed ĝi ankaŭ funkcios same kun :ref:`setuptools`, :ref:`Flit <flit>`, :ref:`PDM <pdm>`, aŭ aliaj malfasadoj subtenantaj la tabelon ``[project]`` por :ref:`metadatenoj <configuring metadata>`.
ja: 多くのバックエンド群から選択することができます; このチュートリアルでは :ref:`Hatchling <hatch>` をデフォルトとして使いますが、 :ref:`setuptools` ・ :ref:`Flit <flit>` ・ :ref:`PDM <pdm>` や、 :ref:`メタデータ <configuring metadata>` として ``[project]`` テーブルをサポートする他のものでも同様に動作するでしょう。
ru: Вы можете выбрать один из нескольких бэкендов; в этом руководстве по умолчанию используется :ref:`Hatchling <hatch>`, но он будет работать идентично с :ref:`setuptools`, :ref:`Flit <flit>`, :ref:`PDM <pdm>` и другими, которые поддерживают таблицу ``[project]`` для :ref:`metadata <configuring metadata>`.
ta: நீங்கள் பல பின்தளத்தில் இருந்து தேர்வு செய்யலாம்; இந்த டுடோரியல் பயன்பாடுகள்: ref: `அட்ச்லிங் <அட்ச்>` இயல்பாகவே, ஆனால் அது ஒரே மாதிரியாக செயல்படும்: ref: `setuptools`,: Ref:` Flit <flit> `,: Ref:` pdm <pdm> `, மற்றும்` `[திட்டம்]` `மெட்டாடாட்டா:` மெட்டாடாட்டா: `மெட்டாடா கட்டமைப்பு.

source: Some build backends are part of larger tools that provide a command-line interface with additional features like project initialization and version management, as well as building, uploading, and installing packages. This tutorial uses single-purpose tools that work independently.
eo: Kelkaj konstruaj malfasadoj estas parto de pli grandaj iloj, kiuj disponigas komandlinian interfacon kun kromaj funkcioj kiel ekstarigo de projekto kaj administrado de versioj, kune kun konstruado, alŝutado kaj instalado de pakoj. Ĉi tiu lernilo uzas unucelan sendependan ilon.
ja: ビルド・アップロード・インストールと並んでプロジェクト初期化やバージョン管理のような追加機能を伴ったコマンドラインインタフェースを提供する、もっと大きなツールの一部を構成するビルドバックエンドもあります。このチュートリアルでは、独立に動作する単一目的のツールを扱います。
pt_br: Alguns backends de construção fazem parte de ferramentas maiores que fornecem uma interface de linha de comando com recursos adicionais, como inicialização de projeto e gerenciamento de versão, além de construção, envio e instalação de pacotes. Este tutorial usa ferramentas de propósito único que funcionam de forma independente.
ru: Некоторые средства сборки являются частью более крупных инструментов, предоставляющих интерфейс командной строки с дополнительными возможностями, такими как инициализация проекта и управление версиями, а также сборка, загрузка и установка пакетов. В этом учебнике используются универсальные инструменты, работающие независимо друг от друга.
ta: சில உருவாக்க பின்தளத்தில் பெரிய கருவிகளின் ஒரு பகுதியாகும், அவை திட்ட துவக்கம் மற்றும் பதிப்பு மேலாண்மை போன்ற கூடுதல் அம்சங்களுடன் கட்டளை-வரி இடைமுகத்தை வழங்குகின்றன, அத்துடன் தொகுப்புகளை உருவாக்குதல், பதிவேற்றுதல் மற்றும் நிறுவுதல். இந்த பயிற்சி சுயாதீனமாக வேலை செய்யும் ஒற்றை நோக்கக் கருவிகளைப் பயன்படுத்துகிறது.

source: The :file:`pyproject.toml` tells :term:`build frontend <Build Frontend>` tools like :ref:`pip` and :ref:`build` which backend to use for your project. Below are some examples for common build backends, but check your backend's own documentation for more details.
eo: La dosiero :file:`pyproject.toml` sciigas :term:`la konstruan fasadon <Build Frontend>` kiel :ref:`pip` kaj :ref:`build` pri la malfasado uzota por la projekto. Jen kelkaj ekzemploj por oftaj konstruaj malfasadoj, sed legu la dokumentaron de via malfasado por detaloj.
ja: :file:`pyproject.toml` は、 :ref:`pip` や :ref:`build` のような :term:`ビルドフロントエンド <Build Frontend>` ツールに対して、そのプロジェクトにおいてどのバックエンドを使うかを指示します。よくあるビルドバックエンドのいくつかの例を下に挙げますが、もっと詳しいことについてはバックエンド自身の説明文書を確認してください。
ru: В :file:`pyproject.toml` указывается :term:`build frontend <Build Frontend>` инструментам, таким как :ref:`pip` и :ref:`build`, какой бэкенд использовать для вашего проекта. Ниже приведены примеры для распространенных бэкендов сборки, но для получения более подробной информации обратитесь к документации по вашему бэкенду.
ta: தி: கோப்பு: `pyproject.toml` சொல்கிறது: சொல்:` பில்ட் ஃபிரான்டெண்ட் <பில்ட் ஃபிரான்டெண்ட்> `போன்ற கருவிகள்: ref:` பிப்` மற்றும்: ref: `பில்ட்` உங்கள் திட்டத்திற்கு எந்த பின்தளத்தில் பயன்படுத்த வேண்டும். பொதுவான கட்டமைப்பிற்கான சில எடுத்துக்காட்டுகள் கீழே உள்ளன, ஆனால் மேலும் விவரங்களுக்கு உங்கள் பின்தளத்தில் சொந்த ஆவணங்களை சரிபார்க்கவும்.

source: The ``build-backend`` key is the name of the Python object that frontends will use to perform the build.
eo: La ŝlosilo ``build-backend`` estas la nomo de la Python-objekto uzota de fasadoj por fari la konstruon.
ja: ``build-backend`` キーは、そのフロントエンドがビルドを実行するにあたって使用するであろう Python オブジェクトの名前です。
ru: Ключ ``build-backend`` - это имя объекта Python, который фронтенды будут использовать для выполнения сборки.
ta: `` பில்ட்-பேக்கெண்ட்`` விசையானது பைதான் பொருளின் பெயர், இது கட்டமைப்பைச் செய்ய ஃபிரான்டெண்ட்ச் பயன்படுத்தும்.

source: Both of these values will be provided by the documentation for your build backend, or generated by its command line interface. There should be no need for you to customize these settings.
eo: Ambaŭ valoroj estos disponigitaj de la dokumentaro de la konstrua malfasado aŭ genereblaj per ĝia komandlinia fasado. Ne necesu, ke oni adaptu tiajn agordojn.
ja: これらの両方の値は、ビルドバックエンドの説明文書によって提供されるか、そのコマンドラインインターフェースによって生成されるでしょう。これらの設定をカスタマイズする必要はないはずです。
ru: Оба эти значения можно найти в документации к вашему бэкенду сборки или получить из его интерфейса командной строки. Вам не придется настраивать эти параметры.
ta: இந்த இரண்டு மதிப்புகளும் உங்கள் உருவாக்க பின்தளத்தில் ஆவணங்கள் மூலம் வழங்கப்படும், அல்லது அதன் கட்டளை வரி இடைமுகத்தால் உருவாக்கப்படும். இந்த அமைப்புகளைத் தனிப்பயனாக்க வேண்டிய அவசியமில்லை.

source: Additional configuration of the build tool will either be in a ``tool`` section of the ``pyproject.toml``, or in a special file defined by the build tool. For example, when using ``setuptools`` as your build backend, additional configuration may be added to a ``setup.py`` or ``setup.cfg`` file, and specifying ``setuptools.build_meta`` in your build allows the tools to locate and use these automatically.
ja: ビルドツールの追加の設定は、 ``pyproject.toml`` の ``tool`` セクションか、ビルドツールによって定義された特別なファイルの中にあるでしょう。例えば、ビルドバックエンドとして ``setuptools`` を使う時には、追加の設定を ``setup.py`` ないし ``setup.cfg`` ファイルに追加してもよく、ビルド中に ``setuptools.build_meta`` を指定することでツールに対してこれらを自動的に探索して使うようにできます。
ru: Дополнительная конфигурация инструмента сборки будет находиться либо в секции ``tool`` в файле ``pyproject.toml``, либо в специальном файле, определяемом инструментом сборки. Например, при использовании ``setuptools`` в качестве бэкенда сборки, дополнительные настройки могут быть добавлены в файл ``setup.py`` или ``setup.cfg``, а указание ``setuptools.build_meta`` в вашей сборке позволяет инструментам автоматически находить и использовать их.
ta: உருவாக்க கருவியின் கூடுதல் உள்ளமைவு `` pyproject.toml`` இன் `` கருவி` பிரிவில் அல்லது உருவாக்க கருவியால் வரையறுக்கப்பட்ட சிறப்பு கோப்பில் இருக்கும். எடுத்துக்காட்டாக, `` செடிப்டூல்ச்`` ஐ உங்கள் உருவாக்க பின்தளத்தில் பயன்படுத்தும் போது, கூடுதல் உள்ளமைவு ஒரு `` setup.py`` அல்லது `` setup.cfg`` கோப்பில் சேர்க்கப்படலாம், மேலும் `` setuptools.build_meta` ஐக் குறிப்பிடுவது உங்கள் கட்டமைப்பில் கருவிகளை தானாகவே பயன்படுத்தவும் பயன்படுத்தவும் அனுமதிக்கிறது.

source: Configuring metadata
eo: Agordi metadatenojn
ja: メタデータを設定する
pt_br: Configurando metadados
ru: Конфигурирование метаданных
ta: மெட்டாடேட்டாவை உள்ளமைத்தல்
