Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: :ref:`Pipenv` is a dependency manager for Python projects. If you're familiar with Node.js' `npm`_ or Ruby's `bundler`_, it is similar in spirit to those tools. While :ref:`pip` alone is often sufficient for personal use, Pipenv is recommended for collaborative projects as it's a higher-level tool that simplifies dependency management for common use cases.
eo: :ref:`Pipenv` estas dependeco-administrilo por Python-projekto. Se vi konas `npm`_ de Node.js aŭ `bundler`_ de Ruby, ĝi estas simila en spirito al tiuj iloj. Dum :ref:`pip` sola ofte sufiĉas por persona uzado, Pipenv estas rekomendata por kunlabora projekto, ĉar ĝi estas altnivela ilo simpliganta administradon de dependecoj por oftaj uzkazoj.
ja: :ref:`Pipenv` は Python のプロジェクトの依存関係を管理するツールです。 Node.js での `npm`_ や Ruby の `bundler`_ を知っているなら、意図するところはこれらのツールと同じです。個人で使う分には :ref:`pip` さえあれば十分であることが多いですが、共同作業を伴うプロジェクトでは、多くのユースケースにおいて依存関係管理を単純化する上位のツールとして Pipenv が推奨されています。
pt_br: :ref:`Pipenv` é um gerenciador de dependências para projetos Python. Se você está familiarizado com o `npm`_ do Node.js ou o `bundler`_ do Ruby, é semelhante em espírito a essas ferramentas. Enquanto :ref:`pip` por si só costuma ser suficiente para uso pessoal, Pipenv é recomendado para projetos colaborativos por ser uma ferramenta de nível superior que simplifica o gerenciamento de dependências para casos de uso comuns.
ru: :ref:`Pipenv` - это менеджер зависимостей для Python-проектов. Если вы знакомы с `npm`_ в Node.js или `bundler`_ в Ruby, то он схож по духу с этими инструментами. Хотя для личного использования часто достаточно одного :ref:`pip`, Pipenv рекомендуется для совместных проектов, так как это инструмент более высокого уровня, который упрощает управление зависимостями для общих случаев использования.
ta: : குறிப்பு: `பைபென்வ்` பைதான் திட்டங்களுக்கான சார்பு மேலாளர். Node.js 'npm`_ அல்லது ரூபியின் `பண்ட்லர்`_ உடன் உங்களுக்கு தெரிந்திருந்தால், அது அந்தக் கருவிகளுக்கு ஆவிக்கு ஒத்ததாகும். அதே நேரத்தில்: ref: `பிப்` மட்டும் பெரும்பாலும் தனிப்பட்ட பயன்பாட்டிற்கு போதுமானது, கூட்டு திட்டங்களுக்கு பைபென்வி பரிந்துரைக்கப்படுகிறது, ஏனெனில் இது பொதுவான பயன்பாட்டு நிகழ்வுகளுக்கு சார்பு நிர்வாகத்தை எளிதாக்கும் உயர் மட்ட கருவியாகும்.

source: Use ``pip`` to install Pipenv:
eo: Uzi ``pip`` por instali Pipenv:
ja: ``pip`` を使って Pipenv をインストールする:
pt_br: Use ``pip`` para instalar Pipenv:
ru: Используйте ``pip`` для установки Pipenv:
ta: பைபென்வை நிறுவ `` பிப்`` ஐப் பயன்படுத்தவும்:

source: This does a `user installation`_ to prevent breaking any system-wide packages. If ``pipenv`` isn't available in your shell after installation, you'll need to add the :py:data:`user base <python:site.USER_BASE>`'s binary directory to your ``PATH``. See :ref:`Installing to the User Site` for more information.
ja: これは、システムワイドにインストールされたパッケージ群を破壊しないように、 `ユーザインストール <user installation>`_ を行います。インストール後にシェルから ``pipenv`` が利用できない場合は、 :py:data:`ユーザベース <python:site.USER_BASE>` のバイナリディレクトリを ``PATH`` 変数に追加する必要があるでしょう。詳しくは、 :ref:`ユーザサイトにインストールする <Installing to the User Site>` を見てください。
pt_br: fIsso faz uma `instalação do usuário`_ para evitar quebrar qualquer pacote do sistema. Se ``pipenv`` não estiver disponível em seu shell após a instalação, você precisará adicionar o diretório binário da :py:data:`base de usuário <python:site.USER_BASE>` ao seu ``PATH``. Veja :ref:`Instalando no Site do Usuário <Installing to the User Site>` para mais informações.
ru: При этом выполняется ``пользовательская установка``, чтобы не нарушить общесистемные пакеты. Если ``pipenv`` недоступен в вашей оболочке после установки, вам нужно добавить бинарную директорию :py:data:`user base <python:site.USER_BASE>` в ваш ``PATH``. Дополнительную информацию см. в разделе :ref:`Установка на сайт пользователя`.
ta: எந்தவொரு கணினி அளவிலான தொகுப்புகளையும் உடைப்பதைத் தடுக்க இது `பயனர் நிறுவல்`_ செய்கிறது. நிறுவலுக்குப் பிறகு உங்கள் செல்லில் `` பைபென்வ்`` கிடைக்கவில்லை என்றால், நீங்கள்: py: தரவு: `பயனர் அடிப்படை <பைதான்: site.user_base>` இன் பைனரி அடைவு உங்கள் `` பாதை`` சேர்க்க வேண்டும். காண்க: குறிப்பு: `பயனர் தளத்திற்கு நிறுவுதல்` மேலும் தகவலுக்கு.

source: Installing packages for your project
eo: Instali pakojn por via projekto
ja: プロジェクト用にパッケージをインストールする
pt_br: Instalando pacotes para seu projeto
ru: Установка пакетов для вашего проекта
ta: உங்கள் திட்டத்திற்கான தொகுப்புகளை நிறுவுதல்

source: Pipenv manages dependencies on a per-project basis. To install packages, change into your project's directory (or just an empty directory for this tutorial) and run:
eo: Pipenv administras dependecojn por projekto. Por instali pakon, iru al la dosierujo de via projekto (aŭ malplena dosierujo por ĉi tiu lernilo), kaj rulu la jenon:
ja: Pipenv は、プロジェクト毎に依存関係を管理します。パッケージをインストールするには、まずプロジェクト (このチュートリアル用にはからのディレクトリへ行けば十分) のディレクトリへ行って、以下のコマンドを実行してください:
pt_br: O Pipenv gerencia dependências por projeto. Para instalar pacotes, mude para o diretório do seu projeto (ou apenas um diretório vazio para este tutorial) e execute:
ru: Pipenv управляет зависимостями на основе каждого проекта. Чтобы установить пакеты, перейдите в каталог вашего проекта (или просто в пустой каталог для этого руководства) и выполните команду:
ta: PIPENV ஒரு திட்டத்தின் அடிப்படையில் சார்புகளை நிர்வகிக்கிறது. தொகுப்புகளை நிறுவ, உங்கள் திட்டத்தின் கோப்பகத்தில் மாற்றவும் (அல்லது இந்த டுடோரியலுக்கான வெற்று அடைவு) மற்றும் இயக்கவும்:

source: Pipenv will install the `Requests`_ library and create a ``Pipfile`` for you in your project's directory. The :ref:`Pipfile` is used to track which dependencies your project needs in case you need to re-install them, such as when you share your project with others. You should get output similar to this (although the exact paths shown will vary):
eo: Pipenv instalos la bibliotekon `Requests`_ kaj kreos la dosieron ``Pipfile`` por vi en la projekta dosierujo. :ref:`Pipfile` registras la dependecojn postulatajn de via projekto, kiam oni volas reinstali ilin, ekzemple kiam vi sendas vian projekton al aliuloj. Vi ricevos eligaĵon similan al la jeno (kvankam la precizaj dosierlokoj diferencos):
ja: Pipenv は、 `Requests`_ ライブラリをインストールし、プロジェクトのディレクトリに ``Pipfile`` を作成するでしょう。 :ref:`Pipfile` は、そのプロジェクトを共有している場合などのように、再インストールが必要な時にそのプロジェクトが必要とする依存関係を追跡するために使われます。 (正確なディレクトリパスは変化するとしても) これに似た出力が表示されるべきです:
pt_br: Pipenv irá instalar a biblioteca `Requests`_ e criar um ``Pipfile`` para você no diretório do seu projeto. O :ref:`Pipfile` é usado para rastrear quais dependências seu projeto precisa no caso de você precisar reinstalá-las, como quando você compartilha seu projeto com outras pessoas. Você deve obter uma saída semelhante a esta (embora os caminhos exatos mostrados variem):
ru: Pipenv установит библиотеку `Requests`_ и создаст для вас ``Pipfile`` в каталоге вашего проекта. Этот :ref:`Pipfile` используется для отслеживания зависимостей, необходимых вашему проекту, на случай, если вам понадобится их переустановить, например, когда вы делитесь своим проектом с другими. Вы должны получить результат, похожий на этот (хотя точные пути могут отличаться):
ta: பைபென்வி `கோரிக்கைகள்`_ நூலகத்தை நிறுவி, உங்கள் திட்டத்தின் கோப்பகத்தில் உங்களுக்காக ஒரு` `பிப்ஃபைல்`` உருவாக்கும். தி: ரெஃப்: `பிப்ஃபைல்` உங்கள் திட்டத்தை நீங்கள் மீண்டும் நிறுவ வேண்டியிருந்தால், உங்கள் திட்டத்தை மற்றவர்களுடன் பகிர்ந்து கொள்ளும்போது அவற்றை மீண்டும் நிறுவ வேண்டும் என்பதைக் கண்காணிக்க பயன்படுத்தப்படுகிறது. இதைப் போன்ற வெளியீட்டை நீங்கள் பெற வேண்டும் (காட்டப்பட்டுள்ள சரியான பாதைகள் மாறுபடும் என்றாலும்):

source: Using installed packages
eo: Uzi instalitajn pakojn
ja: インストール済みのパッケージを使う
pt_br: Usando pacotes instalados
ru: Использование установленных пакетов
ta: நிறுவப்பட்ட தொகுப்புகளைப் பயன்படுத்துதல்

source: Now that Requests is installed you can create a simple :file:`main.py` file to use it:
eo: Post instalo de Requests, vi povas krei simplan dosieron :file:`main.py` por uzi ĝin:
ja: 今や、Requests がインストールされたので、それを使うために単純な :file:`main.py` ファイルを作成しましょう:
pt_br: Agora que Requests está instalado você pode criar um :file:`main.py` simples para usá-lo:
ru: Теперь, когда Requests установлен, вы можете создать простой файл :file:`main.py` для его использования:
ta: இப்போது கோரிக்கைகள் நிறுவப்பட்டுள்ளன, நீங்கள் ஒரு எளிய: கோப்பு: `main.py` கோப்பைப் பயன்படுத்தலாம்:

source: Then you can run this script using ``pipenv run``:
eo: Poste vi povas ruli la programon per ``pipenv run``:
ja: 続いて ``pipenv run`` を使ってこのスクリプトを走らせます:
pt_br: Então, você pode executar este script usando ``pipenv run``:
ru: Затем вы можете запустить этот скрипт с помощью ``pipenv run``:
ta: `` பைபென்வ் ரன்`` ஐப் பயன்படுத்தி இந்த ச்கிரிப்டை இயக்கலாம்:

source: You should get output similar to this:
eo: Vi ricevos eligaĵon simila al la jeno:
ja: 大体こんな感じの出力が得られるはずです:
pt_br: Você deve obter uma saída similar a esta:
ru: Вы должны получить результат, похожий на этот:
ta: இதைப் போன்ற வெளியீட்டை நீங்கள் பெற வேண்டும்:

source: Using ``pipenv run`` ensures that your installed packages are available to your script. It's also possible to spawn a new shell that ensures all commands have access to your installed packages with ``pipenv shell``.
eo: Uzo de ``pipenv run`` certigas, ke via programo povas atingi viajn instalitajn pakojn. Ankaŭ vi povas lanĉi novan ŝelon per ``pipenv shell``certigante, ke viaj komandoj povas atingi viajn instalitajn pakojn.
ja: ``pipenv run`` を使うことで、インストール済みのパッケージを確実にスクリプトから利用できるようになります。``pipenv shell`` で新しいシェルを立ち上げれば、あらゆるコマンドからインストール済みパッケージへのアクセスが保証されます。
pt_br: Usar ``pipenv run`` garante que seus pacotes instalados estejam disponíveis para seu script. Também é possível gerar um novo shell que garante que todos os comandos tenham acesso aos seus pacotes instalados com ``pipenv shell``.
ru: Использование ``pipenv run`` гарантирует, что установленные пакеты будут доступны вашему скрипту. Также можно породить новую оболочку, которая обеспечит доступ всех команд к установленным пакетам с помощью ``pipenv shell``.
ta: `` பைபென்வ் ரன்`` ஐப் பயன்படுத்துவது உங்கள் நிறுவப்பட்ட தொகுப்புகள் உங்கள் ச்கிரிப்ட்டில் கிடைப்பதை உறுதி செய்கிறது. `` பைபென்வ் செல்`` உடன் உங்கள் நிறுவப்பட்ட தொகுப்புகளுக்கு அனைத்து கட்டளைகளும் அணுகுவதை உறுதி செய்யும் ஒரு புதிய செல்லை உருவாக்கவும் முடியும்.

source: Next steps
eo: Sekvaj paŝoj
ja: 次なる一歩
pt_br: Próximos passos
ru: Следующие шаги
ta: அடுத்த படிகள்

source: Congratulations, you now know how to effectively manage dependencies and development environments on a collaborative Python project! ✨ 🍰 ✨
eo: Gratulon, vi nun scias kiel efektive administri dependecojn kaj evoluajn mediojn en kulabora Python-projekto! ✨ 🍰 ✨
ja: おめでとう、今やあなたは、共同作業を必要とする Python プロジェクトにおいて、依存関係や開発環境を効率良く管理する方法をご存知です！✨ 🍰 ✨
pt_br: Parabéns, agora você sabe como gerenciar dependências e ambientes de desenvolvimento com eficácia em um projeto colaborativo Python! ✨ 🍰 ✨
ru: Поздравляем, теперь вы знаете, как эффективно управлять зависимостями и средами разработки в совместном проекте на Python! ✨ 🍰 ✨
ta: வாழ்த்துக்கள், கூட்டு பைதான் திட்டத்தில் சார்புநிலைகள் மற்றும் மேம்பாட்டு சூழல்களை எவ்வாறு திறம்பட நிர்வகிப்பது என்பது இப்போது உங்களுக்குத் தெரியும்! ✨

source: If you're interested in creating and distributing your own Python packages, see the :ref:`tutorial on packaging and distributing packages <distributing-packages>`.
eo: Se vi interesiĝas krei kaj distribui vian propran Python-pakon, vidu la :ref:`lernilon pri kreado kaj distribuado de pakoj <distributing-packages>`.
ja: 自分で Python パッケージを作成したり配布したりすることに興味があるなら、 :ref:`パッケージングとパッケージ配布のためのチュートリアル <distributing-packages>` を見てください。
pt_br: Se você estiver interessado em criar e distribuir seus próprios pacotes Python, veja o :ref:`tutorial sobre empacotamento e distribuição de pacotes <distributing-packages>`.
ru: Если вы заинтересованы в создании и распространении собственных пакетов Python, смотрите :ref:`учебник по упаковке и распространению пакетов <distributing-packages>`.
ta: உங்கள் சொந்த பைதான் தொகுப்புகளை உருவாக்கி விநியோகிப்பதில் நீங்கள் ஆர்வமாக இருந்தால், இதைக் காண்க: குறிப்பு: `தொகுப்புகளை பேக்கேசிங் மற்றும் விநியோகித்தல் பற்றிய பயிற்சி <விநியோகிக்கும் பேக்கேச்கள்>`.

source: Note that when your application includes definitions of Python source packages, they (and their dependencies) can be added to your ``pipenv`` environment with ``pipenv install -e <relative-path-to-source-directory>`` (e.g. ``pipenv install -e .`` or ``pipenv install -e src``).
eo: Nodu, ke se via programo inkluzivas difinojn de Python-fontpakojn, oni povas aldoni ilin (kaj iliajn dependaĵojn) al la medio ``pipenv`` per ``pipenv install -e <relativa-dosierloko-de-fonta-dosierujo>`` (ekz. ``pipinstall -e .`` aŭ ``pipenv install -e src``).
ja: あなたのアプリケーションが Python ソースコードパッケージの定義を含んでいる場合には、 ``pipenv install -e <relative-path-to-source-directory>`` (例えば ``pipenv install -e .`` や ``pipenv install -e src``) によって、 (その依存先も含めて) それがあなたの ``pipenv`` 環境にインストールされ得ることに注意してください。
pt_br: Observe que quando sua aplicação inclui definições de pacotes fonte do Python, elas (e suas dependências) podem ser adicionadas ao seu ambiente de ``pipenv`` com ``pipenv install -e <caminho-relativo-ao-diretório-fonte>`` (por exemplo, ``pipenv install -e .`` ou ``pipenv install -e src``).
ru: Обратите внимание, что если ваше приложение включает определения пакетов с исходным кодом Python, они (и их зависимости) могут быть добавлены в ваше окружение ``pipenv`` с помощью ``pipenv install -e <относительный-патч-к-директории-источника>`` (например, ``pipenv install -e .`` или ``pipenv install -e src``).
ta: உங்கள் பயன்பாட்டில் பைதான் மூல தொகுப்புகளின் வரையறைகளை உள்ளடக்கியிருக்கும் போது, அவை (மற்றும் அவற்றின் சார்புகளை) `` பைபென்வ்`` சூழலில் `` பைபென்வ் நிறுவல் -இ <உறவினர்-பாதை-க்கு-மூல-நேரடி> `` (எ.கா.

source: Other Tools for Application Dependency Management
eo: Aliaj Iloj por Administri Programan Dependecon
ja: アプリケーションの依存関係管理のためのその他のツール
pt_br: Outras ferramentas para gerenciamento de dependências de aplicações
ru: Другие инструменты для управления зависимостями приложений
ta: பயன்பாட்டு சார்பு நிர்வாகத்திற்கான பிற கருவிகள்

source: If you find this particular approach to managing application dependencies isn't working well for you or your use case, you may want to explore these other tools and techniques, listed in alphabetical order, to see if one of them is a better fit:
ja: アプリケーションの依存関係管理で、あなたのユースケースではこの特定のアプローチがあまりうまく働かないことがわかったならば、この後にアルファベット順に列挙する他のツール群やテクニックがより上手く使えるかどうか試してみたくなるかもしれません:
pt_br: Se você achar que essa abordagem específica para gerenciar dependências de aplicações não está funcionando bem para você ou seu caso de uso, convém explorar essas outras ferramentas e técnicas, listadas em ordem alfabética, para ver se uma delas se encaixa melhor:
ru: Если вы обнаружите, что этот конкретный подход к управлению зависимостями приложений не подходит вам или вашему сценарию использования, вы можете изучить другие инструменты и методы, перечисленные в алфавитном порядке, чтобы понять, не подходит ли вам один из них:
ta: பயன்பாட்டு சார்புகளை நிர்வகிப்பதற்கான இந்த குறிப்பிட்ட அணுகுமுறையை நீங்கள் கண்டறிந்தால் அல்லது உங்கள் பயன்பாட்டு வழக்குக்கு சரியாக வேலை செய்யாது என்றால், அவற்றில் ஒன்று சிறந்த பொருத்தமாக இருக்கிறதா என்று பார்க்க, அகர வரிசைப்படி பட்டியலிடப்பட்டுள்ள இந்த பிற கருவிகள் மற்றும் நுட்பங்களை நீங்கள் ஆராய விரும்பலாம்:

source: `hatch <https://github.com/pypa/hatch>`_ for opinionated coverage of even more steps in the project management workflow, such as incrementing versions and creating new skeleton projects from project templates.
eo: `hatch <https://github.com/pypa/hatch>`_ por opiniriĉa subtenado de eĉ pli da paŝoj en la projekta mastruma laborluo, kiel alkrementado de versio kaj kreado de nova projekto el projekto-ŝablono.
ja: `hatch <https://github.com/pypa/hatch>`_ は、プロジェクト管理のワークフローにおいて、バージョン番号の増やし方やテンプレートから新しいスケルトンプロジェクトを作成するやり方など、ステップ数は増えてもこだわりのあるやり方でやろうとするツールです。
pt_br: `hatch <https://github.com/pypa/hatch>`_ para uma cobertura opinativa de ainda mais etapas no fluxo de trabalho de gerenciamento de projeto, como incrementar versões e criar novos projetos básicos a partir de modelos de projeto.
ru: `hatch <https://github.com/pypa/hatch>`_ для подробного освещения еще большего количества шагов в рабочем процессе управления проектами, таких как инкремент версий и создание новых скелетных проектов из шаблонов проектов.
ta: `அட்ச் <https://github.com/pypa/hatch>` _ திட்ட மேலாண்மை பணிப்பாய்வுகளில் இன்னும் அதிகமான படிகளைப் பற்றிய கருத்துக்களுக்காக, பதிப்புகளை அதிகரித்தல் மற்றும் திட்ட வார்ப்புருக்களிலிருந்து புதிய எலும்புக்கூடு திட்டங்களை உருவாக்குவது போன்றவை.

source: `micropipenv <https://github.com/thoth-station/micropipenv>`_ for a lightweight wrapper around pip that supports ``requirements.txt``, Pipenv and Poetry lock files, or converting them to pip-tools compatible output. Designed for containerized Python applications, but not limited to them.
eo: `micropipenv <https://github.com/thoth-station/micropipenv>`_ por leĝera volvilo ĉirkaŭ pip subtenanta ``requirements.txt``, Pipenv- kaj Poetry-serurdosieroj, kaj konvertado al formo kongrua kun pip-tools. Fasonita por, sed ne nur por, enujigita Python-programo.
ja: `micropipenv <https://github.com/thoth-station/micropipenv>`_ は、 pip に対する軽量のラッパで ``requirements.txt`` や Pipenv や Poetry のロックファイル、あるいはそれらを pip ツールと互換性のある形への変換出力をサポートするツールです。コンテナ化された Python アプリケーションのために設計されましたが、用途はそれに限りません。
pt_br: micropipenv <https://github.com/thoth-station/micropipenv>`_ para um invólucro leve do pip que oferece suporte a ``requirements.txt``, arquivos de bloqueio de Pipenv e de Poetry ou convertê-los em saída compatível com pip-tools. Projetado para aplicações em contêineres Python, mas não se limitando a elas.
ru: `micropipenv <https://github.com/thoth-station/micropipenv>`_ для легковесной обертки вокруг pip, поддерживающей файлы ``requirements.txt``, Pipenv и Poetry lock, или конвертирующей их в совместимый с pip-tools вывод. Предназначена для контейнерных Python-приложений, но не ограничивается ими.
ta: `மைக்ரோபிபென்வ் <https://github.com/thoth-station/micropipenv>` _ `` தேவைகள். Txt``, பைபன்வி மற்றும் பா பூட்டு கோப்புகளை ஆதரிக்கும் அல்லது அவற்றை பிப்-குழாய்களுக்கு இணக்கமான வெளியீட்டிற்கு மாற்றும் பி.ஐ.பி. கொள்கலன் செய்யப்பட்ட பைதான் பயன்பாடுகளுக்காக வடிவமைக்கப்பட்டுள்ளது, ஆனால் அவற்றுடன் மட்டுப்படுத்தப்படவில்லை.

source: `PDM <https://github.com/pdm-project/pdm>`_ for a modern Python package management relying on standards such as :pep:`517` and :pep:`621`.
eo: `PDM <https://github.com/pdm-project/pdm>`_ por moderna Python-pakadministrado per normoj kiel :pep:`517` kaj :pep:`621`.
ja: `PDM <https://github.com/pdm-project/pdm>`_ は、 :pep:`517` や :pep:`621` のような標準に立脚した近代的な Python パッケージ管理ツールです。
ru: `PDM <https://github.com/pdm-project/pdm>`_ для современного управления пакетами Python, опирающегося на такие стандарты, как :pep:`517` и :pep:`621`.
ta: `Pdm <https://github.com/pdm-project/pdm>` _ போன்ற தரங்களை நம்பியிருக்கும் நவீன பைதான் தொகுப்பு நிர்வாகத்திற்கு: PEP: `517` மற்றும்: PEP:` 621`.

source: `pip-tools <https://github.com/jazzband/pip-tools>`_ for creating a lock file of all dependencies from a list of packages directly used in a project, and ensuring that only those dependencies are installed.
eo: `pip-tools <https://github.com/jazzband/pip-tools>`_ por krei serurdosieron de ĉiuj dependaĵoj el listo de pakoj rekte uzataj en projekto, certigante, ke nur tiuj dependaĵoj estas instalitaj.
ja: `pip-tools <https://github.com/jazzband/pip-tools>`_ は、プロジェクト内で直接使われているパッケージのリストから全ての依存関係のロックファイルを生成するツールで、依存関係に現れるものだけがインストールされていることを保証します。
pt_br: `pip-tools <https://github.com/jazzband/pip-tools>`_ para criar um arquivo de bloqueio de todas as dependências de uma lista de pacotes usados diretamente em um projeto e garantir que apenas essas dependências estão instalados.
ru: `pip-tools <https://github.com/jazzband/pip-tools>`_ для создания файла блокировки всех зависимостей из списка пакетов, непосредственно используемых в проекте, и обеспечения установки только этих зависимостей.
ta: `பிப்-டூல்ச் <https://github.com/jazzband/pip-tools>` _ ஒரு திட்டத்தில் நேரடியாகப் பயன்படுத்தப்படும் தொகுப்புகளின் பட்டியலிலிருந்து அனைத்து சார்புகளின் பூட்டுக் கோப்பை உருவாக்குவதற்கும், அந்த சார்புகள் மட்டுமே நிறுவப்பட்டிருப்பதை உறுதி செய்வதற்கும்.

source: `Poetry <https://github.com/python-poetry/poetry>`__ for a tool comparable in scope to Pipenv that focuses more directly on use cases where the project being managed is structured as a distributable Python package with a valid ``pyproject.toml`` file. By contrast, Pipenv explicitly avoids making the assumption that the application being worked on will support distribution as a ``pip``-installable Python package.
eo: `Poetry <https://github.com/python-poetry/poetry>`__ por ilo de simila utilo al Pipenv, kiu pli temas pri tiuj uzkazoj, kie la administrata projekto estas strukturita kiel distribuebla Python-pako kun valida dosiero ``pyproject.toml``. Malkiele, Pipenv eksplicite ne supozas, ke la administrata programo estas distribuebla kiel ``pip``-instalebla Python-pako.
ja: `Poetry <https://github.com/python-poetry/poetry>`__ は、そのカバーする範囲という点で Pipenv と互換性のあるツールで、 ``pyproject.toml`` ファイルを使った配布可能な Python パッケージとしてプロジェクト管理のユースケースが構成されている場合にもっと直接に使用することに焦点を当てたものです。これとは対照的に、 Pipenv は明示的に、 (開発) 作業中のアプリケーションが ``pip`` でインストール可能な Python パッケージとしての配布をサポートしているという仮定を置くことを避けています。
pt_br: `Poetry <https://github.com/python-poetry/poetry>`__ para uma ferramenta comparável em escopo a Pipenv que se concentra mais diretamente em casos de uso onde o projeto sendo gerenciado é estruturado como um pacote Python distribuível com um arquivo ``pyproject.toml`` válido. Por outro lado, Pipenv explicitamente evita fazer a suposição de que a aplicação na qual está sendo trabalhada será compatível com a distribuição como um pacote Python instalável com ``pip``.
ru: `Poetry <https://github.com/python-poetry/poetry>`__ для инструмента, сопоставимого с Pipenv по масштабу, который в большей степени ориентирован на случаи использования, когда управляемый проект структурирован как распространяемый пакет Python с действительным файлом ``pyproject.toml``. В отличие от этого, Pipenv явно избегает предположений о том, что приложение, над которым ведется работа, будет поддерживать распространение в виде ``pip``-инсталлируемого Python-пакета.
ta: `கவிதை <https://github.com/python-poetry/poetry>` __ __ __ PIPENV உடன் ஒப்பிடக்கூடிய ஒரு கருவிக்கு, நிர்வகிக்கப்படும் திட்டம் ஒரு செல்லுபடியாகும் `` pyproject.tomll`` `கோப்புடன் விநியோகிக்கக்கூடிய பைதான் தொகுப்பாக கட்டமைக்கப்பட்ட பயன்பாட்டு நிகழ்வுகளில் நேரடியாக கவனம் செலுத்துகிறது. இதற்கு நேர்மாறாக, பிபென்வ் வெளிப்படையாக வேலை செய்யப்படும் பயன்பாடு விநியோக விநியோகத்தை `` பிப்`` நிறுவக்கூடிய பைதான் தொகுப்பாக ஆதரிக்கும் என்ற அனுமானத்தை செய்வதைத் தவிர்க்கிறது.

source: Packaging Python Projects
eo: Paki projektojn de Python
ja: Python のプロジェクトをパッケージングする
pt_br: Empacotando projetos Python
ru: Упаковка Python'ьих проектов
ta: பேக்கேசிங் பைதான் திட்டங்கள்
