Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: For more information, see the :doc:`venv <python:library/venv>` docs or the :doc:`virtualenv <virtualenv:index>` docs.
eo: Plir pliaj informoj, vidu la dokumentaron pri :doc:`venv <python:library/venv>` aŭ la dokumentaron pri :doc:`virtualenv <virtualenv:index>`.
ja: さらなる説明は、 :doc:`venv <python:library/venv>` の説明文書や :doc:`virtualenv <virtualenv:index>` の説明文書をみてください。
pt_br: Para mais informações, veja a documentação do :doc:`venv <python:library/venv>` ou do :doc:`virtualenv <virtualenv:index>`.
ru: Дополнительную информацию можно найти в документах :doc:`venv <python:library/venv>` или :doc:`virtualenv <virtualenv:index>`.
ta: மேலும் தகவலுக்கு, டி.ஓ.சி: `வெவி <பைதான்: நூலகம்/வென்வ்>` டாக்ச் அல்லது தி: டாக்: `மெய்நிகர் ஈவ் <மெய்நிகர் ஈன்வ்: குறியீட்டு>` டாக்ச் ஆகியவற்றைக் காண்க.

source: The use of :command:`source` under Unix shells ensures that the virtual environment's variables are set within the current shell, and not in a subprocess (which then disappears, having no useful effect).
eo: La uzo de :command:`source` en Unikseca ŝelo certigas, ke la variabloj de la virtuala medio estas agorditaj ene de la aktuala ŝelo kaj ne en subprocezo (kiu poste malaperos kaj estos efikinte neniel).
ja: UNIX のシェル上で :command:`source` を使うとそのシェル内では仮想環境用の変数が設定されますが、サブシェルでは設定され (ず、役に立つ効果が残り) ません。
pt_br: O uso de :command:`source` em shells Unix garante que as variáveis do ambiente virtual sejam definidas dentro do shell atual, e não em um subprocesso (que então desaparece, sem nenhum efeito útil).
ru: Использование :command:`source` в оболочках Unix гарантирует, что переменные виртуального окружения будут установлены в текущей оболочке, а не в подпроцессе (который затем исчезает, не оказывая никакого полезного воздействия).
ta: இதன் பயன்பாடு: கட்டளை: `மூல` யூனிக்ச் செல்களின் கீழ் மெய்நிகர் சூழலின் மாறிகள் தற்போதைய செல்லுக்குள் அமைக்கப்பட்டிருப்பதை உறுதி செய்கிறது, ஆனால் ஒரு துணை செயலாக்கத்தில் அல்ல (பின்னர் அது மறைந்துவிடும், பயனுள்ள விளைவு இல்லை).

source: In both of the above cases, Windows users should *not* use the :command:`source` command, but should rather run the :command:`activate` script directly from the command shell like so:
eo: En ambaŭ ĉi-supraj kazoj, uzanto de Windows *ne* uzu la komandon :command:`source`, sed preferu ruli la programeton :command:`activate` rekte en la komanda ŝelo jene:
ja: 上記のいずれの場合でも、 Windows ユーザは :command:`source` コマンドを使うべき *ではなく* 、代わりに :command:`activate` スクリプトをコマンドシェルから直接に実行するべきで、例えば次のようにします:
ru: В обоих случаях пользователям Windows не следует использовать команду :command:`source`, а лучше запустить скрипт :command:`activate` непосредственно из командной оболочки, как показано выше:
ta: மேலே உள்ள இரண்டு நிகழ்வுகளிலும், சாளரங்கள் பயனர்கள் * பயன்படுத்தக்கூடாது * பயன்படுத்தக்கூடாது: கட்டளை: `மூல` கட்டளை, மாறாக: கட்டளையை இயக்க வேண்டும்:` ச்கிரிப்டை நேரடியாக கட்டளை செல்லிலிருந்து நேரடியாக ச்கிரிப்டை இயக்கவும்:

source: Managing multiple virtual environments directly can become tedious, so the :ref:`dependency management tutorial <managing-dependencies>` introduces a higher level tool, :ref:`Pipenv`, that automatically manages a separate virtual environment for each project and application that you work on.
eo: Rekta administrado de multaj virtualaj medioj tedas, kaj la :ref:`lernilo pri administrado de dependecoj <managing-dependencies>` enkondukas plialtnivelan ilon :ref:`Pipenv`, kiu aŭtomate administras po unu aparta virtuala medio por ĉiu projekto aŭ programo evoluigata de vi.
ja: 複数の仮想環境をそのままで管理することはうんざりする作業になりがちなので、 :ref:`依存関係を管理するためのチュートリアル <managing-dependencies>` では、より抽象度の高いツール :ref:`Pipenv` を使ってプロジェクトやアプリケーションのそれぞれのために作成した個別の仮想環境群を自動的に管理する方法を紹介しています。
pt_br: Gerenciar vários ambientes virtuais diretamente pode se tornar tedioso, então o :ref:`tutorial de gerenciamento de dependências <managing-dependencies>` apresenta uma ferramenta de alto nível, :ref:`Pipenv`, que gerencia automaticamente um ambiente virtual separado para cada projeto e aplicação no qual você trabalha.
ru: Непосредственное управление несколькими виртуальными средами может стать утомительным, поэтому в учебнике по управлению зависимостями <managing-dependencies>` представлен инструмент более высокого уровня, :ref:`Pipenv`, который автоматически управляет отдельной виртуальной средой для каждого проекта и приложения, над которым вы работаете.
ta: பல மெய்நிகர் சூழல்களை நேரடியாக நிர்வகிப்பது சிரமமாக மாறும், எனவே: ref: `சார்பு மேலாண்மை பயிற்சி <நிர்வாக-சார்புநிலைகள்>` ஒரு உயர் மட்ட கருவியை அறிமுகப்படுத்துகிறது,: re: `பைபென்வ்`, நீங்கள் பணிபுரியும் ஒவ்வொரு திட்டத்திற்கும் பயன்பாட்டிற்கும் ஒரு தனி மெய்நிகர் சூழலை தானாக நிர்வகிக்கிறது.

source: Use pip for Installing
eo: Uzu pip por instali
ja: pip を使ってインストールする
pt_br: Usar pip para instalação
ru: Используйте pip для установки
ta: நிறுவ PIP ஐப் பயன்படுத்தவும்

source: :ref:`pip` is the recommended installer. Below, we'll cover the most common usage scenarios. For more detail, see the :doc:`pip docs <pip:index>`, which includes a complete :doc:`Reference Guide <pip:cli/index>`.
eo: :ref:`pip` estas la rekomendata instalilo. Ĉi-sube, ni priskribos la plej oftajn uzkazojn. Por pli da detaloj, vidu :doc:`la dokumentaron de pip <pip:index>`, kiu inkluzivas plenan :doc:`Referencan Gvidilon <pip:cli/index>`.
ja: :ref:`pip` は推奨されているインストーラです。以下に最もよくある使用シナリオを挙げます。より詳しくは、 :doc:`リファレンスガイド <pip:cli/index>` の全体を含む :doc:`pip 説明文書 <pip:index>` を見てください。
pt_br: :ref:`pip` é o instalador recomendado. A seguir, cobriremos os cenários de uso mais comuns. Para obter mais detalhes, consulte a :doc:`documentação do pip <pip:index>`, que inclui um :doc:`Guia de Referências <pip:cli/index>` completo.
ru: :ref:`pip` - это рекомендуемая программа установки. Ниже мы рассмотрим наиболее распространенные сценарии использования. Более подробную информацию можно найти в :doc:`pip docs <pip:index>`, который включает в себя полное :doc:`Reference Guide <pip:cli/index>`.
ta: : ref: `பிப்` என்பது பரிந்துரைக்கப்பட்ட நிறுவி. கீழே, மிகவும் பொதுவான பயன்பாட்டு காட்சிகளை நாங்கள் உள்ளடக்குவோம். மேலும் விவரங்களுக்கு, டிஓசி: `பிஐபி டாக்ச் <பிப்: இன்டெக்ச்>`, இதில் முழுமையானது: டாக்: `குறிப்பு வழிகாட்டி <பிஐபி: சிஎல்ஐ/குறியீட்டு>` ஐப் பார்க்கவும்.

source: Installing from PyPI
eo: Instali el PyPI
ja: PyPI からインストールする
pt_br: Instalando a partir do PyPI
ru: Установка из PyPI
ta: PYPI இலிருந்து நிறுவுகிறது

source: The most common usage of :ref:`pip` is to install from the :term:`Python Package Index <Python Package Index (PyPI)>` using a :term:`requirement specifier <Requirement Specifier>`. Generally speaking, a requirement specifier is composed of a project name followed by an optional :term:`version specifier <Version Specifier>`. A full description of the supported specifiers can be found in the :ref:`Version specifier specification <version-specifiers>`. Below are some examples.
eo: La plej ofta uzmaniero de :ref:`pip` estas instalado el :term:`la Python-Pakindekso <Python Package Index (PyPI)>` per :term:`postulo-specifilo <Requirement Specifier>`. Ĝenerale, postulo-specifilo konsistas el projekta nomo sekvita de nedeviga :term:`versio-specifilo <Version Specifier>`. Plena priskribo de la permesataj specifiloj troviĝas en la :ref:`Normo pri versio-specifiloj <version-specifiers>`. Jen kelkaj ekzemploj.
ja: :ref:`pip` の最もよくある使い方は、 :term:`要求事項指定子 <Requirement Specifier>` を用いて :term:`Python パッケージインデックス <Python Package Index (PyPI)>` からインストールすることです。一般的には、要求事項識別子は、プロジェクト名と後続する省略可能な :term:`バージョン指定子 <Version Specifier>` で構成されています。 :ref:`バージョン指定子仕様 <version-specifiers>` に、サポートされている識別子の完全な説明があります。以下にいくつかの例を挙げます。
pt_br: O uso mais comum do :ref:`pip` é instalar a partir do :term:`Python Package Index <Python Package Index (PyPI)>` usando um :term:`especificador de requisitos <Especificador de Requisitos>`. De modo geral, um especificador de requisitos é composto de um nome de projeto seguido por um :term:`especificador de versão <Especificador de Versão>` opcional . A descrição completa dos especificadores suportados podem ser encontrados na :ref:`especificação de especificadores de versão <version-specifiers>`. Abaixo estão alguns exemplos.
ru: Чаще всего :ref:`pip` используется для установки из индекса пакетов :term:`Python <Python Package Index (PyPI)>` с помощью спецификатора требований :term:`Requirement Specifier <Requirement Specifier>`. Вообще говоря, спецификатор требований состоит из имени проекта, за которым следует необязательный :term:`спецификатор версии <Version Specifier>`. Полное описание поддерживаемых спецификаторов можно найти в спецификации :ref:`Version specifier <version-specifiers>`. Ниже приведены некоторые примеры.
ta: இதன் மிகவும் பொதுவான பயன்பாடு: ref: `பிப்` என்பது நிறுவல்: கால:` பைதான் தொகுப்பு குறியீட்டு <பைதான் தொகுப்பு குறியீட்டு (பைபி)> `ஒரு: காலத்தைப் பயன்படுத்துதல்:` தேவை விவரக்குறிப்பு <தேவை விவரக்குறிப்பு> `. பொதுவாக, ஒரு தேவை விவரக்குறிப்பு ஒரு திட்டப் பெயரை உள்ளடக்கியது, அதைத் தொடர்ந்து ஒரு விருப்ப: சொல்: `பதிப்பு விவரக்குறிப்பு <பதிப்பு விவரக்குறிப்பு>`. ஆதரிக்கப்பட்ட குறிப்பான்களின் முழு விளக்கத்தையும்: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>` இல் காணலாம். சில எடுத்துக்காட்டுகள் கீழே.

source: To install the latest version of "SomeProject":
eo: Por instali la plej novan version de «SomeProject»:
ja: "とあるプロジェクト" の最新版をインストールするには:
pt_br: Para instalar a versão mais recente de "SomeProject":
ru: Чтобы установить последнюю версию "SomeProject":
ta: "Forproject" இன் அண்மைக் கால பதிப்பை நிறுவ:

source: To install a specific version:
eo: Por instali specifan version:
ja: 特定のバージョンをインストールするには:
pt_br: Para instalar uma versão específica:
ru: Для установки определенной версии:
ta: ஒரு குறிப்பிட்ட பதிப்பை நிறுவ:

source: To install greater than or equal to one version and less than another:
eo: Por instali version ne malpli novan ol unu version kaj malpli novan ol alian:
ja: あるバージョンと同じか新しいバージョンで、もう一つのものより古いものをインストールするには:
pt_br: Para instalar maior ou igual a uma versão e menor que outra:
ru: Чтобы установить версию больше или равную одной и меньше другой:
ta: ஒரு பதிப்பை விட அதிகமாகவோ அல்லது சமமாகவோ நிறுவவும், மற்றொன்றை விட குறைவாகவும் நிறுவுதல்:

source: To install a version that's :ref:`compatible <version-specifiers-compatible-release>` with a certain version: [4]_
eo: Por instali version :ref:`kongruan <version-specifiers-compatible-release>` kun iu versio: [4]_
ja: あるバージョンと :ref:`"互換性がある" <version-specifiers-compatible-release>` バージョンをインストールするには: [4]_
ru: Чтобы установить версию, которая :ref:`совместима <version-specifiers-compatible-release>` с определенной версией: [4]_
ta: ஒரு பதிப்பை நிறுவ: குறிப்பு: `இணக்கமான <பதிப்பு-விவரிப்பாளர்கள்-இணக்கமான-வெளியீடு>` ஒரு குறிப்பிட்ட பதிப்போடு: [4] _

source: In this case, this means to install any version "==1.4.*" version that's also ">=1.4.2".
eo: Tiukaze, tio signifas instali ajnan version «==1.4.*» ankaŭ plenumantan «>=1.4.2».
ja: この場合には、 "==1.4.*" で、かつ、 ">=1.4.2" であるバージョンをインストールするという意味になります。
pt_br: Nesse caso, isso significa instalar qualquer versão "==1.4.*" que também seja ">=1.4.2".
ru: В данном случае это означает установку любой версии "==1.4.*", которая также ">=1.4.2".
ta: இந்த வழக்கில், "== 1.4.*" பதிப்பையும் நிறுவ வேண்டும் என்பதே இதன் பொருள் "> = 1.4.2".

source: Source Distributions vs Wheels
eo: Fonto-Distribuoj kontraste kun Wheel-oj
ja: ソースコード配布物 vs. Wheels
pt_br: Distribuições de fonte vs Wheels
ru: Дистрибутивы источников против колес
ta: மூல வழங்கல் Vs சக்கரங்கள்

source: :ref:`pip` can install from either :term:`Source Distributions (sdist) <Source Distribution (or "sdist")>` or :term:`Wheels <Wheel>`, but if both are present on PyPI, pip will prefer a compatible :term:`wheel <Wheel>`. You can override pip`s default behavior by e.g. using its :ref:`--no-binary <pip:install_--no-binary>` option.
eo: :ref:`pip` povas instali aŭ :term:`fontan distribuon (sdist) <Source Distribution (or "sdist")>` aŭ :term:`Wheel <Wheel>`. Se ambaŭ ekzistas ĉe PyPI, pip preferas kongruan :term:`wheel <Wheel>`. Oni povas ŝanĝi la aprioran konduton de pip per la flago :ref:`--no-binary <pip:install_--no-binary>`.
ja: :ref:`pip` は、 :term:`ソースコード配布物 (sdist) <Source Distribution (or "sdist")>` または :term:`Wheels <Wheel>` のどちらからでもインストールすることができますが、両方が PyPI に存在している場合には pip は互換性のある :term:`wheel <Wheel>` を選好します。例えば :ref:`--no-binary <pip:install_--no-binary>` オプションを使うことで pip のデフォルト動作を上書き修正することができます。
pt_br: :ref:`pip` pode instalar a partir de :term:`Distribuições Fonte (sdist) <Distribuição Fonte (ou "sdist")>` ou :term:`Wheels <Wheel>`, mas se ambos estiverem presentes no PyPI, pip irá preferir um :term:`wheel <Wheel>` compatível. Você pode substituir o comportamento padrão do pip, por exemplo usando sua opção :ref:`--no-binary <pip:install_--no-binary>`.
ru: :ref:`pip` может устанавливать как из :term:`Source Distributions (sdist) <Источниковый дистрибутив (или "sdist")>`, так и из :term:`Wheels <Wheel>`, но если оба присутствуют на PyPI, pip предпочтет совместимый :term:`wheel <Wheel>`. Вы можете переопределить поведение pip по умолчанию, например, используя его опцию :ref:`--no-binary <pip:install_--no-binary>`.
ta: . பைப்பின் இயல்புநிலை நடத்தை எ.கா. அதைப் பயன்படுத்துதல்: ref: `-no-entar <pip: நிறுவு _-- இல்லை-பைனரி>` விருப்பம்.

source: :term:`Wheels <Wheel>` are a pre-built :term:`distribution <Distribution Package>` format that provides faster installation compared to :term:`Source Distributions (sdist) <Source Distribution (or "sdist")>`, especially when a project contains compiled extensions.
eo: :term:`Wheel <Wheel>` estas antaŭkonstruita :term:`distribua <Distribution Package>` formo pli rapide instalebla ol :term:`Fonta Distribuo (sdist) <Source Distribution (or "sdist")>`, speciale por projekto enhavanta tradukitan etendaĵon.
ja: :term:`Wheels <Wheel>` は、ビルド済みの :term:`配布物 <Distribution Package>` フォーマットで、特にプロジェクトがコンパイル済み拡張を含んでいる場合には、 :term:`ソースコード配布物 (sdist) <Source Distribution (or "sdist")>` に比べてより短時間でインストールすることができます。
pt_br: :term:`Wheels <Wheel>` são um formato de :term:`distribuição <Pacote de Distribuição>` pré-construído que fornece uma instalação mais rápida em comparação com :term:`Distribuições Fonte (sdist) <Distribuição Fonte (ou "sdist")>`, especialmente quando um projeto contém extensões compiladas.
ru: :term:`Колеса <Wheel>` - это предварительно собранный :term:`дистрибутив <Distribution Package>` формата, который обеспечивает более быструю установку по сравнению с :term:`Source Distributions (sdist) <Source Distribution (или "sdist")>`, особенно когда проект содержит скомпилированные расширения.
ta: :term:`Wheels <Wheel>` அரே a pre-built :term:`distribution <Distribution Package>` வடிவம் that provides faster நிறுவல் compared பெறுநர் :term:`Source Distributions (sdist) <Source பரவல் (or "sdist")>`, especially when a திட்டம் contains compiled extensions.

source: If :ref:`pip` does not find a wheel to install, it will locally build a wheel and cache it for future installs, instead of rebuilding the source distribution in the future.
eo: Se :ref:`pip` ne trovas instalotan wheel, ĝi loke konstruos wheel kaj enkaŝmemorigi ĝin por estonteco anstataŭ rekonstruado de la fonta distribuo.
ja: :ref:`pip` がインストールするべき wheel を発見できなかった場合には、手元で wheel をビルドして、将来のインストール時に再びソースコード配布物からリビルドしないで済むようにキャッシュしておきます。
pt_br: Se :ref:`pip` não encontrar um wheel para instalar, ele irá construir um wheel localmente e armazená-lo em cache para instalações futuras, ao invés de reconstruir a distribuição fonte no futuro.
ru: Если :ref:`pip` не находит колеса для установки, он локально собирает колесо и кэширует его для будущих установок, вместо того, чтобы пересобирать исходный дистрибутив в будущем.
ta: If: ref: `பிப்` நிறுவ ஒரு சக்கரத்தைக் கண்டுபிடிக்கவில்லை, இது எதிர்காலத்தில் மூல விநியோகத்தை மீண்டும் கட்டியெழுப்புவதற்குப் பதிலாக, உள்நாட்டில் ஒரு சக்கரத்தை உருவாக்கி எதிர்கால நிறுவல்களுக்கு தற்காலிகமாக சேமிக்கும்.

source: Upgrade an already installed ``SomeProject`` to the latest from PyPI.
eo: Ĝisdatigi jam instalitan ``SomeProject`` al la plej nova ĉe PyPI.
ja: インストール済みの ``とあるプロジェクト`` を PyPI から最新版に更新する。
pt_br: Atualize um ``SomeProject`` já instalado para o mais recente do PyPI.
ru: Обновление уже установленного ``SomeProject`` до последней версии из PyPI.
ta: ஏற்கனவே நிறுவப்பட்ட `` someproject`` ஐ பைபியிலிருந்து சமீபத்தியதாக மேம்படுத்தவும்.

source: Installing to the User Site
eo: Instali al la Loko de la Uzanto
ja: ユーザサイトへインストールする
pt_br: Instalando para o site do usuário
ru: Установка в пользовательский каталог :file:`site`
ta: பயனர் தளத்திற்கு நிறுவுதல்

source: To install :term:`packages <Distribution Package>` that are isolated to the current user, use the ``--user`` flag:
eo: Por instali :term:`pakojn <Distribution Package>` izolitajn al la aktuala uzanto, uzu la flagon ``--user``:
ja: :term:`パッケージ <Distribution Package>` を現在のユーザだけが使えるように他から隔離してインストールするには ``--user`` フラグを使います:
pt_br: Para instalar :term:`pacotes <Pacote de Distribuição>` que são isolados para o usuário atual, use o sinalizador ``--user``:
ru: Чтобы установить :term:`пакеты <Distribution Package>`, которые изолированы от текущего пользователя, используйте флаг ``--user``:
ta: நிறுவ: கால: `தொகுப்புகள் <விநியோக தொகுப்பு>` தற்போதைய பயனருக்கு தனிமைப்படுத்தப்பட்ட, `` --user`` கொடியைப் பயன்படுத்தவும்:

source: For more information see the `User Installs <https://pip.pypa.io/en/latest/user_guide/#user-installs>`_ section from the pip docs.
eo: Por pli da informoj, vidu la paragrafon `User Installs <https://pip.pypa.io/en/latest/user_guide/#user-installs>`_ de la dokumentaro de pip.
ja: もっと詳しい情報を知りたければ、pip 説明文書の `ユーザ限定のインストール <https://pip.pypa.io/en/latest/user_guide/#user-installs>`_ の節を見てください。
pt_br: Para obter mais informações, consulte a seção `User Installs <https://pip.pypa.io/en/latest/user_guide/#user-installs>`_ da documentação do pip.
ru: Для получения дополнительной информации смотрите раздел `User Installs <https://pip.pypa.io/en/latest/user_guide/#user-installs>`_ из документации pip.
ta: மேலும் தகவலுக்கு, `பயனர் நிறுவல்கள் <https://pip.pypa.io/en/latest/user_guide/#user-installs>` _ பிரிவு பிப் டாக்சிலிருந்து.

source: Note that the ``--user`` flag has no effect when inside a virtual environment - all installation commands will affect the virtual environment.
eo: Notu, ke la flago ``-user`` havas neniun efikon ene de virtuala medio – ĉiaj instalaj komandoj ŝanĝos la virtualan medion.
ja: 仮想環境の中では ``--user`` フラグが無効になることに注意してください - すべてのインストールコマンドが仮想環境に影響を与えます。
pt_br: Observe que o sinalizador ``--user`` não tem efeito quando dentro de um ambiente virtual -- todos os comandos de instalação afetarão o ambiente virtual.
ru: Обратите внимание, что флаг ``--user`` не влияет на виртуальную среду - все команды установки будут влиять на виртуальную среду.
ta: மெய்நிகர் சூழலுக்குள் இருக்கும்போது `` --user`` கொடி எந்த விளைவையும் ஏற்படுத்தாது என்பதை நினைவில் கொள்க-அனைத்து நிறுவல் கட்டளைகளும் மெய்நிகர் சூழலை பாதிக்கும்.

source: If ``SomeProject`` defines any command-line scripts or console entry points, ``--user`` will cause them to be installed inside the `user base`_'s binary directory, which may or may not already be present in your shell's :envvar:`PATH`. (Starting in version 10, pip displays a warning when installing any scripts to a directory outside :envvar:`PATH`.) If the scripts are not available in your shell after installation, you'll need to add the directory to your :envvar:`PATH`:
ja: ``とあるプロジェクト`` がコマンドラインスクリプトかコンソールエントリポイントをひとつでも定義しているのであれば、 ``--user`` を与えることで 、 `ユーザベース <user base>`_ のバイナリ置き場、それがシェルの :envvar:`PATH` 変数にあろうがなかろうが、そこにインストールすることになるでしょう (バージョン 10 以降の pip では、スクリプトを :envvar:`PATH` に含まれていないパスにインストールする時には警告を表示します)。インストール後にスクリプトが利用可能でない場合には、 :envvar:`PATH` にそのディレクトリパスを追加する必要があるでしょう:
pt_br: Se ``SomeProject`` definir quaisquer scripts de linha de comando ou pontos de entrada de console, ``--user`` fará com que sejam instalados dentro do diretório binário da `base do usuário`_, que pode ou não já estar presente em seu :envvar:`PATH` do shell. (A partir da versão 10, pip exibe um aviso ao instalar qualquer script em um diretório fora de :envvar:`PATH`.) Se os scripts não estiverem disponíveis em seu shell após a instalação, você precisará adicionar o diretório ao seu :envvar:`PATH`:
ru: Если ``SomeProject`` определяет какие-либо скрипты командной строки или консольные точки входа, ``--user`` заставит их быть установленными в бинарную директорию ``user base`_, которая может присутствовать или не присутствовать в :envvar:`PATH`` вашей оболочки. (Начиная с версии 10, pip выводит предупреждение при установке любых скриптов в каталог вне :envvar:`PATH`). Если скрипты недоступны в вашей оболочке после установки, вам нужно добавить каталог в :envvar:`PATH`:
ta: எந்தவொரு கட்டளை-வரி ச்கிரிப்டுகள் அல்லது கன்சோல் நுழைவு புள்ளிகளை `` சில திட்ட` `வரையறுத்தால்,` `--user`` அவை` பயனர் தளத்தின் `_ இன் பைனரி கோப்பகத்திற்குள் நிறுவப்படும், இது ஏற்கனவே உங்கள் செல்லில் இருக்கலாம் அல்லது இல்லாமல் இருக்கலாம்: envvar: `பாதை`. .

source: On Linux and macOS you can find the user base binary directory by running ``python -m site --user-base`` and adding ``bin`` to the end. For example, this will typically print ``~/.local`` (with ``~`` expanded to the absolute path to your home directory) so you'll need to add ``~/.local/bin`` to your ``PATH``. You can set your ``PATH`` permanently by `modifying ~/.profile`_.
eo: Sur Linux kaj macOS, vi povas trovi la bazan duumaĵan dosierujon de la uzanto per ``python -m site --user-base`` kaj aldonanta ``bin`` al la fino. Ekzemple, tio ordinare eligas ``~/.local`` (kun ``~`` anstataŭiigta per la absoluta dosierloko de via hejma dosierujo); do vi aldonos ``~/.local/bin`` al via ``PATH ``. Vi povas fiksi vian ``PATH`` `modifante ~/.profile <modifying ~/.profile>`_.
ja: Linux や macOS 上では、 ``python -m site --user-base`` を実行した結果の末尾に ``bin`` を追加すれば、ユーザベースのバイナリ置き場となるディレクトリがどこであるかがわかるでしょう。例えば、このコマンドは大抵の場合に ``~/.local`` (の ``~`` をあなたのホームディレクトリの絶対パスに展開したもの) を表示しますが、すると、 ``PATH`` には ``~/.local/bin`` を追加する必要があるということです。 `~/.profile を修正する <modifying ~/.profile>`_ ことで ``PATH`` を恒久的に変更することができます。
pt_br: No Linux e no macOS você pode encontrar o diretório binário da base do usuário executando ``python -m site --user-base`` e adicionando ``bin`` no final. Por exemplo, isso normalmente imprimirá ``~/.local`` (com ``~`` expandido para o caminho absoluto para o seu diretório inicial), então você precisará adicionar ``~/.local/bin`` para seu ``PATH``. Você pode definir seu ``PATH`` permanentemente `modificando ~/.profile`_.
ru: В Linux и macOS вы можете найти бинарный каталог пользовательской базы, выполнив команду ``python -m site --user-base`` и добавив ``bin`` в конце. Например, обычно выводится ``~/.local`` (при этом ``~`` расширяется до абсолютного пути к вашей домашней директории), поэтому вам нужно будет добавить ``~/.local/bin`` в ваш ``PATH``. Вы можете установить свой ``PATH`` постоянно, ``изменив ~/.profile``.
ta: லினக்ச் மற்றும் மேகோசில் நீங்கள் `` பைதான் -எம் தளத்தை -யூசர் -பேச்`` ஐ இயக்கி, `` பின்`` ஐ இறுதிவரை சேர்ப்பதன் மூலம் பயனர் அடிப்படை பைனரி கோப்பகத்தைக் காணலாம். எடுத்துக்காட்டாக, இது பொதுவாக `` ~/.local`` ஐ அச்சிடும் (`` `` `உங்கள் வீட்டு கோப்பகத்திற்கான முழுமையான பாதைக்கு விரிவாக்கப்படும்) எனவே உங்கள்` `பாதை`` இல்` `~/.local/bin`` ஐ சேர்க்க வேண்டும். `மாற்றியமைப்பதன் மூலம் உங்கள்` `பாதையை` நிரந்தரமாக அமைக்கலாம்.
