Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: First, we'll define the job for building the dist packages of your project and storing them for later use:
eo: Unue, ni difinas la taskon por konstrui la distribuajn pakojn de via projekto kaj konservi ilin por posta uzo:
ja: 最初に、あなたのプロジェクトの dist パッケージをビルドして、その後の使用のために保存するジョブを定義しましょう:
pt_br: Primeiro, definiremos o trabalho para construir os pacotes dist do seu projeto e armazená-los para uso posterior:
ru: Сначала мы определим задание для сборки дист-пакетов вашего проекта и хранения их для последующего использования:
ta: முதலில், உங்கள் திட்டத்தின் தொலைதூர தொகுப்புகளை உருவாக்குவதற்கும் அவற்றை பின்னர் பயன்படுத்த சேமிப்பதற்கும் வேலையை வரையறுப்போம்:

source: This will download your repository into the CI runner and then install and activate the newest available Python 3 release.
eo: Tio elŝutos vian deponejon al la kontinuintegrilo kaj instalos kaj aktivigos la plej novan eldonon de Python 3.
ja: これによって、あなたのリポジトリを CI ランナーにダウンロードして、利用可能な最新の Python 3 リリースをインストールしアクティベートすることになります。
pt_br: Isso fará o download do seu repositório no executor de CI e, em seguida, instalará e ativará o lançamento mais recente disponível do Python 3.
ru: Это позволит загрузить ваш репозиторий в CI runner, а затем установить и активировать самый новый доступный релиз Python 3.
ta: இது உங்கள் களஞ்சியத்தை தொஒ ரன்னரில் பதிவிறக்கம் செய்து பின்னர் கிடைக்கக்கூடிய புதிய பைதான் 3 வெளியீட்டை நிறுவி செயல்படுத்தும்.

source: And now we can build the dists from source and store them. In this example, we'll use the ``build`` package. So add this to the steps list:
eo: Nun ni povas konstrui la distribuojn el fonto kaj konservi ilin. En ĉi tiu ekzemplo, ni uzos la pakon ``build``. Do aldonu la jenon al la listo de paŝoj:
ja: そして、今や我々はソースコードから dist 配布物をビルドして保存しておくことができます。この例では、パッケージを ``build`` することになります。ですから、これをステップリストに加えましょう:
pt_br: E agora podemos construir os dists a partir da fonte e armazená-los. Neste exemplo, usaremos o pacote ``build``. Então, adicione isso à lista de etapas:
ru: Теперь мы можем собрать дисты из исходного кода и сохранить их. В этом примере мы будем использовать пакет ``build``. Так что добавьте его в список шагов:
ta: இப்போது நாம் மூலத்திலிருந்து தொலைதூரங்களை உருவாக்கி அவற்றை சேமிக்க முடியும். இந்த எடுத்துக்காட்டில், `` பில்ட்`` தொகுப்பைப் பயன்படுத்துவோம். எனவே இதை படிகள் பட்டியலில் சேர்க்கவும்:

source: Defining a workflow job environment
eo: Difini laborfluan taskan medion
ja: ワークフローのジョブ環境を定義する
pt_br: Definindo um ambiente de tarefa do fluxo de trabalho
ru: Определение рабочей среды рабочего процесса
ta: பணிப்பாய்வு வேலை சூழலை வரையறுத்தல்

source: This will also ensure that the PyPI publishing workflow is only triggered if the current commit is tagged.
eo: Tio ankaŭ certigas, ke la PyPI-eldona laborfluo nur ekos, se la aktuala enmeto havas etikedon.
ja: これは、当該コミットがタグ付きである時にだけ PyPI 公開 <publishing> ワークフローが起動されることをも保証するものです。
pt_br: Isso também garantirá que o fluxo de trabalho de publicação do PyPI só seja acionado se o commit atual estiver marcado.
ru: Это также гарантирует, что рабочий процесс публикации PyPI будет запущен только в том случае, если текущий коммит помечен.
ta: தற்போதைய கமிட் குறிக்கப்பட்டால் மட்டுமே PYPI பப்ளிசிங் பணிப்பாய்வு தூண்டப்படுவதை இது உறுதி செய்யும்.

source: Publishing the distribution to PyPI
eo: Eldoni la distribuon al PyPI
ja: PyPI へ配布物を公開する <publishng>
pt_br: Publicando a distribuição para PyPI
ru: Публикация дистрибутива в PyPI
ta: PYPI க்கு விநியோகத்தை வெளியிடுகிறது

source: Finally, add the following steps at the end:
eo: Fine, postmetu la jenajn paŝojn:
ja: 最後に、次の手続きを末尾に追加しましょう:
pt_br: Finalmente, adicione as seguintes etapas ao final:
ru: Наконец, добавьте следующие шаги в конце:
ta: இறுதியாக, முடிவில் பின்வரும் படிகளைச் சேர்க்கவும்:

source: This step uses the `pypa/gh-action-pypi-publish`_ GitHub Action: after the stored distribution package has been downloaded by the `download-artifact`_ action, it uploads the contents of the ``dist/`` folder into PyPI unconditionally.
eo: Tiu paŝo uzas la GitHub-ago `pypa/gh-action-pypi-publish`_: post elŝuto de la distribua pako per la ago `download-artifact`_, ĝi alŝutas la enhavon de la dosierujo ``dist/`` al PyPI senkondiĉe.
ja: この手順では、保存されている配布パッケージが `download-artifact`_ アクションによってダウンロードされた後に `pypa/gh-action-pypi-publish`_ という GitHub Action: を使って、 ``dist/`` フォルダの内容物を無条件に PyPI へアップロードします。
pt_br: Essa etapa usa a GitHub Action `pypa/gh-action-pypi-publish`_: após o primeiro pacote de distribuição armazenado ter sido baixado pela ação `download-artifact`_, ele envia o conteúdo da pasta ``dist /`` para PyPI incondicionalmente.
ru: Этот шаг использует действие `pypa/gh-action-pypi-publish`_ GitHub: после загрузки сохраненного дистрибутива действием `download-artifact`_, оно безусловно загружает содержимое папки ``dist/`` в PyPI.
ta: இந்த படி `பைபா/சிஎச்-ஆக்சன்-பிப்-பிபிலிச்`_ அறிவிலிமையம் செயலைப் பயன்படுத்துகிறது: சேமிக்கப்பட்ட விநியோக தொகுப்பு` பதிவிறக்கம்-ஆர்டிஃபாக்ட்`_ செயலால் பதிவிறக்கம் செய்யப்பட்ட பிறகு, இது `` மாவட்ட/`கோப்புறையின் உள்ளடக்கங்களை பதிவேற்றுகிறது நிபந்தனையின்றி பைபிக்குள்.

source: Separate workflow for publishing to TestPyPI
eo: Aparta laborfluo por eldoni al TestPyPI
ja: TestPyPI へ公開 <publish> するもうひとつのワークフロー
pt_br: Fluxo de trabalho separado para publicação no TestPyPI
ru: Отдельный рабочий процесс для публикации в TestPyPI
ta: டெச்ட்பிபிக்கு வெளியிடுவதற்கு பணிப்பாய்வு தனி

source: Now, repeat these steps and create another job for publishing to the TestPyPI package index under the ``jobs`` section:
eo: Nun ripetu tiujn paŝojn, kreante alian taskon por eldonado al la pakindekso Prova PyPI sub la sekcio ``jobs``:
ja: さて、これらのステップを繰り返して、 ``jobs`` セクションに TestPyPI パッケージインデックスに公開 <publish> するようなもうひとつのジョブを作成しましょう:
pt_br: Agora, repita essas etapas e crie outro trabalho para publicação no índice do pacote TestPyPI na seção ``jobs``:
ru: Теперь повторите эти шаги и создайте еще одно задание для публикации в индекс пакета TestPyPI в разделе ``jobs``:
ta: இப்போது, இந்த படிகளை மீண்டும் செய்து, `` வேலைகள்`` பிரிவின் கீழ் டெச்ட்பை தொகுப்பு குறியீட்டுக்கு வெளியிட மற்றொரு வேலையை உருவாக்கவும்:

source: Requiring manual approvals in the ``testpypi`` GitHub Environment is typically unnecessary as it's designed to run on each commit to the main branch and is often used to indicate a healthy release publishing pipeline.
eo: Postuli malaŭtomatan aprobadon en la GitHub-medio ``testpypi`` ordinare ne necesas, ĉar ĝi laŭfasone ruliĝas post ĉiu enmeto en la ĉefbranĉon kaj ofte indikas sanan eldonadan ĉenstablon.
ja: ``testpypi`` Github 環境において手動の承認を要求することは、main ブランチへのコミット毎に走るように設計されていることから、典型的な場合には不必要とされていて、使われるとすればリリースの公開 <publish> パイプラインが健全であることを示すためであることが多いのです。
pt_br: Exigir aprovações manuais no ambiente GitHub ``testpypi`` normalmente é desnecessário, pois ele é projetado para ser executado em cada commit no branch principal e é frequentemente usado para indicar um pipeline de publicação de lançamento íntegro.
ru: Требование ручного одобрения в среде ``testpypi`` GitHub обычно не требуется, поскольку она предназначена для выполнения каждого коммита в основной ветке и часто используется для обозначения здорового конвейера публикации pipрелизов.
ta: `` டெச்ட்பை`` அறிவிலிமையம் சூழலில் கையேடு ஒப்புதல்கள் தேவைப்படுவது பொதுவாக தேவையற்றது, ஏனெனில் இது முதன்மையான கிளைக்கு ஒவ்வொரு உறுதியிலும் இயங்க வடிவமைக்கப்பட்டுள்ளது மற்றும் ஆரோக்கியமான வெளியீட்டு வெளியீட்டு குழாய்த்திட்டத்தைக் குறிக்க பெரும்பாலும் பயன்படுத்தப்படுகிறது.

source: The whole CI/CD workflow
eo: La plena laborfluo por kontinuaj integrado kaj disponigo
ja: CI/CD ワークフローの全体像
pt_br: O fluxo de trabalho de CI/CD completo
ru: Весь рабочий процесс CI/CD
ta: முழு சிஐ/சிடி பணிப்பாய்வு

source: This paragraph showcases the whole workflow after following the above guide.
eo: Jen alineo pri la plena laborfluo laŭ la ĉi-supra gvidilo.
ja: この段落には、上述のガイド文書に従った場合のワークフローの全体像を披露します。
pt_br: Este parágrafo mostra todo o fluxo de trabalho após seguir o guia acima.
ru: В этом пункте показан весь рабочий процесс после выполнения вышеописанного руководства.
ta: இந்த பத்தி மேலே உள்ள வழிகாட்டியைப் பின்பற்றிய பிறகு முழு பணிப்பாய்வுகளையும் காட்டுகிறது.

source: That's all, folks!
eo: Jen fino!
ja: これでできましたよ、皆さん!
pt_br: Isso é tudo, pessoal!
ru: Вот и все, друзья!
ta: அவ்வளவுதான், எல்லோரும்!

source: Now, whenever you push a tagged commit to your Git repository remote on GitHub, this workflow will publish it to PyPI. And it'll publish any push to TestPyPI which is useful for providing test builds to your alpha users as well as making sure that your release pipeline remains healthy!
ja: これで、手元の Git リポジトリをリモートの GitHub にタグ付きのコミットをプッシュする時はいつでも、このワークフローがそれを PyPI へ公開します。そして、プッシュしさえすればいつでも TestPyPI で公開されますので、アルファ版のユーザにテストビルドを提供するためにも、あなたのリリースパイプラインが健全な状態に保たれていることを確認するためにも役に立ちます!
pt_br: Agora, sempre que você fizer um push de um commit com tag para seu repositório Git remoto no GitHub, este fluxo de trabalho irá publicá-lo no PyPI. E publicará qualquer push para TestPyPI que seja útil para fornecer construções de teste para seus usuários alfa, bem como garantir que sua versão pipeline permaneça saudável!
ru: Теперь, когда бы вы ни отправили помеченный коммит в свой Git-репозиторий на GitHub, этот рабочий процесс будет публиковать его в PyPI. И он будет публиковать любой push в TestPyPI, что полезно для предоставления тестовых сборок вашим альфа-пользователям, а также для того, чтобы убедиться, что ваш конвейер релизовpip остаётся здоровым!
ta: இப்போது, கிட்அப்பில் உங்கள் அறிவிலி களஞ்சிய ரிமோட்டிற்கு குறிக்கப்பட்ட உறுதிப்பாட்டை நீங்கள் தள்ளும்போதெல்லாம், இந்த பணிப்பாய்வு அதை பைபிக்கு வெளியிடும். இது உங்கள் ஆல்பா பயனர்களுக்கு சோதனை கட்டமைப்பை வழங்குவதற்கும், உங்கள் வெளியீட்டு குழாய் ஆரோக்கியமாக இருப்பதை உறுதிசெய்வதற்கும் பயனுள்ளதாக இருக்கும் டெச்ட்பிபிக்கு எந்தவொரு உந்துதலையும் வெளியிடும்!

source: If your repository has frequent commit activity and every push is uploaded to TestPyPI as described, the project might exceed the `PyPI project size limit <https://pypi.org/help/#project-size-limit>`_. The limit could be increased, but a better solution may constitute to use a PyPI-compatible server like :ref:`pypiserver` in the CI for testing purposes.
ja: リポジトリで活発に頻繁なコミットがあって、前述のようにあらゆるプッシュが TestPyPI へアップロードされているなら、そのプロジェクトは `PyPI プロジェクトサイズ制限 <https://pypi.org/help/#project-size-limit>`_ を超過するかもしれません。この制限を緩和することもできますが、より良い解決策は試験目的の CI の中で :ref:`pypiserver` のような PyPI と互換のあるサーバを使うように構成することかもしれません。
pt_br: Se o seu repositório tiver atividade de commit frequente e cada push for carregado no TestPyPI conforme descrito, o projeto poderá exceder o `limite de tamanho do projeto PyPI <https://pypi.org/help/#project-size-limit>`_. O limite poderia ser aumentado, mas uma solução melhor pode consistir em usar um servidor compatível com PyPI como :ref:`pypiserver` no CI para fins de teste.
ru: Если в вашем репозитории часто происходят коммиты и каждый push загружается в TestPyPI, как описано выше, проект может превысить ограничение на размер проекта <https://pypi.org/help/#project-size-limit>`_. Лимит может быть увеличен, но лучшим решением может быть использование PyPI-совместимого сервера, например :ref:`pypiserver`, в CI для тестирования.
ta: உங்கள் களஞ்சியத்தில் அடிக்கடி செயல்படும் செயல்பாடு இருந்தால், ஒவ்வொரு உந்துதலும் விவரிக்கப்பட்டுள்ளபடி டெச்ட்பைட்டில் பதிவேற்றப்பட்டால், திட்டம் `PYPI திட்ட அளவு வரம்பை <https://pypi.org/help/#project-cise-limit>` _. வரம்பை அதிகரிக்க முடியும், ஆனால் ஒரு சிறந்த தீர்வு ஒரு பைபி-இணக்கமான சேவையகத்தைப் பயன்படுத்தலாம்: குறிப்பு நோக்கங்களுக்காக தொஒ இல் `பைபிசெவர்`.

source: It is recommended to keep the integrated GitHub Actions at their latest versions, updating them frequently.
eo: Estas rekomendata teni la integritajn GitHub Actions ĉe la plej novaj versioj, ĝisdatigante ofte.
ja: 統合された GitHub Actions を最新版に保ち、頻繁にアップデートすることを推奨します。
pt_br: Recomenda-se manter o GitHub Actions integrado em suas versões mais recentes, atualizando-as frequentemente.
ru: Рекомендуется поддерживать интегрированные GitHub Actions в последних версиях и часто их обновлять.
ta: ஒருங்கிணைந்த அறிவிலிமையம் செயல்களை அவற்றின் அண்மைக் கால பதிப்புகளில் வைத்திருக்க பரிந்துரைக்கப்படுகிறது, அவற்றை அடிக்கடி புதுப்பிக்கிறது.

source: Building and Publishing
eo: Konstruado kaj Eldonado
ja: ビルドすることと公開すること
pt_br: Construção e publicação
ru: Строительство и публикации
ta: கட்டிடம் மற்றும் வெளியீடு

source: Hosting
eo: Gastigado
ja: ホスティング
pt_br: Hospedagem
ru: Хостинг
ta: ஓச்டிங்

source: Installation
eo: Instalado
ja: インストール
pt_br: Instalação
ru: Установка
ta: நிறுவல்

source: 0; url=../../discussions/single-source-version/
ta: 0; முகவரி = ../../விவாதங்கள்/ஒற்றை-மூல பதிப்பு/

source: Redirecting stale single-source package version link...
eo: Alidirektante malnovan hiperligon pri unufontigo de paka versio…
ja: 古くなったシングルソースのパッケージバージョンリンクをリダイレクトする
ru: Перенаправление устаревшей ссылки на версию пакета из одного источника...
ta: பழமையான ஒற்றை மூல தொகுப்பு பதிப்பு இணைப்பை திருப்பிவிடுதல் ...

source: If the page doesn't automatically refresh, see :ref:`single-source-version`.
eo: Se la paĝo ne reŝargiĝas aŭtomate, vidu :ref:`single-source-version`.
ja: もし、ページが自動的にリフレッシュされないなら、 :ref:`single-source-version` をみて下さい。
ru: Если страница не обновляется автоматически, смотрите :ref:`single-source-version`.
ta: பக்கம் தானாகவே புதுப்பிக்கவில்லை என்றால், காண்க: குறிப்பு: `ஒற்றை-மூல-பதிப்பு`.

source: Supporting multiple Python versions
eo: Subteni plurajn versiojn de Python
ja: 複数の Python バージョンをサポートする
pt_br: Fornecendo suporte a várias versões do Python
ru: Поддержка нескольких версий Python'а
ta: பல பைதான் பதிப்புகளை ஆதரிக்கிறது

source: In addition to the work required to create a Python package, it is often necessary that the package must be made available on different versions of Python. Different Python versions may contain different (or renamed) standard library packages, and the changes between Python versions 2.x and 3.x include changes in the language syntax.
ja: Python パッケージを作成するのに必要とされる仕事に加えて、しばしばそのパッケージが異なるバージョンの Python に対応することが求められます。 Python のバージョンが異なると、異なる (または名称を変更した) 標準ライブラリパッケージを含むことがあり、 Python 2.x と 3.x の間には言語の文法に違いがあります。
pt_br: Além do trabalho necessário para criar um pacote Python, geralmente é necessário que o pacote esteja disponível em diferentes versões do Python. Diferentes versões Python podem conter diferentes (ou renomeados) pacotes de biblioteca padrão, e as alterações entre Python versões 2.x e 3.x incluem alterações na sintaxe da linguagem.
ru: Помимо работы, необходимой для создания пакета Python, часто возникает необходимость сделать его доступным для разных версий Python. Разные версии Python могут содержать разные (или переименованные) пакеты стандартной библиотеки, а изменения между версиями Python 2.x и 3.x включают изменения в синтаксисе языка.
ta: பைதான் தொகுப்பை உருவாக்க தேவையான வேலைக்கு கூடுதலாக, பைத்தானின் வெவ்வேறு பதிப்புகளில் தொகுப்பு கிடைக்க வேண்டும் என்பது பெரும்பாலும் தேவை. வெவ்வேறு பைதான் பதிப்புகளில் வெவ்வேறு (அல்லது மறுபெயரிடப்பட்ட) நிலையான நூலக தொகுப்புகள் இருக்கலாம், மேலும் பைதான் பதிப்புகள் 2.x மற்றும் 3.x க்கு இடையிலான மாற்றங்கள் மொழி தொடரியல் மாற்றங்களை உள்ளடக்குகின்றன.

source: Performed manually, all the testing required to ensure that the package works correctly on all the target Python versions (and OSs!) could be very time-consuming. Fortunately, several tools are available for dealing with this, and these will briefly be discussed here.
eo: Malaŭtomata testado por certigi, ke la pako funkcias ĝuste sur ĉiuj celataj versioj de Python (kaj mastrumaj sistemoj!), postulas multegon da tempo. Feliĉe, ekzistas pluraj iloj por helpi pri tio, kiujn ni diskutos ĉi tie.
ja: パッケージが対象となる Python バージョン (および OS 群！) で正しく動作することを確認するために要求されるテストを全て手動でやるとなると、大変に時間がかかるでしょう。幸いなことに、このようなテストを扱ういくつかのツールを利用することができますので、ここで簡単に議論しておきましょう。
pt_br: Executados manualmente, todos os testes necessários para garantir que o pacote funcione corretamente em todas as versões alvo Python (e sistemas operacionais!) podem consumir muito tempo. Felizmente, várias ferramentas estão disponíveis para lidar com isso, e elas serão brevemente discutidas aqui.
ru: Если выполнять тестирование вручную, то все проверки, необходимые для обеспечения корректной работы пакета на всех целевых версиях Python (и ОС!), могут занять очень много времени. К счастью, существует несколько инструментов для решения этой проблемы, о которых мы вкратце расскажем здесь.
ta: கைமுறையாக நிகழ்த்தப்பட்டது, அனைத்து இலக்கு பைதான் பதிப்புகளிலும் (மற்றும் OSS!) தொகுப்பு சரியாக செயல்படுவதை உறுதிசெய்ய தேவையான அனைத்து சோதனைகளும் மிகவும் நேரத்தை எடுத்துக்கொள்ளக்கூடும். அதிர்ச்டவசமாக, இதைக் கையாள்வதற்கு பல கருவிகள் கிடைக்கின்றன, இவை சுருக்கமாக இங்கே விவாதிக்கப்படும்.

source: Automated testing and continuous integration
eo: Aŭtomata testado kaj kontinua integrado
ja: 自動化されたテストと継続的インテグレーション
pt_br: Testes automatizados e integração contínua
ru: Автоматическое тестирование и непрерывная интеграция
ta: தானியங்கு சோதனை மற்றும் தொடர்ச்சியான ஒருங்கிணைப்பு

source: Several hosted services for automated testing are available. These services will typically monitor your source code repository (e.g. at `GitHub <https://github.com>`_ or `Bitbucket <https://bitbucket.org>`_) and run your project's test suite every time a new commit is made.
eo: Ekzistas pluraj gastigaj servoj por aŭtomata testado. Tiaj servoj ordinare observadas la fontkodan deponejon (ekz. ^©e `GitHub <https://github.com>`_ aŭ `Bitbucket <https://bitbucket.org>`_) kaj rulas la testaron post ĉiu modifo.
ja: 自動化されたテスト用のオンラインサービスがいくつか利用可能です。典型的には、これらのサービスがあなたのソースコードリポジトリ (例えば `GitHub <https://github.com>`_ や `Bitbucket <https://bitbucket.org>`_) を監視していて、新しいコミットが為されるたびにテストスイートを実行します。
pt_br: Vários serviços hospedados para testes automatizados estão disponíveis. Esses serviços normalmente irão monitorar seu repositório de código-fonte (por exemplo, no `GitHub <https://github.com>`_ ou `Bitbucket <https://bitbucket.org>`_) e executar um conjunto de testes do seu projeto toda vez que um novo commit é feito.
ru: Существует несколько хостинговых сервисов для автоматизированного тестирования. Эти сервисы обычно следят за вашим репозиторием исходного кода (например, на `GitHub <https://github.com>`_ или `Bitbucket <https://bitbucket.org>`_) и запускают набор тестов вашего проекта каждый раз, когда делается новый коммит.
ta: தானியங்கு சோதனைக்கு பல புரவலன் செய்யப்பட்ட சேவைகள் கிடைக்கின்றன. இந்த சேவைகள் பொதுவாக உங்கள் மூலக் குறியீடு களஞ்சியத்தை கண்காணிக்கும் (எ.கா. கமிட் செய்யப்படுகிறது.

source: These services also offer facilities to run your project's test suite on *multiple versions of Python*, giving rapid feedback about whether the code will work, without the developer having to perform such tests themselves.
eo: Tiaj servoj ankaŭ ofertas funkcion por ruli la testaron sur *multaj versioj de Python*, rapide sciigante pri ĉu la kodo funkcias, sen malaŭtomata testado far la aŭtoro.
ja: これらのサービスは、また、あなたのプロジェクトのテストスイートを *複数のバージョンの Python* で走らせる機能を提供しているので、開発者がそのようなテストを自分でやらなくてもソースコードが動作するか否かについて素早くフィードバックを返してくれます。
pt_br: Esses serviços também oferecem facilidades para executar o conjunto de testes do seu projeto em *várias versões do Python*, fornecendo um feedback rápido sobre se o código funcionará, sem que o desenvolvedor tenha que realizar esses testes por conta própria.
ru: Эти сервисы также предлагают возможности для запуска тестового набора вашего проекта на *многих версиях Python*, что позволяет быстро получить информацию о том, будет ли работать код, без необходимости разработчику самому выполнять такие тесты.
ta: இந்த சேவைகள் பைதானின் பல பதிப்புகளில் உங்கள் திட்டத்தின் சோதனைத் தொகுப்பை இயக்குவதற்கான வசதிகளையும் வழங்குகின்றன, மேலும் உருவாக்குபவர் அத்தகைய சோதனைகளைச் செய்யாமல், குறியீடு செயல்படுமா என்பது குறித்த விரைவான கருத்துக்களை அளிக்கிறது.

source: Wikipedia has an extensive `comparison <https://en.wikipedia.org/wiki/Comparison_of_continuous_integration_software>`_ of many continuous-integration systems. There are two hosted services which when used in conjunction provide automated testing across Linux, Mac and Windows:
eo: Vikipedio havas detalan `komparon <https://en.wikipedia.org/wiki/Comparison_of_continuous_integration_software>`_ inter pluraj sistemoj por kontinua integrado. Ekzistas du gastigitajn servojn, kiuj kune provizas aŭtomatan testadon por Linux, Mac kaj Windows:
ja: Wikipedia には、数多くの継続的インテグレーションシステムを多方面から比較した `比較ページ <https://en.wikipedia.org/wiki/Comparison_of_continuous_integration_software>`_ があります。その中には、両方を一緒に使うことで Linux ・ Mac ・ Windows を跨いだ自動化されたテストを実行できるようなふたつのオンラインサービスもあります。
pt_br: A Wikipédia tem uma extensa `comparação <https://en.wikipedia.org/wiki/Comparison_of_continuous_integration_software>`_ de muitos sistemas de integração contínua. Existem dois serviços hospedados que, quando usados em conjunto, fornecem testes automatizados no Linux, Mac e Windows:
ru: В Википедии есть обширное "сравнение <https://en.wikipedia.org/wiki/Comparison_of_continuous_integration_software>`_ многих систем непрерывной интеграции". Существует два хостинговых сервиса, которые при совместном использовании обеспечивают автоматизированное тестирование в Linux, Mac и Windows:
ta: விக்கிபீடியாவில் ஒரு விரிவான `ஒப்பீடு <https://en.wikipedia.org/wiki/comparison_of_continous_integration_software>` _ பல தொடர்ச்சியான-ஒருங்கிணைப்பு அமைப்புகளில் உள்ளது. லினக்ச், மேக் மற்றும் சாளரங்கள் முழுவதும் தானியங்கு சோதனையை வழங்கும் போது இரண்டு புரவலன் செய்யப்பட்ட சேவைகள் உள்ளன:

source: `Travis CI <https://travis-ci.org>`_ provides both a Linux and a macOS environment. The Linux environment is Ubuntu 12.04 LTS Server Edition 64 bit while the macOS is 10.9.2 at the time of writing.
eo: `Travis CI <https://travis-ci.org>`_ provizas kaj Linux-an kaj macOS-an mediojn. La medio Linux estis Ubuntu 12.04 LTS Servila Eldono 64-bita, dum la medio macOS estis 10.9.2, kiam ĉi tiu dokumento estis verkita.
ja: `Travis CI <https://travis-ci.org>`_ は Linux と macOS の両方の環境を提供します。原稿執筆時点で、 Linux 環境は Ubuntu 12.04 LTS Server Edition 64 bit で、 macOS 環境は 10.9.2 です。
pt_br: `Travis CI <https://travis-ci.org>`_ fornece um ambiente Linux e macOS. O ambiente Linux é Ubuntu 12.04 LTS Server Edition de 64 bits, enquanto o macOS é 10.9.2 no momento da escrita.
ru: В системе Travis CI <https://travis-ci.org>`_ есть как Linux, так и macOS. Среда Linux - это Ubuntu 12.04 LTS Server Edition 64 bit, а macOS на момент написания статьи - 10.9.2.
ta: `டிராவிச் சி <https://travis-ci.org>` _ லினக்ச் மற்றும் மேகோச் சூழல் இரண்டையும் வழங்குகிறது. லினக்ச் சூழல் உபுண்டு 12.04 எல்.டி.எச் சர்வர் பதிப்பு 64 பிட் ஆகும், அதே நேரத்தில் மேகோச் 10.9.2 ஆகும்.

source: `Appveyor <https://www.appveyor.com/>`_ provides a Windows environment (Windows Server 2012).
eo: `Appveyor <https://www.appveyor.com/>`_ provizas Windows-medion (Windows Server 2012).
ja: `Appveyor <https://www.appveyor.com/>`_ は、Windows 環境 (Windows Server 2012) を提供します。
pt_br: `Appveyor <https://www.appveyor.com/>`_ fornece um ambiente Windows (Windows Server 2012).
ru: `Appveyor <https://www.appveyor.com/>`_ предоставляет среду Windows (Windows Server 2012).
ta: `Appveyor <https://www.appweyor.com/>` _ சாளரங்கள் சூழலை வழங்குகிறது (விண்டோச் சர்வர் 2012).
