Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Downstreams often use hashes to verify the authenticity of source files on subsequent builds, which require that they remain bitwise identical over time. For example, automatically generated Git archives do not guarantee this, as the compressed data may change if gzip is upgraded on the server.
eo: Malsupruloj ofte uzas haketaĵojn por konfirmi la aŭtentikecon de fontdosieroj por sekvaj konstruoj. Tio postulas, ke ili restu bite identaj. Ekzemple, aŭtomate generita Git-arĥivo ne garantias tion, ĉar la densigitaj datenoj povas ŝanĝiĝi, se la servilo ĝisdatigas ``gzip``.
ja: ダウンストリーム側は、引き続くビルドに用いるためのソースファイルの真正性を検証するために、時を経てもビット単位で同一であることを要求するハッシュ値を使うことがしばしばあります。例えば、仮にサーバ上の gzip がアップグレードされれば、圧縮されたデータが変化するかもしれないので、自動的に作成される Git アーカイブはこのようなことを保証しません。

source: Archive files can be mirrored, reducing both upstream and downstream bandwidth use. The actual builds can afterwards be performed in firewalled or offline environments, that can only access source files provided by the local mirror or redistributed earlier.
eo: Oni povas speguli arĥivo-dosierojn, malpliigante Interretan uzadon por ĉiuj. La konstruado mem povas okazi en ŝirmita aŭ senkonekta medio, kiu povas nur atingi fontodosierojn provizitajn de la loka spegulo aŭ redistribuitajn pli frue.
ja: アーカイブファイルはミラーサイトにおくことも可能で、アップストリームとダウンストリームの両方の帯域幅を節約することができます。実際のビルドは、ローカルミラーまたは前もって再配布を受けたソースファイル群にしかアクセスが提供されないファイアウォールの内側もしくはオフラインの環境下で後から実行することが可能です。

source: Explicitly publishing archive files can ensure that any dependencies on version control system metadata are resolved when creating the source archive. For example, automatically generated Git archives omit all of the commit tag information, potentially resulting in incorrect version details in the resulting builds.
eo: Eksplicite eldoni arĥivo-dosierojn povas certigi, ke ajna dependeco sur versikontrolsistemaj metadatenoj solviĝas dum kreado de la fonta arĥivo. Ekzemple, aŭtomate generita Git-arĥivo ekskluziviĝas informojn pri la enmetaj etikedoj, eble kaŭzante malĝustajn informojn pri versiaj detaloj en la rezultaj konstruoj.
ja: 明示的にアーカイブファイルを公開することで、そのソースコードアーカイブが作成された時点でバージョン管理システムのメタデータに関する依存関係がすべて解決されていたことを保証することができます。例えば、自動的に生成される Git アーカイブはコミットタグ情報をすべて削除していて、そのビルドに必要なバージョン情報の詳細が不正確になっている可能性があります。

source: How?
eo: Kiel?
ja: どのように？

source: Ideally, **a source distribution archive published on PyPI should include all the files from the package's Git repository** that are necessary to build the package itself, run its test suite, build and install its documentation, and any other files that may be useful to end users, such as shell completions, editor support files, and so on.
eo: Ideale, **fontodistribua arĥivo ĉe PyPI inkluzivu ĉiujn dosierojn de la Git-deponejo de la pako** necesajn por konstrui la pako mem, ruli la testaron, konstrui kaj instali la dokumentaron, kaj ĉiajn aliajn dosierojn utilajn por uzantoj, kiel ekzemple ŝelkompletigaĵojn, redaktilajn helpdosierojn ktp.
ja: 理想的には、 ** PyPI上で公開されたソースコード配布物のアーカイブには、そのパッケージの Git リポジトリからパッケージ自体をビルドし、テストスイートを走らせ、説明文書をインストールするために必要なファイルや、シェル補完やエディタ用のサポートファイルなどエンドユーザにとって役に立つかもしれない他のファイルを全て含めるべきです ** 。

source: Some projects have concerns related to Python package managers using source distributions from PyPI. They do not wish to increase their size with files that are not used by these tools, or they do not wish to publish source distributions at all, as they enable a problematic or outright nonfunctional fallback to building the particular project from source. In these cases, a good compromise may be to publish a separate source archive for downstream use elsewhere, for example by attaching it to a GitHub release. Alternatively, large files, such as test data, can be split into separate archives.
eo: Kelkaj projektoj havas problemojn pri Python-pakadministrilo uzanta fontan distribuon el PyPI. Ili ne deziras pligrandigi pakojn kun dosieroj ne uzataj, aŭ ili deziras ne eldoni fontan distribuon, ĉar konstrui projekton el fonta distribuo povas esti problemplene aŭ neeble. Tiakaze, bona kompromiso povas esti eldoni apartan fontarĥivon por malsupruloj aliloke, ekzemple per alkroĉado al GitHub-eldono. Alternative, grandaj dosieroj, kiel ekzemple testdatenoj, povas esti dividitaj en apartajn arĥivojn.
ja: プロジェクトによっては、PyPI からのソースコード配布物を使う Python パッケージ管理機構に関して心配する場合があります。彼らとしては、特定のプロジェクトをソースコードからビルドするという問題含みではっきりと機能しないことがわかっている代替策を有効にすることになるので、これらのツール類によって使われることのないファイル群で彼らのパッケージのサイズが増えることを望まなかったり、ソースコード配布物を公開することを全く望まなかったりするのです。

source: On the other hand, some projects (NumPy_, for instance) decide to include tests in their installed packages. This has the added advantage of permitting users to run tests after installing them, for example to check for regressions after upgrading a dependency. Yet another approach is to split tests or test data into a separate Python package. Such an approach was taken by the cryptography_ project, with the large test vectors being split to cryptography-vectors_ package.
eo: Aliflanke, kelkaj projektoj (kiel NumPy_ ekzemple) decidas inkluzivi testojn en siaj instalitaj pakoj. Tio havas la ekstran avantaĝon ebligantan uzantojn ruli testojn post instalo, ekzemple por kontroli cimojn post ĝisdatigo de dependaĵo. Alia metodo estas disdividi testojn aŭ testajn datenojn en apartan Python-pakon. Tiun metodon uzas la projekto cryptography_, kies grandaj tekstovektoroj troviĝas en la pako cryptography-vectors_.
ja: 他方で、(例えば NumPy_ のような) いくつかのプロジェクトでは、そのインストールパッケージの中にテストスイートを同梱することに決めたものがあります。これによって、そのようなパッケージをインストールした後に、例えば依存先のパッケージをアップグレードした後にリグレッション (退行)がないかどうかの確認を行うために、ユーザがテストスイートを走らせることを許すという利点を追加することができます。さらに別のやり方としては、テストスイートやテストデータを別の Python パッケージに分割する方法があります。そのような方法は、巨大なテストベクトルを cryptography-vectors_package に分離する形で、 cryptography_ プロジェクトで採用されています。

source: A good idea is to use your source distribution in the release workflow. For example, the :ref:`build` tool does exactly that — it first builds a source distribution, and then uses it to build a wheel. This ensures that the source distribution actually works, and that it won't accidentally install fewer files than the official wheels.
eo: Bona ideo estas uzi la fontan distribuon en la eldona laborfluo. Ekzemple, la ilo :ref:`build` faras precize tion: ĝi unue konstruas fontan distribuon, kaj poste uzas ĝin por konstrui wheel. Tio certigas, ke la fonta distribuo fakte funkcias, kaj ke ĝi ne preterlasas dosierojn inkluzivitajn en la oficiala wheel.
ja: リリースの際のワークフローでソースコード配布物を用いるのは良い考えです。例えば、 :ref:`build` ツールは正にそれをやります -- まずソースコード配布物をビルドし、それを使って wheel をビルドするのです。これによって、ソースコード配布物が実際に動作することを確実にし、誤って公式の wheel よりも数の少ないファイル群をインストールしてしまうことがなくなります。

source: Ideally, also use the source distribution to run tests, build documentation, and so on, or add specific tests to make sure that all necessary files were actually included. Understandably, this requires more effort, so it's fine not do that — downstream packagers will report any missing files promptly.
eo: Ideale, ankaŭ uzu la fontan distribuon por ruli testojn, konstrui dokumentaron, ktp, aŭ aldonu specifajn testojn por certigi, ke ĉiuj necesaj dosieroj inkluziviĝis. Kompreneble, tio postulas pli da peno; tial, estas bone ne fari tion – malsuprulaj pakantoj tuj raportos ian ajn mankantan dosieron.
ja: 理想的には、テストスイートを走らせたり説明文書をビルドしたりといったことや、全ての必要なファイルが実際に含まれていることを確実にする特殊なテストを追加するのに、ソースコード配布物も使いましょう。当然のことですが、これはより多くの努力を必要としますので、こうしなくても問題はありません -- ダウンストリームのパッケージ作業者たちが素早く不足しているファイルを報告してくれるでしょう。

source: Do not use the Internet during the build process
eo: Ne uzi Interreton dum konstruado
ja: ビルドプロセスの最中にインターネットを使うことはやめましょう

source: Downstream builds are frequently done in sandboxed environments that cannot access the Internet. The package sources are unpacked into this environment, and all the necessary dependencies are installed.
eo: Malsuprulo ofte konstruas en izolita medio sen konekto al Interreto, malpakante la resursojn de la pako en tiun medion kaj instalante ĉiujn necesajn dependaĵojn.
ja: ダウンストリームのビルドは、しばしば、インターネットにアクセスすることができないサンドボックス化された環境の中で行われます。パッケージのソースファイルがこの環境内に展開され、必要な全ての依存関係がインストールされます。

source: Even if this is not the case, and assuming that you took sufficient care to properly authenticate downloads, using the Internet is discouraged for a number of reasons:
eo: Eĉ se ne, kaj supozante, ke oni taŭge aŭtentikigus elŝutojn, uzi Interreton estas malrekomendate pro la jenaj kialoj:
ja: 仮にこれが当てはまらない場合でも、適切にダウンロードを認証するために十分な注意を払っていたものと仮定して、インターネットを使うことはいくつもの理由から推奨されません:

source: The Internet connection may be unstable (e.g. due to poor reception) or suffer from temporary problems that could cause the process to fail or hang.
eo: La Interreta konekto povas esti malstabila (ekz. pro malbona sendrata reto) aŭ havi dumpteman problemon, kaŭzante malsukceson aŭ paraliziĝon de la procezo.
ja: インターネット接続は (例えば受信状態が悪いために) 不安定であるかもしれませんし、プロセスを失敗させたりハングさせたりしかねない一時的な問題の影響を受けるかもしれません。

source: The remote resources may become temporarily or even permanently unavailable, making the build no longer possible. This is especially problematic when someone needs to build an old package version.
eo: La foraj resursoj povas portempe aŭ eĉ daŭre neatingebligi, malebligante la konstruadon. Tio estas aparte problema, kiam oni devas konstrui malnovan version de pako.
ja: リモートにあるリソース群は、もはやビルドができなくなるような形で、一時的または永続的に利用不可能になるかもしれません。これは、特に、誰かが古いバージョンのパッケージをビルドする必要に迫られた時に問題となります。

source: The remote resources may change, making the build not reproducible.
eo: La foraj resursoj povas ŝanĝiĝi, nereproduktebligante la konstruon.
ja: リモートのリソース群は、ビルドが再現可能にならない形に変化するかもしれません。

source: Accessing remote servers poses a privacy issue and a potential security issue, as it exposes information about the system building the package.
eo: Kontakto al fora servilo kaŭzas problemojn pri privateco kaj eble sekureco, ĉar tio tralasas informojn pri la sistemo konstruanta la pakon.
ja: リモートのサーバにアクセスすることは、当該システムでそのパッケージをビルドしていることに関する情報を暴露するので、プライバシー問題と潜在的なセキュリティ問題をもたらします。

source: The user may be using a service with a limited data plan, in which uncontrolled Internet access may result in additional charges or other inconveniences.
eo: La uzanto eble uzas servon kun limigita datenplano tiel, ke senbrida konektado al Interreto povas kaŭzi kromajn pagendaĵojn aŭ aliajn ĝenojn.
ja: ユーザは、制御下にないインターネットアクセスが追加料金やその他の不都合に帰結してしまう、そのようなデータ量に制約のある通信サービスを使っているかもしれません。

source: Ideally, custom build scripts should not even attempt to access the Internet at all, unless explicitly requested to. If any resources are missing and need to be fetched, they should ask the user for permission first. If that is not feasible, the next best thing is to provide an opt-out switch to disable all Internet access. This could be done e.g. by checking whether a ``NO_NETWORK`` environment variable is set to a non-empty value.
eo: Ideale, propra konstrua programeto ne eĉ provu atingi Interreton sen eksplicita peto. Se ia resurso mankas kaj estas elŝutenda, la programeto petu por permeso unue. Se tio ne eblas, la dua plej bona opcio estas provizi baskulon por malŝalti ĉian atingon al Interreto, ekzemple kontrolante, ĉu iu media variablo «NO_NETWORK» estas nemalplena.
ja: 理想的には、カスタムビルド用スクリプトは、明示的に要求された場合を除いて、インターネットへのアクセスを試みることさえ全く行うべきでありません。もし、何らかのリソースが不足していてフェッチする必要があるなら、まずユーザに許可を求めるべきです。それが実現不可能であれば、次善の策は、あらゆるインターネットアクセスをさせないというオプトアウトのスイッチを提供するべきです。これは、例えば ``NO_NETWORK`` 環境変数が空でない値に設定されているか否かを調べることで行うことができます。

source: Since downstreams frequently also run tests and build documentation, the above should ideally extend to these processes as well.
eo: Ĉar malsupruloj ofte ankaŭ rulas testojn kaj konstruas dokumentaron, oni faru la ĉi-supron ankaŭ por tiaj procedoj.
ja: ダウンストリームは、しばしばテストを走らせたり説明文書をビルドしたりしますので、理想的を言えば、上記のことはこれらのプロセスにも同様に拡大適用されるべきです。

source: Please also remember that if you are fetching remote resources, you absolutely must *verify their authenticity* (usually against a hash), to protect against the file being substituted by a malicious party.
eo: Ankaŭ bonvolu memori, ke se oni elŝutas forajn resursojn, oni absolute devas *kontroli la aŭtentikecon* (ofte per haketaĵo), gardante kontraŭ fianstataŭigo far fiulo.
ja: もし、リモートのリソースをフェッチするのであれば、悪意ある第三者がファイルを置換しているという事態から保護するために、 (通常はハッシュ値を使って) 絶対に *その真正性を検証* しなければならないことも覚えておいてください。

source: Support building against system dependencies
eo: Ebligi konstruadon uzante sistemajn dependecojn
ja: システムの依存関係に対してビルドすることをサポートする

source: Some Python projects have non-Python dependencies, such as libraries written in C or C++. Trying to use the system versions of these dependencies in upstream packaging may cause a number of problems for end users:
eo: Kelkaj Python-projektoj dependas de ne-Python-aj bibliotekoj en ekz. C aŭ C++. Uzado de sistemaj versioj de tiaj dependaĵoj en suprula pakado kaŭzas multajn problemojn por uzantoj:
ja: Python プロジェクトの中には、 C や C++ で書かれたライブラリのような非 Python の依存関係を持つものがあります。アップストリームパッケージング内でこのような依存関係のシステムバージョンを使おうとする試行は、エンドユーザに多数の問題をもたらすかもしれません:

source: Building from a source distribution requires a source-compatible version of the dependency to be present, along with its development headers and other auxiliary files that some systems package separately from the library itself.
eo: Konstrui el fonta distribuo postulas font-kongruan version de la dependaĵo, kune kun ĝiaj ĉapoj kaj aliaj helpdosieroj, kiujn kelkaj sistemoj pakas aparte de la biblioteko mem.
ja: ソースコード配布物からのビルドには、ソースコードレベルで互換性のあるバージョンの依存関係先が、システムによってはライブラリ本体とは別のパッケージとして用意されていることがある、開発用のヘッダーファイルやその他の補助ファイルと共に、存在していることが要求されます。

source: Even for an experienced user, installing a compatible dependency version may be very hard. For example, the used Linux distribution may not provide the required version, or some other package may require an incompatible version.
eo: Eĉo por spertulo, instali kongruan version de dependaĵo povas esti malfacilege. Ekzemple, la postulata versio povus manki en la uzata Linux-distribuo, aŭ alia pako povus postuli nekongruan version.
ja: 経験を積んだユーザにとってさえ、互換性のある依存関係先のバージョンをインストールすることは極めて難しかもしれません。例えば、使っている Linux ディストロが要求されているバージョンを提供していないこともあり得るし、他のパッケージが互換性のないバージョンのものを要求しているかもしれません。

source: The linkage between the Python package and its system dependency is not recorded by the packaging system. The next system update may upgrade the library to a newer version that breaks binary compatibility with the Python package, and requires user intervention to fix.
eo: La pakada sistemone registras la ligon inter la Python-pako kaj la sistema dependaĵo. Sistema ĝisdatigo povas ĝisdatigi la bibliotekon al nova versio, rompante binaran kongruecon kun la Python-pako kaj postulante malaŭtomatan riparon.
ja: Python パッケージとそのシステム依存関係の間の関連性は、パッケージングシステムによって記録されているということはありません。次回のシステム更新がライブラリを、 Python パッケージとのバイナリ互換性を破壊するような、より新しいバージョンへとアップグレードするかもしれず、ユーザが修復のために介入することが要求されるかもしれません。

source: However, none of these issues apply to downstream packaging, and downstreams have good reasons to prefer dynamically linking to system dependencies. In particular:
eo: Tamen, neniu el tiuj problemoj validas por malsuprula pakado, kaj malsupruloj havas bonajn kialojn por preferi dinamikan bindadon al sistemaj dependaĵoj. Specife:
ja: しかしながら、これらの課題のどれひとつを取ってもそれはダウンストリームのパッケージングには当てはまらず、ダウンストリーム側ではシステムの依存関係に直接にリンクする方を好む十分な理由があります。とりわけ次のような場合:

source: In many cases, reliably sharing dynamic dependencies between components is a large part of the *purpose* of a downstream packaging ecosystem. Helping to support that makes it easier for users of those systems to access upstream projects in their preferred format.
eo: Ofte, fidinde komunigi dinamikajn dependaĵojn inter komponantoj estas granda parto de la *celo* de malsupruloa pakada ekosistemo. Helpante tion, oni faciligas por uzantoj de tiaj sistemoj uzi suprulajn projektojn en sia preferata formo.
ja: 多くのケースでは、部品間で動的な依存関係を信頼できる形で共有することが、ダウンストリーム側のパッケージングエコシステムの *目的* の大きな部分を占めています。それをサポートするのを補助することは、そのようなシステムのユーザが好ましいフォーマットでアップストリームのプロジェクトにアクセスすることをより容易にします。

source: Static linking and vendoring obscures the use of external dependencies, making source auditing harder.
eo: Statika bindado kaj kopiado kaŝas la uzon de eksteraj dependaĵoj, malfaciligante inspektadon de la fonto.
ja: 静的なリンキングと提供は、その出自の検証が難しくなるので、外部への依存関係の使用をわかりにくくします。

source: Dynamic linking makes it possible to quickly and systematically replace the used libraries across an entire downstream packaging ecosystem, which can be particularly important when they turn out to contain a security vulnerability or critical bug.
eo: Dinamika bindado ebligas rapide kaj sisteme anstataŭigi la uzitajn bibliotekojn tra tuta malsuprula pakada ekosistemo, kio gravas pri sekureca problemo aŭ severa cimo.
ja: 動的なリンキングは、ダウンストリームのパッケージングエコシステム全体で使用されるライブラリを素早く体系的に置き換えることができるようにしますが、それは、セキュリティ上の脆弱性や致命的なバグを含んでいることが判明した時には特に重要になり得ます。

source: Last but not least, static linking and vendoring results in duplication, and may increase the use of both disk space and memory.
eo: Laste, sed grave, statika bindado kaj kopiado de dependaĵoj kreas duplikatojn kaj povas uzi troon da diskospaco kaj memoro.
ja: 最後ではあるが最も軽微といういうわけではありませんが、静的なリンキングとベンダーリングの結果として重複が起きて、ディスクスペースとメモリの両方を余計に使うことになります。

source: Support downstream testing
eo: Subteni testadon far malsupruloj
ja: ダウンストリーム側のテストをサポートする

source: Verifying that the downstream packaging did not introduce any bugs.
eo: Konfirmi, ke la malsuprula pakado ne kreis cimojn.
ja: ダウンストリームのパッケージングがどんなバグも持ち込まないようにするために検証すること。

source: Testing on additional platforms that are not covered by upstream testing.
eo: Testi sur pliaj platformoj ol la suprula testaro.
ja: アップストリームのテストではカバーされていない追加的なプラットフォームでのテストを行うこと。

source: Finding subtle bugs that can only be reproduced with particular hardware, system package versions, and so on.
eo: Trovi subtilan cimon nur troveblan per specifaj aparatoj, versioj de sistemaj pakoj ktp.
ja: 特定のハードウェアやシステムパッケージのバージョンといったものだけで再現し得る些細なバグを探索すること。

source: Testing the released package against newer (or older) dependency versions than the ones present during upstream release testing.
eo: Testi la eldonitan pakon por versioj de dependaĵoj pli novaj (aŭ malnovaj) ol tiuj de la suprulaj testoj.
ja: アップストリーム側でのリリース時のテストで使われたものに比べて、より新しい (またはより古い) 依存先バージョンに対してリリース済パッケージをテストすること。

source: Testing the package in an environment closely resembling the production setup. This can detect issues caused by non-trivial interactions between different installed packages, including packages that are not dependencies of your package, but nevertheless can cause issues.
eo: Testi la pakon en medio tre simila al la medioj de uzantoj. Tio povas trovi cimojn okazantojn pro komplikaj interagoj inter diversaj instalitaj pakoj, inkluzive de tiuj pakoj, kiuj ne estas dependaĵoj de via pako sed tamen povas kaŭzi problemojn.
ja: 本番構成に非常によく似た環境でパッケージをテストすること。これによって、パッケージ自身の依存関係先ではないパッケージを含めて、異なるインストール済パッケージとの間の自明でない相互作用によって引き起こされる問題点を検出することができます。

source: Testing the released package against newer Python versions (including newer point releases), or less tested Python implementations such as PyPy.
eo: Testi la eldonitan pakon por pli novaj versioj de Python (inkluzive de punktaj eldonoj) aŭ maloftaj Python-realigoj kiel PyPy.
ja: リリースされたパッケージを、 (ポイントリリースを含めて) より新しい Python のバージョンや、よりテストされていない PyPy のような Python 実装に対してテストすること。

source: Include the test files and fixtures in the source distribution, or make it possible to easily download them separately.
eo: Inkluzivu la testo-dosierojn kaj testilojn en la fontan distribuon, aŭ faciligu aparte elŝuti ilin.
ja: テストファイルと必要品はソースコード配布物の中に含めておくか、簡単に個別にダウンロードできるようにしておきましょう。

source: Do not write to the package directories during testing. Downstream test setups sometimes run tests on top of the installed package, and modifications performed during testing and temporary test files may end up being part of the installed package!
eo: Ne skribu al la pakaj dosierujoj dum testado. Malsupruloj ofte testas sur la instalita pako; modifoj dum testado kaj provizoraj testdosieroj povas inkluziviĝi en la instalita pako!
ja: テストを実行している間は、パッケージのディレクトリに書き込んではいけません。ダウンストリーム側のテスト構成は、インストールパッケージのトップディレクトリで実行される場合があり、テスト実行中の修正や一時的なテストファイルがインストールパッケージの一部となってしまうかもしれません！

source: Make your tests work without a specialized setup, or perform the necessary setup as part of test fixtures. Do not ever assume that you can connect to system services such as databases — in an extreme case, you could crash a production service!
eo: Igu la testojn ruleblaj sen speciala aranĝo, aŭ faru la necesan aranĝon kiel parton de la testilo. Neniam supozu, ke oni povas konekti al sistemaj servoj kiel ekzemple datenbankoj – oni povus eĉ fiaskigi gravan servon!
ja: テストが特別な設定なしで動作するようにするか、または、必要な設定をテストの必要物の一部として行うようにしましょう。データベースのようなシステム側のサービスに接続することができるとは絶対に仮定しないでください -- とんでもない場合には、供用中のサービスをクラッシュさせるかもしれませんよ！

source: If your package has optional dependencies, make their tests optional as well. Either skip them if the needed packages are not installed, or add markers to make deselecting easy.
eo: Se via pako havas laŭvolajn dependecojn, igu iliajn testojn laŭvolaj ankaŭ. Aŭ transsaltu ilin, se la rilataj pakoj mankas, aŭ marku ilin por faciligi malelekti ilin.
ja: パッケージがオプションの依存関係を持つなら、その部分のテストもまたオプションにしましょう。必要なパッケージがインストールされていなければ、そのようなテストをスキップするか、簡単に選択外にすることができるようなマーカを追加しましょう。

source: More generally, add markers to tests with special requirements. These can include e.g. significant space usage, significant memory usage, long runtime, incompatibility with parallel testing.
eo: Pli ĝenerale, marku testojn kun specialaj postuloj. Tiuj povas inkluzivi ekz. signifan uzon de diskospaco aŭ memoro, longan ruladan daŭron, neparaleligeblecon.
ja: もっと一般的に、特別な要求事項を伴うテストにはマーカを付けましょう。これには、例えば、相当な記憶スペースを使用する、相当なメモリを使用する、長時間を要する、並行でテストを走らせることができない、などが含まれます。

source: Do not assume that the test suite will be run with ``-Werror``. Downstreams often need to disable that, as it causes false positives, e.g. due to newer dependency versions. Assert for warnings using ``pytest.warns()`` rather than ``pytest.raises()``!
eo: Ne supozu, ke oni rulos la testaron kun ``-Werror``. Malsupruloj ofte bezonas malŝalti ĝin pro malĝustaj pozitivoj, ekz. pri pli novaj versioj de dependecoj. Asertu avertojn per ``pytest.warns()``, ne ``pytest.raises()``!
ja: テストスイートが ``-Werror`` 付きで実行されるであろうと仮定してはなりません。それは、例えばより新しい依存関係のバージョンなどのせいで偽陽性を引き起こすので、往々にしてダウンストリーム側では無効にする必要があります。 ``pytest.raises()`` を使うよりも ``pytest.warns()`` を使って警告をアサートしてください！

source: Aim to make your test suite reliable and reproducible. Avoid flaky tests. Avoid depending on specific platform details, don't rely on exact results of floating-point computation, or timing of operations, and so on. Fuzzing has its advantages, but you want to have static test cases for completeness as well.
eo: Provu fidindigi kaj malhazardigi la testaron. Evitu malsukceman teston. Evitu dependi de detaloj pri iu platformo, aŭ ekzaktajn rezultojn de gliskoma operacio, aŭ la daŭro de operacioj ktp. Hazarda testado povas utili, sed ankaŭ havu statikajn testojn por kompleteco.
ja: テストスイートが信頼できて再現可能なものになることを目指しましょう。当てにならないテストを避けましょう。浮動小数点計算や操作のタイミングの結果をそのまま信頼することなど、特別なプラットフォームの細部に依存するものを避けましょう。ファジングには利点もありますが、完全性を期すための静的なテストも持っておきたいでしょう。

source: If your test suite takes significant time to run, support testing in parallel. Downstreams often maintain a large number of packages, and testing them all takes a lot of time. Using pytest-xdist_ can help them avoid bottlenecks.
eo: Se oni bezonas multon da tempo por ruli la testaron, subtenu paralelan testadon. Malsupruloj ofte mastrumas multajn pakojn, kaj testi ĉiujn postulas multegon da tempo. Uzi pytest-xdist_ povas malhelpi ŝtopiĝon.
ja: テストスイートの実行に非常に長い時間がかかるなら、並行テストをサポートしましょう。ダウンストリーム側は、しばしば、多数のパッケージを維持管理していて、それらを全てテストするには長い時間がかかります。ボトルネックを避けるには、 pytest-xdist_ を使うことが助けとなるでしょう。
