Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The difference between ``console_scripts`` and ``gui_scripts`` only affects Windows systems. ``console_scripts`` are wrapped in a console executable, so they are attached to a console and can use :py:data:`sys.stdin`, :py:data:`sys.stdout` and :py:data:`sys.stderr` for input and output. ``gui_scripts`` are wrapped in a GUI executable, so they can be started without a console, but cannot use standard streams unless application code redirects them. Other platforms do not have the same distinction.
eo: La diferenco inter ``console_scripts`` kaj ``gui_scripts`` nur gravas sur Windows. ``console_scripts`` estas volvita en konzolan ruleblaĵon, alligitan an konzolo, kiu povas uzi :py:data:`sys.stdin`, :py:data:`sys.stdout` kaj :py:data:`sys.stderr` por enigo kaj eligo. ``gui_scripts`` estas volvita en grafikan ruleblaĵon, uzeblan sen konzolo, kiu ne povas uzi la normajn fluojn sen eksplicita redirektado. Aliaj platformoj ne havas tian distingon.
ja: ``console_scripts`` と ``gui_scripts`` の違いは、 Windows システムにだけ影響を与えます。 ``console_scripts`` はコンソールで実行できるようにラップされるので、コンソールに接続されて 入出力に :py:data:`sys.stdin` ・ :py:data:`sys.stdout` ・ :py:data:`sys.stderr` を使えます。 ``gui_scripts`` は GUI で実行可能となるようにラップされるので、コンソールなしで起動することができ、しかし、アプリケーション側でリダイレクトしておかない限りは標準入出力を使うことができません。他のプラットフォームではこのような区別をしません。
ru: Разница между ``консольные скрипты`` и ``gui_скрипты`` влияет только на системы Windows. ``консольные_скрипты`` обернуты в консольный исполняемый файл, поэтому они подключаются к консоли и могут использовать :py: данные:`sys.stdin`, :py: данные:`sys.stdout` и :py: данные:`sys.stderr` для ввода и вывода. ``gui_скрипты`` оборачиваются в исполняемый файл GUI, поэтому их можно запускать без консоли, но они не могут использовать стандартные потоки, если код приложения не перенаправит их. На других платформах такого различия нет.
ta: `` கன்சோல்_ச்கிரிப்ட்ச்`` மற்றும் `` gui_scripts` ஆகியவற்றுக்கு இடையிலான வேறுபாடு சாளரங்கள் அமைப்புகளை மட்டுமே பாதிக்கிறது. `` console_scripts`` ஒரு கன்சோலில் இயங்கக்கூடியதாக இருக்கும், எனவே அவை ஒரு கன்சோலுடன் இணைக்கப்பட்டு பயன்படுத்தலாம்: py: தரவு: `sys.stdin`,: py: data:` sys.stdout` மற்றும்: py: தரவு: ` உள்ளீடு மற்றும் வெளியீட்டிற்கு sys.stderr`. `` gui_scripts`` ஒரு GUI இயங்கக்கூடியதாக மூடப்பட்டிருக்கும், எனவே அவை கன்சோல் இல்லாமல் தொடங்கப்படலாம், ஆனால் பயன்பாட்டுக் குறியீடு அவற்றை திருப்பிவிடாவிட்டால் நிலையான ச்ட்ரீம்களைப் பயன்படுத்த முடியாது. மற்ற தளங்களில் ஒரே வேறுபாடு இல்லை.

source: Install tools are expected to set up wrappers for both ``console_scripts`` and ``gui_scripts`` in the scripts directory of the install scheme. They are not responsible for putting this directory in the ``PATH`` environment variable which defines where command-line tools are found.
eo: Instalilo starigu volvilojn por kaj ``console_scripts`` kaj ``gui_scripts`` en la dosierujo ``scripts`` de la instala skemo. Instalilo ne respondecas pri metado de tiu dosierujo en la media variablo ``PATH`` difinanta la lokojn de komandliniaj iloj.
ja: インストールツールは、 ``console_scripts`` と ``gui_scripts`` の両方について、インストールスキームのスクリプト用ディレクトリにラッパをセットアップするものと期待されています。(しかし、インストールツールは) このディレクトリをコマンドラインツールを探索するために定義される ``PATH`` 環境変数に入れることについては責任を持ちません。
pt_br: Espera-se que as ferramentas de instalação configurem wrappers para ``console_scripts`` e ``gui_scripts`` no diretório de scripts do esquema de instalação. Eles não são responsáveis por colocar este diretório na variável de ambiente ``PATH`` que define onde as ferramentas de linha de comando são encontradas.
ru: Утилиты установки должны устанавливать обертки для ``console_scripts`` и ``gui_scripts`` в каталог scripts схемы установки. Они не отвечают за размещение этого каталога в переменной окружения ``PATH'', которая определяет, где находятся инструменты командной строки.
ta: நிறுவல் திட்டத்தின் ச்கிரிப்ட்ச் கோப்பகத்தில் `` கன்சோல்_ச்கிரிப்ட்ச்`` மற்றும் `` gui_scripts` ஆகிய இரண்டிற்கும் ரேப்பர்களை நிறுவும் கருவிகள் அமைக்கும் என்று எதிர்பார்க்கப்படுகிறது. கட்டளை-வரி கருவிகள் எங்கு காணப்படுகின்றன என்பதை வரையறுக்கும் `` பாதை` சுற்றுச்சூழல் மாறியில் இந்த கோப்பகத்தை வைப்பதற்கு அவர்கள் பொறுப்பல்ல.

source: As files are created from the names, and some filesystems are case-insensitive, packages should avoid using names in these groups which differ only in case. The behaviour of install tools when names differ only in case is undefined.
eo: Ĉar dosieroj kreiĝas de la nomoj, kaj kelkaj dosiersistemoj estas usklecblidaj, pako ne uzu tiajn nomojn en tiuj grupoj, kiaj nur diferencas usklece. La tiukaza konduto de instaliloj ne estas difinita.
ja: 名前からファイルが作られることと、いくつかのファイルシステムでは大文字小文字を区別しないことから、パッケージはこれらのグループについては大文字か小文字かの違いしかないような名前を使うことを避けるべきです。名前が大文字小文字しか違わない場合のインストールツールの挙動は未定義です。
pt_br: Como os arquivos são criados a partir dos nomes e alguns sistemas de arquivos não fazem distinção entre maiúsculas e minúsculas, os pacotes devem evitar o uso de nomes nesses grupos que diferem apenas em maiúsculas e minúsculas. O comportamento das ferramentas de instalação quando os nomes diferem apenas no caso de ser indefinido.
ru: Поскольку файлы создаются на основе имен, а некоторые файловые системы не чувствительны к регистру, пакеты должны избегать использования имен в этих группах, отличающихся только регистром. Поведение инструментов установки, когда имена отличаются только регистром, не определено.
ta: பெயர்களிலிருந்து கோப்புகள் உருவாக்கப்படுவதால், சில கோப்பு முறைமைகள் வழக்கு-உணர்வற்றவை என்பதால், தொகுப்புகள் இந்த குழுக்களில் பெயர்களைப் பயன்படுத்துவதைத் தவிர்க்க வேண்டும். பெயர்கள் வேறுபடும்போது நிறுவும் கருவிகளின் நடத்தை வரையறுக்கப்படவில்லை.

source: October 2017: This specification was written to formalize the existing entry points feature of setuptools (discussion_).
eo: Oktobro 2017: Tiu specifo estis verkita por formaligi la ekzistantan enirpunktan funkcion de setuptools (`diskuto <discussion>`_).
ja: 2017年10月: setuptools の既存のエントリポイント機能を公式のものとするためのこの仕様が書かれました (discussion_) 。
ru: Октябрь 2017 г: Эта спецификация была написана для формализации существующей функции точек входа в setuptools (discussion_).
ta: அக்டோபர் 2017: இந்த விவரக்குறிப்பு செட்ப்டூல்சின் (கலந்துரையாடல்_) இருக்கும் நுழைவு புள்ளிகள் அம்சத்தை முறைப்படுத்த எழுதப்பட்டது.

source: Externally Managed Environments
eo: Ekstere Mastrumataj Medioj
ja: 外部から管理される環境
pt_br: Ambiente gerenciado externamente
ru: Внешне управляемые среды
ta: வெளிப்புறமாக நிர்வகிக்கப்பட்ட சூழல்கள்

source: While some Python installations are entirely managed by the user that installed Python, others may be provided and managed by another means (such as the operating system package manager in a Linux distribution, or as a bundled Python environment in an application with a dedicated installer).
eo: Dum kelkaj instalaĵoj de Python estas plene mastrumataj de tiu uzanto, kiu instalis Python, aliaj instalaĵoj povas esti disponigitaj kaj mastrumataj alimaniere (kiel ekzemple la mastrumsistema pakadministrilo en Linux-distribuo, aŭ kiel faskigita Python-medio en programo kun propra instalilo).
ja: Python の導入方法の中には Python をインストールするユーザが全てを管理するものもある一方で、(Linux ディストリビューションのオペレーティングシステムが提供するパッケージマネージャや、専用のインストーラを伴うアプリケーションにおけるバンドルされた Python 環境のような) 別の手段で準備され管理されるものもあります。
pt_br: Embora algumas instalações do Python sejam totalmente gerenciadas pelo usuário que instalou o Python, outras podem ser fornecidas e gerenciadas por outros meios (como o gerenciador de pacotes do sistema operacional em uma distribuição Linux ou como um ambiente integrado Python em um aplicativo com um instalador dedicado).
ru: В то время как некоторые установки Python полностью управляются пользователем, установившим Python, другие могут предоставляться и управляться другими средствами (например, менеджером пакетов операционной системы в дистрибутиве Linux или окружением Python в приложении со специальной программой установки).
ta: சில பைதான் நிறுவல்கள் பைத்தானை நிறுவிய பயனரால் முழுமையாக நிர்வகிக்கப்படுகின்றன, மற்றவை மற்றொரு வழிமுறையால் வழங்கப்படலாம் மற்றும் நிர்வகிக்கப்படலாம் (லினக்ச் விநியோகத்தில் இயக்க முறைமை தொகுப்பு மேலாளர் அல்லது ஒரு பிரத்யேக நிறுவியுடன் ஒரு பயன்பாட்டில் தொகுக்கப்பட்ட பைதான் சூழலாக) .

source: Attempting to use conventional Python packaging tools to manipulate such environments can be confusing at best and outright break the entire underlying operating system at worst. Documentation and interoperability guides only go so far in resolving such problems.
eo: Provi uzi ordinaran Python-pakilon por administri tian medion estas konfuze kaj povas eĉ malstabiligi la tutan mastruman sistemon. Dokumentaro kaj gvidiloj pri kunfunkcipovo nur helpas iomete pri tiaj problemoj.
ja: そのような環境下で従来の Python のパッケージングツール類を使おうと試みることは、最もうまくいったときでも混乱を招く結果になり、最悪の場合には根底にあるオペレーティングシステム全体を完全に破壊してしまうことにもなりかねません。このような問題を解決する上では、説明文書と互換性ガイドだけが頼りになります。
pt_br: A tentativa de usar ferramentas de empacotamento convencionais Python para manipular esses ambientes pode ser confusa, na melhor das hipóteses, e, na pior das hipóteses, quebrar completamente todo o sistema operacional subjacente. Os guias de documentação e interoperabilidade passam longe da resolução de tais problemas.
ru: Попытка использовать обычные средства упаковки Python для работы с такими средами может в лучшем случае привести к путанице, а в худшем - к поломке всей базовой операционной системы. Документация и руководства по совместимости помогают решить такие проблемы.
ta: இதுபோன்ற சூழல்களைக் கையாள வழக்கமான பைதான் பேக்கேசிங் கருவிகளைப் பயன்படுத்த முயற்சிப்பது மிகச் சிறந்ததாகவும், முழு அடிப்படை இயக்க முறைமையையும் மிக மோசமாக உடைக்கும். ஆவணங்கள் மற்றும் இயங்குதன்மை வழிகாட்டிகள் இதுபோன்ற சிக்கல்களைத் தீர்ப்பதில் மட்டுமே இதுவரை செல்கின்றன.

source: This specification defines an ``EXTERNALLY-MANAGED`` marker file that allows a Python installation to indicate to Python-specific tools such as ``pip`` that they neither install nor remove packages into the interpreter’s default installation environment, and should instead guide the end user towards using :ref:`virtual-environments`.
eo: Ĉi tiu normo difinas markodosieron ``EXTERNALLY-MANAGED``, per kiu Python-instalo indikas al Python-specifa ilo kiel ``pip``, malhelpante instaladon al aŭ malinstaladon de la implicita instala medio de la interpretilo, kaj sugestante al la uzanton :ref:`virtualan medion <virtual-environments>`.
ja: この仕様では ``EXTERNALLY-MANAGED`` というマーカファイルを定義しており、これによって Python をインストールする際に ``pip`` のような Python に特有のツール群に対してインタプリタのデフォルトのインストール環境にパッケージをインストールしたり取り除いたりしないように指示し、その代わりに、エンドユーザに対して :ref:`仮想環境 <virtual-environments` を使うようにガイドするべきです。
ru: Эта спецификация определяет файл-маркер ``EXTERNALLY-MANAGED``, который позволяет установке Python указать таким специфичным для Python инструментам, как ``pip``, что они не устанавливают и не удаляют пакеты в среду установки интерпретатора по умолчанию, а вместо этого должны направить конечного пользователя на использование :ref:`virtual-environments`.
ta: இந்த விவரக்குறிப்பு `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` மார்க்கர் கோப்பை வரையறுக்கிறது, இது ஒரு பைதான் நிறுவலை பைதான்-குறிப்பிட்ட கருவிகளைக் குறிக்க அனுமதிக்கிறது, அதாவது `` பிஐபி`` அவை மொழிபெயர்ப்பாளரின் இயல்புநிலை நிறுவல் சூழலில் தொகுப்புகளை நிறுவவோ அல்லது அகற்றவோ இல்லை, அதற்கு பதிலாக இறுதி பயனரைப் பயன்படுத்துவதை வழிநடத்த வேண்டும்: ref: `மெய்நிகர்-சுற்றுச்சூழல்.

source: It also standardizes an interpretation of the ``sysconfig`` schemes so that, if a Python-specific package manager is about to install a package in an interpreter-wide context, it can do so in a manner that will avoid conflicting with the external package manager and reduces the risk of breaking software shipped by the external package manager.
ja: また、 Python 特有のパッケージマネージャがインタープリタ全体のコンテキストでパッケージをインストールしようとしている場合に、外部のパッケージマネージャと相互干渉を避け、また、外部のパッケージマネージャから導入されたソフトウェアを破壊する危険を避けるであろうやり方でインストールすることができるように ``sysconifg`` の翻訳を標準化しています。
ru: Он также стандартизирует интерпретацию схем ``sysconfig``, чтобы, если менеджер пакетов, специфичный для Python, собирается установить пакет в контексте всего интерпретатора, он мог сделать это таким образом, чтобы избежать конфликта с внешним менеджером пакетов и снизить риск поломки программ, поставляемых внешним менеджером пакетов.
ta: இது `` சிச்கான்ஃபிக்` திட்டங்களின் விளக்கத்தையும் தரப்படுத்துகிறது, இதனால் ஒரு பைதான்-குறிப்பிட்ட தொகுப்பு மேலாளர் ஒரு மொழிபெயர்ப்பாளர் அளவிலான சூழலில் ஒரு தொகுப்பை நிறுவ உள்ளால், வெளிப்புறத்துடன் முரண்படுவதைத் தவிர்க்கும் வகையில் அவ்வாறு செய்ய முடியும் தொகுப்பு மேலாளர் மற்றும் வெளிப்புற தொகுப்பு மேலாளரால் அனுப்பப்பட்ட மென்பொருளை உடைக்கும் அபாயத்தை குறைக்கிறது.

source: Terminology
eo: Terminaro
ja: 用語集
pt_br: Terminologia
ru: Терминология
ta: சொல்

source: A few terms used in this specification have multiple meanings in the contexts that it spans. For clarity, this specification uses the following terms in specific ways:
eo: Kelkaj terminoj uzitaj en tiu specifo havas plurajn signifojn tra kuntekstoj. Por klareco, ĉi tiu specifo uzas la jenajn terminojn jene:
ja: この仕様書で用いられる用語のいくつかには、それが置かれた文脈に従って複数の意味を持つものがあります。明確性のために、この仕様書では以下の用語を特定の意味で使用します:
ru: Некоторые термины, используемые в данной спецификации, имеют несколько значений в контекстах, которые она охватывает. Для ясности в данной спецификации следующие термины используются особым образом:
ta: இந்த விவரக்குறிப்பில் பயன்படுத்தப்படும் சில சொற்கள் அது பரவியிருக்கும் சூழல்களில் பல அர்த்தங்களைக் கொண்டுள்ளன. தெளிவுக்கு, இந்த விவரக்குறிப்பு பின்வரும் சொற்களை குறிப்பிட்ட வழிகளில் பயன்படுத்துகிறது:

source: distro
eo: distribuo
ja: 配布物 <distro>
ta: டிச்ட்ரோ

source: Short for "distribution," a collection of various sorts of software, ideally designed to work properly together, including (in contexts relevant to this document) the Python interpreter itself, software written in Python, and software written in other languages. That is, this is the sense used in phrases such as "Linux distro" or "Berkeley Software Distribution."
eo: Kolekto de diversaj specoj de programoj, ideale fasonitaj kohere, inkluzive de (en kuntekstoj rilataj al ĉ tiu dokumento) la Python-interpretilo mem, programoj verkitaj en Python, kaj programoj verkitaj en aliaj lingvoj. Tio estas la senco en la terminoj «Linux-distribuo» aŭ «Berkeley-Programdistribuo» (BSD).
ja: 短く言うと "配布物 <distribution>" で、適切に協働した動作をするように理想的に設計され、(この説明文書に適合する文脈で) Python インタープリタそのものを含み、Python で書かれたソフトウェアであり他の言語で書かれたソフトウェアでもある、さまざまな種類のソフトウェアの集合体。すなわち、これが "Linux ディストロ <Linux distro>" や "バークレーソフトウェア配布物 <Berkeley Software Distribution>" といったフレーズで使われる意味です。
ru: Сокращение от "дистрибутив", собрание различных программ, в идеале предназначенных для совместной работы, включая (в контексте, относящемся к данному документу) сам интерпретатор Python, программы, написанные на Python, и программы, написанные на других языках. Именно в этом смысле используются такие фразы, как "Дистрибутив Linux" или "Дистрибутив программного обеспечения Berkeley."
ta: "விநியோகத்திற்கான" குறுகிய, பல்வேறு வகையான மென்பொருள்களின் தொகுப்பாகும், இது (இந்த ஆவணத்துடன் தொடர்புடைய சூழல்களில்) பைதான் மொழிபெயர்ப்பாளர், பைத்தானில் எழுதப்பட்ட மென்பொருள் மற்றும் பிற மொழிகளில் எழுதப்பட்ட மென்பொருள் உட்பட ஒன்றாக ஒன்றாக வேலை செய்ய வடிவமைக்கப்பட்டுள்ளது. அதாவது, இது "லினக்ச் டிச்ட்ரோ" அல்லது "பெர்க்லி மென்பொருள் வழங்கல்" போன்ற சொற்றொடர்களில் பயன்படுத்தப்படும் உணர்வு.

source: A distro can be an operating system (OS) of its own, such as Debian, Fedora, or FreeBSD. It can also be an overlay distribution that installs on top of an existing OS, such as Homebrew or MacPorts.
eo: Distribuo povas esti memstara mastruma sistemo (OS), kiel Debian, Fedora aŭ FreeBSD. Ĝi ankaŭ povas esti plustavola distribuo instalita sur mastruman sistemon, kiel Homebrew aŭ MacPorts.
ja: 配布物 <distro> は、Debian 、 Fedora や FreeBSD のようなそれ自身のオペレーティングシステム (OS) であっても構いません。あるいは、 Homebrew や MacPorts のような既存の OS の上に重ねて配布物をインストールするものであっても構いません。
ru: Дистрибутив может быть самостоятельной операционной системой (ОС), такой как Debian, Fedora или FreeBSD. Он также может быть оверлейным дистрибутивом, который устанавливается поверх существующей ОС, например Homebrew или MacPorts.
ta: ஒரு டிச்ட்ரோ டெபியன், ஃபெடோரா அல்லது ஃப்ரீ.பி.எச்.டி போன்ற அதன் சொந்த இயக்க முறைமையாக (ஓஎச்) இருக்கலாம். இது ஓம்பிரூ அல்லது மேக்போர்ட்ச் போன்ற ஏற்கனவே உள்ள OS க்கு மேல் நிறுவும் மேலடுக்கு விநியோகமாகவும் இருக்கலாம்.

source: This document uses the short term "distro," because the term "distribution" has another meaning in Python packaging contexts: a source or binary distribution package of a single piece of Python language software, that is, in the sense of ``setuptools.dist.Distribution`` or "sdist". To avoid confusion, this document does not use the plain term "distribution" at all. In the Python packaging sense, it uses the full phrase "distribution package" or just "package" (see below).
eo: La termino «distribuo» havas alian signifon en Python-pakada kunteksto: fontan aŭ duuman distribuan pako de iu Python-lingva programo, en la senco de ``setuptools.dist.Distribution`` aŭ «fonta distribuo». Por eviti konfuzon, por la Python-pakada senco, ĉi tiu dokumento uzas la plenan terminon «distribua pako» aŭ simple «pako» (vidu ĉi-sube).
ja: Python のパッケージングの文脈では、"ディストリビューション <distribution>" という用語は別の意味、つまり、 Python 言語で書かれたソフトウェアのひとつの部品のソースコード配布パッケージまたはバイナリ配布パッケージ、即ち ``setuptools.dist.Distribution`` 乃至 "sdist" の意味での配布物という意味を持つので、この文書では短縮された用語である "ディストロ <distro>" を使います。混乱を避けるために、この文書では "ディストリビューション <distribution>" をそのままでは使わないことにします。 Python パッケージングの意味で使う時は完全形の "配布パッケージ <distribution package>" または単に "パッケージ <package>" を使います (後述します)。
ru: В этом документе используется краткий термин "дистрибутив", потому что термин "дистрибутив" имеет другое значение в контексте упаковки Python: исходный или бинарный дистрибутив отдельной части программного обеспечения языка Python, то есть в смысле ``setuptools.dist.Distribution`` или "sdist". Чтобы избежать путаницы, в этом документе вообще не используется обычный термин "дистрибутив". В смысле упаковки Python в нем используется полная фраза "дистрибутив" или просто "пакет" (см. ниже).
ta: இந்த ஆவணம் குறுகிய கால "டிச்ட்ரோ" ஐப் பயன்படுத்துகிறது, ஏனெனில் "வழங்கல்" என்ற சொல் பைதான் பேக்கேசிங் சூழல்களில் மற்றொரு பொருளைக் கொண்டுள்ளது: பைதான் மொழி மென்பொருளின் ஒற்றை பகுதியின் மூல அல்லது பைனரி விநியோக தொகுப்பு, அதாவது `` செட்டுப்டூல்கள் என்ற பொருளில். Dist.distribution`` அல்லது "Sdist". குழப்பத்தைத் தவிர்க்க, இந்த ஆவணம் "வழங்கல்" என்ற எளிய வார்த்தையைப் பயன்படுத்தாது. பைதான் பேக்கேசிங் அர்த்தத்தில், இது "விநியோக தொகுப்பு" அல்லது "தொகுப்பு" என்ற முழு சொற்றொடரைப் பயன்படுத்துகிறது (கீழே காண்க).

source: The provider of a distro - the team or company that collects and publishes the software and makes any needed modifications - is its **distributor**.
eo: La provizanto de distribuo – la teamo aŭ firmao kolektanta, eldonanta, kaj laŭbezone modifanta la programaron – estas ĝia **distribuanto**.
ja: ディストロを提供する者 - ソフトウェアを収集して公開し、何であれ必要とされる修正を加えるチームまたは企業 - は、その **配布者 <distributor>** です。
ru: Поставщик дистрибутива - команда или компания, которая собирает и публикует программное обеспечение и вносит в него необходимые изменения, - является его **дистрибьютором**.
ta: ஒரு டிச்ட்ரோவின் வழங்குநர் - மென்பொருளை சேகரித்து வெளியிடும் குழு அல்லது நிறுவனம் எந்தவொரு மாற்றங்களையும் செய்யும் - அதன் ** விநியோகச்தர் **.

source: package
eo: pako
ja: パッケージ
ru: пакет
ta: தொகுப்பு

source: A unit of software that can be installed and used within Python. That is, this refers to what Python-specific packaging tools tend to call a :term:`distribution package` or simply a "distribution"; the colloquial abbreviation "package" is used in the sense of the Python Package Index.
eo: Unuo de programo instalebla kaj uzebla en Python. Python-specifa pakilo ofte nomas ĝin :term:`distribua pako <distribution package>` aŭ simple «distribuo»; la familiara mallongigo «pako» estas uzata laŭ la nomo Python-Pakindekso.
ja: インストールすることができ、Python 内で使うことができるソフトウエアの単位。つまり、これは Python 特有のパッケージングツールが :term:`配布パッケージ <Distribution Package>` または単に "配布物" と呼びがちなものを参照しています; 口語的な省略形である "配布物" は Python Package Index の意味で使われます。
ru: Единица программного обеспечения, которая может быть установлена и использована в Python. То есть, это относится к тому, что специфические для Python средства упаковки обычно называют :term:`distribution package` или просто "дистрибутив"; разговорное сокращение "пакет" используется в смысле индекса пакетов Python.
ta: பைத்தானுக்குள் நிறுவப்பட்டு பயன்படுத்தக்கூடிய மென்பொருளின் ஒரு அலகு. அதாவது, பைதான்-குறிப்பிட்ட பேக்கேசிங் கருவிகள் ஒரு: கால: `விநியோக தொகுப்பு` அல்லது வெறுமனே ஒரு" வழங்கல் "என்று அழைக்க முனைகின்றன என்பதைக் குறிக்கிறது; பைதான் தொகுப்பு குறியீட்டின் அர்த்தத்தில் பேச்சுவழக்கு சுருக்கம் "தொகுப்பு" பயன்படுத்தப்படுகிறது.

source: This document does not use "package" in the sense of an importable name that contains Python modules, though in many cases, a distribution package consists of a single importable package of the same name.
eo: Ĉi tiu dokumento ne uzas la terminon «pako» en la senco de importebla nomo enhavanta Python-modulojn, kvankam ofte distribua pako ja konsistas el unu samnoma importebla pako.
ja: この説明文書は "配布物 <package>" を Python モジュールを含んでいてインポート可能なものの名前という意味では使いませんが、多くの場合、 配布パッケージは同名のインポート可能な単一のパッケージから構成されています。
ru: В этом документе слово "пакет" не используется в смысле импортируемого имени, содержащего модули Python, хотя во многих случаях дистрибутив состоит из одного импортируемого пакета с тем же именем.
ta: இந்த ஆவணம் பைதான் தொகுதிகள் கொண்ட இறக்குமதி செய்யக்கூடிய பெயரின் அர்த்தத்தில் "தொகுப்பு" ஐப் பயன்படுத்தாது, இருப்பினும் பல சந்தர்ப்பங்களில், ஒரு விநியோக தொகுப்பு அதே பெயரில் இறக்குமதி செய்யக்கூடிய ஒற்றை தொகுப்பைக் கொண்டுள்ளது.

source: This document generally does not use the term "package" to refer to units of installation by a distro's package manager (such as ``.deb`` or ``.rpm`` files). When needed, it uses phrasing such as "a distro's package." (Again, in many cases, a Python package is shipped inside a distro's package named something like ``python-`` plus the Python package name.)
ja: この説明文書では、"パッケージ <package>" という言葉で (``.deb`` や ``.rpm`` ファイルのような) ディストロのパッケージマネージャがインストールする単位を参照することはしません。必要な場合には "ディストロのパッケージ" などと言い換えて使います。 (再掲になりますが、多くの場合には、 Python パッケージがディストロのパッケージとして出荷される場合には Python パッケージの名称に ``python-`` を付け加えます。)
ru: В этом документе обычно не используется термин "пакет" для обозначения единиц установки менеджером пакетов дистрибутива (таких как файлы ``.deb`` или ``.rpm``). При необходимости используется формулировка "пакет дистрибутива". (Опять же, во многих случаях пакет Python поставляется внутри пакета дистрибутива с именем типа ``python-`` плюс имя пакета Python.)
ta: இந்த ஆவணம் பொதுவாக ஒரு டிச்ட்ரோவின் தொகுப்பு மேலாளரால் நிறுவலின் அலகுகளைக் குறிக்க "தொகுப்பு" என்ற வார்த்தையைப் பயன்படுத்தாது (போன்றவை `.deb`` அல்லது` .rpm`` கோப்புகள் போன்றவை). தேவைப்படும்போது, இது "ஒரு டிச்ட்ரோவின் தொகுப்பு" போன்ற சொற்றொடரைப் பயன்படுத்துகிறது. .

source: Python-specific package manager
eo: Python-specifa pakadministrilo
ja: Python 特有のパッケージマネージャ
ru: Python-специфический менеджер пакетов
ta: பைதான்-குறிப்பிட்ட தொகுப்பு மேலாளர்
