Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: November 2020: The original version of this specification was approved through :pep:`643`.
eo: Novembro 2020: La originala versio de ĉi tiu specifo estis aprobita per :pep:`643`.
ja: 2020年11月: :pep:`643` を通じてこの仕様の当初のバージョンが承認された。
ru: Ноябрь 2020 года: Первоначальная версия этой спецификации была одобрена через :pep:`643`.
ta: நவம்பர் 2020: இந்த விவரக்குறிப்பின் அசல் பதிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `643`.

source: July 2021: Defined what a source tree is.
eo: Julio 2021: Difinis fontarbon.
ja: 2021年7月: ソースコードツリーとは何であるかを定義。
ru: Июль 2021 года: Определено, что такое дерево источников.
ta: சூலை 2021: ஒரு மூல மரம் என்றால் என்ன என்பதை வரையறுத்தது.

source: September 2022: The filename of a source distribution was standardized through :pep:`625`.
eo: Septembro 2022: La dosiernomo de fonta distribuo estis normigita per :pep:`625`.
ja: 2022年9月: :pep:`625` を通じて、ソースコード配布物のファイル名を標準化した。
ru: Сентябрь 2022: Имя файла исходного дистрибутива было стандартизировано через :pep:`625`.
ta: செப்டம்பர் 2022: மூல விநியோகத்தின் கோப்பு பெயர் தரப்படுத்தப்பட்டது: PEP: `625`.

source: August 2023: Source distribution archive features were standardized through :pep:`721`.
eo: Aŭgusto 2023: Trajtoj de fontdistribuaj arĥivoj estis normigitaj per :pep:`721`.
ja: 2023年8月: : pep:`721` を通じて、ソースコード配布物のアーカイブの機能について標準化された。
ru: Август 2023 года: Функции архива дистрибутива исходных текстов были стандартизированы с помощью :pep:`721`.
ta: ஆகச்ட் 2023: மூல விநியோக காப்பக நற்பொருத்தங்கள் தரப்படுத்தப்பட்டன: PEP: `721`.

source: December 2024: License files inclusion into source distribution was standardized through :pep:`639`.
eo: Decembro 2024: inkluzivo de licenco-dosiero en fonta distribuo estis normigita per :pep:`639`.
ru: Декабрь 2024 года: Включение файлов лицензий в дистрибутив исходных текстов было стандартизировано с помощью :pep:`639`.
ta: டிசம்பர் 2024: மூல விநியோகத்தில் உரிமக் கோப்புகளைச் சேர்ப்பது தரப்படுத்தப்பட்டது: PEP: `639`.

source: Version specifiers
eo: Versispecifiloj
ja: バージョン指定子
pt_br: Especificadores de versão
ru: Спецификаторы версии
ta: பதிப்பு விவரக்குறிப்புகள்

source: This specification describes a scheme for identifying versions of Python software distributions, and declaring dependencies on particular versions.
eo: Jen specifo pri skemo por identigi versiojn de Python-programaj distribuoj kaj deklari dependecojn sur specifaj versioj.
ja: この仕様では、 Python ソフトウェア配布物のバージョンを識別したり、特定のバージョンにおける依存関係を宣言したりする枠組みを記述します。
ru: Эта спецификация описывает схему идентификации версий программных дистрибутивов Python и объявления зависимостей от конкретных версий.
ta: இந்த விவரக்குறிப்பு பைதான் மென்பொருள் விநியோகங்களின் பதிப்புகளை அடையாளம் காண்பதற்கான திட்டத்தை விவரிக்கிறது, மேலும் குறிப்பிட்ட பதிப்புகளில் சார்புகளை அறிவிக்கிறது.

source: Definitions
eo: Difinoj
ja: 用語定義
ru: Определение
ta: வரையறைகள்

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in :rfc:`2119`.
eo: La ŝlosilvortoj «DEVAS» (MUST, SHALL), «DEVAS NE» (MUST NOT, SHALL NOT), «POSTULATA» (REQUIRED), «-U» (SHOULD), «NE -U» (SHOULD NOT), «REKOMENDATA» (RECOMMENDED), «POVAS» (MAY), kaj «NEDEVIGA» (OPTIONAL) en ĉi tiu dokumento estas interpretataj laŭ :rfc:`2119`.
ja: この説明文書におけるキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", および "OPTIONAL" は、 :rfc:`2119` に記述されているように解釈されます。
ru: Ключевые слова "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY" и "OPTIONAL" в этом документе должны интерпретироваться так, как описано в :rfc:`2119`.
ta: "கட்டாயம்", "செய்யக்கூடாது", "தேவை", "வேண்டும்", "வேண்டும்", ",", ",", ",", "பரிந்துரைக்கப்படக்கூடாது", "மே" மற்றும் "விருப்பமானது" ஆகியவை விவரிக்கப்பட்டுள்ளபடி விளக்கப்பட வேண்டும்: RFC: `2119`.

source: "Build tools" are automated tools intended to run on development systems, producing source and binary distribution archives. Build tools may also be invoked by integration tools in order to build software distributed as sdists rather than prebuilt binary archives.
eo: «Konstruilo» estas aŭtomata ilo por evoluada sistemo, produktanta fonto-distribuajn kaj duum-distribuajn arĥivojn. Konstruilon integrilo povas alvoki, por konstrui programon distribuitan kiel fontan distribuon, ne kiel antaŭkonstruitan duuman arĥivon.
ja: "ビルドツール <Build tools>" とは、開発システムを走らせてソースコード配布物やバイナリ配布物のアーカイブを生成することを意図した自動化ツールのことです。ビルドツールは、また、ビルド済みのバイナリのアーカイブではなくて sdist として配布されるソフトウェアをビルドする目的で統合ツールから起動されることもあります。
ru: "Инструменты сборки" - это автоматизированные инструменты, предназначенные для работы в системах разработки и создающие архивы исходных текстов и бинарных дистрибутивов. Инструменты сборки также могут вызываться средствами интеграции для сборки программного обеспечения, распространяемого в виде sdists, а не предварительно собранных бинарных архивов.
ta: "பில்ட் கருவிகள்" என்பது மேம்பாட்டு அமைப்புகளில் இயங்குவதை நோக்கமாகக் கொண்ட தானியங்கி கருவிகள், மூல மற்றும் பைனரி விநியோக காப்பகங்களை உருவாக்குகிறது. பைனரி காப்பகங்களை முன்பே கட்டியெழுப்புவதை விட SDIST களாக விநியோகிக்கப்பட்ட மென்பொருளை உருவாக்குவதற்கு ஒருங்கிணைப்பு கருவிகளால் உருவாக்க கருவிகள் பயன்படுத்தப்படலாம்.

source: "Index servers" are active distribution registries which publish version and dependency metadata and place constraints on the permitted metadata.
eo: «Indekso-servilo» estas aktiva distribuo-registro eldonanta metadatenojn pri versioj kaj dependecoj kaj limigas la permesatajn metadatenojn.
ja: "インデックスサーバ <Index servers>" とは、バージョンと依存関係のメタデータを広報し、許されるメタデータに制限を加えるような、正規の配布物の登記所にあたるものです。
ru: "Индексные серверы" - это активные реестры распространения, которые публикуют метаданные о версиях и зависимостях и накладывают ограничения на разрешенные метаданные.
ta: "இன்டெக்ச் சேவையகங்கள்" என்பது செயலில் விநியோக பதிவுகள் ஆகும், அவை பதிப்பு மற்றும் சார்பு மெட்டாடேட்டாவை வெளியிடுகின்றன மற்றும் அனுமதிக்கப்பட்ட மெட்டாடேட்டாவில் இடக் கட்டுப்பாடுகளை வெளியிடுகின்றன.

source: "Publication tools" are automated tools intended to run on development systems and upload source and binary distribution archives to index servers.
eo: «Eldonilo» estas aŭtomata ilo ruliĝanta sur evoluada sistemo por alŝuti fontajn kaj duumajn distribuajn arĥivojn al indeksoserviloj.
ja: "出版ツール <Publication tools>" とは、開発システムを走らせ、ソースコード配布物やバイナリ配布物のアーカイブをインデックスサーバへアップロードすることを意図した自動化ツールのことです。
ru: "Инструменты публикации" - это автоматизированные инструменты, предназначенные для запуска на системах разработки и загрузки архивов исходных и бинарных дистрибутивов на индексные серверы.
ta: "வெளியீட்டு கருவிகள்" என்பது மேம்பாட்டு அமைப்புகளில் இயங்குவதற்கும், மூல மற்றும் பைனரி விநியோக காப்பகங்களை குறியீட்டு சேவையகங்களுக்கு பதிவேற்றுவதற்கும் நோக்கம் கொண்ட தானியங்கி கருவிகள்.

source: "Installation tools" are integration tools specifically intended to run on deployment targets, consuming source and binary distribution archives from an index server or other designated location and deploying them to the target system.
eo: «Instalilo» estas integrilo specife por disponebligaĵoj, konsumanta fontan aŭ duuman distribuan arĥivon el indeksa servilo aŭ alia provizita loko kaj disponiganta ĝin al la cela sistemo.
ja: "インストールツール <Installation tools>" とは、デプロイメントターゲット上で走らせ、インデックスサーバもしくは別途指定された場所から得たソースコード配布物やバイナリ配布物のアーカイブを入力として、ターゲットとなるシステムに配置することを意図した統合ツールです。
ru: "Инструменты установки" - это инструменты интеграции, специально предназначенные для запуска на объектах развертывания, потребляющие исходные и двоичные архивы дистрибутивов с индексного сервера или другого указанного места и развертывающие их на целевой системе.
ta: "நிறுவல் கருவிகள்" என்பது ஒருங்கிணைப்பு கருவிகள் குறிப்பாக வரிசைப்படுத்தல் இலக்குகள், நுகர்வு மூல மற்றும் பைனரி விநியோக காப்பகங்களை ஒரு குறியீட்டு சேவையகம் அல்லது பிற நியமிக்கப்பட்ட இடத்திலிருந்து இயக்கவும், அவற்றை இலக்கு அமைப்புக்கு அனுப்பவும் நோக்கம் கொண்டவை.

source: "Automated tools" is a collective term covering build tools, index servers, publication tools, integration tools and any other software that produces or consumes distribution version and dependency metadata.
eo: «Aŭtomataj iloj» estas kolektiva esprimo inkluzivanta konstruilojn, indeksoservilojn, eldonilojn, integrilojn kaj ajnajn aliajn programojn produktantajn aŭ konsumantajn medatatenojn pri versioj kaj dependecoj de distribuo.
ja: "自動化ツール <Automated tools>" とは、ビルドツール・インデックスサーバ・出版ツール・統合ツールや、配布物のバージョン・依存関係メタデータを作り出したり入力として扱うその他のソフトウェアを集合的に包含する用語です。
ru: "Автоматизированные инструменты" - это собирательный термин, охватывающий инструменты сборки, индексные серверы, инструменты публикации, инструменты интеграции и любое другое программное обеспечение, которое производит или потребляет метаданные о версиях и зависимостях дистрибутива.
ta: "தானியங்கி கருவிகள்" என்பது உருவாக்கும் கருவிகள், குறியீட்டு சேவையகங்கள், வெளியீட்டு கருவிகள், ஒருங்கிணைப்பு கருவிகள் மற்றும் விநியோக பதிப்பு மற்றும் சார்பு மெட்டாடேட்டாவை உருவாக்கும் அல்லது நுகரும் வேறு எந்த மென்பொருளையும் உள்ளடக்கியது.

source: Version scheme
eo: Versia skemo
ja: バージョン番号枠組み
ru: Схема версии
ta: பதிப்பு திட்டம்

source: Distributions are identified by a public version identifier which supports all defined version comparison operations
eo: Distribuo estas identigita per publika versio-identigilo subtenanta ĉiujn difinitajn versikomparajn operaciojn
ja: 配布物は、すべての定義されたバージョン比較操作をサポートしている公的バージョン識別子によって識別されます。
ru: Дистрибутивы идентифицируются общедоступным идентификатором версии, который поддерживает все определенные операции сравнения версий
ta: அனைத்து வரையறுக்கப்பட்ட பதிப்பு ஒப்பீட்டு செயல்பாடுகளையும் ஆதரிக்கும் பொது பதிப்பு அடையாளங்காட்டியால் விநியோகங்கள் அடையாளம் காணப்படுகின்றன

source: The version scheme is used both to describe the distribution version provided by a particular distribution archive, as well as to place constraints on the version of dependencies needed in order to build or run the software.
eo: La versioskemo estas uzata kaj por priskribi la distribuversion disponigitan de iu distribuo-arĥivo kaj ankaŭ por limigi la versiojn de dependaĵoj necesaj por konstrui aŭ ruli la programon.
ja: バージョン枠組みは、特定の配布物アーカイブによって提供される配布物のバージョンを記述するためにも使われますし、同様に、当該ソフトウェアをビルドしたり走らせたりするために必要な依存関係にあるバージョンに対して制約を加えるためにも使われます。
ru: Схема версий используется как для описания версии дистрибутива, предоставляемого конкретным архивом дистрибутива, так и для наложения ограничений на версии зависимостей, необходимых для сборки или запуска программного обеспечения.
ta: ஒரு குறிப்பிட்ட விநியோக காப்பகத்தால் வழங்கப்பட்ட விநியோக பதிப்பை விவரிக்கவும், மென்பொருளை உருவாக்க அல்லது இயக்குவதற்குத் தேவையான சார்புகளின் பதிப்பில் தடைகளை வைக்கவும் பதிப்பு திட்டம் பயன்படுத்தப்படுகிறது.

source: Public version identifiers
eo: Publikaj versiidentigiloj
ja: 公的バージョン識別子
ru: Идентификаторы общедоступных версий
ta: பொது பதிப்பு அடையாளங்காட்டிகள்

source: The canonical public version identifiers MUST comply with the following scheme::
eo: La kanona publika versia identigilo DEVAS observi la jenan skemon::
ja: 正統な公的バージョン識別子は、以下の枠組みに合致していなければなりません::
ru: Канонические идентификаторы публичных версий ДОЛЖНЫ соответствовать следующей схеме::
ta: நியமன பொது பதிப்பு அடையாளங்காட்டிகள் பின்வரும் திட்டத்திற்கு இணங்க வேண்டும் ::

source: Public version identifiers MUST NOT include leading or trailing whitespace.
eo: Publika versia identigilo DEVAS NE inkluzivi komencan aŭ finan blankan spacon.
ja: 公的バージョン識別子は、先頭もしくは末尾に空白文字を含んではなりません。
ru: Идентификаторы общедоступных версий НЕ ДОЛЖНЫ содержать ведущие или завершающие пробельные символы.
ta: பொது பதிப்பு அடையாளங்காட்டிகளில் முன்னணி அல்லது பின்தங்கிய இடைவெளியைக் கொண்டிருக்கக்கூடாது.

source: Public version identifiers MUST be unique within a given distribution.
eo: Publika versia identigilo DEVAS esti unika en iu distribuo.
ja: 公的バージョン識別子は、その配布物の中で一意でなければなりません。
ru: Идентификаторы публичных версий ДОЛЖНЫ быть уникальными в пределах одного дистрибутива.
ta: கொடுக்கப்பட்ட விநியோகத்திற்குள் பொது பதிப்பு அடையாளங்காட்டிகள் தனித்துவமாக இருக்க வேண்டும்.

source: Installation tools SHOULD ignore any public versions which do not comply with this scheme but MUST also include the normalizations specified below. Installation tools MAY warn the user when non-compliant or ambiguous versions are detected.
eo: Instalilo IGNORU ajnan publikan version, kiu ne observas tiun skemon, kaj DEVAS inkluzivi la normigojn ĉi-subajn. Instalilo POVAS averti la uzanton, kiam ĝi trovas neobservantajn aŭ ambiguajn versiojn.
ja: インストールツール <Installation tools> は、この枠組みに合致しない公的バージョンのすべてを無視するべきですが、以下に指定される標準化も含んでいなければなりません。インストールツールは、バージョンが非適合であったり曖昧であったりした時には、ユーザに対して警告を行なっても構いません。
ru: Средства установки ДОЛЖНЫ игнорировать любые публичные версии, которые не соответствуют этой схеме, но также ДОЛЖНЫ включать нормализации, указанные ниже. Средства установки МОГУТ предупреждать пользователя при обнаружении несоответствующих или неоднозначных версий.
ta: நிறுவல் கருவிகள் இந்த திட்டத்திற்கு இணங்காத எந்தவொரு பொது பதிப்புகளையும் புறக்கணிக்க வேண்டும், ஆனால் கீழே குறிப்பிடப்பட்டுள்ள இயல்பாக்கங்களையும் சேர்க்க வேண்டும். இணக்கமற்ற அல்லது தெளிவற்ற பதிப்புகள் கண்டறியப்படும்போது நிறுவல் கருவிகள் பயனரை எச்சரிக்கலாம்.

source: See also :ref:`version-specifiers-regex` which provides a regular expression to check strict conformance with the canonical format, as well as a more permissive regular expression accepting inputs that may require subsequent normalization.
eo: Vidu ankaŭ :ref:`version-specifiers-regex`, kiu provizas regulan esprimon por kontroli striktan konformecon al la kanona formo, kaj pli permeseman regulan esprimon por tiuj enigaĵoj, kiujn oni devas normigi poste.
ja: 正統なフォーマットに厳密に適合していることを確認するための正規表現についても、さらに標準化する必要があるかもしれない入力を受け入れるためのより緩やかな正規表現についても、これらを提供する :ref:`version-specifiers-regex` を見てください。
ru: См. также :ref:`version-specifiers-regex`, который предоставляет регулярное выражение для проверки строгого соответствия каноническому формату, а также более свободное регулярное выражение, принимающее входные данные, которые могут потребовать последующей нормализации.
ta: மேலும் காண்க: குறிப்பு: `பதிப்பு-விவரிப்பாளர்கள்-ரெசெக்ச்` இது நியமன வடிவத்துடன் கடுமையான இணக்கத்தை சரிபார்க்க வழக்கமான வெளிப்பாட்டை வழங்குகிறது, அத்துடன் அடுத்தடுத்த இயல்பாக்கம் தேவைப்படும் உள்ளீடுகளை ஏற்றுக்கொள்வது மிகவும் அனுமதிக்கப்பட்ட வழக்கமான வெளிப்பாடு.

source: Public version identifiers are separated into up to five segments:
eo: Publika versia identigilo konsistas el maksimume kvin segmentoj:
ja: 公的バージョン識別子は５個の部分に分割されます:
ru: Идентификаторы публичных версий разделяются на пять сегментов:
ta: பொது பதிப்பு அடையாளங்காட்டிகள் ஐந்து பிரிவுகளாக பிரிக்கப்படுகின்றன:

source: Epoch segment: ``N!``
eo: Epoka segmento: ``N!``
ja: エポック部分: ``N!``
pt_br: Segmento de época: ``N!``
ru: Эпохальный сегмент: ``N!``
ta: சகாப்தம்: `` `

source: Release segment: ``N(.N)*``
eo: Eldona segmento: ``N(.N)*``
ja: リリース部分: ``N(.N)*``
pt_br: Segmento de lançamento: ``N(.N)*``
ru: Сегмент выпуска: ``N(.N)*``
ta: வெளியீட்டு பிரிவு: `` n (.n)*``

source: Pre-release segment: ``{a|b|rc}N``
eo: Antaŭeldona segmento: ``{a|b|rc}N``
ja: プレリリース部分: ``{a|b|rc}N``
pt_br: Segmento de pré-lançamento: ``{a|b|rc}N``
ru: Предрелизный сегмент: ``{a|b|rc}N``
ta: முன் வெளியீட்டு பிரிவு: `{a | b | rc} n``

source: Post-release segment: ``.postN``
eo: Posteldona segmento: ``.postN``
ja: ポストリリース部分: ``.postN``
pt_br: Segmento de pós lançamento: ``.postN``
ru: Пост-релизный сегмент: ``.postN``
ta: வெளியீட்டுக்குப் பிந்தைய பிரிவு: `` .போச்ட்ன்``

source: Development release segment: ``.devN``
eo: Evoluada eldona segmento: ``.devN``
ja: 開発リリース部分: ``.devN``
pt_br: Segmento de versão de desenvolvimento: ``.devN``
ru: Сегмент релиза разработки: ``.devN``
ta: மேம்பாட்டு வெளியீட்டு பிரிவு: `` .டெவ்ன்``

source: Any given release will be a "final release", "pre-release", "post-release" or "developmental release" as defined in the following sections.
eo: Ĉia eldono estas aŭ «fina eldono», aŭ «antaŭeldono», aŭ «posteldono» aŭ «evolua eldono» laŭ la ĉi-subaj paragrafoj.
ja: どのリリースであっても、この後の節で定義する "最終リリース <final release>"・"プレリリース <pre-release>"・"ポストリリース <post-release>"・"開発リリース <developmental release>" になることでしょう。
ru: Любой конкретный релиз может быть "финальным релизом", "предварительным релизом", "пост-релизом" или "девелоперским релизом", как определено в следующих разделах.
ta: எந்தவொரு வெளியீட்டும் பின்வரும் பிரிவுகளில் வரையறுக்கப்பட்டுள்ளபடி "இறுதி வெளியீடு", "முன் வெளியீடு", "வெளியீட்டுக்கு பிந்தைய" அல்லது "மேம்பாட்டு வெளியீடு" ஆகும்.

source: All numeric components MUST be non-negative integers represented as sequences of ASCII digits.
eo: Ĉiu nombra komponanto DEVAS esti nenegativa entjero reprezentita kiel vico de Askiaj ciferoj.
ja: 数字で構成される部分は、すべて、 ASCII の数字の並びとして表現される非負の整数でなければなりません。
ru: Все числовые компоненты ДОЛЖНЫ быть неотрицательными целыми числами, представленными в виде последовательностей цифр ASCII.
ta: அனைத்து எண் கூறுகளும் ASCII இலக்கங்களின் வரிசைகளாக குறிப்பிடப்படும் எதிர்மறை அல்லாத முழு எண்களாக இருக்க வேண்டும்.

source: All numeric components MUST be interpreted and ordered according to their numeric value, not as text strings.
eo: Ĉiu numera komponanto DEVAS esti interpretata kaj ordigita laŭ sia numera valoro, ne kiel teksto.
ja: 数字で構成される部分は、すべて、テキスト文字列としてではなく、数としての値に従って解釈され整列されなければなりません。
ru: Все числовые компоненты ДОЛЖНЫ интерпретироваться и упорядочиваться в соответствии с их числовым значением, а не как текстовые строки.
ta: அனைத்து எண் கூறுகளும் அவற்றின் எண் மதிப்புக்கு ஏற்ப விளக்கப்பட்டு ஆர்டர் செய்யப்பட வேண்டும், உரை சரங்களாக அல்ல.

source: All numeric components MAY be zero. Except as described below for the release segment, a numeric component of zero has no special significance aside from always being the lowest possible value in the version ordering.
eo: Ĉia numera komponanto POVAS esti nulo. Krom la ĉi-suba paragrafo pri la eldono-segmento, la numera komponanto nulo ne estas speciala; ĝi estas simple la plej malgranda valoro je ordigado de versioj.
ja: 数字で構成される部分は、すべて、ゼロであっても構いません。リリースを表す部分について後で記述する場合を除いて、数字の部分がゼロであることは、常にバージョンの整列で取り得る最小の値であること以外には、なんら特別な重要性を持ちません。
ru: Все числовые компоненты МОГУТ быть нулевыми. За исключением случаев, описанных ниже для сегмента выпуска, числовой компонент, равный нулю, не имеет особого значения, кроме того, что всегда является наименьшим возможным значением при упорядочивании версий.
ta: அனைத்து எண் கூறுகளும் பூச்சியமாக இருக்கலாம். வெளியீட்டுப் பிரிவுக்கு கீழே விவரிக்கப்பட்டுள்ளதைத் தவிர, பூச்சியத்தின் ஒரு எண் கூறுக்கு பதிப்பு வரிசைப்படுத்தலில் எப்போதும் மிகக் குறைந்த மதிப்பாக இருப்பதைத் தவிர்த்து சிறப்பு முக்கியத்துவம் இல்லை.

source: Some hard to read version identifiers are permitted by this scheme in order to better accommodate the wide range of versioning practices across existing public and private Python projects.
eo: Kelkaj malfacile legeblaj versio-identigiloj estas permesataj de tiu skemo por pli bone adapti al la larĝa gamo de versio-formoj en ekzistantaj publikaj kaj privataj Python-projektoj.
ja: 読解困難なバージョン識別子のいくつかは、既存の公開または非公開の Python プロジェクトにおける幅広いバージョン付与方法をよりうまく収容するために、この枠組みによって許容されています。
ru: Эта схема допускает использование некоторых трудночитаемых идентификаторов версий, чтобы лучше приспособиться к широкому спектру практик версионирования в существующих общественных и частных проектах Python.
ta: தற்போதுள்ள பொது மற்றும் தனியார் பைதான் திட்டங்களில் பரந்த அளவிலான பதிப்பு நடைமுறைகளுக்கு ஏற்றவாறு இந்த திட்டத்தால் பதிப்பு அடையாளங்காட்டிகளைப் படிக்க சில கடினமாக உள்ளது.

source: Accordingly, some of the versioning practices which are technically permitted by the specification are strongly discouraged for new projects. Where this is the case, the relevant details are noted in the following sections.
eo: Tial, kelkaj el la versiaj formoj teĥnike permesataj de la specifo estas malrekomendegataj por novaj projektoj. Por tiaj kazoj, la ĉi-subaj paragrafoj notas detalojn.
ja: 従って、当該仕様で技術的に許容されているバージョン付与方法のいくつかは、新規プロジェクトにおいては強い非推奨になっています。これが問題になるケースでは、引き続く節に関連する詳細事項をまとめてあります。
ru: Соответственно, некоторые методы версионирования, которые технически разрешены спецификацией, настоятельно не рекомендуются для новых проектов. Если это так, то соответствующие детали указаны в следующих разделах.
ta: அதன்படி, விவரக்குறிப்பால் தொழில்நுட்ப ரீதியாக அனுமதிக்கப்பட்ட சில பதிப்பு நடைமுறைகள் புதிய திட்டங்களுக்கு கடுமையாக ஊக்கமளிக்கின்றன. இது எங்கே, தொடர்புடைய விவரங்கள் பின்வரும் பிரிவுகளில் குறிப்பிடப்பட்டுள்ளன.

source: Local version identifiers MUST comply with the following scheme::
eo: Loka versia identigilo DEVAS observi la jenan skemon::
ja: ローカルのバージョン指定子は、以下に述べる枠組みに適合しなければなりません::
ru: Локальные идентификаторы версий ДОЛЖНЫ соответствовать следующей схеме::
ta: உள்ளக பதிப்பு அடையாளங்காட்டிகள் பின்வரும் திட்டத்திற்கு இணங்க வேண்டும் ::

source: They consist of a normal public version identifier (as defined in the previous section), along with an arbitrary "local version label", separated from the public version identifier by a plus. Local version labels have no specific semantics assigned, but some syntactic restrictions are imposed.
ja: プラスの文字によって公的バージョン識別子と区分されている任意の "ローカルバージョンラベル" を伴った、 (前の節で定義した) 通常の公的バージョン識別子で構成されています。ローカルバージョンラベルは、その意味の点では特に指定はありませんが、文法の上ではいくらかの制約が課されています。
ru: Они состоят из обычного идентификатора публичной версии (как определено в предыдущем разделе), а также произвольной "метки локальной версии", отделенной от идентификатора публичной версии плюсом. Локальные метки версий не имеют специфической семантики, но на них накладываются некоторые синтаксические ограничения.
ta: அவை ஒரு சாதாரண பொது பதிப்பு அடையாளங்காட்டியைக் கொண்டிருக்கின்றன (முந்தைய பிரிவில் வரையறுக்கப்பட்டுள்ளபடி), தன்னிச்சையான "உள்ளக பதிப்பு சிட்டை" உடன், பொது பதிப்பு அடையாளங்காட்டியிலிருந்து ஒரு பிளச் மூலம் பிரிக்கப்பட்டுள்ளன. உள்ளக பதிப்பு லேபிள்களுக்கு குறிப்பிட்ட சொற்பொருள்கள் ஒதுக்கப்படவில்லை, ஆனால் சில தொடரியல் கட்டுப்பாடுகள் விதிக்கப்படுகின்றன.

source: Local version identifiers are used to denote fully API (and, if applicable, ABI) compatible patched versions of upstream projects. For example, these may be created by application developers and system integrators by applying specific backported bug fixes when upgrading to a new upstream release would be too disruptive to the application or other integrated system (such as a Linux distribution).
ja: ローカルのバージョン指定子は、上流のプロジェクトのパッチ適用済バージョンに互換性のある API (もし適用可能なら ZBI も) を示すために用いられます。例えば、上流の新しいリリースに更新することが当該アプリケーションや (Linux ディストロのような) 他の統合されたシステムにとって破壊的に過ぎるであろうという場合に、特定のバグ修正をバックポートして適用することでアプリケーション開発者やシステム統合者によって作成されるかもしれません。
ru: Идентификаторы локальных версий используются для обозначения полностью совместимых с API (и, если применимо, ABI) исправленных версий проектов upstream. Например, они могут быть созданы разработчиками приложений и системными интеграторами путем применения специфических исправлений, когда обновление до нового релиза upstream будет слишком разрушительным для приложения или другой интегрированной системы (например, дистрибутива Linux).
ta: மேலோடை திட்டங்களின் இணக்கமான இணைக்கப்பட்ட பதிப்புகளை முழுமையாக பநிஇ (மற்றும், பொருந்தினால், ஏபிஐ) குறிக்க உள்ளக பதிப்பு அடையாளங்காட்டிகள் பயன்படுத்தப்படுகின்றன. எடுத்துக்காட்டாக, புதிய மேலோடை வெளியீட்டிற்கு மேம்படுத்தும்போது குறிப்பிட்ட பின்னணி பிழைத் திருத்தங்களைப் பயன்படுத்துவதன் மூலம் பயன்பாட்டு உருவாக்குபவர்கள் மற்றும் கணினி ஒருங்கிணைப்பாளர்களால் இவை உருவாக்கப்படலாம், பயன்பாடு அல்லது பிற ஒருங்கிணைந்த அமைப்புக்கு (லினக்ச் வழங்கல் போன்றவை) மிகவும் இடையூறு விளைவிக்கும்.
