Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If used as part of a project's development cycle, these post-releases are indicated by including a post-release segment in the version identifier::
eo: Se posteldono estas parto de la evolua ciklo de projekto, ĝi indikiĝas per posteldona segmento en la versia identigilo::
ja: プロジェクトの開発サイクルの一部として用いられる場合、これらのポストリリースは、バージョン識別子の中にポストリリース構成部分を含めることによって表示されます::
ru: Если эти пост-релизы используются в рамках цикла разработки проекта, они обозначаются включением сегмента post-release в идентификатор версии::
ta: ஒரு திட்டத்தின் மேம்பாட்டு சுழற்சியின் ஒரு பகுதியாகப் பயன்படுத்தப்பட்டால், இந்த பிந்தைய வெளியீடுகள் பதிப்பு அடையாளங்காட்டியில் வெளியீட்டுக்குப் பிந்தைய பிரிவைச் சேர்ப்பதன் மூலம் குறிக்கப்படுகின்றன ::

source: A version identifier that includes a post-release segment without a developmental release segment is termed a "post-release".
eo: Versia identigilo inkluzivanta posteldonan segmenton sen evolueldona segmento nomiĝas «posteldono».
ja: 開発リリース構成部分なしでポストリリース構成部分を含むバージョン識別子のことを "ポストリリース <post-release>" という用語で呼びます。
ru: Идентификатор версии, включающий сегмент пост-релиза без сегмента релиза разработки, называется "пост-релизом".
ta: மேம்பாட்டு வெளியீட்டு பிரிவு இல்லாமல் வெளியீட்டுக்குப் பிந்தைய பிரிவை உள்ளடக்கிய பதிப்பு அடையாளங்காட்டி "வெளியீட்டுக்குப் பிந்தையது" என்று அழைக்கப்படுகிறது.

source: The post-release segment consists of the string ``.post``, followed by a non-negative integer value. Post-releases are ordered by their numerical component, immediately following the corresponding release, and ahead of any subsequent release.
eo: La posteldona segmento konsistas el la signoĉeno ``.post`` sekvita de nenegativa entjero. Posteldono estas ordigita laŭ sia numera komponanto, tuj post la respondanta eldono, kaj antaŭ ajna sekva eldono.
ja: ポストリリース構成部分は、 ``.post`` という文字列とこれに引き続く非負整数値で成り立っています。ポストリリースは、対応するリリースの直後に続き、かつ、後続のリリースの部分よりも前にある、そのような数字の構成部分を使って順序付けを行います。
ru: Сегмент пост-релиза состоит из строки ``.post``, за которой следует целое неотрицательное значение. Пост-релизы упорядочиваются по их числовой составляющей, сразу после соответствующего релиза и перед любым последующим релизом.
ta: வெளியீட்டுக்குப் பிந்தைய பிரிவு `` .போச்ட்`` என்ற சரம் கொண்டது, அதைத் தொடர்ந்து எதிர்மறை அல்லாத முழு எண் மதிப்பு. பிந்தைய உறவுகள் அவற்றின் எண் கூறுகளால் கட்டளையிடப்படுகின்றன, உடனடியாக தொடர்புடைய வெளியீட்டைத் தொடர்ந்து, அடுத்தடுத்த வெளியீட்டிற்கு முன்னதாக.

source: The use of post-releases to publish maintenance releases containing actual bug fixes is strongly discouraged. In general, it is better to use a longer release number and increment the final component for each maintenance release.
eo: La uzo de posteldono por ripari faktan cimon estas malrekomendegata. Ĝenerale, oni uzu pli longan eldonan numeron kaj alkrementu la finan komponanton por ĉiu cimripara eldono.
ja: 実質的にバグフィクスを含むようなメンテナンスリリースを公開するためにポストリリースを使用することは、強い非推奨の対象です。一般的に、もっと長いリリース番号を使う方がベターで、各メンテナンスリリースについて最後の部分を増加させていく方が良いでしょう。
ru: Настоятельно не рекомендуется использовать пост-релизы для публикации релизов сопровождения, содержащих фактические исправления ошибок. В целом, лучше использовать более длинный номер релиза и увеличивать последний компонент для каждого выпуска обслуживания.
ta: உண்மையான பிழை திருத்தங்களைக் கொண்ட பராமரிப்பு வெளியீடுகளை வெளியிடுவதற்கு பிந்தைய வெளியீடுகளின் பயன்பாடு கடுமையாக ஊக்கமளிக்கிறது. பொதுவாக, நீண்ட வெளியீட்டு எண்ணைப் பயன்படுத்துவது மற்றும் ஒவ்வொரு பராமரிப்பு வெளியீட்டிற்கான இறுதி கூறுகளை அதிகரிப்பதும் நல்லது.

source: Post-releases are also permitted for pre-releases::
eo: Posteldonoj estas ankaŭ permesataj por antaŭeldonoj::
ja: ポストリリースは、また、プレリリースにも使うことができます::
pt_br: Pós lançamentos também são permitidos para pré-lançamentos::
ru: Пост-релизы также разрешены для пре-релизов::
ta: முன் வெளியீடுகளுக்கு பிந்தைய வெளியீடுகளும் அனுமதிக்கப்படுகின்றன ::

source: Creating post-releases of pre-releases is strongly discouraged, as it makes the version identifier difficult to parse for human readers. In general, it is substantially clearer to simply create a new pre-release by incrementing the numeric component.
eo: Krei posteldono de antaŭeldono estas malrekomendegate, ĉar tio malfaciligas la versio-identigilon por homoj. Ĝenerale, estas pli simple krei novan antaŭeldonon alkrementante la numeran komponanton.
ja: プレリリースのポストリリースを作成することは、人間がバージョン識別子を解釈する時に困難を生じるので、強い非推奨事項です。一般に、単純に数字の部分を一つ増加させることで新しいプレリリース番号を作成する方が、大幅にわかりやすいものです。
ru: Настоятельно не рекомендуется создавать пост-релизы из пре-релизов, так как это затрудняет разбор идентификатора версии для человека. В целом, гораздо понятнее просто создать новый пререлиз, увеличив числовой компонент.
ta: முன் வெளியீடுகளின் பிந்தைய உறவுகளை உருவாக்குவது வலுவாக ஊக்கமளிக்கிறது, ஏனெனில் இது பதிப்பு அடையாளங்காட்டியை மனித வாசகர்களுக்கு அலசுவது கடினம். பொதுவாக, எண் கூறுகளை அதிகரிப்பதன் மூலம் புதிய முன் வெளியீட்டை உருவாக்குவது கணிசமாக தெளிவாக உள்ளது.

source: Developmental releases
eo: Evoluaj eldonoj
ja: 開発用リリース
pt_br: Versões de desenvolvimento
ru: Развивающие релизы
ta: வளர்ச்சி வெளியீடுகள்

source: Some projects make regular developmental releases, and system packagers (especially for Linux distributions) may wish to create early releases directly from source control which do not conflict with later project releases.
eo: Kelkaj projektoj regule kreas evoluadajn eldonojn. Sistema pakanto (speciale por Linux-distribuo) eble volas krei fruan eldonon rekte el fontarbo ne konfliktantan kun postaj projektaj eldonoj.
ja: プロジェクトの中には、定期的に開発リリースを作成するものもあり、 (とりわけ Linux ディストリビューション向けの) システムパッケージング担当者は、後のプロジェクトリリースと干渉しないように、直接ソースコードから早期リリースを作りたいと望むかもしれません。
ru: Некоторые проекты регулярно выпускают новые релизы, и разработчики системных пакетов (особенно для дистрибутивов Linux) могут захотеть создавать ранние релизы непосредственно из системы контроля исходных кодов, которые не будут конфликтовать с более поздними релизами проекта.
ta: சில திட்டங்கள் வழக்கமான மேம்பாட்டு வெளியீடுகளை உருவாக்குகின்றன, மேலும் கணினி பேக்கேசர்கள் (குறிப்பாக லினக்ச் விநியோகங்களுக்கு) ஆரம்ப வெளியீடுகளை மூலக் கட்டுப்பாட்டிலிருந்து நேரடியாக உருவாக்க விரும்பலாம், அவை பிற்கால திட்ட வெளியீடுகளுடன் முரண்படாது.

source: If used as part of a project's development cycle, these developmental releases are indicated by including a developmental release segment in the version identifier::
eo: Kiel parto de la evoluciklo de projekto, tiuj evoluaj eldonoj indikiĝas per segmento de evolua eldono en la versia identigilo::
ja: プロジェクトの開発サイクルの一部として使われる場合、このような開発リリース <developmental release> はバージョン識別子の中に開発リリース構成部分を含めることで表示されます::
ru: Если они используются как часть цикла разработки проекта, то эти релизы указываются путем включения сегмента developmental release в идентификатор версии::
ta: ஒரு திட்டத்தின் மேம்பாட்டு சுழற்சியின் ஒரு பகுதியாகப் பயன்படுத்தப்பட்டால், இந்த வளர்ச்சி வெளியீடுகள் பதிப்பு அடையாளங்காட்டியில் ஒரு வளர்ச்சி வெளியீட்டு பிரிவைச் சேர்ப்பதன் மூலம் குறிக்கப்படுகின்றன ::

source: A version identifier that includes a developmental release segment is termed a "developmental release".
eo: Versia identigilo inkluzivanta evolueldona segmento nomiĝas «evolua eldono».
ja: 開発リリース構成部分を含むバージョン識別子のことを "開発リリース <developmental release>" という用語で表します。
ru: Идентификатор версии, включающий сегмент выпуска разработки, называется "выпуском разработки".
ta: மேம்பாட்டு வெளியீட்டு பிரிவை உள்ளடக்கிய பதிப்பு அடையாளங்காட்டி "மேம்பாட்டு வெளியீடு" என்று அழைக்கப்படுகிறது.

source: The developmental release segment consists of the string ``.dev``, followed by a non-negative integer value. Developmental releases are ordered by their numerical component, immediately before the corresponding release (and before any pre-releases with the same release segment), and following any previous release (including any post-releases).
ja: 開発リリース構成部分は、 ``.dev`` という文字列と、それに続く非負整数値で構成されます。開発リリースは、対応するリリースの直前 (で、かつ、同じリリース構成部分を持つあらゆるプレリリース部分の前のもの) で、かつ、 (任意のポストリリースを含む) 旧リリースの後にある数値部分で順序付けされます。
ru: Сегмент релиза разработки состоит из строки ``.dev``, за которой следует целое неотрицательное значение. Релизы разработки упорядочиваются по их числовой составляющей, непосредственно перед соответствующим релизом (и перед любыми предшествующими релизами с тем же сегментом релиза) и после любого предыдущего релиза (включая любые пост-релизы).
ta: மேம்பாட்டு வெளியீட்டு பிரிவு `` .dev`` என்ற சரத்தைக் கொண்டுள்ளது, அதைத் தொடர்ந்து எதிர்மறை அல்லாத முழு எண் மதிப்பு. மேம்பாட்டு வெளியீடுகள் அவற்றின் எண் கூறுகளால் ஆர்டர் செய்யப்படுகின்றன, அதனுடன் தொடர்புடைய வெளியீட்டிற்கு முன்பே (மற்றும் ஒரே வெளியீட்டு பிரிவுடன் எந்தவொரு முன் வெளியீட்டிற்கும் முன்பு), மற்றும் முந்தைய வெளியீட்டைப் பின்பற்றி (எந்தவொரு பிந்தைய வெளியீடுகளும் உட்பட).

source: Developmental releases are also permitted for pre-releases and post-releases::
eo: Evolua eldono estas ankaŭ permesata por antaŭeldono kaj posteldono::
ja: 開発リリースは、また、プレリリースやポストリリースにおいても許されます::
ru: Релизы разработки также разрешены для предварительных и последующих релизов::
ta: முன் வெளியீடுகள் மற்றும் பிந்தைய வெளியீடுகளுக்கு வளர்ச்சி வெளியீடுகளும் அனுமதிக்கப்படுகின்றன ::

source: While they may be useful for continuous integration purposes, publishing developmental releases of pre-releases to general purpose public index servers is strongly discouraged, as it makes the version identifier difficult to parse for human readers. If such a release needs to be published, it is substantially clearer to instead create a new pre-release by incrementing the numeric component.
ja: これらは継続的インテグレーションの目的では利用する価値がある一方で、プレリリースの開発リリースを一般目的の公開インデックスサーバ群に公開することは、人間が読んだ時に解釈するのが難しいバージョン識別子になってしまうので、強い非推奨とされています。そのようなリリースを公開する必要があるなら、数字部分を増加させた新しいプレリリースを代わりに作成する方が、よほどわかりやすいでしょう。
ru: Хотя они могут быть полезны для целей непрерывной интеграции, публикация предварительных релизов разработки на общедоступных индексных серверах крайне не рекомендуется, так как это затрудняет разбор идентификатора версии для человека. Если такой релиз необходимо опубликовать, гораздо понятнее вместо этого создать новый предварительный релиз, увеличив числовой компонент.
ta: தொடர்ச்சியான ஒருங்கிணைப்பு நோக்கங்களுக்காக அவை பயனுள்ளதாக இருக்கும் என்றாலும், பொது நோக்கத்திற்கான பொது குறியீட்டு சேவையகங்களுக்கு முன் வெளியீடுகளின் மேம்பாட்டு வெளியீடுகளை வெளியிடுவது வலுவாக ஊக்கமளிக்கிறது, ஏனெனில் இது பதிப்பு அடையாளங்காட்டியை மனித வாசகர்களுக்கு அலசுவது கடினம். அத்தகைய வெளியீட்டை வெளியிட வேண்டியிருந்தால், எண் கூறுகளை அதிகரிப்பதன் மூலம் புதிய முன் வெளியீட்டை உருவாக்குவது கணிசமாக தெளிவாக உள்ளது.

source: Developmental releases of post-releases are also strongly discouraged, but they may be appropriate for projects which use the post-release notation for full maintenance releases which may include code changes.
eo: Evoluada eldono de posteldono estas ankaŭ malrekomendegata, sed ĝi eble taŭgas por projekto uzanta la posteldonan notacion por plena flega eldono eble inkluzivanta ŝanĝojn de kodo.
ja: ポストリリースの開発リリースもまた強い非推奨とされていますが、ソースコードの変更を含む可能性のあるフルメンテナンスリリースをポストリリースと表記しているプロジェクトには適切かもしれません。
ru: Также настоятельно не рекомендуется использовать пост-релизы для разработки, но они могут быть уместны в проектах, которые используют нотацию post-release для полных релизов сопровождения, которые могут включать изменения кода.
ta: பிந்தைய வெளியீடுகளின் மேம்பாட்டு வெளியீடுகளும் கடுமையாக ஊக்கமளிக்கின்றன, ஆனால் அவை குறியீடு மாற்றங்களை உள்ளடக்கிய முழு பராமரிப்பு வெளியீடுகளுக்கு வெளியீட்டுக்குப் பிந்தைய குறியீட்டைப் பயன்படுத்தும் திட்டங்களுக்கு அவை பொருத்தமானதாக இருக்கலாம்.

source: Version epochs
eo: Versiaj epokoj
ja: バージョンエポック
ru: Эпохи версий
ta: பதிப்பு சகாப்தங்கள்

source: If included in a version identifier, the epoch appears before all other components, separated from the release segment by an exclamation mark::
eo: Se epoko ekzistas en versio-identigilo, ĝi ĉeestas antaŭ ĉiaj aliaj komponantoj, apartigite el la eldono-segmento per krisigno::
ja: バージョン識別子に含まれる場合、エポックは、エクスクラメーションマークでリリース番号構成部分と仕切られて、他のすべての構成部分よりも前に出現します::
ru: Если он включен в идентификатор версии, то эпоха появляется перед всеми остальными компонентами и отделяется от сегмента релиза восклицательным знаком::
ta: பதிப்பு அடையாளங்காட்டியில் சேர்க்கப்பட்டால், சகாப்தம் மற்ற எல்லா கூறுகளுக்கும் முன்பாக தோன்றும், வெளியீட்டு பிரிவில் இருந்து ஆச்சரியக் குறி ::

source: If no explicit epoch is given, the implicit epoch is ``0``.
eo: Se la epoko ne estas eksplicita, la implicita epoko estas ``0``.
ja: 明示的にエポックが示されていない場合は、エポックとして ``0`` を暗黙のうちに仮定します。
ru: Если явная эпоха не указана, то неявной эпохой будет ``0``.
ta: வெளிப்படையான சகாப்தம் எதுவும் கொடுக்கப்படவில்லை என்றால், மறைமுகமான சகாப்தம் `` 0`` ஆகும்.

source: Most version identifiers will not include an epoch, as an explicit epoch is only needed if a project *changes* the way it handles version numbering in a way that means the normal version ordering rules will give the wrong answer. For example, if a project is using date based versions like ``2014.04`` and would like to switch to semantic versions like ``1.0``, then the new releases would be identified as *older* than the date based releases when using the normal sorting scheme::
eo: Multaj versio-identigiloj ne inkluzivas epokon, ĉar eksplicita epoko nur necees, se projekto *ŝanĝas* la manieron de versia numerado tiel, ke la ordinaraj reguloj pri ordigado de versioj estas malĝustaj. Ekzemple, se projekto uzas dato-bazajn versiojn kiel ``2014.04`` kaj volas ŝanĝi al semantikaj versioj kiel ``1.0``, do la novaj eldonoj estus rigardataj kiel *pli malnovaj* ol la dato-bazaj eldonoj laŭ la ordinara ordigado::
ja: 明示的なエポックが必要となるのは、あるプロジェクトがバージョン番号を取り扱う方法を通常のバージョン順序付けルールが誤った回答を返すようなやり方で *変更した* 場合だけなので、ほとんどのバージョン識別子はエポックを含んでいません。例えば、あるプロジェクトが ``2014.04`` のような日付ベースのバージョン番号を使っていたのに、 ``1.0`` のようなセマンティックバージョン番号に変更したいとすれば、通常の順序付けの枠組みを適用した時に、新しいリリースが日付ベースのバージョン番号よりも *よりふるいもの* として識別されてしまうでしょう::
ru: Большинство идентификаторов версий не будут включать эпоху, поскольку явная эпоха нужна только в том случае, если проект *изменяет* способ обработки нумерации версий таким образом, что обычные правила упорядочивания версий дают неверный ответ. Например, если проект использует версии, основанные на дате, такие как ``2014.04``, и хочет перейти на семантические версии, такие как ``1.0``, то новые релизы будут идентифицироваться как *более старые*, чем версии, основанные на дате, при использовании обычной схемы сортировки::
ta: பெரும்பாலான பதிப்பு அடையாளங்காட்டிகள் ஒரு சகாப்தத்தை சேர்க்காது, ஏனெனில் ஒரு திட்டம் * மாற்றினால் மட்டுமே வெளிப்படையான சகாப்தம் தேவைப்படுகிறது * இது பதிப்பு எண்ணிக்கையை கையாளும் விதத்தில் சாதாரண பதிப்பு வரிசைப்படுத்தும் விதிகள் தவறான பதிலைக் கொடுக்கும். எடுத்துக்காட்டாக, ஒரு திட்டம் `` 2014.04`` போன்ற தேதி அடிப்படையிலான பதிப்புகளைப் பயன்படுத்துகிறது மற்றும் `` 1.0`` போன்ற சொற்பொருள் பதிப்புகளுக்கு மாற விரும்பினால், புதிய வெளியீடுகள் சாதாரண வரிசையாக்கத் திட்டத்தைப் பயன்படுத்தும் போது தேதி அடிப்படையிலான வெளியீடுகளை விட * பழையவை * என அடையாளம் காணப்படும் ::

source: However, by specifying an explicit epoch, the sort order can be changed appropriately, as all versions from a later epoch are sorted after versions from an earlier epoch::
eo: Tamen, eksplicitante epokon, oni povas ŝanĝi la ordon, ĉar ĉiuj versioj de pli posta epoko estas ordigitaj post versioj de pli frua epoko::
ja: しかしながら、明示的にエポックを指定すれば、より新しいエポックに属するすべてのバージョン番号が、より古いエポックに属するものよりも後に続くものとして順序付けされるので、ソートの順序を適切に変更することができます::
ru: Однако, указав явную эпоху, можно соответствующим образом изменить порядок сортировки: все версии, относящиеся к более поздней эпохе, будут отсортированы после версий, относящихся к более ранней эпохе::
ta: இருப்பினும், ஒரு வெளிப்படையான சகாப்தத்தைக் குறிப்பிடுவதன் மூலம், வரிசை வரிசையை சரியான முறையில் மாற்ற முடியும், ஏனெனில் முந்தைய சகாப்தத்தின் அனைத்து பதிப்புகளும் முந்தைய சகாப்தத்தின் பதிப்புகளுக்குப் பிறகு வரிசைப்படுத்தப்படுகின்றன ::

source: Normalization
eo: Normigo
ja: 正規化
pt_br: Normalização
ru: Нормализация
ta: இயல்பாக்கம்

source: In order to maintain better compatibility with existing versions there are a number of "alternative" syntaxes that MUST be taken into account when parsing versions. These syntaxes MUST be considered when parsing a version, however they should be "normalized" to the standard syntax defined above.
ja: 既存のバージョン番号との互換性をより良く保つためには、バージョン番号を解釈する時に考慮に入れておかなければならない "代わりになり得る" シンタックスがたくさんあります。このようなシンタックスはバージョン番号を解釈する時には考慮しなければなりませんが、しかし、そのようなバージョン番号は上述の標準的なシンタックスに "正規化" されるべきです。
ru: Для обеспечения лучшей совместимости с существующими версиями существует ряд "альтернативных" синтаксисов, которые ДОЛЖНЫ быть учтены при разборе версий. Эти синтаксисы ДОЛЖНЫ учитываться при разборе версии, однако они должны быть "нормализованы" к стандартному синтаксису, определенному выше.
ta: தற்போதுள்ள பதிப்புகளுடன் சிறந்த பொருந்தக்கூடிய தன்மையைப் பராமரிக்க, பல "மாற்று" தொடரியல் உள்ளன, அவை பதிப்புகளை பாகுபடுத்தும்போது கணக்கில் எடுத்துக்கொள்ளப்பட வேண்டும். ஒரு பதிப்பை பாகுபடுத்தும்போது இந்த தொடரியல் கருத்தில் கொள்ளப்பட வேண்டும், இருப்பினும் அவை மேலே வரையறுக்கப்பட்ட நிலையான தொடரியல் க்கு "இயல்பாக்கப்பட வேண்டும்".

source: Case sensitivity
eo: Usklecdistingo
ja: ケースセンシティビティ
pt_br: Sensível a maiúsculas e minúsculas
ru: Чувствительность случая
ta: வழக்கு உணர்திறன்

source: All ascii letters should be interpreted case insensitively within a version and the normal form is lowercase. This allows versions such as ``1.1RC1`` which would be normalized to ``1.1rc1``.
eo: Ĉiu Askia litero interpretiĝu usklecblinde en versio. La norma formo estas minusklo. Tio permesas version kiel ``1.1RC1``, kies norma formo estas ``1.1rc1``.
ja: すべてのアスキー文字は、バージョン番号の中では大文字小文字の区別をせずに解釈されるべきであり、標準系は小文字です。これによって、 ``1.1rc1`` に標準化されるであろう `1.1RC1`` のようなバージョン番号を許容します。
ru: Все буквы ascii должны интерпретироваться без учета регистра в пределах версии, и нормальной формой является строчный регистр. Это позволяет использовать такие версии, как ``1.1RC1``, которые будут нормализованы до ``1.1rc1``.
ta: அனைத்து ASCII கடிதங்களும் ஒரு பதிப்பிற்குள் உணர்வற்ற முறையில் விளக்கப்பட வேண்டும் மற்றும் சாதாரண வடிவம் சிறிய எழுத்துக்கள். இது `` 1.1rc1`` போன்ற பதிப்புகளை அனுமதிக்கிறது, இது `1.1rc1`` க்கு இயல்பாக்கப்படும்.

source: Integer Normalization
eo: Entjera Normigo
ja: 整数の標準化
ru: Нормализация целого числа
ta: முழு எண் இயல்பாக்கம்

source: All integers are interpreted via the ``int()`` built in and normalize to the string form of the output. This means that an integer version of ``00`` would normalize to ``0`` while ``09000`` would normalize to ``9000``. This does not hold true for integers inside of an alphanumeric segment of a local version such as ``1.0+foo0100`` which is already in its normalized form.
eo: Ĉiu entjero interpretiĝas laŭ la apriora funkcio ``int()``, kaj la normigita formo estas la teksta eligaĵo. Alivorte, la normigita formo de ``00`` estas ``0``, kaj la normigita formo de ``09000`` estas ``9000``. Tio ne temas pri entjero en alfabetcifera segmento de loka versio kiel ``1.0+foo0100``, kiu estas sia propra normigita formo.
ja: あらゆる整数は、組み込みの ``int()`` を通じて解釈され、出力の文字列へと標準化されます。これは、整数のバージョン番号の ``00`` が ``0`` へと標準化され、``09000`` が ``9000`` へと標準化されることを意味します。 ``1.0+foo0100`` のようなローカルバージョンで標準化済みのもののアルファベットと数字から成る構成部分の中では、これは適用されません。
ru: Все целые числа интерпретируются с помощью встроенной функции ``int()`` и нормализуются к строковой форме вывода. Это означает, что целочисленная версия ``00`` будет нормализована до ``0``, а ``09000`` - до ``9000``. Это не относится к целым числам внутри буквенно-цифрового сегмента локальной версии, например ``1.0+foo0100``, которая уже находится в нормализованной форме.
ta: அனைத்து முழு எண்ணும் `` இன்ட் () `` வழியாக விளக்கப்பட்டு வெளியீட்டின் சரம் வடிவத்தை இயல்பாக்குகிறது. இதன் பொருள் `` 00`` இன் முழு எண் பதிப்பு `` 0`` க்கு இயல்பாக்கும், அதே நேரத்தில் `09000``` `9000`` க்கு இயல்பாக்கும். `` 1.0+FOO0100`` போன்ற உள்ளக பதிப்பின் எண்ணெழுத்து பிரிவின் உள்ளே நுழைவதற்கு இது உண்மையல்ல, இது ஏற்கனவே அதன் இயல்பாக்கப்பட்ட வடிவத்தில் உள்ளது.

source: Pre-release separators
eo: Antaŭeldonaj apartigiloj
ja: プレリリースのセパレータ
ru: Сепараторы перед выпуском
ta: முன் வெளியீட்டு பிரிப்பான்கள்

source: Pre-releases should allow a ``.``, ``-``, or ``_`` separator between the release segment and the pre-release segment. The normal form for this is without a separator. This allows versions such as ``1.1.a1`` or ``1.1-a1`` which would be normalized to ``1.1a1``. It should also allow a separator to be used between the pre-release signifier and the numeral. This allows versions such as ``1.0a.1`` which would be normalized to ``1.0a1``.
eo: Antaŭeldono permesas la apartigilojn ``.``, ``-`` aŭ ``_`` inter la eldono-segmento kaj la antaŭeldono-segmento. La norma formo ne uzas apartigilon. Tio permesas versiojn kiel ``1.1.a1`` aŭ ``1.1-a1``, kies norma formo estas ``1.1a1``. Antaŭeldono ankaŭ permesas apartigilon inter la antaŭeldono-specifilo kaj la numero. Tio permesas versiojn kiel ``1.0a.1``, kies norma formo estas ``1.0a1``.
ja: プレリリースは、リリース構成部分とプレリリース構成部分の間のセパレータとして、 ``.`` ・ ``-`` または ``_`` を許容するべきです。この部分の標準形式は、セパレータなしのものです。これによって、標準化すれば ``1.1a1`` になる ``1.1.a1`` や ``1.1-a1`` のようなバージョン番号を許容します。さらに、プレリリース記号と数字部分の間に使われるセパレータをも許容するべきです。これによって、 ``1.0a1`` に標準化される ``1.0a.1`` のようなバージョン番号を許容します。
ru: Предварительные выпуски должны допускать разделитель ``.``, ``-`` или ``_`` между сегментом выпуска и сегментом предварительных выпусков. Нормальная форма для этого - без разделителя. Это позволяет использовать такие версии, как ``1.1.a1`` или ``1.1-a1``, которые будут нормализованы до ``1.1a1``. Также следует разрешить использовать разделитель между обозначением pre-release и цифрой. Это позволяет использовать такие версии, как ``1.0a.1``, которые будут нормализованы до ``1.0a1``.
ta: முன் வெளியீடுகள் வெளியீட்டுப் பிரிவுக்கும் வெளியீட்டுக்கு முந்தைய பிரிவுக்கும் இடையில் ஒரு `` .` .`. இதற்கான சாதாரண வடிவம் பிரிப்பான் இல்லாமல் உள்ளது. இது `` 1.1. இது ஒரு பிரிப்பான் முன் வெளியீட்டு அடையாளத்திற்கும் எண்களுக்கும் இடையில் பயன்படுத்த அனுமதிக்க வேண்டும். இது `` 1.0a.1`` போன்ற பதிப்புகளை அனுமதிக்கிறது, இது `` 1.0a1`` க்கு இயல்பாக்கப்படும்.

source: Pre-release spelling
eo: Literumado de antaŭeldono
ja: プレリリースの綴り方
ru: Предварительное написание
ta: முன் வெளியீட்டு எழுத்துப்பிழை

source: Pre-releases allow the additional spellings of ``alpha``, ``beta``, ``c``, ``pre``, and ``preview`` for ``a``, ``b``, ``rc``, ``rc``, and ``rc`` respectively. This allows versions such as ``1.1alpha1``, ``1.1beta2``, or ``1.1c3`` which normalize to ``1.1a1``, ``1.1b2``, and ``1.1rc3``. In every case the additional spelling should be considered equivalent to their normal forms.
eo: Antaŭeldono permesas la literumaĵojn ``alpha``, ``beta``, ``c``, ``pre`` kaj ``preview`` por ``a``, ``b``, ``rc``, ``rc`` kaj``rc`` respektive. Tio permesas versiojn kiel ``1.1alpha1``, ``1.1beta2`` kaj ``1.1c3``, kiuj estas normigitaj al ``1.1a1``, ``1.1b2`` kaj ``1.1rc3``. Ĉiukaze la ekstra literumaĵo ekvivalentas la norman formon.
ja: プレリリース番号は、 ``a`` ・ ``b`` ・ ``rc`` ・ ``rc`` および ``rc`` を表す追加的な綴り方である ``alpha`` ・ ``beta`` ・ ``c`` ・ ``pre`` および ``preview`` を許容します。これによって、標準化すれば ``1.1a1`` ・ ``1.1b2`` ・ ``1.1rc3`` となる ``1.1alpha1`` ・ ``1.1beta2`` ・ ``1.1c3`` のようなバージョン番号を許容します。それぞれのケースで、追加的な綴り方の部分は標準的な形式のものと同等であると見做されます。
ru: В предварительных версиях допускаются дополнительные написания ``alpha``, ``beta``, ``c``, ``pre`` и ``preview`` для ``a``, ``b``, ``rc``, ``rc`` и ``rc`` соответственно. Это позволяет использовать такие версии, как ``1.1alpha1``, ``1.1beta2`` или ``1.1c3``, которые нормализуются до ``1.1a1``, ``1.1b2`` и ``1.1rc3``. В каждом случае дополнительные написания следует считать эквивалентными их нормальным формам.
ta: முன்-வெளியீடுகள் `` ஆல்பா``, `` பீட்டா``, `சி``,` `முன்``, மற்றும்` `பி``,` `rc``,` `rc`, மற்றும்` `` `` `` `` `` `` `` `` `` `` `` `` `` `` இது `` 1.1alpha1``, `` 1.1beta2``, அல்லது `` 1.1c3`` போன்ற பதிப்புகளை `` 1.1a1``, `` 1.1b2``, மற்றும் `1rc3`` போன்ற பதிப்புகளை அனுமதிக்கிறது. ஒவ்வொரு சந்தர்ப்பத்திலும் கூடுதல் எழுத்துப்பிழை அவற்றின் சாதாரண வடிவங்களுக்கு சமமானதாக கருதப்பட வேண்டும்.
