Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: ``conda`` is an open source (BSD licensed) package management system and environment management system that allows users to install multiple versions of binary software packages and their dependencies, and easily switch between them. It is a cross-platform tool working on Windows, MacOS, and Linux. Conda can be used to package up and distribute all kinds of packages, it is not limited to just Python packages. It has full support for native virtual environments. Conda makes environments first-class citizens, making it easy to create independent environments even for C libraries. It is written in Python, but is Python-agnostic. Conda manages Python itself as a package, so that :command:`conda update python` is possible, in contrast to pip, which only manages Python packages.
eo: ``conda`` estas malfermitfonta (BSD-licenca) pakadministra kaj mediadministra sistemo, kiu permesas instali plurajn versiojn de duumaj programaj pakoj kaj iliaj dependaĵoj kaj facile ŝanĝi inter ili. Ĝi estas plurplatforma, sur Windows, macOS kaj Linux. Conda povas esti uzita por paki kaj distribui ĉiajn pakojn; ĝi ne estas limigita al nur Python-pakoj. Ĝi plene subtenas indiĝenajn virtualajn mediojn. Conda igas mediojn unuaklasaj civitanoj, faciligante krei sendependajn mediojn eĉ por C-bibliotekoj. Ĝi estas verkita en Python, sed ne estas nur por Python. Conda administras Python mem kiel pakon, tiel ke :command:`conda update python` eblas, kontraste al pip, kiu nur administras Python-pakojn.
ja: ``conda`` は、複数のバージョンのソフトウェアのバイナリパッケージやその依存先パッケージをインストールして容易に切り替えて使えるようにする (BSDライセンスの) オープンソースのパッケージマネジメントシステム兼環境管理システムです。これは Windows・MacOS・Linuxで動作するクロスプラットフォームのツールです。conda を使えばあらゆる種類のパッケージをまとめたり配布したりすることができて、 Python のパッケージだけには限りません。ネイティブの仮想環境を完全にサポートしています。C 言語のライブラリさえも独立した環境を容易に生成できるようにすることで、conda は (仮想) 環境を一級市民にしています。Python で書かれていていますが、Pythonに依存しているわけではありません。conda は Python そのものをパッケージのひとつとして扱うため :command:`conda update python` とすることが可能で、Python のパッケージだけを扱う pip とは対照的です。
ru: ``conda`` - это система управления пакетами с открытым исходным кодом (лицензия BSD) и система управления окружением, которая позволяет пользователям устанавливать несколько версий бинарных программных пакетов и их зависимостей, а также легко переключаться между ними. Это кроссплатформенный инструмент, работающий под Windows, MacOS и Linux. Conda может использоваться для упаковки и распространения всех видов пакетов, она не ограничивается только пакетами Python. Она имеет полную поддержку собственных виртуальных сред. Conda делает окружения гражданами первого класса, позволяя легко создавать независимые окружения даже для библиотек на Си. Она написана на Python, но является Python-агностичной. Conda управляет самим Python как пакетом, поэтому возможна команда :`conda update python`, в отличие от pip, который управляет только пакетами Python.
ta: `` காண்டா`` என்பது ஒரு திறந்த மூல (பி.எச்.டி உரிமம் பெற்ற) தொகுப்பு மேலாண்மை அமைப்பு மற்றும் சுற்றுச்சூழல் மேலாண்மை அமைப்பு, இது பைனரி மென்பொருள் தொகுப்புகளின் பல பதிப்புகளையும் அவற்றின் சார்புகளையும் நிறுவ பயனர்களை அனுமதிக்கிறது, மேலும் அவற்றுக்கு இடையில் எளிதாக மாறுகிறது. இது சாளரங்கள், மேகோச் மற்றும் லினக்சில் பணிபுரியும் குறுக்கு-தளம் கருவியாகும். அனைத்து வகையான தொகுப்புகளையும் தொகுத்து விநியோகிக்க கான்டாவைப் பயன்படுத்தலாம், இது பைதான் தொகுப்புகளுக்கு மட்டுப்படுத்தப்படவில்லை. இது சொந்த மெய்நிகர் சூழல்களுக்கு முழு ஆதரவைக் கொண்டுள்ளது. காண்டா சூழல்களை முதல் தர குடிமக்களை உருவாக்குகிறது, இது சி நூலகங்களுக்கு கூட சுயாதீனமான சூழல்களை உருவாக்குவதை எளிதாக்குகிறது. இது பைத்தானில் எழுதப்பட்டுள்ளது, ஆனால் பைதான்-அஞ்ஞானியாகும். காண்டா பைத்தானை ஒரு தொகுப்பாக நிர்வகிக்கிறார், அதனால்: கட்டளை: `காண்டா புதுப்பிப்பு பைதான்` சாத்தியமாகும், இது PITHON தொகுப்புகளை மட்டுமே நிர்வகிக்கிறது.

source: Anaconda `Anaconda <https://docs.anaconda.com/anaconda/>`_ is a Python distribution published by Anaconda, Inc. It is a stable collection of Open Source packages for big data and scientific use, and a collection of Graphical Interface utilities for managing conda environments.
eo: `Anaconda <https://docs.anaconda.com/anaconda/>`_ estas Python-distribuo eldonita de la firmao Anaconda, Inc. Ĝi estas stabila kolekto de Malfermitfontaj pakoj por grandaj datenoj kaj scienca uzado kune kun grafikfasadaj ilaĵoj por administri ``conda``-medion.
ja: Anaconda `Anaconda <https://docs.anaconda.com/anaconda/>`_ は Anaconda, Inc. 社が公開した Python 配布物です。ビッグデータや科学分野向けの一連のオープンソースパッケージの安定版のコレクションであり、 conda 環境を管理する GUI のユーティリティのコレクションでもあります。
ru: Anaconda `Anaconda <https://docs.anaconda.com/anaconda/>`_ - дистрибутив Python, опубликованный компанией Anaconda, Inc. Это стабильная коллекция пакетов с открытым исходным кодом для работы с большими данными и научными исследованиями, а также набор утилит с графическим интерфейсом для управления средами conda.
ta: அனகோண்டா `அனகோண்டா <https://docs.anaconda.com/anaconda/>` _ என்பது அனகோண்டா, இன்க். கான்டா சூழல்களை நிர்வகிப்பதற்கான இடைமுக பயன்பாடுகள்.

source: In addition to the full distribution provided by Anaconda, the conda package manager itself is available in `miniconda <https://docs.anaconda.com/miniconda/>`_, `miniforge <https://github.com/conda-forge/miniforge>`_, and `pixi <https://pixi.sh/>`_.
eo: Krom la plena distribuo provizita de Anaconda, la pakadministrilo ``conda`` mem estas disponebla en `miniconda <https://docs.anaconda.com/miniconda/>`_, `miniforge <https://github.com/conda-forge/miniforge>`_ kaj `pixi <https://pixi.sh/>`_.
ja: Anaconda が提供する完全版の配布物に加えて、 conda パッケージマネージャそれ自身が `miniconda <https://docs.anaconda.com/miniconda/>`_ ・ `miniforge <https://github.com/conda-forge/miniforge>`_ ・ `pixi <https://pixi.sh/>`_ から利用可能です。
ru: В дополнение к полному дистрибутиву, предоставляемому Anaconda, сам менеджер пакетов conda доступен в `miniconda <https://docs.anaconda.com/miniconda/>`_, `miniforge <https://github.com/conda-forge/miniforge>`_ и `pixi <https://pixi.sh/>`_.
ta: அனகோண்டா வழங்கிய முழு விநியோகத்திற்கு கூடுதலாக, காண்டா தொகுப்பு மேலாளர் `மினிகொண்டா <https://docs.anaconda.com/miniconda/>` _, `மினிஃபார்ச் <https://github.com/conda இல் கிடைக்கிறது. ஃபோர்ச்/மினிஃபார்ச்> `_, மற்றும்` பிக்சி <https://pixi.sh/> `_.

source: Conda packages are available on multiple channels on Anaconda.org, including the default channel supported by Anaconda, Inc, the community supported conda-forge channel, which provides a wide variety of pre-built packages, and some domain-specific package collections.
eo: Conda-pakoj disponeblas ĉe pluraj kanaloj en Anaconda.org, inkluzive de la apriora kanalo de Anaconda, Inc.; la komunume subtenata kanalo ``conda-forge``, kiu provizas multe da antaŭkonstruitaj pakoj; kaj fakaj pakokolektoj.
ja: Conda パッケージ群は、Anaconda Inc. がサポートするデフォルトのチャンネルや、広範囲に渡るプリビルドパッケージや幾つかのドメイン特有のパッケージコレクションを提供しているところのコミュニティがサポートする conda-forge チャンネルを含めて、 Anaconda.org の複数のチャンネルから利用可能です。
ru: Пакеты Conda доступны по нескольким каналам на Anaconda.org, включая канал по умолчанию, поддерживаемый Anaconda, Inc, канал conda-forge, поддерживаемый сообществом, который предоставляет широкий спектр предварительно созданных пакетов, а также некоторые коллекции пакетов, специфичные для конкретного домена.
ta: அனகோண்டா.ஆர்சில் பல சேனல்களில் காண்டா தொகுப்புகள் கிடைக்கின்றன, இதில் அனகோண்டா, இன்க் ஆதரிக்கப்படும் இயல்புநிலை சேனல், சமூகம் ஆதரவளித்த கான்டா-ஃபார்ச் சேனலை உள்ளடக்கியது, இது பலவிதமான முன் கட்டப்பட்ட தொகுப்புகளை வழங்குகிறது மற்றும் சில டொமைன்-குறிப்பிட்ட தொகுப்பு தொகுப்புகளை வழங்குகிறது.

source: Installing stand alone command line tools
eo: Instali memstarajn komandliniajn ilojn
ja: スタンドアローンのコマンドラインツールをインストールする
pt_br: Instalando ferramentas de linha de comando autônomas
ru: Установка отдельных инструментов командной строки
ta: ச்டாண்ட் தனியாக கட்டளை வரி கருவிகளை நிறுவுதல்

source: Many packages provide command line applications. Examples of such packages are `mypy <https://github.com/python/mypy>`_, `flake8 <https://github.com/PyCQA/flake8>`_, `black <https://github.com/psf/black>`_, and :ref:`pipenv`.
eo: Multaj pakoj provizas komandliniajn aplikprogramojn. Jen kelkaj ekzemploj: `mypy <https://github.com/python/mypy>`_, `flake8 <https://github.com/PyCQA/flake8>`_, `black <https://github.com/psf/black>`_ kaj :ref:`pipenv`.
ja: 多くのパッケージは、コマンドラインアプリケーションを提供しています。そのようなパッケージの例としては、 `mypy <https://github.com/python/mypy>`_ ・ `flake8 <https://github.com/PyCQA/flake8>`_ ・ `black <https://github.com/psf/black>`_ ・ :ref:`pipenv` が挙げられます。
pt_br: Muitos pacotes fornecem aplicações de linha de comando. Exemplos deste tipo de aplicação são `mypy <https://github.com/python/mypy>`_, `flake8 <https://github.com/PyCQA/flake8>`_, `black <https://github.com/psf/black>`_ e :ref:`pipenv`.
ru: Многие пакеты предоставляют приложения командной строки. Примерами таких пакетов являются: `mypy <https://github.com/python/mypy>`_, `flake8 <https://github.com/PyCQA/flake8>`_, `black <https://github.com/psf/black>`_ и :ref:`pipenv`.
ta: பல தொகுப்புகள் கட்டளை வரி பயன்பாடுகளை வழங்குகின்றன. அத்தகைய தொகுப்புகளின் எடுத்துக்காட்டுகள் `mypy <https://github.com/python/mypy>` _, `flake8 <https://github.com/pycqa/flake8>` _, `கருப்பு <https: // github. com/psf/கருப்பு> `_, மற்றும்: ref:` pipenv`.

source: Usually you want to be able to access these applications from anywhere on your system, but installing packages and their dependencies to the same global environment can cause version conflicts and break dependencies the operating system has on Python packages.
eo: Kutime oni volas atingi tiujn programojn de ie ajn sur la sistemo, sed instalado de pakoj kaj dependaĵoj al la sama malloka medio povas kaŭzi versio-konfliktojn kaj rompi Python-dependecojn de la mastruma sistemo.
ja: 通常ならシステムのどこからでもこれらのアプリケーションにアクセスできるようにしたいと思うでしょうが、パッケージとその依存先パッケージを同じグローバル環境にインストールすると、バージョンの衝突を起こしてオペレーティングシステムが持っている Python パッケージ間の依存関係を破壊してしまうかもしれません。
pt_br: Normalmente você deseja acessar essas aplicações de qualquer lugar no sistema, mas instalar pacotes e suas dependências no mesmo ambiente global pode causar conflitos de versão e quebrar as dependências que o sistema operacional tem nos pacotes Python.
ru: Обычно вы хотите иметь доступ к этим приложениям из любой точки системы, но установка пакетов и их зависимостей в одно и то же глобальное окружение может привести к конфликту версий и нарушению зависимостей операционной системы от пакетов Python.
ta: வழக்கமாக நீங்கள் இந்த பயன்பாடுகளை உங்கள் கணினியில் எங்கிருந்தும் அணுக முடியும், ஆனால் தொகுப்புகளையும் அவற்றின் சார்புகளையும் அதே உலகளாவிய சூழலுக்கு நிறுவுவது பதிப்பு மோதல்களை ஏற்படுத்தும் மற்றும் பைதான் தொகுப்புகளில் இயக்க முறைமை வைத்திருக்கும் சார்புகளை உடைக்கலாம்.

source: :ref:`pipx` solves this by creating a virtual environment for each package, while also ensuring that its applications are accessible through a directory that is on your ``$PATH``. This allows each package to be upgraded or uninstalled without causing conflicts with other packages, and allows you to safely run the applications from anywhere.
eo: :ref:`pipx` solvas tiun problemon kreante virtualan medion por ĉiu pako, certigante ke programoj estas atingeblaj per dosierujo en via ``$PATH``. Tio permesas ĝisdatigadon aŭ malinstaladon de ĉiu pako sen konflikto kun aliaj pakoj kaj sekuran ruladon ie ajn.
ja: :ref:`pipx` は、 ``$PATH`` に含まれるディレクトリを通してアプリケーションにアクセスできるようにしつつ各パッケージに仮想環境を作成することでこの問題を解決します。こうすることで、各パッケージの更新や削除をしても他のパッケージには影響を与えず、どこからでもアプリケーションを安全に走らせることができるようにできます。
pt_br: :ref:`pipx` resolve isso criando um ambiente virtual para cada pacote, enquanto também garante que suas aplicações sejam acessíveis através de um diretório que está em seu ``$PATH``. Isso permite que cada pacote seja atualizado ou desinstalado sem causar conflitos com outros pacotes e permite que você execute a aplicações com segurança de qualquer lugar.
ru: :ref:`pipx` решает эту проблему, создавая виртуальное окружение для каждого пакета, а также обеспечивая доступ к его приложениям через каталог, который находится в вашем ``$PATH``. Это позволяет обновлять или удалять каждый пакет, не вызывая конфликтов с другими пакетами, и позволяет безопасно запускать приложения из любого места.
ta: . இது ஒவ்வொரு தொகுப்பையும் மற்ற தொகுப்புகளுடன் மோதல்களை ஏற்படுத்தாமல் மேம்படுத்த அல்லது நிறுவல் நீக்க அனுமதிக்கிறது, மேலும் பயன்பாடுகளை எங்கிருந்தும் பாதுகாப்பாக இயக்க அனுமதிக்கிறது.

source: pipx only works with Python 3.6+.
eo: pipx nur funkcias kun Python 3.6+.
ja: pipx は Python 3.6+ でのみ動作します。
pt_br: pipx só funciona com Python 3.6+.
ru: pipx работает только с Python 3.6+.
ta: பிஐபிஎக்ச் பைதான் 3.6+ உடன் மட்டுமே வேலை செய்கிறது.

source: pipx is installed with pip:
eo: Oni instalas pipx per pip:
ja: pipx は pip と一緒にインストールされています:
pt_br: pipx é instalado com pip:
ru: pipx устанавливается вместе с pip:
ta: PIPX PIP உடன் நிறுவப்பட்டுள்ளது:

source: ``ensurepath`` ensures that the application directory is on your ``$PATH``. You may need to restart your terminal for this update to take effect.
eo: ``ensurepath`` certigas, ke la programa dosierujo estas en via ``$PATH``. Vi eble bezonas relanĉi vian terminalon por efektivigi la ĝisdatigon.
ja: ``ensurepath `` は、アプリケーションのあるディレクトリが ``$PATH`` に含まれるようにすることを保証します。この更新(訳注、``$PATH``の修正のこと)が効果を持つようにするためにターミナルを再起動する必要があるかもしれません。
pt_br: ``ensurepath`` garante que o diretório de aplicação está em seu ``$PATH``. Você pode precisar reiniciar seu terminal para que as atualizações de caminho tenham efeito.
ru: ``ensurepath`` гарантирует, что каталог приложения находится в вашем ``$PATH``. Возможно, вам потребуется перезапустить терминал, чтобы обновление вступило в силу.
ta: `` உறுதிப்படுத்தவும் `` பயன்பாட்டு அடைவு உங்கள் `` $ பாதை`` ஐ உறுதி செய்கிறது. இந்த புதுப்பிப்பு நடைமுறைக்கு வர உங்கள் முனையத்தை மறுதொடக்கம் செய்ய வேண்டியிருக்கலாம்.

source: Now you can install packages with ``pipx install`` and run the package's applications(s) from anywhere.
eo: Nun vi povas instali pakon per ``pipx install`` kaj ruli la programojn de la pako ie ajn.
ja: これで、 ``pipx install`` を使ってパッケージをインストールすることができるようになり、どこからでもそのパッケージのアプリケーションを起動することができるようになりました。
pt_br: Agora você pode instalar pacotes com ``pipx install`` e executar as aplicações do pacote de qualquer lugar.
ru: Теперь вы можете устанавливать пакеты с помощью ``pipx install`` и запускать приложения пакета из любого места.
ta: இப்போது நீங்கள் `` பிஐபிஎக்ச் நிறுவல்` உடன் தொகுப்புகளை நிறுவலாம் மற்றும் எங்கிருந்தும் தொகுப்பின் பயன்பாடுகளை (களை) இயக்கலாம்.

source: For example:
eo: Ekzemple:
ja: 例:
pt_br: Por exemplo:
ru: Например:
ta: உதாரணமாக:

source: To see a list of packages installed with pipx and which applications are available, use ``pipx list``:
eo: Por vidi liston de pakoj instalitaj per pipx kaj liston de haveblaj programoj, uzu ``pipx list``:
ja: pipx でインストールされたパッケージのリストやどんなアプリケーションが使用可能かを見るためには、 ``pipx list`` を使ってください:
pt_br: Para ver uma lista de pacotes instalados com pipx e quais aplicações estão disponíveis, use ``pipx list``:
ru: Чтобы посмотреть список пакетов, установленных с помощью pipx, и доступных приложений, используйте ``pipx list``:
ta: PIPX உடன் நிறுவப்பட்ட தொகுப்புகளின் பட்டியலைக் காண மற்றும் எந்த பயன்பாடுகள் கிடைக்கின்றன என்பதைக் காண, `` PIPX பட்டியல்`` ஐப் பயன்படுத்தவும்:

source: To upgrade or uninstall a package:
eo: Por ĝisdatigi aŭ malinstali pakon:
ja: パッケージを更新またはアンインストールするには:
pt_br: Para atualizar ou desinstalar um pacote:
ru: Чтобы обновить или удалить пакет:
ta: ஒரு தொகுப்பை மேம்படுத்த அல்லது நிறுவல் நீக்க:

source: pipx can be upgraded or uninstalled with pip:
eo: pipx estas ĝisdatigebla kaj malinstalebla per pip:
ja: pipx は pip を使って更新やアンインストールができます:
pt_br: pipx pode ser atualizado ou desinstalado com pip:
ru: pipx можно обновить или удалить с помощью pip:
ta: PIPX ஐ மேம்படுத்தலாம் அல்லது PIP உடன் நிறுவல் நீக்கலாம்:

source: pipx also allows you to install and run the latest version of an application in a temporary, ephemeral environment. For example:
eo: pipx ankaŭ permesas al vi instali kaj ruli la plej novan version de programo en provizora, efemera medio. Ekzemple:
ja: また、pipx ならアプリケーションの最新版を一時的で短命の環境にインストールして動作させることができます。例えば:
pt_br: pipx também permite que você instale e execute a versão mais recente de uma aplicação em um ambiente temporário e efêmero. Por exemplo:
ru: pipx также позволяет установить и запустить последнюю версию приложения во временной, эфемерной среде. Например:
ta: ஒரு பயன்பாட்டின் அண்மைக் கால பதிப்பை தற்காலிக, இடைக்கால சூழலில் நிறுவவும் இயக்கவும் PIPX உங்களை அனுமதிக்கிறது. உதாரணமாக:

source: To see the full list of commands pipx offers, run:
eo: Por vidi la plenan liston de komandoj de pipx, rulu la jenon:
ja: pipx で使える(サブ)コマンドの完全なリストを見たければ、次のようにしてください:
pt_br: Para ver a lista completa de comandos pipx oferece, execute:
ru: Чтобы увидеть полный список команд, которые предлагает pipx, выполните команду:
ta: பிப்எக்ச் வழங்கும் கட்டளைகளின் முழு பட்டியலையும் காண, இயக்கவும்:

source: You can learn more about pipx at https://pipx.pypa.io/.
eo: Lernu pli pri pipx ĉe https://pipx.pypa.io/.
ja: pipx については、 https://pipx.pypa.io/ でもっと学べます。
pt_br: Você pode aprender mais sobre pipx em https://pipx.pypa.io/.
ru: Подробнее о pipx можно узнать на сайте https://pipx.pypa.io/.
ta: PIPX பற்றி https://pipx.pypa.io/ இல் மேலும் அறியலாம்.

source: Installing pip/setuptools/wheel with Linux Package Managers
eo: Instali pip/setuptools/wheel per Linux-pakadministrilojn
ja: Linux パッケージマネージャを使って pip/setuptools/wheel をインストールする
pt_br: Instalando pip/setuptools/wheel com gerenciadores de pacotes do Linux
ru: Установка pip/setuptools/wheel через менеджеры пакетов Linux
ta: லினக்ச் தொகுப்பு மேலாளர்களுடன் PIP/Setuptools/whle ஐ நிறுவுதல்

source: This section covers how to install :ref:`pip`, :ref:`setuptools`, and :ref:`wheel` using Linux package managers.
eo: Jen paragrafo pri kiel instali :ref:`pip`, :ref:`setuptools`, kaj :ref:`wheel` per Linux-pakadministriloj.
ja: この節では、Linux のパッケージマネージャを使って :ref:`pip` ・ :ref:`setuptools` ・ :ref:`wheel` をインストールする方法について説明します。
pt_br: Esta seção cobre como instalar :ref:`pip`, :ref:`setuptools` e :ref:`wheel` usando gerenciadores de pacotes do Linux.
ru: В этом разделе рассказывается о том, как установить :ref:`pip`, :ref:`setuptools` и :ref:`wheel` с помощью менеджеров пакетов Linux.
ta: இந்த பிரிவு எவ்வாறு நிறுவுவது என்பதை உள்ளடக்கியது: குறிப்பு: `பிப்`,: ref:` setuptools`, மற்றும்: Ref: `whel` லினக்ச் தொகுப்பு மேலாளர்களைப் பயன்படுத்துதல்.

source: If you're using a Python that was downloaded from `python.org <https://www.python.org>`_, then this section does not apply. See the :ref:`installing_requirements` section instead.
eo: Se vi uzas Python elŝutitan el `python.org <https://www.python.org>`_, ĉi tiu paragrafo ne rilatas. Anstataŭe vidu la paragrafon :ref:`installing_requirements`.
ja: `python.org <https://www.python.org>`_ からダウンロードした Python を使っているなら、この節の議論はあてはまりません。代わりに :ref:`installing_requirements` 節を見てください。
pt_br: Se você estiver usando um Python que foi baixado de `python.org <https://www.python.org>`_, então esta seção não se aplica. Veja a seção :ref:`installing_requirements`.
ru: Если вы используете Python, загруженный с сайта `python.org <https://www.python.org>`_, то этот раздел не применим. Вместо этого смотрите раздел :ref:`installing_requirements`.
ta: `Python.org <https://www.python.org> _ _ இலிருந்து பதிவிறக்கம் செய்யப்பட்ட பைதானைப் பயன்படுத்துகிறீர்கள் என்றால், இந்த பிரிவு பொருந்தாது. இதைக் காண்க: ref: `நிறுவுதல்_ரொக்விரெமென்ட்ச்` பிரிவு.

source: Note that it's common for the versions of :ref:`pip`, :ref:`setuptools`, and :ref:`wheel` supported by a specific Linux Distribution to be outdated by the time it's released to the public, and updates generally only occur for security reasons, not for feature updates. For certain Distributions, there are additional repositories that can be enabled to provide newer versions. The repositories we know about are explained below.
ja: 特定の Linux ディストロでサポートされているバージョンの :ref:`pip` ・ :ref:`setuptools` ・ :ref:`wheel` が公開時点で既に旧バージョンになってしまっているのに、更新されるのはセキュリティが理由の時だけで機能追加があっても更新されない、というのはよくあることです。ディストロの中にはより新しいバージョンを提供することができる追加のリポジトリが存在する場合もあります。以下では、そのようなリポジトリのうちの既知のものを説明します。
pt_br: Observe que é comum que as versões de :ref:`pip`, :ref:`setuptools` e :ref:`wheel` suportadas por uma distribuição Linux específica estejam desatualizadas no momento em que é lançado para o público, e as atualizações geralmente ocorrem apenas por motivos de segurança, não para atualizações de recursos. Para certas distribuições, existem repositórios adicionais que podem ser ativados para fornecer versões mais recentes. Os repositórios que conhecemos são explicados abaixo.
ru: Обратите внимание, что обычно версии :ref:`pip`, :ref:`setuptools` и :ref:`wheel`, поддерживаемые конкретным дистрибутивом Linux, устаревают к моменту его публичного выпуска, а обновления обычно происходят только по соображениям безопасности, а не для обновления функций. Для некоторых дистрибутивов существуют дополнительные репозитории, которые могут быть включены для получения более новых версий. Репозитории, о которых мы знаем, описаны ниже.
ta: இதன் பதிப்புகளுக்கு இது பொதுவானது: ref: `பிப்`,: ref:` setuptools`, மற்றும்: ref: `சக்கரம்` ஒரு குறிப்பிட்ட லினக்ச் விநியோகத்தால் ஆதரிக்கப்படுகிறது, அது பொதுமக்களுக்கு வெளியிடப்பட்ட நேரத்தில் காலாவதியானது, பொதுவாக புதுப்பிப்புகள் பாதுகாப்பு காரணங்களுக்காக மட்டுமே நிகழ்கிறது, அம்ச புதுப்பிப்புகளுக்கு அல்ல. சில விநியோகங்களுக்கு, புதிய பதிப்புகளை வழங்க கூடுதல் களஞ்சியங்கள் இயக்கப்படலாம். எங்களுக்குத் தெரிந்த களஞ்சியங்கள் கீழே விளக்கப்பட்டுள்ளன.

source: Also note that it's somewhat common for Distributions to apply patches for the sake of security and normalization to their own standards. In some cases, this can lead to bugs or unexpected behaviors that vary from the original unpatched versions. When this is known, we will make note of it below.
eo: Ankaŭ notu, ke Distribuoj ofte flikas por sekureco kaj konformeco al siaj normoj. Kelkfoje, tio povas kaŭzi cimojn aŭ neatenditajn kondutojn diferencajn de originalaj neflikitaj versioj. Kiam tio estas konata, ni rimarkos tion ĉi-sube.
ja: また、ディストロがセキュリティ上の理由やディストロ自身の標準に合致させる目的でパッチを適用することはそれなりによくあります。いくつかのケースでは、オリジナルの未パッチのバージョンとは異なるバグや期待に反した動きにつながることもあります。わかっているものについては、以下に注記します。
pt_br: Observe também que é um tanto comum que as Distribuições apliquem patches para fins de segurança e normalização de acordo com seus próprios padrões. Em alguns casos, isso pode levar a bugs ou comportamentos inesperados que variam em relação às versões originais sem patch. Quando isso for conhecido, faremos anotações sobre isso a seguir.
ru: Также обратите внимание, что дистрибутивы нередко применяют исправления в целях безопасности и приведения их в соответствие с собственными стандартами. В некоторых случаях это может привести к ошибкам или неожиданному поведению, отличающемуся от первоначальных непропатченных версий. Когда об этом станет известно, мы сообщим об этом ниже.
ta: பாதுகாப்பு மற்றும் இயல்பாக்குதலுக்காக தங்கள் சொந்த தரங்களுக்கு விநியோகங்கள் இணைப்புகளைப் பயன்படுத்துவது ஓரளவு பொதுவானது என்பதையும் நினைவில் கொள்க. சில சந்தர்ப்பங்களில், இது அசல் இணைக்கப்படாத பதிப்புகளிலிருந்து மாறுபடும் பிழைகள் அல்லது எதிர்பாராத நடத்தைகளுக்கு வழிவகுக்கும். இது அறியப்படும்போது, அதை கீழே குறிப்பிடுவோம்.

source: Fedora
ta: ஃபெடோரா
