Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The project's :term:`metadata <Pyproject Metadata>` is placed in :term:`pyproject.toml`. The :term:`pyproject metadata keys <Pyproject Metadata Key>` and the ``[build-system]`` table may be filled in as described in :ref:`writing-pyproject-toml`, adding a dependency on ``typer`` (this tutorial uses version *0.12.3*).
eo: La projektaj :term:`metadatenoj <Pyproject Metadata>` troviĝas en :term:`pyproject.toml`. La :term:`metadatenaj ŝlosiloj pyproject <Pyproject Metadata Key>` kaj la tabelo ``[build-system]`` estu laŭ :ref:`writing-pyproject-toml`, kun dependeco sur ``typer`` (ĉi tiu lernilo uzas la version *0.12.3*).
ja: プロジェクトの :term:`メタデータ <Pyproject Metadata>` は :term:`pyproject.toml` の中にあります。 ``typer`` (このチュートリアルではバージョン *0.1.2.3* を使います) への依存を追加しながら、 :ref:`writing-pyproject-toml` に記述されているように :term:`pyproject メタデータキー <Pyproject Metadata Key>` や ``[build-system]`` テーブルに値が埋め込まれます。
ru: Метаданные проекта :term:`metadata <Pyproject Metadata>` размещаются в :term:`pyproject.toml`. Ключи метаданных :term:`pyproject <Pyproject Metadata Key>` и таблица ``[build-system]`` могут быть заполнены, как описано в :ref:`writing-pyproject-toml`, добавив зависимость от ``typer`` (в этом руководстве используется версия *0.12.3*).
ta: திட்டத்தின்: கால: `மெட்டாடேட்டா <பைபிரோசெக்ட் மெட்டாடேட்டா>` வைக்கப்பட்டுள்ளது: கால: `pyproject.toml`. தி: கால: `பைபிரொசெக்ட் மேனிலை தரவு விசைகள் <பைபிரோசெக்ட் மேனிலை தரவு விசை>` மற்றும் `` [பில்ட்-சிச்டம்] `` அட்டவணை விவரிக்கப்பட்டுள்ளபடி நிரப்பப்படலாம்: `` எழுதுதல்-பிப்ரோசெக்ட்-டோம்ல்`, `` `` டைபர்`` (இந்த பயிற்சி பதிப்பைப் பயன்படுத்துகிறது *0.12.3 *).

source: For the project to be recognised as a command-line tool, additionally a ``console_scripts`` :ref:`entry point <entry-points>` (see :ref:`console_scripts`) needs to be added as a :term:`subkey <Pyproject Metadata Subkey>`:
eo: Por ke la projekto estu rekonebla kiel komandlinia ilo, krome la :ref:`enirpunkto <entry-points>` ``console_scripts`` (vidu :ref:`console_scripts`) devas esti aldonita kiel :term:`subŝlosilo <Pyproject Metadata Subkey>`:
ja: コマンドラインツールとして認識されるプロジェクト向けには、さらに ``console_scripts`` :ref:`エントリポイント <entry-point>` (:ref:`console_scripts`をご覧ください) が :term:`サブキー <Pyproject Metadata Subkey>` として追加されている必要があります:
ru: Чтобы проект распознавался как инструмент командной строки, дополнительно необходимо добавить ``console_scripts`` :ref:`entry point <entry-points>` (см. :ref:`console_scripts`) в качестве :term:`subkey <Pyproject Metadata Subkey>`:
ta: திட்டம் ஒரு கட்டளை-வரி கருவியாக அங்கீகரிக்கப்படுவதற்கு, கூடுதலாக ஒரு `` கன்சோல்_ச்கிரிப்ட்ச்``: குறிப்பு: `நுழைவு புள்ளி <நுழைவு புள்ளிகள்>` (பார்க்க: குறிப்பு: `கன்சோல்_ச்கிரிப்ட்ச்`) ஒரு: காலமாக சேர்க்கப்பட வேண்டும்: `சப்ச்கே <பைபிரோசெக்ட் மேனிலை தரவு சப்ச்கி>`:

source: Now, the project's source tree is ready to be transformed into a :term:`distribution package <Distribution Package>`, which makes it installable.
eo: Nun, la fontarbo de la projekto pretas transformiĝi en instaleblan :term:`distribuan pakon <Distribution Package>`.
ja: これで、プロジェクトのソースコードツリーが、インストールすることができる :term:`配布パッケージ <Distribution Package>` へと変換される準備ができました。
ru: Теперь дерево исходных текстов проекта готово к преобразованию в :term:`distribution package <Distribution Package>`, что делает его пригодным для установки.
ta: இப்போது, திட்டத்தின் மூல மரம் A: காலமாக மாற்ற தயாராக உள்ளது: `விநியோக தொகுப்பு <விநியோக தொகுப்பு>`, இது நிறுவக்கூடியதாக அமைகிறது.

source: Installing the package with ``pipx``
eo: Instali la pakon per ``pipx``
ja: ``pipx`` を使ってパッケージをインストールする
ru: Установка пакета с помощью ``pipx``
ta: `` பிப்எக்ச்`` உடன் தொகுப்பை நிறுவுதல்

source: After installing ``pipx`` as described in :ref:`installing-stand-alone-command-line-tools`, install your project:
eo: Post instalo de ``pipx`` laŭ :ref:`installing-stand-alone-command-line-tools`, instalu vian projekton:
ja: :ref:`installing-stand-alone-command-line-tools` に記述されているように ``pipx`` をインストールした後に、プロジェクトをインストールしましょう:
ru: После установки ``pipx``, как описано в :ref:`installing-stand-alone-command-line-tools`, установите ваш проект:
ta: இவ்வாறு விவரிக்கப்பட்டுள்ளபடி `` பிப்எக்ச்`` ஐ நிறுவிய பிறகு: குறிப்பு: `தனியாக-கட்டம்-கட்டளை-கோல்களை நிறுவுதல், உங்கள் திட்டத்தை நிறுவவும்:

source: This will expose the executable script we defined as an entry point and make the command ``greet`` available. Let's test it:
eo: Tio difinos la ruleblan programon kiel enirpunkton kaj disponigos la komandon ``greet``. Ni elprovu:
ja: これによって、エントリポイントとして定義した実行可能なスクリプトを露出し、コマンド ``greet`` を利用可能にします。試してみましょう:
ru: Это откроет исполняемый скрипт, который мы определили как точку входа, и сделает доступной команду ``greet``. Давайте проверим это:
ta: இது ஒரு நுழைவு புள்ளியாக நாங்கள் வரையறுத்துள்ள இயங்கக்கூடிய ச்கிரிப்டை அம்பலப்படுத்தும் மற்றும் கட்டளையை `` வாழ்த்துக்கள்`` கிடைக்கச் செய்யும். அதை சோதிப்போம்:

source: Since this example uses ``typer``, you could now also get an overview of the program's usage by calling it with the ``--help`` option, or configure completions via the ``--install-completion`` option.
eo: Ĉar ĉi tiu ekzemplo uzas ``typer``, oni povas nun superrigardi la opciojn de la programo per la flago ``--help`` aŭ agordi kompletigadon per la flago ``--install-completion``.
ja: この例では ``typer`` を使っていますので、今や ``--help`` オプションをつけて呼び出すことでプログラムの使用方法の概要を得たり、 ``--install-completion`` オプション経由でコマンドライン補完を得ることができるでしょう。
ru: Поскольку в этом примере используется ``typer``, теперь вы также можете получить обзор использования программы, вызвав ее с помощью опции ``--help``, или настроить завершение работы с помощью опции ``--install-completion``.
ta: இந்த எடுத்துக்காட்டு `` டைபர்`` ஐப் பயன்படுத்துவதால், நிரல் பயன்பாட்டின் ``--எல்ப்`` விருப்பத்துடன் அழைப்பதன் மூலம் அல்லது ``-நிறுவல்-முடித்தல்`` விருப்பத்தின் மூலம் நிறைவுகளை உள்ளமைக்கவும் இப்போது நிரலின் பயன்பாட்டின் கண்ணோட்டத்தையும் பெறலாம் .

source: To just run the program without installing it permanently, use ``pipx run``, which will create a temporary (but cached) virtual environment for it:
eo: Por simple ruli la programon sen malprovizora instalado, uzu ``pipx run``, kiu kreos provizoran (sed enkaŝmemorigitan) virtualan medion por ĝi:
ja: プログラムを永続的にインストールすることなしにただプログラムを走らせるためには、一時的な (しかしキャッシュされる) 仮想環境を作ってくれる ``pipx run`` を使いましょう。
ru: Чтобы просто запустить программу без ее постоянной установки, используйте ``pipx run``, который создаст для нее временное (но кэшированное) виртуальное окружение:
ta: நிரலை நிரந்தரமாக நிறுவாமல் இயக்க, `` பிப்எக்ச் ரன்`` ஐப் பயன்படுத்தவும், இது ஒரு தற்காலிக (ஆனால் தற்காலிக சேமிப்பு) மெய்நிகர் சூழலை உருவாக்கும்:

source: There is, however, a more practical solution to this problem, in the form of an entry point specific to ``pipx run``. The same can be defined as follows in :file:`pyproject.toml`:
eo: Tamen ekzistas pli praktika solvo de tiu problemo: enirpunkto specifa al ``pipx run``. La sama estas difinebla jene en :file:`pyproject.toml`:
ja: しかしながら、この問題に対するもっと実際的な解決法で、 ``pipx run`` でエントリポイントを指定する形式があります。以下に述べる :file:`pyproject.toml` 内で定義することで同様のことができるのです:
ru: Однако существует более практичное решение этой проблемы в виде точки входа, специфичной для ``pipx run``. Ее можно определить следующим образом в :file:`pyproject.toml`:
ta: எவ்வாறாயினும், இந்த சிக்கலுக்கு மிகவும் நடைமுறை தீர்வு உள்ளது, `` பிப்எக்ச் ரன்`` க்கு குறிப்பிட்ட நுழைவு புள்ளியின் வடிவத்தில். பின்வருமாறு இதை வரையறுக்கலாம்: கோப்பு: `pyproject.toml`:

source: Thanks to this entry point (which *must* match the package name), ``pipx`` will pick up the executable script as the default one and run it, which makes this command possible:
eo: Dank’ al tiu enirpunkto (kiu *devas* kongrui kun la nomo de la pako), ``pipx`` trovos la ruleblan programon kiel la implicitaĵon kaj rulos ĝin. Tio ebligas la jenan komandon:
ja: このエントリポイント (その名称がパッケージ名称と *一致しなければなりません*) のおかげで、 ``pipx`` は実行可能なスクリプトをデフォルトのものとして選択しそれを走らせるでしょう、そして、それはこのコマンドを実現可能にします:
ru: Благодаря этой точке входа (которая *должна* соответствовать имени пакета), ``pipx`` подберет исполняемый скрипт по умолчанию и запустит его, что делает эту команду возможной:
ta: இந்த நுழைவு புள்ளிக்கு நன்றி (இது * தொகுப்பு பெயருடன் பொருந்த வேண்டும்), `` பிப்எக்ச்`` இயங்கக்கூடிய ச்கிரிப்டை இயல்புநிலையாக எடுத்துக்கொண்டு இயக்கும், இது இந்த கட்டளையை சாத்தியமாக்குகிறது:

source: Conclusion
eo: Konkludo
ja: 結論
ru: Заключение
ta: முடிவு

source: Packaging and distributing projects
eo: Paki kaj distribui projektojn
ja: パッケージングとプロジェクトの配布
pt_br: Empacotando e distribuindo projetos
ru: Упаковка и распространение проектов
ta: திட்டங்களை பேக்கேசிங் மற்றும் விநியோகித்தல்

source: Outdated
eo: Eksvalidiĝinta
ja: 期限切れのもの
pt_br: Desatualizada
ru: Устаревший
ta: காலாவதியான

source: This section covers some additional details on configuring, packaging and distributing Python projects with ``setuptools`` that aren't covered by the introductory tutorial in :doc:`/tutorials/packaging-projects`. It still assumes that you are already familiar with the contents of the :doc:`/tutorials/installing-packages` page.
eo: Ĉi tiu paragrafo diskutas pliajn detalojn pri agordado, pakado kaj distribuado de Python-projektoj per ``setuptools`` ne menciitajn en la enkonduka lernilo en :doc:`/tutorials/packaging-projects`. Ĝi supozas, ke vi jam konas la enhavon de la paĝo :doc:`/tutorials/installing-packages`.
ja: この節では、 ``setuptools`` を使ったPythonパッケージの設定・パッケージング・配布方法について、 :doc:`/tutorials/packaging-projects`_ の入門的なチュートリアルでは触れていないような追加的な詳細を説明します。あなたが既に :doc:`/tutorials/installing-packages` ページの内容については慣れ親しんでいるものと仮定して進めます。
pt_br: Esta seção cobre alguns detalhes adicionais sobre configuração, empacotamento e distribuição de projetos Python com ``setuptools`` que não são cobertos pelo tutorial introdutório em :doc:`/tutorials/packaging-projects`. Ele ainda assume que você já está familiarizado com o conteúdo da página :doc:`/tutorials/installing-packages`.
ru: В этом разделе рассматриваются некоторые дополнительные детали по настройке, упаковке и распространению проектов Python с помощью ``setuptools``, которые не были рассмотрены во вводном руководстве в :doc:`/tutorials/packaging-projects``. При этом предполагается, что вы уже знакомы с содержанием страницы :doc:`/tutorials/installing-packages`.
ta: இந்த பிரிவு பைதான் திட்டங்களை உள்ளமைத்தல், பேக்கேசிங் மற்றும் விநியோகித்தல் பற்றிய சில கூடுதல் விவரங்களை `` செடிப்டூல்ச்`` உடன் அறிமுகம் டுடோரியலால் உள்ளடக்கியது: டாக்: `/டுடோரியல்கள்/பேக்கேசிங்-திட்டங்கள்`. : டாக்: `/டுடோரியல்கள்/நிறுவுதல்-பேக்கேச்கள்` பக்கத்தின் உள்ளடக்கங்களை நீங்கள் ஏற்கனவே அறிந்திருக்கிறீர்கள் என்று அது இன்னும் கருதுகிறது.

source: The section does *not* aim to cover best practices for Python project development as a whole. For example, it does not provide guidance or tool recommendations for version control, documentation, or testing.
eo: Ĉi tiu paragrafo *ne* celas rekomendi pri ĉiaj aspektoj de Python-projektoj. Ekzemple, ĝi ne rekomendas ion ajn aŭ iun ajn ilon pri versio-kontrolado, dokumentaro aŭ testado.
ja: この節は、Pythonプロジェクトの開発についての全体的なベストプラクティスを説明しているわけではありません。例えば、バージョン管理や文書化、あるいは試験について、手引きとなったりツールを推奨するようなことはありません。
pt_br: A seção *não* visa cobrir as melhores práticas para o desenvolvimento de projetos Python como um todo. Por exemplo, ele não fornece orientação ou recomendações de ferramentas para controle de versão, documentação ou teste.
ru: Этот раздел *не* ставит целью охватить лучшие практики разработки проектов на Python в целом. Например, в нем нет руководства или рекомендаций по инструментам для контроля версий, документации или тестирования.
ta: ஒட்டுமொத்தமாக பைதான் திட்ட மேம்பாட்டுக்கான சிறந்த நடைமுறைகளை ஈடுகட்ட இந்த பிரிவு * இல்லை *. எடுத்துக்காட்டாக, இது பதிப்பு கட்டுப்பாடு, ஆவணங்கள் அல்லது சோதனைக்கான வழிகாட்டுதல் அல்லது கருவி பரிந்துரைகளை வழங்காது.

source: For more reference material, see :std:doc:`Building and Distributing Packages <setuptools:userguide/index>` in the :ref:`setuptools` docs, but note that some advisory content there may be outdated. In the event of conflicts, prefer the advice in the Python Packaging User Guide.
eo: Por pli da referencaj informoj, vidu :std:doc:`Building and Distributing Packages <setuptools:userguide/index>` en la dokumentaro de :ref:`setuptools`, sed notu, ke tieaj konsiloj povas esti eksvalidiĝinta. Se ekzistas neakordo, preferu la konsilojn en la Manlibro por Python-Uzantoj pri Pakado.
ja: より詳しい参考文献としては、:ref:`setuptools` の説明文書の中の :std:doc:`パッケージのビルドと配布 <setuptools:userguide/index>` を挙げておきますが、推奨事項のいくつかはもはや古くなっているかもしれません。喰い違いがあった場合には、Python パッケージングユーザガイドの推奨事項を優先してください。
pt_br: Para mais material de referência, veja :std:doc:`Construindo e Distribuindo Pacotes <setuptools:userguide/index>` na documentação :ref:`setuptools`, mas note que alguns conteúdos de aviso podem estar desatualizados. No caso de conflitos, dê preferência ao conselho do Guia de Usuário para Empacotamento de Python.
ru: Дополнительные справочные материалы см. в :std:doc:`Building and Distributing Packages <setuptools:userguide/index>` в :ref:`setuptools` docs, но учтите, что некоторые рекомендации там могут быть устаревшими. В случае возникновения противоречий отдавайте предпочтение советам в руководстве пользователя по упаковке Python.
ta: மேலும் குறிப்புப் பொருளுக்கு, காண்க: எச்.டி.டி: டிஓசி: `தொகுப்புகளை உருவாக்குதல் மற்றும் விநியோகித்தல் <செட்டப்டூல்ச்: யு.எச்.இ. மோதல்கள் ஏற்பட்டால், பைதான் பேக்கேசிங் பயனர் வழிகாட்டியில் ஆலோசனையை விரும்புங்கள்.

source: Requirements for packaging and distributing
eo: Postuloj por pakado kaj distribuado
ja: パッケージングと配布に対する要求事項
pt_br: Requisitos para empacotamento e distribuição
ru: Требования к упаковке и распространению
ta: பேக்கேசிங் மற்றும் விநியோகிப்பதற்கான தேவைகள்

source: First, make sure you have already fulfilled the :ref:`requirements for installing packages <installing_requirements>`.
eo: Unue certigu, ke vi jam plenumis la :ref:`postulojn por instali pakojn <installing_requirements>`.
ja: 最初に、あなたが既に :ref:`パッケージをインストールする際の要求事項 <installing_requirements>` を満たしていることを確実にしてください。
pt_br: Primeiro, certifique-se de que você já cumpriu os :ref:`requisitos para instalação de pacotes <installing_requirements>`.
ru: Во-первых, убедитесь, что вы уже выполнили :ref:`требования к установке пакетов <installing_requirements>`.
ta: முதலில், நீங்கள் ஏற்கனவே நிறைவு செய்துள்ளீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்: ref: `தொகுப்புகளை நிறுவுவதற்கான தேவைகள் <நிறுவல்_ரொக்விரெமென்ட்ச்>`.

source: Install "twine" [1]_:
eo: Instali «twine» [1]_:
ja: "twine"をインストールする [1]_:
pt_br: Instale "twine" [1]_:
ru: Установите «twine» [1]_:
ta: "கயிறு" நிறுவவும் [1] _:

source: You'll need this to upload your project :term:`distributions <Distribution Package>` to :term:`PyPI <Python Package Index (PyPI)>` (see :ref:`below <Uploading your Project to PyPI>`).
eo: Vi postulas tiun por alŝuti viajn projektajn :term:`distribuojn <Distribution Package>` al :term:`PyPI <Python Package Index (PyPI)>` (vidu :ref:`ĉi-sube <Uploading your Project to PyPI>`).
ja: あなたのプロジェクトの :term:`配布物 <Distribution Package>` を :term:`PyPI <Python Package Index (PyPI)>` にアップロードする( :ref:`後述 <Uploading your Project to PyPI>` )ためにこれが必要になるでしょう。
pt_br: Você precisará disso para enviar as :term:`distribuições <Distribution Package>` do seu projeto para o :term:`PyPI <Python Package Index (PyPI)>` (veja :ref:`abaixo <Uploading your Project to PyPI>`).
ru: Он понадобится для загрузки вашего проекта :term:`distributions <Дистрибутивный пакет>` в :term:`PyPI <Индекс пакетов Python (PyPI)>` (см. :ref:`ниже <Загрузка проекта в PyPI>`).
ta: உங்கள் திட்டத்தை பதிவேற்ற உங்களுக்கு இது தேவைப்படும்: கால: `விநியோகங்கள் <விநியோக தொகுப்பு>` க்கு: கால: `பைபி <பைதான் தொகுப்பு குறியீட்டு (பைபி)>` (பார்க்க: `கீழே <கீழே <உங்கள் திட்டத்தை பைபி>` .

source: Configuring your project
eo: Agordi vian projekton
ja: あなたのプロジェクトを設定する
pt_br: Configurando seu projeto
ru: Настройка вашего проекта
ta: உங்கள் திட்டத்தை உள்ளமைத்தல்

source: Initial files
eo: Komencaj dosieroj
ja: 最初に必要なファイル群
pt_br: Arquivos iniciais
ru: Исходные файлы
ta: தொடக்க கோப்புகள்

source: The most important file is :file:`setup.py` which exists at the root of your project directory. For an example, see the `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ in the `PyPA sample project <https://github.com/pypa/sampleproject>`_.
eo: La plej grava dosiero estas :file:`setup.py` ĉe la radiko de via projekta dosierujo. Por ekzemplo, vidu `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ en la `ekzempla projekto de PyPA <https://github.com/pypa/sampleproject>`_.
ja: 最重要のファイルは、あなたのプロジェクトのディレクトリの一番上(ルート)にある :file:`setup.py` です。`PyPA サンプルプロジェクト <https://github.com/pypa/sampleproject>`_ の `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ に具体例があります。
pt_br: O arquivo mais importante é :file:`setup.py` que existe na raiz do diretório do seu projeto. Para obter um exemplo, consulte o `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ no `projeto de exemplo PyPA <https://github.com/pypa/sampleproject>`_.
ru: Наиболее важным файлом является :file:`setup.py`, который существует в корне каталога вашего проекта. Для примера смотрите `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.py>`_ в проекте-образце PyPA <https://github.com/pypa/sampleproject>`_.
ta: மிக முக்கியமான கோப்பு: கோப்பு: உங்கள் திட்ட கோப்பகத்தின் மூலத்தில் இருக்கும் `setup.py`. ஒரு எடுத்துக்காட்டுக்கு, `setup.py <https://github.com/pypa/sampleproject/blob/db5806e0a32040340340dde7dde7d5eb3fa2532e/setup.py. மாதிரி தயாரிப்பு> `_.

source: :file:`setup.py` serves two primary functions:
eo: :file:`setup.py` havas du ĉeffunkciojn:
ja: :file:`setup.py` はふたつの主要な機能を提供します。
pt_br: :file:`setup.py` tem duas funções principais:
ru: Файл :file:`setup.py` выполняет две основные функции:
ta: : கோப்பு: `setup.py` இரண்டு முதன்மை செயல்பாடுகளுக்கு உதவுகிறது:

source: It's the file where various aspects of your project are configured. The primary feature of :file:`setup.py` is that it contains a global ``setup()`` function. The keyword arguments to this function are how specific details of your project are defined. The most relevant arguments are explained in :ref:`the section below <setup() args>`.
ja: まず、あなたのプロジェクトをさまざまな角度から設定するためのファイルです。 :file:`setup.py` の主要な機能は、グローバルな ``setup()`` 関数を含んでいることです。この関数にキーワード引数を渡すことで、あなたのプロジェクトの特定の細部を定義することができます。適切な引数のほとんどについて :ref:`次節 <setup() args>` で説明します。
pt_br: É o arquivo onde vários aspectos do seu projeto são configurados. A principal característica do :file:`setup.py` é que ele contém uma função global ``setup()``. Os argumentos nomeados para esta função são como os detalhes específicos do seu projeto são definidos. Os argumentos mais relevantes são explicados em :ref:`a seção abaixo de <setup() args>`.
ru: Это файл, в котором настраиваются различные аспекты вашего проекта. Главная особенность :file:`setup.py` заключается в том, что он содержит глобальную функцию ``setup()``. Ключевые слова-аргументы этой функции определяют конкретные детали вашего проекта. Наиболее важные аргументы описаны в :ref:`разделе ниже <setup() args>`.
ta: உங்கள் திட்டத்தின் பல்வேறு நற்பொருத்தங்கள் கட்டமைக்கப்பட்ட கோப்பு இது. இதன் முதன்மை அம்சம்: கோப்பு: `setup.py` என்னவென்றால், அதில் உலகளாவிய` `அமைவு ()` `செயல்பாடு உள்ளது. இந்த செயல்பாட்டிற்கான முக்கிய வாதங்கள் உங்கள் திட்டத்தின் குறிப்பிட்ட விவரங்கள் எவ்வாறு வரையறுக்கப்படுகின்றன என்பதுதான். மிகவும் பொருத்தமான வாதங்கள் இதில் விளக்கப்பட்டுள்ளன: ref: `கீழே உள்ள பிரிவு <அமைவு () args>`.

source: It's the command line interface for running various commands that relate to packaging tasks. To get a listing of available commands, run ``python3 setup.py --help-commands``.
eo: Ĝi estas la komandlinian fasadon por rulado de diversaj komandoj pri pakado. Por listo de haveblaj komandoj, rulu ``python3 setup.py --help-commands``.
ja: それは、パッケージングする上での作業項目に関連したさまざまなコマンドを走らせるためのコマンドラインインタフェイスです。使用可能なコマンドを一覧するには、 ``python setup.py --help-commands`` を実行してください。
pt_br: É a interface de linha de comando para executar vários comandos relacionados a tarefas de empacotamento. Para obter uma lista dos comandos disponíveis, execute ``python3 setup.py --help-commands``.
ru: Это интерфейс командной строки для запуска различных команд, связанных с задачами упаковки. Чтобы получить список доступных команд, выполните команду ``python3 setup.py --help-commands``.
ta: பேக்கேசிங் பணிகளுடன் தொடர்புடைய பல்வேறு கட்டளைகளை இயக்குவதற்கான கட்டளை வரி இடைமுகம் இது. கிடைக்கக்கூடிய கட்டளைகளின் பட்டியலைப் பெற, `` python3 setup.py--help-commands`` ஐ இயக்கவும்.

source: :file:`setup.cfg` is an ini file that contains option defaults for :file:`setup.py` commands. For an example, see the `setup.cfg <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.cfg>`_ in the `PyPA sample project <https://github.com/pypa/sampleproject>`_.
eo: :file:`setup.cfg` estas ini-dosiero enhavanta implicitajn valorojn de opcioj por la komandoj de :file:`setup.py`. Por ekzemplo, vidu `setup.cfg <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.cfg>`_ en la `ekzempla projekto de PyPA <https://github.com/pypa/sampleproject>`_.
ja: :file:`setup.cfg` は :file:`setup.py` のコマンド群に対するオプションの既定値を含む初期化ファイルです。 `PyPA サンプルプロジェクト <https://github.com/pypa/sampleproject>`_ の中の `setup.cfg <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.cfg>`_ に使用例が出ています。
pt_br: :file:`setup.cfg` é um arquivo ini que contém opções padrão para os comandos :file:`setup.py`. Para obter um exemplo, consulte o `setup.cfg <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.cfg>`_ no `projeto de exemplo PyPA <https://github.com/pypa/sampleproject>`_.
ru: :file:`setup.cfg` - это ini-файл, содержащий параметры по умолчанию для команд :file:`setup.py`. Для примера смотрите файл `setup.cfg <https://github.com/pypa/sampleproject/blob/db5806e0a3204034c51b1c00dde7d5eb3fa2532e/setup.cfg>`_ в проекте-образце `PyPA <https://github.com/pypa/sampleproject>`_.
ta: . ஒரு எடுத்துக்காட்டுக்கு, `setup.cfg <https://github.com/pypa/sampleproject/blob/db5806e0a3204034034dde7dde7d5eb3fa2532e/setup.cfg> _` _ _ _ _ _ _ _ _ _ மாதிரி தயாரிப்பு> `_.
