Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: A tool for installing, upgrading, and/or removing Python packages in a manner that conforms to Python packaging standards. The most popular Python-specific package manager is pip_; other examples include the old `Easy Install command <easy-install_>`_ as well as direct usage of a ``setup.py`` command.
eo: Ilo por instali, ĝisdatigi kaj/aŭ malinstali Python-pakojn konforme al normoj pri pakado de Python. La plej populara Python-specifa pakadministrilo estas pip_; jen aliaj ekzemploj: `la malnova komando Easy Install <easy-install_>`_ kaj rekta uzo de la komando ``setup.py``.
ja: Python パッケージング標準 <Python packaging standard> を満足する形で Python パッケージをインストール・アップグレード・削除するためのツール。最もよく知られた Python 特有のパッケージマネージャは pip_ です; 他の例には、 ``setup.py`` コマンドを直接に使う方法と同様、古い `Easy Install コマンド <easy-install_>`_ が含まれます。
ru: Инструмент для установки, обновления и/или удаления пакетов Python в соответствии со стандартами упаковки Python. Наиболее популярным менеджером пакетов для Python является pip_; другие примеры включают старую команду <easy-install_>`_, а также прямое использование команды ``setup.py``.
ta: பைதான் பேக்கேசிங் தரநிலைகளுக்கு இணங்க பைதான் தொகுப்புகளை நிறுவுதல், மேம்படுத்துதல் மற்றும்/அல்லது அகற்றுவதற்கான ஒரு கருவி. மிகவும் பிரபலமான பைதான்-குறிப்பிட்ட தொகுப்பு மேலாளர் பிப்_; மற்ற எடுத்துக்காட்டுகளில் பழைய `எளிதான நிறுவல் கட்டளை <எளிதான-நிறுவல்_>` _ மற்றும் `` setup.py`` கட்டளையின் நேரடி பயன்பாடு ஆகியவை அடங்கும்.

source: (Note that the ``easy_install`` command was removed in setuptools version 52, released 23 January 2021.)
eo: (Notu, ke la komando ``easy_install`` estis forigita en versio 52 de setuptools, eldonita je la 23a de Januaro 2021.)
ja: (``easy_install`` コマンドは、2021 年 1 月 23 日にリリースされた setuptools のバージョン 52 で除去されています。)
ru: (Обратите внимание, что команда ``easy_install`` была удалена в версии setuptools 52, выпущенной 23 января 2021 года.)
ta: (Note that the ``easy_install`` கட்டளை was removed in setuptools version 52, released 23 மா-தை 2021.)

source: (Conda_ is a bit of a special case, as the ``conda`` command can install much more than just Python packages, making it more like a distro package manager in some senses. Since the ``conda`` command generally only operates on Conda-created environments, most of the concerns in this document do not apply to ``conda`` when acting as a Python-specific package manager.)
eo: (Conda_ estas speciala kazo, ĉar la komando ``conda`` povas instali multe pli ol nur Python-pakojn, iel simile al distribuaj pakadministriloj. Ĉar la komando ``conda`` nur funkcias en Conda-kreita medio, la plejparto de la koncernoj en ĉi tiu dokumento ne validas por ``conda`` funkcianta kiel Python-specifa pakadministrilo.)
ja: (Conda_ は少々特別なケースです、というのは、 `conda` コマンドを使えば単に Python パッケージだけではなくずっと多くのものをインストールすることができるからで、いくつかの意味ではディストロ <distro> 付属のパッケージマネージャにもっと似ていると言えるでしょう。 ``conda`` コマンドは一般的には Conda が作成した環境の上でのみ動作するので、Python 特有のパッケージマネージャとして動作する場合には、この説明文書における関心のほとんどは ``conda`` には適用されません。)
ru: (Conda_ - это немного особый случай, поскольку команда ``conda`` может устанавливать не только пакеты Python, что делает ее в некотором смысле похожей на менеджер пакетов дистрибутива. Поскольку команда ``conda`` обычно работает только с окружениями, созданными Conda, большинство проблем, описанных в этом документе, не относятся к ``conda``, когда она выступает в роли менеджера пакетов для Python.)
ta: . காண்டா உருவாக்கிய சூழல்களில், பைதான்-குறிப்பிட்ட தொகுப்பு மேலாளராக செயல்படும்போது இந்த ஆவணத்தில் உள்ள பெரும்பாலான கவலைகள் `` கான்டா`` க்கு பொருந்தாது.)

source: distro package manager
eo: distribupakadministrilo
ja: ディストロ <distro> パッケージマネージャ
ru: менеджер пакетов дистрибутива
ta: டிச்ட்ரோ தொகுப்பு மேலாளர்

source: A tool for installing, upgrading, and/or removing a distro's packages in an installed instance of that distro, which is capable of installing Python packages as well as non-Python packages, and therefore generally has its own database of installed software unrelated to the :ref:`database of installed distributions <recording-installed-packages>`. Examples include ``apt``, ``dpkg``, ``dnf``, ``rpm``, ``pacman``, and ``brew``. The salient feature is that if a package was installed by a distro package manager, removing or upgrading it in a way that would satisfy a Python-specific package manager will generally leave a distro package manager in an inconsistent state.
eo: Ilo por instali, ĝisdatigi, kaj/aŭ malinstali pakojn de distribuo en instalita distribuo, kapabla instali Python-pakojn kaj ne-Python-ajn pakojn, kun sia propra datenbanko de instalitaj programoj ne rilata al la :ref:`datenbanko de instalitaj distribuoj <recording-installed-packages>`. Jen kelkaj ekzemploj: ``apt``, ``dpkg``, ``dnf``, ``rpm``, ``pacman`` kaj ``brew``. Grave, se iu pako estis instalita de la pakadministrilo de la distribuo, do malinstalado aŭ ĝisdatigado de tiu pako tiel, kiel Python-specifa pakadministrilo funkcius, kaŭzus malkoherecon je la pakadministrilo de la distribuo.
ja: 当該ディストロのインストール済みインスタンス内でディストロ提供のパッケージをインストール・更新・削除するためのツールで、 Python パッケージか非 Python パッケージかに依らずインストールする能力を持つものであり、従って、一般的にそのツールに特有のインストール済みソフトウェアのデータベースで :ref:`インストール済み配布物のデータベース <recording-installed-packages>` とは無関係のものを持つもの。例には ``apt`` ・ ``dpkg`` ・ ``def`` ・ ``rpm`` ・ ``pacman`` ・ ``brew`` を含みます。顕著な特徴としては、あるパッケージがディストロのパッケージマネージャによってインストールされていた場合に、 Python 特有のパッケージマネージャを満足させる方法でそのパッケージを削除したり更新したりすることが、一般にディストロのパッケージマネージャの状態を不整合なまま放置するであろうということです。
ru: Инструмент для установки, обновления и/или удаления пакетов дистрибутива в установленном экземпляре этого дистрибутива, который способен устанавливать пакеты Python, а также пакеты, не относящиеся к Python, и поэтому обычно имеет свою собственную базу данных установленного программного обеспечения, не связанную с :ref:`базой данных установленных дистрибутивов <recording-installed-packages>`. Примерами могут служить ``apt``, ``dpkg``, ``dnf``, ``rpm``, ``pacman`` и ``brew``. Основная особенность заключается в том, что если пакет был установлен менеджером пакетов дистрибутива, то его удаление или обновление таким образом, чтобы удовлетворить специфический менеджер пакетов Python, обычно приводит к тому, что менеджер пакетов дистрибутива оказывается в противоречивом состоянии.
ta: அந்த டிச்ட்ரோவின் நிறுவப்பட்ட நிகழ்வில் ஒரு டிச்ட்ரோவின் தொகுப்புகளை நிறுவுதல், மேம்படுத்துதல் மற்றும்/அல்லது அகற்றுவதற்கான ஒரு கருவி, இது பைதான் தொகுப்புகள் மற்றும் பைதான் அல்லாத தொகுப்புகளை நிறுவும் திறன் கொண்டது, எனவே பொதுவாக நிறுவப்பட்ட மென்பொருளின் சொந்த தரவுத்தளத்தை பொதுவாகக் கொண்டுள்ளது : ref: `நிறுவப்பட்ட விநியோகங்களின் தரவுத்தளம் <பதிவு-நிறுவப்பட்ட-பேக்கேச்கள்>`. எடுத்துக்காட்டுகளில் `` apt``, `dpkg``,` `dnf``,` `rpm``,` `பேக்மேன்``, மற்றும்` `ப்ரூ`` ஆகியவை அடங்கும். முக்கிய நற்பொருத்தம் என்னவென்றால், ஒரு டிச்ட்ரோ தொகுப்பு மேலாளரால் ஒரு தொகுப்பு நிறுவப்பட்டிருந்தால், ஒரு பைதான்-குறிப்பிட்ட தொகுப்பு மேலாளரை திருப்திப்படுத்தும் வகையில் அதை அகற்றுவது அல்லது மேம்படுத்துவது பொதுவாக ஒரு டிச்ட்ரோ தொகுப்பு மேலாளரை சீரற்ற நிலையில் விட்டுவிடுவார்.

source: This document also uses phrases like "external package manager" or "system's package manager" to refer to a distro package manager in certain contexts.
eo: Ĉi tiu dokumento ankaŭ uzas terminojn kiel «eksteran pakadministrilon» aŭ «sistema pakadministrilon» signifante la pakadministrilon de la distribuo en kelkaj kuntekstoj.
ja: この説明文書は、また、ある種の文脈ではディストロのパッケージマネージャのことを指し示すのに "外部パッケージマネージャ <external package manager>" や "システムのパッケージマネージャ <system's package manager>" のような言い回しを用います。
ru: В этом документе также используются такие фразы, как "внешний менеджер пакетов" или "менеджер пакетов системы" для обозначения менеджера пакетов дистрибутива в определенных контекстах.
ta: இந்த ஆவணம் சில சூழல்களில் டிச்ட்ரோ தொகுப்பு மேலாளரைப் பார்க்க "வெளிப்புற தொகுப்பு மேலாளர்" அல்லது "கணினியின் தொகுப்பு மேலாளர்" போன்ற சொற்றொடர்களையும் பயன்படுத்துகிறது.

source: shadow
eo: ombri
ja: シャドー <shadow>
pt_br: sombra
ru: тень
ta: நிழல்

source: To shadow an installed Python package is to cause some other package to be preferred for imports without removing any files from the shadowed package. This requires multiple entries on ``sys.path``: if package A 2.0 installs module ``a.py`` in one ``sys.path`` entry, and package A 1.0 installs module ``a.py`` in a later ``sys.path`` entry, then ``import a`` returns the module from the former, and we say that A 2.0 shadows A 1.0.
ja: インストール済みの Python パッケージをシャドー <shadow> するというのは、シャドーされたパッケージに由来するファイルをひとつも削除することなしに、インポート時に別のパッケージを選好させることです。これは ``sys.path`` に複数のエントリーを要求します: パッケージ A 2.0 がある ``sys.path`` エントリに ``a.py`` モジュールをインストールし、かつ、パッケージ A 1.0 が ``a.py`` モジュールを後続の ``sys.path`` エントリにインストールしている時に、 ``import a`` が前者のモジュールを返し、これを A 2.0 が A 1.0 をシャドーしたと言います。
ru: Затенение установленного пакета Python заключается в том, чтобы заставить другой пакет быть предпочтительным для импорта без удаления каких-либо файлов из затененного пакета. Для этого требуется несколько записей в ``sys.path``: если пакет A 2.0 устанавливает модуль ``a.py`` в одной записи ``sys.path``, а пакет A 1.0 устанавливает модуль ``a.py`` в более поздней записи ``sys.path``, то ``import a`` возвращает модуль из первого, и мы говорим, что A 2.0 затеняет A 1.0.
ta: நிறுவப்பட்ட பைதான் தொகுப்பை நிழலாடுவது, நிழல் தொகுப்பிலிருந்து எந்த கோப்புகளையும் அகற்றாமல் இறக்குமதிக்கு வேறு சில தொகுப்புகளை விரும்புகிறது. இதற்கு `` sys.bath`` இல் பல உள்ளீடுகள் தேவைப்படுகின்றன: தொகுப்பு A 2.0 ஒரு `` sys.bath`` நுழைவாயிலில் `` a.py`` தொகுப்பை நிறுவுகிறது, மேலும் 1.0 ஐ நிறுவுகிறது தொகுதி `a.py```` a.py`` பின்னர் `` sys.bath`` நுழைவாயிலில், `` இறக்குமதி a`` முந்தையவற்றிலிருந்து தொகுதியைத் தருகிறது, மேலும் 2.0 நிழல்கள் 1.0 என்று நாங்கள் கூறுகிறோம்.

source: This specification is twofold.
eo: Jen duobla specifo.
ja: この仕様には二つの部分があります。
ru: Эта спецификация имеет двоякое значение.
ta: இந்த விவரக்குறிப்பு இரு மடங்கு.

source: First, it describes **a way for distributors of a Python interpreter to mark that interpreter as having its packages managed by means external to Python**, such that Python-specific tools like pip should not change the installed packages in the interpreter's global ``sys.path`` in any way (add, upgrade/downgrade, or remove) unless specifically overridden. It also provides a means for the distributor to indicate how to use a virtual environment as an alternative.
ja: 第一に、 ** Python インタープリタの配布を行う者が、そのインタープリタをPython の外側にある手段によって管理されるパッケージを持ち** 、従って、 pip のような Python 特有のツール類が、特別にオーバーライドされない限りは、当該インタープリタのグローバルな ``sys.path`` に存在するインストール済みパッケージを、いかなる意味でも変更 (追加、更新・ダウングレード、あるいは削除) するべきではないという印を付ける方法を記述しています。また、代替手段としての仮想環境をどのように使うのかを配布者 <distributor> が指示する手段を提供します。
ru: Во-первых, он описывает **способ для дистрибьюторов интерпретатора Python пометить этот интерпретатор как имеющий пакеты, управляемые средствами, внешними по отношению к Python**, так что специфичные для Python инструменты вроде pip не должны изменять установленные пакеты в глобальном ``sys.path` интерпретатора любым способом (добавлять, обновлять/понижать или удалять), если это специально не запрещено. Он также предоставляет дистрибьютору возможность указать, как использовать виртуальное окружение в качестве альтернативы.
ta: முதலாவதாக, ஒரு பைதான் மொழிபெயர்ப்பாளரின் விநியோகச்தர்களுக்கு அந்த மொழிபெயர்ப்பாளருக்கு அதன் தொகுப்புகள் பைதானுக்கு வெளிப்புற வழிமுறைகளை நிர்வகிப்பதாகக் குறிக்க ஒரு வழி இது விவரிக்கிறது ** `sys.bath`` எந்த வகையிலும் (குறிப்பாக மீறப்படாவிட்டால் சேர்க்கவும், மேம்படுத்தவும்/தரமிறக்கவும் அல்லது அகற்றவும்). மெய்நிகர் சூழலை மாற்றாக எவ்வாறு பயன்படுத்துவது என்பதைக் குறிக்க விநியோகச்தருக்கு இது ஒரு வழிமுறையை வழங்குகிறது.

source: This is an opt-in mechanism: by default, the Python interpreter compiled from upstream sources will not be so marked, and so running ``pip install`` with a self-compiled interpreter, or with a distro that has not explicitly marked its interpreter, will work as it always has worked.
ja: これは、オプトインのメカニズムです: デフォルトでは、アップストリームのソースからコンパイルされた Python インタープリタは、そのようにマークを付けられることはなく、また、セルフコンパイルされたインタープリタやディストロのものを使って ``pip install`` を実行すると、それまでと同様に動作するはずです。
ru: Это механизм выбора: по умолчанию интерпретатор Python, скомпилированный из исходных текстов, не будет помечен таким образом, и поэтому запуск ``pip install`` с самокомпилирующимся интерпретатором или с дистрибутивом, который явно не пометил свой интерпретатор, будет работать так, как он всегда работал.
ta: இது ஒரு விருப்பமான பொறிமுறையாகும்: இயல்பாக, மேலோடை மூலங்களிலிருந்து தொகுக்கப்பட்ட பைதான் மொழிபெயர்ப்பாளர் அவ்வளவு குறிக்கப்பட மாட்டார், எனவே `` பிஐபி நிறுவுதல்`` ஒரு தன்வய ஒருங்கிணைந்த மொழிபெயர்ப்பாளருடன் அல்லது அதன் வெளிப்படையாகக் குறிக்கப்படாத ஒரு டிச்ட்ரோவுடன் இயங்குகிறது மொழிபெயர்ப்பாளர், அது எப்போதும் வேலை செய்ததால் வேலை செய்யும்.

source: Second, it sets the rule that when installing packages to an interpreter's global context (either to an unmarked interpreter, or if overriding the marking), **Python-specific package managers should modify or delete files only within the directories of the sysconfig scheme in which they would create files**. This permits a distributor of a Python interpreter to set up two directories, one for its own managed packages, and one for unmanaged packages installed by the end user, and ensure that installing unmanaged packages will not delete (or overwrite) files owned by the external package manager.
eo: Due, ĝi reguligas, ke dum instalado de pako al la malloka kunteksto de interpretilo (aŭ al nemarkita interpretilo, aŭ se oni superregas la markadon), **Python -specifa pakadministrilo modifu aŭ forviŝu dosierojn nur en la dosierujoj de la sysconfig-skemo, en kiu ĝi kreus la dosierojn**. Tio permesas al distribuanto de Python-interpretilo starigi du dosierujojn – unu por siaj propre mastrumataj pakoj, la alia por nemastrumataj pakoj instalitaj de la uzanto –, certigante, ke instalado de nemastrumata pako ne forviŝos (nek superskribos) dosierojn mastrumatajn de la ekstera pakadministrilo.
ja: 第二に、パッケージをインタープリタのグローバルコンテキスト (マークされていないインタープリタの場合やマークをオーバーライドした場合) にインストールする際に、 ** Python 特有のパッケージマネージャが修正・削除しても構わないのは、今まさにファイル群を作成しようとしている sysconfig スキームのディレクトリ内にあるものだけである ** というルールを設定します。これによって、 Python インタープリタの配布者 <distributor> がふたつのディレクトリをセットアップすることを許し、つまり、一つは自分で管理しているパッケージ群 (のためのディレクトリ) でもう一つはエンドユーザがインストールした管理対象外のパッケージ群 (のためのディレクトリ) で、管理対象外のパッケージをインストールしたとしても外部パッケージマネージャ <external package manager> が管理しているファイル群が削除 (または上書き) されることがないことを保証します。
ru: Во-вторых, оно устанавливает правило, что при установке пакетов в глобальный контекст интерпретатора (либо в немаркированный интерпретатор, либо при переопределении маркировки), **специфичные для Python менеджеры пакетов должны изменять или удалять файлы только в тех каталогах схемы sysconfig, в которых они создавали бы файлы**. Это позволяет распространителю интерпретатора Python создать два каталога, один для собственных управляемых пакетов, другой для неуправляемых пакетов, устанавливаемых конечным пользователем, и гарантировать, что установка неуправляемых пакетов не будет удалять (или перезаписывать) файлы, принадлежащие внешнему менеджеру пакетов.
ta: இரண்டாவதாக, ஒரு மொழிபெயர்ப்பாளரின் உலகளாவிய சூழலுக்கு (குறிக்கப்படாத மொழிபெயர்ப்பாளருக்கு, அல்லது குறிப்பைக் கடந்து சென்றால்) தொகுப்புகளை நிறுவும் போது, ** பைதான்-குறிப்பிட்ட தொகுப்பு மேலாளர்கள் சிச்கான்ஃபிக் திட்டத்தின் கோப்பகங்களுக்குள் மட்டுமே கோப்புகளை மாற்றியமைக்க வேண்டும் அல்லது நீக்க வேண்டும் என்ற விதியை இது அமைக்கிறது அவை கோப்புகளை உருவாக்கும் **. இது ஒரு பைதான் மொழிபெயர்ப்பாளரின் விநியோகச்தரை இரண்டு கோப்பகங்களை அமைக்க அனுமதிக்கிறது, ஒன்று அதன் சொந்த நிர்வகிக்கப்பட்ட தொகுப்புகளுக்கு ஒன்று, மற்றும் இறுதி பயனரால் நிறுவப்பட்ட நிர்வகிக்கப்படாத தொகுப்புகளுக்கு ஒன்று, மற்றும் நிர்வகிக்கப்படாத தொகுப்புகளை நிறுவுவது வெளிப்புறத்திற்கு சொந்தமான கோப்புகளை நீக்காது (அல்லது மேலெழுதும்) தொகுப்பு மேலாளர்.

source: Marking an interpreter as using an external package manager
eo: Marki interpretilon kiel uzantan eksteran pakadministrilon
ja: 外部パッケージマネージャ <external package manager> を用いるものとしてインタープリタにマークを付ける
ru: Пометка интерпретатора как использующего внешний менеджер пакетов
ta: வெளிப்புற தொகுப்பு மேலாளரைப் பயன்படுத்துவதில் ஒரு மொழிபெயர்ப்பாளரைக் குறிக்கும்

source: Before a Python-specific package installer (that is, a tool such as pip - not an external tool such as apt) installs a package into a certain Python context, it should make the following checks by default:
eo: Antaŭ ol Python-specifa instalilo (kiel pip – ne ekstera ilo kiel apt) instalas pakon en Python-kuntekston, ĝi implicite kontrolu la jenon:
ja: Python 特有のパッケージインストーラ (つまり pip のようなツール - apt のような外部ツールではない) がある Python コンテキストにパッケージをインストールする前に、デフォルトで以下の項目を確認するべきです:
ru: Прежде чем программа установки пакетов, специфичная для Python (то есть инструмент, такой как pip, а не внешний инструмент, такой как apt), установит пакет в определенный контекст Python, она должна по умолчанию выполнить следующие проверки:
ta: ஒரு பைதான் -குறிப்பிட்ட தொகுப்பு நிறுவி (அதாவது, பிஐபி போன்ற ஒரு கருவி - APT போன்ற வெளிப்புற கருவி அல்ல) ஒரு தொகுப்பை ஒரு குறிப்பிட்ட பைதான் சூழலில் நிறுவுவதற்கு முன், இது இயல்புநிலையாக பின்வரும் சோதனைகளை உருவாக்க வேண்டும்:

source: Is it running outside of a virtual environment? It can determine this by whether ``sys.prefix == sys.base_prefix``.
eo: Ĉu ĝi ruliĝas ekster virtuala medio? Ĝi povas determini tion per ``sys.prefix == sys.base_prefix``.
ja: 仮想環境の外側で動作しているのか？ ``sys.prefix == sys.base_prefix`` が成立するか否かで判断することができます。
ru: Работает ли он вне виртуальной среды? Это можно определить по тому, что ``sys.prefix == sys.base_prefix``.
ta: இது ஒரு மெய்நிகர் சூழலுக்கு வெளியே இயங்குகிறதா? `` Sys.prefix == sys.base_prefix`` என்பதன் மூலம் இதை தீர்மானிக்க முடியும்.

source: Is there an ``EXTERNALLY-MANAGED`` file in the directory identified by ``sysconfig.get_path("stdlib", sysconfig.get_default_scheme())``?
eo: Ĉu ekzistas dosiero ``EXTERNALLY-MANAGED`` en la dosierujo identigita de ``sysconfig.get_path("stdlib", sysconfig.get_default_scheme())``?
ja: ``sysconfig.get_path("stdlib", sysconfig.get_default_scheme())`` で同定されるディレクトリの中に ``EXTERNALLY-MANAGED`` ファイルが存在するか否か？
ru: Есть ли файл ``EXTERNALLY-MANAGED`` в каталоге, определяемом ``sysconfig.get_path("stdlib", sysconfig.get_default_scheme())``?
ta: `` Sysconfig.get_path ("stdlib", sysconfig.get_default_scheme ()) `` `` `` ஆல் அடையாளம் காணப்பட்ட கோப்பகத்தில் `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` கோப்பு உள்ளதா?

source: If both of these conditions are true, the installer should exit with an error message indicating that package installation into this Python interpreter's directory are disabled outside of a virtual environment.
eo: Se ambaŭ kondiĉoj veras, la instalilo ĉesu, sciigante pri la eraro, ke instalado de pako en la dosierujon de ĉi tiu Python-interpretilo ne eblas ekster virtuala medio.
ja: 両方の条件が真であれば、仮想環境の外側ではこの Python インタープリタのディレクトリへパッケージをインストールすることが無効にされていることを示すエラーメッセージとともに、インストーラは終了するべきです。
ru: Если оба эти условия верны, программа установки должна выйти с сообщением об ошибке, указывающим на то, что установка пакетов в каталог этого интерпретатора Python вне виртуальной среды запрещена.
ta: இந்த இரண்டு நிபந்தனைகளும் உண்மையாக இருந்தால், இந்த பைதான் மொழிபெயர்ப்பாளரின் கோப்பகத்தில் தொகுப்பு நிறுவல் ஒரு மெய்நிகர் சூழலுக்கு வெளியே முடக்கப்பட்டிருப்பதைக் குறிக்கும் பிழை செய்தியுடன் நிறுவி வெளியேற வேண்டும்.

source: The installer should have a way for the user to override these rules, such as a command-line flag ``--break-system-packages``. This option should not be enabled by default and should carry some connotation that its use is risky.
eo: La instalilo provizu meĥanismon por superregi tiajn regulojn, ekzemple per flago ``--break-system-packages``. Tia opcio ne estu apriora kaj indiku, ke ĝia uzo estas danĝera.
ja: インストーラは、コマンドライン上の ``--break-system-packages`` フラグのように、ユーザがこれらのルールをオーバーライドする方法を持っているべきです。このオプションはデフォルトでは無効であるべきで、有効にするとリスクを伴うことを含意する何らかのメッセージを伴うべきです。
ru: Программа установки должна иметь возможность отменить эти правила, например, флаг командной строки ``--break-system-packages``. Эта опция не должна быть включена по умолчанию и должна нести в себе некоторый подтекст, что ее использование рискованно.
ta: கட்டளை-வரி கொடி ``-பிரேக்-சிச்டம்-பேக்கேச்கள்`` போன்ற இந்த விதிகளை பயனருக்கு மேலெழுத நிறுவி ஒரு வழியைக் கொண்டிருக்க வேண்டும். இந்த விருப்பம் இயல்புநிலையாக இயக்கப்படக்கூடாது, அதன் பயன்பாடு ஆபத்தானது என்ற சில அர்த்தங்களைக் கொண்டிருக்க வேண்டும்.
