Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Examples of build frontends are :ref:`pip` and :ref:`build`.
eo: Ekzemploj de konstruaj fasadoj estas :ref:`pip` kaj :ref:`build`.
ja: ビルドフロントエンドの例としては、 :ref:`pip` や :ref:`build` があります。
pt_br: Exemplos de frontends de construção são :ref:`pip` e :ref:`build`.
ru: Примерами фронтендов сборки являются :ref:`pip` и :ref:`build`.
ta: கட்டிய முன்பக்கங்களின் எடுத்துக்காட்டுகள்: ref: `pip` மற்றும்: ref:` build`.

source: Built Distribution
eo: Konstruita Distribuo
ja: ビルド済配布物
pt_br: Distribuição Construída
ru: Построенное распределение
ta: கட்டப்பட்ட வழங்கல்

source: A :term:`Distribution <Distribution Package>` format containing files and metadata that only need to be moved to the correct location on the target system, to be installed. :term:`Wheel` is such a format, whereas :term:`Source Distribution <Source Distribution (or "sdist")>` is not, in that it requires a build step before it can be installed. This format does not imply that Python files have to be precompiled (:term:`Wheel` intentionally does not include compiled Python files). See :ref:`package-formats` for more information.
eo: :term:`Distribua <Distribution Package>` formo enhavanta dosierojn kaj metadatenojn, kiujn oni povas simple movi al la ĝustaj lokoj en la cela sistemo por instalado. :term:`Wheel` estas unu ekzemplo, dum :term:`Fonta Distribuo <Source Distribution (or "sdist")>` ne estas ekzemplo, ĉar ĝi postulas tradukadon antaŭ instalado. Tio ne signifas, ke Python-dosiero devas esti antaŭtradukita (:term:`Wheel` intence ne inkluzivas tradukitajn Python-dosierojn). Vidu :ref:`package-formats` por pliaj informoj.
ja: :term:`配布物 <Distribution Package>` フォーマットは、インストールするためにターゲットとなるシステムの適切な位置に移動させることに必要となるファイルやメタデータだけを含んでいます。 :term:`Wheel` はそのようなフォーマットですが、インストールできるようになる前にビルド段階が必須となると言う点で :term:`ソースコード配布物 <Source Distribution (または "sdist")>` はそうではありません。このフォーマットであることは、 Python のファイル群があらかじめコンパイルされた状態でなければならないということを意味しません (:term:`Wheel` では意図的にコンパイル済みの Python ファイル群を含まないようになっています)。より詳しくは :ref:`package-formats` を見てください。
pt_br: Um formato de :term:`Distribuição <Distribution Package>` contendo arquivos e metadados que só precisam ser movidos para o local correto no sistema de destino, para serem instalados. :term:`Wheel` é esse formato, enquanto o :term:`Distribuição Fonte <Source Distribution (or "sdist")>` não é, pois requer uma etapa de construção antes de poder ser instalado. Este formato não implica que os arquivos Python tenham que ser pré-compilados (:term:`Wheel` intencionalmente não inclui arquivos Python compilados). Veja :ref:`package-formats` para mais informações.
ru: Формат : термин:`Дистрибутив <Дистрибутивный пакет>`, содержащий файлы и метаданные, которые нужно только переместить в нужное место на целевой системе, чтобы установить. :термин:`Wheel` является таким форматом, тогда как :термин:`Источник дистрибутива <Источник дистрибутива (или "sdist")>` не является, поскольку требует этапа сборки перед установкой. Этот формат не подразумевает, что файлы Python должны быть предварительно скомпилированы (:term:`Wheel` намеренно не включает скомпилированные файлы Python). Дополнительную информацию смотрите в : ссылка:`форматы пакетов`.
ta: ப: கால: `விநியோக <விநியோக தொகுப்பு>` கோப்புகள் மற்றும் மெட்டாடேட்டாவைக் கொண்ட வடிவம், இலக்கு கணினியில் சரியான இடத்திற்கு மட்டுமே நகர்த்தப்பட வேண்டும், நிறுவப்பட வேண்டும். . இந்த வடிவம் பைதான் கோப்புகளை முன்கூட்டியே எண்ண வேண்டும் என்பதை குறிக்கவில்லை (: கால: `சக்கரம்` வேண்டுமென்றே தொகுக்கப்பட்ட பைதான் கோப்புகளை சேர்க்கவில்லை). காண்க: குறிப்பு: மேலும் தகவலுக்கு `தொகுப்பு வடிவங்கள்.

source: Built Metadata
eo: Konstruitaj Metadatenoj
ja: ビルドされたメタデータ
ru: Встроенные метаданные
ta: மேனிலை தரவு கட்டப்பட்டது

source: The concrete form :term:`Core Metadata` takes when included inside an installed :term:`Project` (``METADATA`` file) or a :term:`Distribution Archive` (``PKG-INFO`` in a :term:`Sdist <Source Distribution (or "sdist")>` and ``METADATA`` in a :term:`Wheel`).
eo: La konkreta formo de :term:`Kerna Metadateno <Core Metadata>` en instalita :term:`Projekto <Project>` (la dosiero ``METADATA``) aŭ :term:`Distribua Arĥivo <Distribution Archive>` (``PKG-INFO`` en :term:`fonta distribuo <Source Distribution (or "sdist")>`, ``METADATA`` en :term:`Wheel`).
ja: インストールされた :term:`プロジェクト <Project>` (``METADATA`` ファイル) や :term:`配布物アーカイブ <Distribution Archive>` (:term:`Sdist <Source Distribution (または "sdist")>` の中の ``PKG-INFO`` や :term:`Wheel` 内の ``METADATA``) の内部に含まれる場合に :term:`コアとなるメタデータ <Core Metadata>` が具体的な形式を取ることになります。
ru: Конкретная форма, которую принимает : термин:`Основные метаданные` при включении в установленный :термин:`Проект` (файл ``METADATA``) или архив :термин:`Дистрибутив` (``PKG-INFO`` в :термин:`Sdist <Источник дистрибутива (или "sdist")>` и ``METADATA`` в :термин:`Колесо``).
ta: கான்கிரீட் படிவம்: கால: `கோர் மெட்டாடேட்டா` ஒரு நிறுவப்பட்ட: கால:` திட்டம்` (`` மெட்டாடேட்டா`` கோப்பு) அல்லது ஒரு: கால: கால: `விநியோக காப்பகம்` (` `பி.கே.சி-இன்ஃபோ`` ஒரு: கால: `Sdist <மூல வழங்கல் (அல்லது" Sdist ")>` மற்றும் `` மெட்டாடேட்டா`` ஒரு: கால: `சக்கரம்`).

source: Core Metadata
eo: Kernaj Metadatenoj
ja: コアとなるメタデータ
ru: Основные метаданные
ta: கோர் மேனிலை தரவு

source: The :ref:`specification <core-metadata>` and the set of :term:`Core Metadata Field`\s it defines that describe key static attributes of a :term:`Distribution Package` or :term:`Installed Project`.
eo: La :ref:`specifo <core-metadata>` kaj la aro de :term:`Kernaj Metadatenaj Kampoj <Core Metadata Field>` difinitaj de ĝi, pri la ĉefaj statikaj atributoj de :term:`Distribua Pako <Distribution Package>` aŭ :term:`Instalita Projekto <Installed Project>`.
ja: :ref:`仕様 <core-metadata>` および :term:`コアとなるメタデータのフィールド <Core Metadata Field`\s において、 :term:`配布パッケージ <Distribution Package>` あるいは :term:`インストール済みのプロジェクト <Installed Project>` の鍵となる静的なアトリビュートを記述するものを定義しています。
ru: `Спецификация <основные метаданные>` и набор определяемых ею полей : термин:`Основные поля метаданных`\, которые описывают ключевые статические атрибуты :термин:`Дистрибутивный пакет` или :термин:`Установленный проект`.
ta: தி: ரெஃப்: `விவரக்குறிப்பு <கோர்-மெட்டாடேட்டா>` மற்றும் தொகுப்பு: கால: `கோர் மேனிலை தரவு புலம்` \ எச் இது ஒரு: காலத்தின் முக்கிய நிலையான பண்புகளை விவரிக்கும் வரையறுக்கிறது:` விநியோக தொகுப்பு` அல்லது: கால: `நிறுவப்பட்ட திட்டம்` .

source: Core Metadata Field
eo: Kerna Metadatena Kampo
ja: コアとなるメタデータのフィールド
ru: Поле основных метаданных
ta: கோர் மேனிலை தரவு புலம்

source: A single key-value pair (or sequence of such with the same name, for multiple-use fields) defined in the :term:`Core Metadata` spec and stored in the :term:`Built Metadata`. Notably, distinct from a :term:`Pyproject Metadata Key`.
eo: Unu ŝlosilo-valoro-paro (aŭ sinsekvo de tiaĵoj de la sama nomo, por plurfoje uzebla kampo) difinita en la specifo :term:`Kernaj Metadatenoj <Core Metadata>`kaj konservita en la :term:`Konstruitaj Metadatenoj <Built Metadata>`. Notinde, diferencas de :term:`Pyproject-Metadatena Ŝlosilo <Pyproject Metadata Key>`.
ja: :term:`コアとなるメタデータ <Core Metadata>` の仕様の中で定義され、 :term:`ビルド済みのメタデータ <Built Metadata>` の中に保存される、単一のキー・バリューペア (または、複数の使用方法のあるフィールドについては、一連の同名のキー・バリューペア)。特筆すべきことに、 :term:`Pyproject メタデータキー <Pyproject Metadata Key>` とは区別される。
ru: Одиночная пара ключ-значение (или последовательность таких пар с одинаковым именем, для многоразовых полей), определенная в спецификации : термин:`Основные метаданные` и хранящаяся в :термин:`Строенные метаданные`. Отличается от : термин:`Ключ метаданных пайпроекта`.
ta: ஒற்றை விசை-மதிப்பு இணை (அல்லது ஒரே பெயருடன், பல பயன்பாட்டு புலங்களுக்கு) வரையறுக்கப்பட்டுள்ளது: கால: `கோர் மெட்டாடேட்டா` ச்பெக் மற்றும் இல் சேமிக்கப்படுகிறது: கால:` கட்டப்பட்ட மெட்டாடேட்டா`. குறிப்பிடத்தக்க வகையில், A இலிருந்து வேறுபட்டது: கால: `பைபிரெக்ட் மேனிலை தரவு கீ`.

source: Distribution Archive
eo: Distribua Arĥivo
ja: 配布物アーカイブ
ru: Архив дистрибутивов
ta: விநியோக காப்பகம்

source: The physical distribution artifact (i.e. a file on disk) for a :term:`Distribution Package`.
eo: La fizika distribua artefakto (ekz. dosiero sur disko) por :term:`Distribua Pako <Distribution Package>`.
ja: :term:`配布パッケージ <Distribution Package>` のための物理的な配布物のアーティファクト (即ち、ディスク上のファイル)。
ru: Физический артефакт распространения (т.е. файл на диске) для : термин:`Дистрибутивный пакет`.
ta: ஒரு: கால: `விநியோக தொகுப்பு` க்கான இயற்பியல் விநியோக கலைப்பொருள் (அதாவது வட்டில் ஒரு கோப்பு).

source: Distribution Package
eo: Distribua Pako
ja: 配布パッケージ
pt_br: Pacote de Distribuição
ru: Пакет дистрибутива
ta: விநியோக தொகுப்பு

source: A versioned archive file that contains Python :term:`packages <Import Package>`, :term:`modules <Module>`, and other resource files that are used to distribute a :term:`Release`. The archive file is what an end-user will download from the internet and install.
eo: Versiohava arĥiva dosiero enhavanta Python-ajn :term:`pakojn <Import Package>`, :term:`modulojn <Module>`, kaj aliajn resursajn dosierojn por distribui :term:`Eldonon <Release>`. La uzanto elŝutas kaj instalas la arĥivan dosieron el Interreto.
ja: :term:`モジュール <Module>`すなわちPythonの :term:`パッケージ <Import Package>`や、ある :term:`Release`を配布するために使われるその他のリソースファイルを内部に含むバージョン付きアーカイブファイル。アーカイブファイルはエンドユーザがインターネットからダウンロードしてインストールするものです。
pt_br: Um arquivo com versão que contém :term:`pacotes <Import Package>` Python, :term:`módulos <Module>`, e outros arquivos de recursos que são usados para distribuir um :term:`Release` (lançamento). O arquivo é o que um usuário final irá baixar da Internet e instalar.
ru: Версионный архивный файл, содержащий Python :term:`пакеты <Import Package>`, :term:`модули <Module>` и другие файлы ресурсов, которые используются для распространения :term:`Release`. Архивный файл - это то, что конечный пользователь скачает из интернета и установит.
ta: பைதான்: கால: `தொகுப்புகள் <இறக்குமதி தொகுப்பு>`,: கால: `தொகுதிகள் <தொகுதி>`, மற்றும் பிற ஆதாரக் கோப்புகள் ஆகியவற்றைக் கொண்ட பதிப்புக் காப்பக கோப்பு, ஒரு: கால: `வெளியீடு` விநியோகிக்கப் பயன்படும் பிற வள கோப்புகள். காப்பகக் கோப்பு என்பது ஒரு இறுதி பயனர் இணையத்திலிருந்து பதிவிறக்கம் செய்து நிறுவும்.

source: A distribution package is more commonly referred to with the single words "package" or "distribution", but this guide may use the expanded term when more clarity is needed to prevent confusion with an :term:`Import Package` (which is also commonly called a "package") or another kind of distribution (e.g. a Linux distribution or the Python language distribution), which are often referred to with the single term "distribution". See :ref:`distribution-package-vs-import-package` for a breakdown of the differences.
eo: Distribua pako estas ofte simple nomata «pako» aŭ «distribuo», sed ĉi tiu gvidilo uzas la plenan terminon tiam, kiam klareco necesas por eviti konfuzon kun :term:`Importa Pako <Import Package>` (kiu estas ankaŭ ofte nomata «pako») aŭ alia speco de distribuo (ekz. Linux-distribuo aŭ distribuo de la programlingvo Python), kiuj ofte estas simple nomataj «distribuo». Vidu :ref:`distribution-package-vs-import-package` por detaloj pri la diferencoj.
ja: 配布パッケージは単語ひとつで「パッケージ」や「配布物」と呼ばれることもしばしばですが、本ガイドでは、 :term:`インポートパッケージ <Import Package>`(これも通常は単に「パッケージ」と呼ばれます)や他の種類の配布物(例えばLinuxディストリビューションやPython言語の配布物)でよく単語ひとつの「配布物」と呼ばれるものとの混同を避けるために明確に述べる必要がある場合には、長い方の用語を用いることがあります。
pt_br: Um pacote de distribuição é mais comumente referido com as palavras "pacote" ou "distribuição", mas este guia pode usar o termo expandido quando mais clareza for necessária para evitar confusão com um :term:`Pacote de Importação` (que também é comumente chamado de "pacote") ou outro tipo de distribuição (por exemplo, uma distribuição Linux ou a distribuição da linguagem Python), que são frequentemente referidos com o único termo "distribuição". Veja :ref:`distribution-package-vs-import-package` para uma explicação das diferenças.
ru: Дистрибутив чаще всего обозначается одним словом "пакет" или "дистрибутив", но в данном руководстве может использоваться расширенный термин, когда требуется большая ясность, чтобы избежать путаницы с :term:`Import Package` (который также обычно называется "пакет") или другим видом дистрибутива (например, дистрибутив Linux или дистрибутив языка Python), которые часто обозначаются одним термином "дистрибутив". Разбор различий см. в :ref:`distribution-package-vs-import-package`.
ta: ஒரு விநியோக தொகுப்பு பொதுவாக "தொகுப்பு" அல்லது "வழங்கல்" என்ற ஒற்றை சொற்களுடன் குறிப்பிடப்படுகிறது, ஆனால் குழப்பத்தைத் தடுக்க கூடுதல் தெளிவு தேவைப்படும்போது இந்த வழிகாட்டி விரிவாக்கப்பட்ட காலத்தைப் பயன்படுத்தலாம்: `இறக்குமதி தொகுப்பு` (இது பொதுவாகவும் பொதுவாகவும் "தொகுப்பு" என்று அழைக்கப்படுகிறது) அல்லது மற்றொரு வகையான வழங்கல் (எ.கா. ஒரு லினக்ச் வழங்கல் அல்லது பைதான் மொழி விநியோகம்), அவை பெரும்பாலும் "வழங்கல்" என்ற ஒற்றை வார்த்தையுடன் குறிப்பிடப்படுகின்றன. காண்க: குறிப்பு: வேறுபாடுகளின் முறிவுக்கு `விநியோக-பேக்கேச்-விஎச்-பிரசங்க-பேக்கேச்`.

source: Egg
ja: 卵
ru: Яйцо
ta: முட்டை

source: A :term:`Built Distribution` format introduced by :ref:`setuptools`, which has been replaced by :term:`Wheel`. For details, see :ref:`egg-format`.
eo: Formo de :term:`Konstruita Distribuo <Built Distribution>` enkondukita de :ref:`setuptools`, nun anstataŭita de :term:`Wheel`. Por detaloj, vidu :ref:`egg-format`.
ja: :term:`Wheel` によって既に置き換えられていますが、 :term:`ビルド済配布物 <Built Distribution>` フォーマットは、 :ref:`setuptools` によって導入されました。詳細については、 :ref:`egg フォーマット <egg-format>` を見てください。
pt_br: Um formato de :term:`Distribuição Construída` introduzido pelo :ref:`setuptools`, que foi substituído pelo :term:`Wheel`. Para detalhes, veja :ref:`egg-format`.
ru: Формат :term:`Built Distribution`, введенный :ref:`setuptools`, который был заменен :term:`Wheel`. Подробности см. в :ref:`egg-format`.
ta: ப: கால: `கட்டப்பட்ட விநியோகம்` வடிவம் அறிமுகப்படுத்தியவர்: குறிப்பு:` செட்டப்டூல்ச்`, இது மாற்றப்பட்டது: கால: `சக்கரம்`. விவரங்களுக்கு, காண்க: ref: `முட்டை வடிவம்`.

source: Extension Module
eo: Etenda Modulo
ja: 拡張モジュール
pt_br: Módulo de Extensão
ru: Модуль расширения
ta: நீட்டிப்பு தொகுதி

source: A :term:`Module` written in the low-level language of the Python implementation: C/C++ for Python, Java for Jython. Typically contained in a single dynamically loadable pre-compiled file, e.g. a shared object (.so) file for Python extensions on Unix, a DLL (given the .pyd extension) for Python extensions on Windows, or a Java class file for Jython extensions.
eo: :term:`Modulo <Module>` verkita en la malaltnivela lingvo de la Python-realigo: C/C++ por Python, Java por Jython. Ofte en unu dinamike ŝargebla antaŭtradukita dosiero, ekz. komunobjekta (``.so``) dosiero por Python-etendaĵo sur Unikso, dinamike ŝargebla biblioteko (DLL, kun la dosiersufikso ``.pyd``) por Python-etendaĵo sur Windows, aŭ Java-klasdosiero por Jython-etendaĵo.
ja: :term:`モジュール <Module>`とは、Pythonの実装のうちの低レベル言語で書かれた部分で、C/C++で書かれたCythonやJavaで書かれたJythonが該当する。典型的には動的にロードできるコンパイル済みのファイルをひとつ含んでいて、Unix上では共有オブジェクトファイル(.so)、Windows上ではDLL(拡張子.pydを与えられる)のPython拡張、Jython拡張ではJavaのクラスファイルの形を取る。
pt_br: Um :term:`Módulo` escrito na linguagem de baixo nível da implementação Python: C/C++ para Python, Java para Jython. Normalmente contido em um único arquivo pré-compilado carregável dinamicamente, por exemplo, um arquivo de objeto compartilhado (.so) para extensões Python no Unix, uma DLL (dada a extensão .pyd) para extensões Python no Windows ou um arquivo de classe Java para extensões Jython.
ru: Термин:`Модуль`, написанный на языке низкого уровня реализации Python: C/C++ для Python, Java для Jython. Обычно содержится в одном динамически загружаемом предварительно скомпилированном файле, например, в файле общих объектов (.so) для расширений Python на Unix, DLL (с расширением .pyd) для расширений Python на Windows, или в файле классов Java для расширений Jython.
ta: ப: கால: `தொகுதி` பைதான் அமலாக்கத்தின் குறைந்த அளவிலான மொழியில் எழுதப்பட்டது: பைத்தானுக்கு சி/சி ++, சிதானுக்கு சாவா. பொதுவாக ஒற்றை மாறும் ஏற்றக்கூடிய முன்-தொகுக்கப்பட்ட கோப்பில் உள்ளது, எ.கா. யுனிக்ச் இல் பைதான் நீட்டிப்புகளுக்கான பகிரப்பட்ட பொருள் (.SO) கோப்பு, சாளரங்களில் பைத்தான் நீட்டிப்புகளுக்கான டி.எல்.எல் (.பிடி நீட்டிப்பு கொடுக்கப்பட்டுள்ளது) அல்லது சைத்தான் நீட்டிப்புகளுக்கான சாவா வகுப்பு கோப்பு.

source: Import Package
eo: Importa Pako
ja: インポートパッケージ
pt_br: Pacote de Importação
ru: Import Package (Импортируемый пакет)
ta: இறக்குமதி தொகுப்பு

source: A Python module which can contain other modules or recursively, other packages.
eo: Python-modulo, kiu povas enhavi aliajn modulojn aŭ, rikure, aliajn pakojn.
ja: 直接に、あるいは何段階になっても良いが、他のパッケージを組み込んで使うようなPythonモジュール。
pt_br: Um módulo Python que pode conter outros módulos ou recursivamente, outros pacotes.
ru: Модуль Python, который может содержать другие модули или, рекурсивно, другие пакеты.
ta: ஒரு பைதான் தொகுதி மற்ற தொகுதிகள் அல்லது மீண்டும் மீண்டும், பிற தொகுப்புகளைக் கொண்டிருக்கலாம்.

source: An import package is more commonly referred to with the single word "package", but this guide will use the expanded term when more clarity is needed to prevent confusion with a :term:`Distribution Package` which is also commonly called a "package". See :ref:`distribution-package-vs-import-package` for a breakdown of the differences.
eo: Oni ofte simple nomas importan pakon «pako», sed ĉi tiu gvidisto uzos la pli longan terminon, kiam oni devas distingi ĝin de :term:`Distribua Pako <Distribution Package>`, kiu ankaŭ ofte nomiĝas «pako». Vidu :ref:`distribution-package-vs-import-package` por resumo de la diferencoj.
ja: インポートパッケージは、より普通には「パッケージ」という１単語の用語で呼ばれますが、本ガイドでは、同様に単に「パッケージ」と呼ばれることが普通である :term:`配布物パッケージ <Distribution Package>`との混同を避けるために必要な場合には、長い方の用語を用いることにします。
pt_br: Um pacote de importação é mais comumente referido com a palavra "pacote", mas este guia usará o termo expandido quando mais clareza for necessária para evitar confusão com um :term:`Pacote de Distribuição` que também é comumente chamado de "pacote" . Veja :ref:`distribution-package-vs-import-package` para uma explicação das diferenças.
ru: Импортный пакет чаще всего обозначается одним словом "пакет", но в этом руководстве будет использоваться расширенный термин, когда требуется большая ясность, чтобы избежать путаницы с :term:`Distribution Package`, который также обычно называется "пакет". Различия см. в :ref:`distribution-package-vs-import-package`.
ta: ஒரு இறக்குமதி தொகுப்பு பொதுவாக "தொகுப்பு" என்ற ஒற்றை வார்த்தையுடன் குறிப்பிடப்படுகிறது, ஆனால் குழப்பத்தைத் தடுக்க கூடுதல் தெளிவு தேவைப்படும்போது இந்த வழிகாட்டி விரிவாக்கப்பட்ட காலத்தைப் பயன்படுத்தும்: ஒரு: கால: `விநியோக தொகுப்பு` இது பொதுவாக" தொகுப்பு "என்றும் அழைக்கப்படுகிறது . காண்க: குறிப்பு: வேறுபாடுகளின் முறிவுக்கு `விநியோக-பேக்கேச்-விஎச்-பிரசங்க-பேக்கேச்`.

source: Installed Project
eo: Instalita Projekto
ja: インストール済みのプロジェクト
ru: Установленный проект
ta: நிறுவப்பட்ட திட்டம்

source: Known Good Set (KGS)
eo: Konata Bona Aro (KGS)
ja: 既知の良好なセット
ru: Known Good Set (KGS, Известный хороший набор)
ta: அறியப்பட்ட நல்ல தொகுப்பு (கிலோ)

source: A set of distributions at specified versions which are compatible with each other. Typically a test suite will be run which passes all tests before a specific set of packages is declared a known good set. This term is commonly used by frameworks and toolkits which are comprised of multiple individual distributions.
eo: Aro de distribuoj ĉe specifitaj versioj kongruaj inter si. Tipe oni rulas testaron, antaŭ ol deklari iun aron konata bona aro. La terminon ofte uzas kadroj kaj ilaroj konsistantaj el multaj distribuoj.
ja: (KGSとは)相互に互換性のある特定のバージョンの配布物の集合。典型的には、テストスイートで全てのテストに合格して実行できるようなパッケージの特定の組み合わせが既知の良好なセット(KGS)であると宣言されます。この用語は、個々の配布物を複数組み合わせて構成されるフレームワークやツールキットで共通して用いられます。
pt_br: Um conjunto de distribuições em versões especificadas que são compatíveis entre si. Normalmente, será executado um conjunto de testes que passa em todos os testes antes que um conjunto específico de pacotes seja declarado como um conjunto sabidamente bom (*known good set*). Este termo é comumente usado por frameworks e kits de ferramentas que são compostos de várias distribuições individuais.
ru: Набор дистрибутивов определенных версий, совместимых друг с другом. Обычно перед тем, как объявить определенный набор пакетов заведомо исправным, запускается набор тестов, который проходит все проверки. Этот термин обычно используется во фреймворках и наборах инструментов, которые состоят из нескольких отдельных дистрибутивов.
ta: ஒருவருக்கொருவர் இணக்கமான குறிப்பிட்ட பதிப்புகளில் விநியோகங்களின் தொகுப்பு. பொதுவாக ஒரு சோதனை தொகுப்பு இயக்கப்படும், இது ஒரு குறிப்பிட்ட தொகுப்புகள் அறியப்பட்ட நல்ல தொகுப்பாக அறிவிக்கப்படுவதற்கு முன்பு அனைத்து சோதனைகளையும் கடந்து செல்லும். இந்த சொல் பொதுவாக பல தனிப்பட்ட விநியோகங்களைக் கொண்ட கட்டமைப்புகள் மற்றும் கருவித்தொகுப்புகளால் பயன்படுத்தப்படுகிறது.

source: License Classifier
eo: Licenco-Klasigilo
ja: ライセンス分類詞 <License Classifier>
ru: Лицензионный классификатор
ta: உரிம வகைப்படுத்தி

source: A PyPI Trove classifier (as :ref:`described <core-metadata-classifier>` in the :term:`Core Metadata` specification) which begins with ``License ::``.
eo: Klasigilo PyPI Trove (:ref:`laŭ <core-metadata-classifier>` la specifo :term:`Kernaj Metadatenoj <Core Metadata>`) komenciĝanta per ``License ::``.
ja: ライセンス <License>::`` で始まる (:term:`コアとなるメタデータ <Core Metadata>` 仕様の中で :ref:`記述されている <core-metadata-classifier>` とおりの) `` PyPI の Trove classifier プロジェクト。
ru: Классификатор PyPI Trove (как :ref:`described <core-metadata-classifier>` в спецификации :term:`Core Metadata`), который начинается с ``Лицензии ::``.
ta: ஒரு பைபி ட்ரோவ் வகைப்படுத்தி (AS: Ref: `விவரிக்கப்பட்ட <கோர்-மெட்டாடேட்டா-கிளாசிஃபையர்>` இல்: கால: `கோர் மெட்டாடேட்டா` விவரக்குறிப்பு)` `உரிமம் ::` `உடன் தொடங்குகிறது.

source: License Expression
eo: Licenco-Esprimo
ja: ライセンス表現
ru: Лицензионная экспрессия
ta: உரிம வெளிப்பாடு

source: SPDX Expression
eo: SPDX-Esprimo
ja: SPDX 表現
ru: SPDX Экспрессия
ta: SPDX வெளிப்பாடு

source: A string with valid SPDX license expression syntax, including one or more SPDX :term:`License Identifier`\(s), which describes a :term:`Project`'s license(s) and how they inter-relate. Examples: ``GPL-3.0-or-later``, ``MIT AND (Apache-2.0 OR BSD-2-Clause)``
eo: Signoĉeno de valida SPDX-licenco-esprima sintakso, inkluzivante unu aŭ pli da :term:`Licenco-Identigilo(j) <License Identifier>`, priskribanta(j) licenco(j)n de la :term:`Projekto <Project>` kaj iliajn interrilatojn. Ekzemple: ``GPL-3.0-or-later``, ``MIT AND (Apache-2.0 OR BSD-2-Clause)``
ja: ひとつかそれ以上の SPDX :term:`ライセンス識別子 <License Identifier>` (複数の場合もあり) を含む、正当な SPDX ライセンス表現の文法を伴う文字列で、 :term:`プロジェクト <Project>` のライセンス(群) を記述し、どのように相互に関係するのかを表現するもの。例: ``GPL-3.0-or-later`` ・ ``MIT AND (Apache-2.0 OR BSD-2-Clause)``
ru: Строка с допустимым синтаксисом выражения лицензий SPDX, включающая один или несколько идентификаторов SPDX :term:`License Identifier`\(s), которые описывают лицензии :term:`Project` и их взаимосвязь. Примеры: ``GPL-3.0-or-later``, ``MIT AND (Apache-2.0 OR BSD-2-Clause)``
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட SPDX உள்ளிட்ட செல்லுபடியாகும் SPDX உரிம வெளிப்பாடு தொடரியல் கொண்ட ஒரு சரம்: சொல்: `உரிம அடையாளங்காட்டி` \ (கள்), இது ஒரு: காலத்தை விவரிக்கிறது:` திட்டத்தின் உரிமம் (கள்) மற்றும் அவை எவ்வாறு தொடர்புபடுத்தப்படுகின்றன. எடுத்துக்காட்டுகள்: `` gpl-3.0 அல்லது-later``, `` MIT மற்றும் (APACHE-2.0 அல்லது BSD-2-confase) ``

source: License Identifier
eo: Licenco-Identigilo
ja: ライセンス識別子
ru: Лицензионный идентификатор
ta: உரிம அடையாளங்காட்டி

source: SPDX Identifier
eo: SPDX-Identigilo
ja: SPDX 識別子
ru: Идентификатор SPDX
ta: SPDX அடையாளம் காணவும்
