Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: `pypi.org <https://pypi.org>`_ is the domain name for the :term:`Python Package Index (PyPI)`. It replaced the legacy index domain name, ``pypi.python.org``, in 2017. It is powered by :ref:`warehouse`.
eo: `pypi.org <https://pypi.org>`_ estas la retadreso de la :term:`Python-Pakindekso (PyPI) <Python Package Index (PyPI)>`. Ĝi anstataŭis la malnovan retadreson, ``pypi.python.org``, en 2017. Ĝi funkciiĝas per :ref:`warehouse`.
ja: `pypi.org <https://pypi.org>`_ は、 :term:`Python パッケージインデックス(PyPI)` のためのドメイン名です。2017年にそれまでのドメイン名である ``pypi.python.org`` を置き換えました。 :ref:`warehouse`を使っています。
pt_br: `pypi.org <https://pypi.org>`_ é o nome de domínio do :term:`Python Package Index (PyPI)`. Ele substituiu o nome de domínio do índice legado, ``pypi.python.org``, em 2017. Ele é tornado possível pelo :ref:`warehouse`.
ru: `pypi.org <https://pypi.org>`_ - это доменное имя для :term:`Python Package Index (PyPI)`. Он заменил устаревшее доменное имя индекса, ``pypi.python.org``, в 2017 году. Он работает на базе :ref:`warehouse`.
ta: `pypi.org <https://pypi.org>` _ என்பது டொமைன் பெயர்: கால: `பைதான் தொகுப்பு அட்டவணை (PYPI)`. இது 2017 ஆம் ஆண்டில் மரபு குறியீட்டு டொமைன் பெயரை மாற்றியது, `` pypi.python.org``. இது இயக்கப்படுகிறது: ref: `கிடங்கு`.

source: The tool-agnostic :term:`Project` specification file. Defined in :pep:`518`.
eo: La ilo-sendependa :term:`projekta <Project>` specifa dosiero. Difinita en :pep:`518`.
ja: ツール不可知論者の :term:`プロジェクト <Project>` 仕様を示すファイル。 :pep:`518` で定義。
pt_br: O arquivo de especificação agnóstica de ferramenta para :term:`Projetos <Project>`. Definido na :pep:`518`.
ru: Инструмент-агностик:термин: файл спецификации "Проект". Определен в :pep:`518'.
ta: கருவி-அம்போச்டிக்: கால: `திட்டம்` விவரக்குறிப்பு கோப்பு. வரையறுக்கப்பட்டுள்ளது: PEP: `518`.

source: Release
eo: Eldono
ja: リリース
pt_br: Lançamento
ru: Выпуск
ta: வெளியீடு

source: A snapshot of a :term:`Project` at a particular point in time, denoted by a version identifier.
eo: Kopio de :term:`Projekto <Project>` ĉe iu punkto en tempo, indikita de versia identigilo.
ja: ある特定の時点における :term:`プロジェクト <Project>`のスナップショットで、バージョン識別子付きのもの。
pt_br: Um snapshot de um :term:`Projeto` em um determinado ponto no tempo, denotado por um identificador de versão.
ru: Снимок :term:`Project` в определенный момент времени, обозначаемый идентификатором версии.
ta: A இன் ச்னாப்சாட்: கால: `திட்டம்` ஒரு குறிப்பிட்ட கட்டத்தில், பதிப்பு அடையாளங்காட்டியால் குறிக்கப்படுகிறது.

source: Making a release may entail the publishing of multiple :term:`Distributions <Distribution Package>`. For example, if version 1.0 of a project was released, it could be available in both a source distribution format and a Windows installer distribution format.
eo: Eldonado de versio povas necesigi publikigon de pluraj :term:`Distribuoj <Distribution Package>`. Ekzemple, se oni eldonus version 1.0 de iu projekto, oni povus disponigi ĝin kiel kaj fontan distribuon kaj Windows-instalilan dosierformon.
ja: リリースを作成することは、複数の :term:`配布物 <Distribution Package>` を公開することを伴います。例えば、あるプロジェクトのバージョン1.0がリリースされたならば、ソースコード配布物とWindowsインストーラ付配布物の両方が利用可能となっているという具合です。
pt_br: Fazer um lançamento pode implicar na publicação de várias :term:`Distribuições <Distribution Package>`. Por exemplo, se a versão 1.0 de um projeto foi lançada, ele pode estar disponível em um formato de distribuição fonte e um formato de distribuição de instalador do Windows.
ru: Создание релиза может повлечь за собой публикацию нескольких :term:`Distributions <Distribution Package>`. Например, если версия 1.0 проекта была выпущена, она может быть доступна как в формате распределения источника, так и в формате Windows.
ta: வெளியீட்டை உருவாக்குவது பல: கால: `விநியோகம் <விநியோக தொகுப்பு>` வெளியீட்டைக் கொண்டிருக்கலாம். எடுத்துக்காட்டாக, ஒரு திட்டத்தின் பதிப்பு 1.0 வெளியிடப்பட்டால், அது ஒரு மூல விநியோக வடிவம் மற்றும் சாளரங்கள் நிறுவி விநியோக வடிவத்தில் கிடைக்கக்கூடும்.

source: Requirement
eo: Postulo
ja: 要求事項
pt_br: Requisito
ru: Требование
ta: தேவை

source: A specification for a :term:`package <Distribution Package>` to be installed. :ref:`pip`, the :term:`PYPA <Python Packaging Authority (PyPA)>` recommended installer, allows various forms of specification that can all be considered a "requirement". For more information, see the :ref:`pip:pip install` reference.
eo: Specifo de instalota :term:`pako <Distribution Package>`. :ref:`pip`, la instalilo rekomendata de :term:`PyPA <Python Packaging Authority (PyPA)>`, permesas diversajn formojn de «postuloj». Por pliaj detaloj, vidu :ref:`pip:pip install`.
ja: インストールされる :term:`パッケージ <Distribution Package>` の仕様。 :term:`PYPA <Python Packaging Authority (PyPA)>` が推奨するインストーラである :ref:`pip` では、「要求事項」とも解釈できる仕様を様々な様式で書くことを許容しています。詳細については、 :ref:`pip:pip install` の項を参照してください。
pt_br: Uma especificação para um :term:`pacote <Distribution Package>` a ser instalado. :ref:`pip`, o instalador recomendado do :term:`PYPA <Python Packaging Authority (PyPA)>`, permite várias formas de especificação que podem ser consideradas um "requisito". Para obter mais informações, consulte a referência de :ref:`pip:pip install`.
ru: Спецификация для устанавливаемого :term:`пакета <Distribution Package>`. :ref:`pip`, рекомендуемый установщик :term:`PYPA <Python Packaging Authority (PyPA)>`, допускает различные формы спецификации, которые все могут считаться "требованием". Для получения дополнительной информации смотрите ссылку :ref:`pip:pip install`.
ta: ஒரு விவரக்குறிப்பு ஒரு: கால: `தொகுப்பு <விநியோக தொகுப்பு>` நிறுவப்பட வேண்டும். . மேலும் தகவலுக்கு, பார்க்க: ref: `PIP: PIP INSTALL` குறிப்பு.

source: Requirement Specifier
eo: Postulo-Specifilo
ja: 要求事項識別子
pt_br: Especificador de Requisitos
ru: Спецификатор требований
ta: தேவை விவரக்குறிப்பு

source: A format used by :ref:`pip` to install packages from a :term:`Package Index`. For an EBNF diagram of the format, see :ref:`dependency-specifiers`. For example, "foo>=1.3" is a requirement specifier, where "foo" is the project name, and the ">=1.3" portion is the :term:`Version Specifier`
eo: Tekstoformo uzata de :ref:`pip` por instali pakojn el :term:`pakindekso <Package Index>`. Por EBNF-diagramo de la tekstoformo, vidu :ref:`dependency-specifiers`. Ekzemple, ``foo>=1.3`` estas postulo-specifilo, en kiu ``foo`` estas la nomo de la projekto kaj ``>=1.3`` estas la :term:`versio-specifilo <Version Specifier>`
ja: :term:`パッケージインデックス <Package Index>`からパッケージをインストールするために :ref:`pip` で用いられる様式。この様式の EBNF 文法構造については、 :ref:`依存関係指定子 <dependency-specifiers>` を見てください。例えば、 "foo>=1.3" は要求事項識別子であり、 "foo" の部分がプロジェクトの名称で、 ">=1.3" の部分は :term:`バージョン指定子 <Version Specifier>` です
pt_br: Um formato usado por :ref:`pip` para instalar pacotes de um :term:`Índice de Pacotes`. Para um diagrama EBNF do formato, veja :ref:`dependency-specifiers`. Por exemplo, "foo>=1.3" é um especificador de requisitos, onde "foo" é o nome do projeto e a parte ">=1.3" é o :term:`Especificador de Versão`
ru: Формат, используемый :ref:`pip` для установки пакетов из :term:`Package Index`. EBNF диаграмму этого формата смотрите в :ref:`dependency-specifiers`. Например, "foo>=1.3" - это спецификатор требований, где "foo" - это имя проекта, а часть ">=1.3" - это :term:`Version Specifier`
ta: பயன்படுத்திய ஒரு வடிவம்: ref: `பிப்` ஒரு: கால:` தொகுப்பு குறியீட்டு` இலிருந்து தொகுப்புகளை நிறுவ. வடிவமைப்பின் ஈபிஎன்எஃப் வரைபடத்திற்கு, காண்க: குறிப்பு: `சார்பு-விவரக்குறிப்புகள்`. எடுத்துக்காட்டாக, "FOO> = 1.3" என்பது ஒரு தேவை விவரக்குறிப்பாகும், அங்கு "FOO" என்பது திட்ட பெயர், மற்றும் "> = 1.3" பகுதி: கால: `பதிப்பு விவரக்குறிப்பு`

source: Requirements File
eo: Postulo-Dosiero
ja: Requirementsファイル
pt_br: Arquivo de Requisitos
ru: Требования к файлам
ta: தேவைகள் கோப்பு

source: A file containing a list of :term:`Requirements <Requirement>` that can be installed using :ref:`pip`. For more information, see the :ref:`pip` docs on :ref:`pip:Requirements Files`.
eo: Dosiero enhavanta liston de :term:`Postuloj <Requirement>` instaleblaj per :ref:`pip`. Por plian informoj, vidu la dokumentaron de :ref:`pip` pri :ref:`Postulo-Dosieroj <pip:Requirements Files>`.
ja: :ref:`pip`を用いてインストールできるように :term:`要求事項 <Requirement>` を記したファイル。詳しい情報は、 :ref:`pip` のドキュメントの :ref:`pip:Requirementsファイル <pip:Requirements Files>` をみてください。
pt_br: Um arquivo contendo uma lista de :term:`Requisitos <Requirement>` que podem ser instalados usando :ref:`pip`. Para mais informações, veja a documentação :ref:`pip` em :ref:`pip:Requirements Files`.
ru: Файл, содержащий список :term:`Requirements <Requirement>` который может быть установлен с помощью :ref:`pip'. Дополнительные сведения см. в :ref:`pip'''' docs on :ref:`pip:Requirements Files`.
ta: ஒரு பட்டியலைக் கொண்ட ஒரு கோப்பு: கால: `தேவைகள் <தேவை>` அதைப் பயன்படுத்தி நிறுவலாம்: குறிப்பு: `பிப்`. மேலும் தகவலுக்கு, பார்க்க: ref: `பிப்` டாக்ச் ஆன்: குறிப்பு:` பிப்: தேவைகள் கோப்புகள்`.

source: Root License Directory
eo: Radika Licenco-Dosierujo
ja: ライセンスディレクトリのルート
ru: Каталог корневых лицензий
ta: ரூட் உரிம அடைவு

source: License Directory
eo: Licenco-Dosierujo
ja: ライセンスディレクトリ
ru: Каталог лицензий
ta: உரிம அடைவு

source: The directory under which license files are stored in a :term:`Project Source Tree`, :term:`Distribution Archive` or :term:`Installed Project`. For a :term:`Project Source Tree` or :term:`Source Distribution (or "sdist")`, this is the :term:`Project Root Directory`. For a :term:`Built Distribution` or :term:`Installed Project`, this is the :file:`.dist-info/licenses/` directory of the wheel archive or project folder respectively. Also, the root directory that paths recorded in the ``License-File`` :term:`Core Metadata Field` are relative to.
eo: La dosierujo, en kiu licenco-dosieroj troviĝas, en :term:`Projekta Fontarbo <Project Source Tree>`, :term:`Distribua Arĥivo <Distribution Archive>` aŭ :term:`Instalita Projekto <Installed Project>`. Por :term:`Projekta Fontarbo <Project Source Tree>` aŭ :term:`Fonta Distribuo <Source Distribution (or "sdist")>`, ĝi estas la :term:`Projekta Radika Dosierujo <Project Root Directory>`. Por :term:`Konstruita Distribuo <Built Distribution>` aŭ :term:`Instalita Projekto <Installed Project>`, ĝi estas la dosierujo :file:`.dist-info/licenses/` de la wheel-arĥivo aŭ projekta dosierujo respektive. Ankaŭ, la radika dosierujo, al kiu estas relativaj la dosierlokoj en la :term:`Kerna Metadatena Kampo <Core Metadata Field>` ``License-File``.
ja: :term:`プロジェクトソースツリー <その下にライセンスファイル群を保存するディレクトリ
ru: Каталог, в котором хранятся файлы лицензий в :term:`Project Source Tree`, :term:`Distribution Archive` или :term:`Installed Project`. Для :term:`Project Source Tree` или :term:`Source Distribution (or "sdist")` это :term:`Project Root Directory`. Для :term:`Built Distribution` или :term:`Installed Project` - это :file:`.dist-info/licenses/` каталог архива колеса или папки проекта соответственно. Также это корневая директория, к которой относятся пути, записанные в ``License-File`` :term:`Core Metadata Field``.
ta: எந்த உரிமக் கோப்புகள் ஒரு: கால: `திட்ட மூல மரம்`,: கால:` விநியோக காப்பகம்` அல்லது: கால: `நிறுவப்பட்ட திட்டம்` என்ற கோப்பகத்தின் கீழ் உள்ள அடைவு. ஒரு: கால: `திட்ட மூல மரம்` அல்லது: கால:` மூல வழங்கல் (அல்லது "SDIST") `, இது: கால:` திட்ட ரூட் அடைவு`. ஒரு: காலத்திற்கு: `கட்டப்பட்ட விநியோகம்` அல்லது: கால:` நிறுவப்பட்ட திட்டம்`, இது: கோப்பு: `.டிச்ட்-இன்ஃபோ/உரிமங்கள்/முறையே சக்கர காப்பகம் அல்லது திட்ட கோப்புறையின் அடைவு. மேலும், `` உரிம-கோப்பு``: கால: `கோர் மேனிலை தரவு புலம்` இல் பதிவு செய்யப்பட்ட பாதைகள் தொடர்புடையவை.

source: The project specification files for :ref:`distutils` and :ref:`setuptools`. See also :term:`pyproject.toml`.
eo: La projektaj specifaj dosieroj por :ref:`distutils` kaj :ref:`setuptools`. Vidu ankaŭ :term:`pyproject.toml`.
ja: :ref:`distutils`や :ref:`setuptools` で使われるプロジェクトの仕様を記したファイル。 :term:`pyproject.toml`も見てください。
pt_br: Os arquivos de especificação do projeto para :ref:`distutils` e :ref:`setuptools`. Veja também :term:`pyproject.toml`.
ru: Файлы спецификаций проекта для:ref:`distutils' и :ref:`setuptools'. См. также :term:`pyproject.toml'.
ta: இதற்கான திட்ட விவரக்குறிப்பு கோப்புகள்: ref: `distutils` மற்றும்: ref:` setuptools`. மேலும் காண்க: கால: `pyproject.toml`.

source: Source Archive
eo: Fonta Arĥivo
ja: ソースコードアーカイブ
pt_br: Arquivo Fonte
ru: Источник Архив
ta: மூல காப்பகம்

source: An archive containing the raw source code for a :term:`Release`, prior to creation of a :term:`Source Distribution <Source Distribution (or "sdist")>` or :term:`Built Distribution`.
eo: Arĥivo enhavanta la krudan fontkodon de :term:`Eldono <Release>`, antaŭ la kreado de :term:`Fonta Distribuo <Source Distribution (or "sdist")>` aŭ :term:`Konstruita Distribuo <Built Distribution>`.
ja: :term:`ソースコード配布物 <Source Distribution (or "sdist")>` や :term:`ビルド配布物 <Built Distribution>` という用語を作る前には、:term:`リリース <Release>`向けに生のソースコードを収めたアーカイブのことをこう呼んでいた。
pt_br: Um arquivo contendo o código-fonte bruto para um :term:`Lançamento <Release>`, antes da criação de uma :term:`Distribuição Fonte <Source Distribution (or "sdist")>` ou :term:`Distribuição Construída <Built Distribution>`.
ru: Архив, содержащий исходный код для :term:`Release`, до создания :term:`Source Distribution <Source Distribution (или "sdist")>` или :term:`Built Distribution`.
ta: A: காலத்திற்கான மூல மூலக் குறியீட்டைக் கொண்ட ஒரு காப்பகம்: `வெளியீடு`, ஒரு உருவாக்குவதற்கு முன்: கால:` மூல வழங்கல் <மூல வழங்கல் (அல்லது "SDIST")> `அல்லது: கால:` கட்டப்பட்ட விநியோகம்`.

source: Source Distribution (or "sdist")
eo: Fonta Distribuo (aŭ «sdist»)
ja: `ソースコード配布物 (またはsdist) <Source Distribution (or "sdist")>`
pt_br: Distribuição Fonte (ou "sdist")
ru: Распространение исходных текстов (или "sdist")
ta: மூல வழங்கல் (அல்லது "SDIST")

source: A :term:`distribution <Distribution Archive>` format (usually generated using ``python -m build --sdist``) that provides metadata and the essential source files needed for installing by a tool like :ref:`pip`, or for generating a :term:`Built Distribution`. See :ref:`package-formats` for more information.
ja: :ref:`pip` のようなツールによるインストールや :term:`ビルド済配布物 <Built Distribution>` の生成のために必要となるメタデータや必須のソースファイルを提供する :term:`配布物 アーカイブ <Distribution Archive>` フォーマット (通常は ``python -m build --sdist`` を使って生成されます) 。もっと情報が欲しければ、 :ref:`パッケージフォーマット <package-formats>` を見てください。
ru: Формат : термин:`дистрибутив <архив дистрибутива>` (обычно генерируется с помощью ``python -m build --sdist``), который предоставляет метаданные и основные исходные файлы, необходимые для установки с помощью такого инструмента, как : ссылка:`pip`, или для генерации :термин:`сборка дистрибутива``. Дополнительную информацию смотрите в : ссылка:`Форматы пакетов`.
ta: ப: கால: `விநியோகம் <விநியோக காப்பகம்>` வடிவம் (வழக்கமாக `` பைதான் -எம் பில்ட் - -ச்டிச்ட்`` ஐப் பயன்படுத்தி உருவாக்கப்படுகிறது) இது மெட்டாடேட்டாவையும் ஒரு கருவியால் நிறுவ தேவையான அத்தியாவசிய மூல கோப்புகளையும் வழங்குகிறது: re: `பிப்`, அல்லது உருவாக்க ஒரு: கால: `கட்டப்பட்ட விநியோகம்`. காண்க: குறிப்பு: மேலும் தகவலுக்கு `தொகுப்பு வடிவங்கள்.

source: System Package
eo: Sistema Pako
ja: システムパッケージ
pt_br: Pacote de Sistemas
ru: Системный пакет
ta: கணினி தொகுப்பு

source: A package provided in a format native to the operating system, e.g. an rpm or dpkg file.
eo: Pako en formo indiĝena al la mastruma sistemo, ekz. rpm aŭ dpkg.
ja: rpmやdpkgのように、オペレーティングシステムに固有のフォーマットで提供されるパッケージ。
pt_br: Um pacote fornecido em um formato nativo para o sistema operacional, por exemplo, um arquivo rpm ou dpkg.
ru: Пакет, предоставляемый в формате, имеющем отношение к операционной системе, например, файл rpm или dpkg.
ta: இயக்க முறைமைக்கு சொந்தமான வடிவத்தில் வழங்கப்பட்ட ஒரு தொகுப்பு, எ.கா. ஒரு RPM அல்லது DPKG கோப்பு.

source: Version Specifier
eo: Versio-Specifilo
ja: バージョン指定子
pt_br: Especificador de Versão
ru: Спецификатор версии
ta: பதிப்பு விவரக்குறிப்பு

source: The version component of a :term:`Requirement Specifier`. For example, the ">=1.3" portion of "foo>=1.3". Read the :ref:`Version specifier specification <version-specifiers>` for a full description of the specifiers that Python packaging currently supports. Support for this specification was implemented in :ref:`setuptools` v8.0 and :ref:`pip` v6.0.
ja: :term:`要求事項指定子 <Requirement Specifier>` のバージョン部分。例えば、"foo>=1.3" の中の ">=1.3" の部分。Python のパッケージングで現在サポートされている識別子の完全な記述については、 :ref:`バージョン指定子の仕様 <version-specifiers>` を読んでください。この仕様のサポートは、 :ref:`setuptools` v8.0 と :ref:`pip` v6.0 で実装されました。
pt_br: O componente de versão de um :term:`Especificador de Requisitos <Requirement Specifier>`. Por exemplo, a parte ">=1.3" de "foo>=1.3". Leia a :ref:`especificação de especificador de versão <version-specifier>` para a especificação completa dos especificadores que o empacotamento do Python oferece suporte atualmente. O suporte para esta especificação foi implementado no :ref:`setuptools` v8.0 e no :ref:`pip` v6.0.
ru: Компонент версии :термин: " спецификатор запросов " . Например, ">=1.3" части "foo>=1.3". Прочтите :ref:`Version спецификатор <version-спецификаторы>` для полного описания спецификаторов, которые Python в настоящее время поддерживаются. Поддержка этой спецификации была реализована в :ref:`setuptools` v8.0 и :ref:`pip` v6.0.
ta: A இன் பதிப்பு கூறு: கால: `தேவை விவரக்குறிப்பு`. எடுத்துக்காட்டாக, "FOO> = 1.3" இன் "> = 1.3" பகுதி. படிக்கவும்: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>` பைதான் பேக்கேசிங் தற்போது ஆதரிக்கும் குறிப்பிட்ட விவரக்குறிப்பாளர்களின் முழு விளக்கத்திற்கு. இந்த விவரக்குறிப்பிற்கான உதவி இதில் செயல்படுத்தப்பட்டது: குறிப்பு: `setuptools` v8.0 மற்றும்: Ref:` Pip` v6.0.

source: Virtual Environment
eo: Virtuala Medio
ja: 仮想環境
pt_br: Ambiente Virtual
ru: Виртуальная среда
ta: மெய்நிகர் சூழல்

source: An isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide. For more information, see the section on :ref:`Creating and using Virtual Environments`.
eo: Izolita Python-medio, en kiu oni povas instali pakojn por iu programo, anstataŭ tutsistema instalado. Por pliaj informoj, vidu :ref:`Krei kaj uzi Virtualan Medion <Creating and using Virtual Environments>`.
ja: システム全体からではなく、ある特定のアプリケーションだけから使えるようにパッケージをインストールすることができる、隔離されたPython環境。詳細は :ref:`仮想環境の生成と使用 <Creating and using Virtual Environments`を参照してください。
pt_br: Um ambiente Python isolado que permite que os pacotes sejam instalados para uso por uma aplicação específica, em vez de serem instalados em todo o sistema. Para obter mais informações, consulte a seção sobre :ref:`Creating and using Virtual Environments`.
ru: Изолированная среда Python, которая позволяет устанавливать пакеты для использования конкретным приложением, а не устанавливать их в масштабах всей системы. Для получения дополнительной информации см. раздел :ref:`Создание и использование виртуальных сред`.
ta: கணினி அகலமாக நிறுவப்படுவதை விட, ஒரு குறிப்பிட்ட பயன்பாட்டால் பயன்படுத்த தொகுப்புகளை நிறுவ அனுமதிக்கும் ஒரு தனிமைப்படுத்தப்பட்ட பைதான் சூழல். மேலும் தகவலுக்கு, பகுதியைப் பார்க்கவும்: ref: `மெய்நிகர் சூழல்களை உருவாக்குதல் மற்றும் பயன்படுத்துதல்`.

source: Wheel Format
eo: Wheel-Formo
ja: Wheel フォーマット
ru: Формат колеса
ta: சக்கர வடிவம்

source: Wheel
ru: Колесо
ta: சக்கரம்

source: The standard :term:`Built Distribution` format originally introduced in :pep:`427` and defined by the :ref:`binary-distribution-format` specification. See :ref:`package-formats` for more information. Not to be confused with its reference implementation, the :term:`Wheel Project`.
eo: La norma dosierformo por :term:`Konstruita Distribuo <Built Distribution>`, origine enkondukita de :pep:`427` kaj difinita de la normo :ref:`binary-distribution-format`. Vidu :ref:`package-formats` por pliaj informoj. Ne konfuzu ĝin kun ĝia referenca realigo, :term:`la Projekto Wheel <Wheel Project>`.
ja: 標準的な :term:`ビルド済配布物 <Built Distribution>` フォーマットで、当初は :pep:`427` で導入され、 :ref:`バイナリ配布物のフォーマット <binary-distribution-format>` 仕様で定義されたもの。詳しくは :ref:`パッケージフォーマット <package-formats>` を見てください。参照実装である :term:`Wheel プロジェクト <Wheel Project>` と混同しないように。
ru: Стандартный формат : термин:`Созданный дистрибутив`, первоначально представленный в :pep:`427` и определенный спецификацией : ссылка:`binary-distribution-format`. Дополнительную информацию см. в : ссылка:`пакетные форматы`. Не путать с его эталонной реализацией, : термин:``Колесо проекта``.
ta: தரநிலை: சொல்: `கட்டப்பட்ட விநியோகம்` வடிவம் முதலில் அறிமுகப்படுத்தப்பட்டது: PEP:` 427` மற்றும் வரையறுக்கப்பட்டுள்ளது: ref: `பைனரி-விநியோக வடிவ விவரங்கள்` விவரக்குறிப்பு. காண்க: குறிப்பு: மேலும் தகவலுக்கு `தொகுப்பு வடிவங்கள். அதன் குறிப்பு செயல்படுத்தலுடன் குழப்பமடையக்கூடாது, தி: கால: `சக்கர திட்டம்`.

source: Wheel Project
eo: Wheel-Projekto
ja: Wheel プロジェクト
ru: Проект Колесо
ta: சக்கர திட்டம்

source: The PyPA reference implementation of the :term:`Wheel Format`; see :ref:`wheel`.
eo: La referenca realigo far PyPA de la :term:`Wheel-Formo <Wheel Format>`; vidu :ref:`wheel`.
ja: :term:`Wheel フォーマット <Wheel Format>` の PyPA による参照実装; :ref:`wheel` 参照。
ru: Эталонная реализация PyPA формата : термин:`Формат колеса`; см. : ссылка:`колесо`.
ta: பைபா குறிப்பு செயல்படுத்தல்: கால: `சக்கர வடிவமைப்பு`; காண்க: குறிப்பு: `சக்கரம்`.

source: Working Set
eo: Aro de Laboro
ja: 動作可能セット
pt_br: Conjunto de Trabalho
ru: Рабочая группа
ta: வேலை தொகுப்பு

source: A collection of :term:`distributions <Distribution Package>` available for importing. These are the distributions that are on the `sys.path` variable. At most, one :term:`Distribution <Distribution Package>` for a project is possible in a working set.
eo: Kolekto de importeblaj :term:`distribuoj <Distribution Package>`. Tiuj estas la distribuoj en la variablo `sys.path`. Maksimume unu :term:`Distribuo <Distribution Package>` por iu projekto povas ĉeesti en aro de laboro.
ja: 一連のインポート可能な :term:`配布物 <Distribution Package>`。これらは `sys.path` 変数から検索できる配布物です。あるプロジェクトには、高々(訳註、at mostではなくat least、すくなくとも、か。)ひとつの :term:`配布物 <Distribution Package>` が動作可能セットにあります。
pt_br: Uma coleção de :term:`distribuições <Distribution Package>` disponíveis para importação. Estas são as distribuições que estão na variável `sys.path`. No máximo, uma :term:`Distribuição <Distribution Package>` para um projeto é possível em um conjunto de trabalho.
ru: Коллекция :term:`дистрибутивов <Distribution Package>`, доступных для импорта. Это дистрибутивы, которые находятся в переменной `sys.path. В рабочем наборе возможен максимум один :term:`Distribution <Distribution Package>` для проекта.
ta: ஒரு தொகுப்பு: கால: `விநியோகம் <விநியோக தொகுப்பு>` இறக்குமதி செய்ய கிடைக்கிறது. `Sys.path` மாறியில் இருக்கும் விநியோகங்கள் இவை. அதிகபட்சம், ஒன்று: சொல்: `விநியோக <விநியோக தொகுப்பு>` ஒரு திட்டத்திற்கு வேலை செய்யும் தொகுப்பில் சாத்தியமாகும்.

source: Analyzing PyPI package downloads
eo: Analizi la pakajn elŝutojn el PyPI
ja: PyPIパッケージのダウンロード状況の解析
pt_br: Analisando downloads de pacotes PyPI
ru: Анализ загрузок пакетов с PyPI
ta: PYPI தொகுப்பு பதிவிறக்கங்களை பகுப்பாய்வு செய்தல்
