Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: This section lists the registered VCS's; expanded, VCS-specific information on how to use the ``vcs``, ``requested_revision``, and other fields of ``vcs_info``; and in some cases additional VCS-specific fields. Tools MAY support other VCS's although it is RECOMMENDED to register them by writing a PEP to amend this specification. The ``vcs`` field SHOULD be the command name (lowercased). Additional fields that would be necessary to support such VCS SHOULD be prefixed with the VCS command name.
eo: Jen listo de registritaj versikontrolsistemoj; versikontrolsistemo-specifaj informoj pri kiel uzi la kampojn ``vcs``, ``requested_revision`` kaj aliajn de ``vcs_info``; kaj en kelkaj kazoj suplementaj versikontrolsistemo-specifaj kampoj. Ilo POVAS subteni alian versikontrolan sistemon, sed estas REKOMENDATE registri ĝin per PEP modifanta ĉi tiun specifon. La kampo ``vcs`` ESTU la komanda nomo (minuskla). Suplementaj kampoj necesaj por tiu versikontrola sistemo HAVU prefikson de la versikontrolsistema komanda nomo.
ja: この節では登録済み VCS; ``vcs`` や ``requested_revision`` やその他の ``vcs_info`` 内のフィールドや、さらにある場合には特定の VCS に特有のフィールドなどの使い方のような拡張された VCS 特有の情報 の一覧を示します。 PEP を書くことでこの仕様を修正する形で別の VCS を登録することが推奨されていますが、ツールの側で他の VCS を (訳注、VCS 登録作業抜きで) サポートしても構いません。 ``vcs`` フィールドの値は、 (小文字の) コマンド名であるべきです。当該 VCS をサポートするのに必要であると思われるその他のフィールドについては、当該 VCS のコマンド名で始まる名前にするべきです。
pt_br: Esta seção lista os VCS registrados; expandidos, informações específicas do VCS sobre como usar ``vcs``, ``required_revision`` e outros campos de ``vcs_info``; e, em alguns casos, campos adicionais específicos de VCS. As ferramentas PODEM oferecer suporte a outros VCS, embora seja RECOMENDADO registrá-las escrevendo uma PEP para alterar esta especificação. O campo ``vcs`` DEVERIA ser o nome do comando (em letras minúsculas). Os campos adicionais que seriam necessários para oferecer suporte a esse VCS DEVERIAM ser prefixados com o nome do comando VCS.
ru: В этом разделе перечислены зарегистрированные VCS; расширенная, специфичная для VCS информация о том, как использовать поля ``vcs``, ``requested_revision`` и другие поля ``vcs_info``; и в некоторых случаях дополнительные специфичные для VCS поля. Инструменты МОГУТ поддерживать другие VCS, хотя РЕКОМЕНДУЕТСЯ регистрировать их путем написания PEP для изменения этой спецификации. Поле ``vcs`` ДОЛЖНО представлять собой имя команды (в нижнем регистре). Дополнительные поля, необходимые для поддержки такой VCS, ДОЛЖНЫ иметь префикс с именем команды VCS.
ta: இந்த பிரிவு பதிவுசெய்யப்பட்ட வி.சி.எச்சை பட்டியலிடுகிறது; விரிவாக்கப்பட்ட, `` vcs``, `` கோரப்பட்ட_ரெவிசன்`` மற்றும் `` vcs_info`` இன் பிற துறைகளை எவ்வாறு பயன்படுத்துவது என்பது பற்றிய வி.சி.எச்-குறிப்பிட்ட தகவல்கள்; மற்றும் சில சந்தர்ப்பங்களில் கூடுதல் வி.சி.எச்-குறிப்பிட்ட புலங்கள். இந்த விவரக்குறிப்பை திருத்துவதற்கு ஒரு PEP ஐ எழுதுவதன் மூலம் அவற்றை பதிவு செய்ய பரிந்துரைக்கப்பட்டாலும் கருவிகள் மற்ற வி.சி.க்களை ஆதரிக்கக்கூடும். `` Vcs`` புலம் கட்டளை பெயராக இருக்க வேண்டும் (கீழ்நிலை). அத்தகைய வி.சி.க்களை ஆதரிக்க தேவையான கூடுதல் புலங்கள் வி.சி.எச் கட்டளை பெயருடன் முன்னொட்டப்பட வேண்டும்.

source: Git
ta: அறிவிலி

source: Home page
eo: Ĉefpaĝo
ja: ホームページ
pt_br: Site
ru: Домашняя страница
ta: முகப்பு பக்கம்

source: vcs command
eo: komando de versikontrola sistemo
ja: vcs コマンド
pt_br: Comando vcs
ru: команда vcs
ta: வி.சி.எச் கட்டளை

source: git
ta: அறிவிலி

source: ``vcs`` field
eo: kampo ``vcs``
ja: ``vcs`` フィールド
pt_br: Campo ``vcs``
ru: поле ``vcs``
ta: `` vcs`` புலம்

source: ``requested_revision`` field
eo: kampo ``requested_revision``
ja: ``requested_revision`` フィールド
pt_br: Campo ``requested_revision``
ru: поле ``запрошенный_пересмотр``
ta: `` கோரப்பட்டது_ரெவிசன்` புலம்

source: A tag name, branch name, Git ref, commit hash, shortened commit hash, or other commit-ish.
eo: Nomo de etikedo, nomo de branĉo, referenco de Git, haketaĵo de enmeto, mallongigita haketaĵo de enmeto, aŭ io simila.
ja: タグ名・ブランチ名・Git 参照・コミットハッシュ・短縮型コミットハッシュ・その他のコミットハッシュ的なもの。
pt_br: Um nome de tag, nome de branch, ref Git, hash de commit, hash de commit encurtado ou outra coisa relacionada a commit.
ru: Имя тега, имя ветки, Git ref, хэш коммита, сокращённый хэш коммита или другое имя коммита.
ta: ஒரு குறிச்சொல் பெயர், கிளை பெயர், அறிவிலி ரெஃப், கமிட் ஆச், சுருக்கப்பட்ட கமிட் ஆச் அல்லது பிற கமிட்-இச்.

source: ``commit_id`` field
eo: kampo ``commit_id``
ja: ``commit_id`` フィールド
pt_br: Campo ``commit_id``
ru: поле ``commit_id``
ta: `` கமிட்_ஐடி`` புலம்

source: A commit hash (40 hexadecimal characters sha1).
eo: Haketaĵo de ŝanĝaro (40 deksesumaj signoj por SHA1).
ja: コミットハッシュ (16進数で40文字のSHA1)。
pt_br: Um hash de confirmação (40 caracteres hexadecimais sha1).
ru: Хэш фиксации (40 шестнадцатеричных символов sha1).
ta: ஒரு கமிட் ஆச் (40 எக்சாடெசிமல் எழுத்துக்கள் சா 1).

source: Tools can use the ``git show-ref`` and ``git symbolic-ref`` commands to determine if the ``requested_revision`` corresponds to a Git ref. In turn, a ref beginning with ``refs/tags/`` corresponds to a tag, and a ref beginning with ``refs/remotes/origin/`` after cloning corresponds to a branch.
eo: Ilo povas uzi la komandojn ``git show-ref`` kaj ``git symbolic-ref`` por determini, ĉu ``requested_revision`` respondas al Git-referenco. Referenco komenciĝanta per ``refs/tags/`` respondas al etikedo, kaj referenco komenciĝanta per ``refs/remotes/origin/`` post klonado respondas al branĉo.
ja: ツールは、 ``requested_revision`` が Git 参照に対応しているか否かを判断するために ``git show-ref`` や ``git symbolic-ref`` コマンドを使うことができます。さらに、 ``refs/tags/`` で始まる参照はタグに対応し、クローンした後に ``refs/remotes/origin/`` で始まる参照はブランチに対応します。
pt_br: As ferramentas podem usar os comandos ``git show-ref`` e ``git symbolic-ref`` para determinar se o ``required_revision`` corresponde a um ref Git. Por sua vez, um ref começando com ``refs/tags/`` corresponde a uma tag, e um ref começando com ``refs/remotes/origin/`` após a clonagem corresponde a um branch.
ru: Инструменты могут использовать команды ``git show-ref`` и ``git symbolic-ref``, чтобы определить, соответствует ли ``запрашиваемая_ревизия`` Git-рефлекту. В свою очередь, ссылка, начинающаяся с ``refs/tags/``, соответствует тегу, а ссылка, начинающаяся с ``refs/remotes/origin/`` после клонирования, соответствует ветке.
ta: கருவிகள் `` கோரப்பட்ட_ரெவிசன்`` ஒரு அறிவிலி ref உடன் ஒத்திருக்கிறதா என்பதை தீர்மானிக்க `` அறிவிலி சோ-ரெஃப்`` மற்றும் `` அறிவிலி சிம்போலிக்-ரெஃப்`` கட்டளைகளைப் பயன்படுத்தலாம். இதையொட்டி, `` refs/tags/`` உடன் ஒரு REF ஒரு குறிச்சொல்லுடன் ஒத்திருக்கிறது, மேலும் ஒரு கிளோனிங் ஒரு கிளைக்கு ஒத்த பிறகு `` refs/ரிமோட்டுகள்/தோற்றம்/`` உடன் தொடங்கும்.

source: Mercurial
ta: மெர்குரியல்

source: hg
ta: எச்.சி.

source: A tag name, branch name, changeset ID, shortened changeset ID.
eo: Nomo de etikedo, nomo de branĉo, identigilo de ŝanĝaro, mallongigita identigilo de ŝanĝaro.
ja: タグ名・ブランチ名・チェンジセット ID ・短縮型チェンジセット ID。
pt_br: Um nome de tag, nome de branch, ID de changeset, ID de changeset abreviado.
ru: Имя тега, имя ветки, идентификатор набора изменений, сокращенный идентификатор набора изменений.
ta: ஒரு குறிச்சொல் பெயர், கிளை பெயர், மாற்றங்கள் ஐடி, சுருக்கப்பட்ட மாற்றங்கள் ஐடி.

source: A changeset ID (40 hexadecimal characters).
eo: Identigilo de ŝanĝaro (40 deksesumaj signoj).
ja: チェンジセット ID (16 進数で 40 文字)。
pt_br: Um ID de changeset (40 caracteres hexadecimais).
ru: Идентификатор набора изменений (40 шестнадцатеричных символов).
ta: ஒரு மாற்ற ஐடி (40 எக்சாடெசிமல் எழுத்துக்கள்).

source: Bazaar
ta: கடைவீதி

source: bzr
ta: பொத்தான்

source: A tag name, branch name, revision id.
eo: Nomo de etikedo, nomo de branĉo, identigilo de revizio.
ja: タグ名・ブランチ名・リビジョン id 。
pt_br: Um nome de tag, nome de branch, id de revisão.
ru: Имя тега, имя ветки, идентификатор ревизии.
ta: ஒரு குறிச்சொல் பெயர், கிளை பெயர், திருத்த ஐடி.

source: A revision id.
eo: Identigilo de revizio.
ja: リビジョン id 。
pt_br: Um id de revisão.
ru: Идентификатор ревизии.
ta: ஒரு திருத்த ஐடி.

source: svn
ta: எச்.வி.என்

source: ``requested_revision`` must be compatible with ``svn checkout`` ``--revision`` option. In Subversion, branch or tag is part of ``url``.
eo: ``requested_revision`` devas kongrui kun la opcio ``--revision`` de ``svn checkout`` . Je Subversion, la branĉo aŭ etikedo estas parto de ``url``.
ja: ``requested_revision`` は、 ``svn checkout`` ``--revision`` オプションと互換でなければなりません。 Subversion では、ブランチまたはタグは ``url`` の一部です。
pt_br: ``requested_revision`` deve ser compatível com a opção ``--revision`` do ``svn checkout``. No Subversion, branch ou tag é parte de ``url``.
ru: ``requested_revision`` должен быть совместим с опцией ``vn checkout`` ``--revision``. В Subversion ветка или тег являются частью ``url``.
ta: `` கோரப்பட்ட_ரெவிசன்`` `` எச்.வி.என் புதுப்பிப்பு` `` `--revision`` விருப்பத்துடன் இணக்கமாக இருக்க வேண்டும். கீழ்ப்படிதலில், கிளை அல்லது குறிச்சொல் `` url`` இன் ஒரு பகுதியாகும்.

source: Since Subversion does not support globally unique identifiers, this field is the Subversion revision number in the corresponding repository.
eo: Ĉar Subversion ne subtenas malloke unikan identigilon, ĉi tiu kampo estas la revizinumero de Subversion en la respondanta deponejo.
ja: Subversion は大域的にユニークな識別子をサポートしていないので、このフィールドは当該リポジトリにおける Subversion のリビジョン番号です。
pt_br: Visto que o Subversion não oferece suporte a identificadores globalmente únicos, este campo é o número da revisão do Subversion no repositório correspondente.
ru: Поскольку Subversion не поддерживает глобально уникальные идентификаторы, это поле представляет собой номер ревизии Subversion в соответствующем хранилище.
ta: உலகளவில் தனித்துவமான அடையாளங்காட்டிகளை அடிபணிதல் ஆதரிக்கவில்லை என்பதால், இந்த புலம் தொடர்புடைய களஞ்சியத்தில் உள்ள கீழ்ப்படிதல் திருத்த எண்ணாகும்.

source: JSON Schema
eo: JSON-Skemo
ja: JSON スキーマ
ru: Схема JSON
ta: சாதொபொகு SCHEMA

source: The following JSON Schema can be used to validate the contents of ``direct_url.json``:
eo: Jen JSON-skemo usebla por kontroli la validecon de la enhavo de ``direct_url.json``:
ja: 以下に述べる JSON スキーマを ``direct_url.json`` の内容を検証するために使うことができます:
ru: Следующая JSON-схема может быть использована для проверки содержимого файла ``direct_url.json``:
ta: `` Adrent_url.json`` இன் உள்ளடக்கங்களை சரிபார்க்க பின்வரும் சாதொபொகு திட்டத்தைப் பயன்படுத்தலாம்:

source: Source archive:
eo: Fonta arĥivo:
ja: ソースコードアーカイブ:
pt_br: Arquivo fonte:
ru: Архив источников:
ta: மூல காப்பகம்:

source: Git URL with tag and commit-hash:
eo: Git-retadreso kun etikedo kaj haketaĵo:
ja: タグおよびコミットハッシュ付きの Git のURL:
pt_br: URL Git com tag e hash de commit:
ru: URL-адрес Git с тегом и хэшем фиксации:
ta: குறிச்சொல் மற்றும் கமிட்-ஆச் உடன் git url:

source: Local directory:
eo: Loka dosierujo:
ja: ローカルディレクトリ:
pt_br: Diretório local:
ru: Локальный справочник:
ta: உள்ளக அடைவு:

source: Local directory in editable mode:
eo: Loka dosierujo en modifebla reĝimo:
ja: 編集可能モード状態にあるローカルディレクトリ:
pt_br: Diretório local em modo editável:
ru: Локальная директория в режиме редактирования:
ta: திருத்தக்கூடிய பயன்முறையில் உள்ளக அடைவு:

source: March 2020: This specification was approved through :pep:`610`, defining the ``direct_url.json`` metadata file.
eo: Marto 2020: Ĉi tiu specifo estis aprobita per :pep:`610`, difinante la metadatenan dosieron ``direct_url.json``.
ja: 2020年3月: ``direct_url.json`` メタデータファイルを定義するこの仕様は、 :pep:`610` を通じて承認されました。
ru: Март 2020 года: Эта спецификация была одобрена через :pep:`610`, определяя файл метаданных ``direct_url.json``.
ta: மார்ச் 2020: இந்த விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `610`,` `` direct_url.json`` மேனிலை தரவு கோப்பை வரையறுக்கிறது.

source: January 2023: Added the ``archive_info.hashes`` key (`discussion <archive-info-hashes_>`_).
eo: Januaro 2023: Aldonis la ŝlosilon ``archive_info.hashes`` (`diskuto <archive-info-hashes_>`_).
ja: 2023年1月: ``archive_info.hashes`` キーを追加しました (`議論 <archive-info-hashes_>`_) 。
ru: Январь 2023 года: Добавлен ключ ``archive_info.hashes`` (``discussion <archive-info-hashes_>`_).
ta: சனவரி 2023: `` காப்பகம்_இன்ஃபோ.ஆச்கள்` விசையை (`கலந்துரையாடல் <காப்பகம்-இன்ஃபோ-ஆச்கள்_>` _) சேர்த்தது.

source: Entry points specification
eo: Specifo pri enirpunktoj
ja: エントリポイントの仕様
pt_br: Especificação de pontos de entrada
ru: Спецификация точек входа
ta: நுழைவு புள்ளிகள் விவரக்குறிப்பு

source: *Entry points* are a mechanism for an installed distribution to advertise components it provides to be discovered and used by other code. For example:
eo: *Enirpunktoj* estas meĥanismo por instalita distribuo reklami komponantojn provizitajn, igante ilin malkovreblaj kaj uzeblaj de alia kodo. Ekzemple:
ja: *エントリポイント* は、インストールされた配布物が他のプログラムから発見され使用されるように提供するコンポーネントを広報するためのメカニズムです。例えば:
pt_br: *Pontos de entrada* são um mecanismo para uma distribuição instalada anunciar componentes que ela fornece para serem descobertos e usados por outro código. Por exemplo:
ru: *Точки входа* - это механизм, с помощью которого установленный дистрибутив рекламирует предоставляемые им компоненты, чтобы их могли обнаружить и использовать другие программы. Например:
ta: * நுழைவு புள்ளிகள்* என்பது நிறுவப்பட்ட விநியோகத்திற்கான ஒரு வழிமுறையாகும், இது பிற குறியீட்டால் கண்டுபிடிக்கப்பட்டு பயன்படுத்தப்பட வேண்டிய கூறுகளை விளம்பரப்படுத்துகிறது. உதாரணமாக:

source: Distributions can specify ``console_scripts`` entry points, each referring to a function. When *pip* (or another console_scripts aware installer) installs the distribution, it will create a command-line wrapper for each entry point.
eo: Distribuo povas specifi enirpunktojn ``console scripts``, po unu por funkcio. Kiam *pip* (aŭ alia instalilo konanta ``console_scripts``) instalos la distribuon, ĝi kreos komandliniajn volvilojn po unu por enirpunkto.
ja: 配布物では、それぞれが関数を参照するような ``console_scripts`` エントリポイントを指定することができます。 *pip* (または console_scripts を認識する他のインストーラ) が配布物をインストールする際に、各エントリポイントのコマンドラインラッパを生成します。
pt_br: As distribuições podem especificar pontos de entrada ``console_scripts``, cada um referindo-se a uma função. Quando *pip* (ou outro instalador compatível com console_scripts) instala a distribuição, ele cria um wrapper de linha de comando para cada ponto de entrada.
ru: Дистрибутивы могут указывать точки входа ``console_scripts``, каждая из которых ссылается на функцию. Когда *pip* (или другая программа установки с поддержкой console_scripts) устанавливает дистрибутив, она создаст обертку командной строки для каждой точки входа.
ta: விநியோகங்கள் `` Console_scripts`` நுழைவு புள்ளிகளைக் குறிப்பிடலாம், ஒவ்வொன்றும் ஒரு செயல்பாட்டைக் குறிக்கின்றன. * பிஐபி * (அல்லது மற்றொரு கன்சோல்_ச்கிரிப்ட்ச் விழிப்புணர்வு நிறுவி) விநியோகத்தை நிறுவும் போது, இது ஒவ்வொரு நுழைவு புள்ளிக்கும் ஒரு கட்டளை-வரி ரேப்பரை உருவாக்கும்.

source: Applications can use entry points to load plugins; e.g. Pygments (a syntax highlighting tool) can use additional lexers and styles from separately installed packages. For more about this, see :doc:`/guides/creating-and-discovering-plugins`.
eo: Programo povas uzi enirpunkton por ŝargi kromprogramojn. Ekzemple, la sintaksreliefigilo Pygments povas uzi pliajn sintaksanalizilojn kaj stilojn el aparte instalitaj pakoj. Por pli pri tio, legu :doc:`/guides/creating-and-discovering-plugins`.
ja: アプリケーションは、プラグインをロードするためにエントリポイントを用いることができます; 例えば、 Pygments (シンタックスハイライトを行うツール) は追加的な字句解析器を使うことが可能であり、また、別にインストールされたパッケージから提供されるスタイルを使うことができます。この件の詳細については、 :doc:`/guides/creating-and-discovering-plugins` を見てください。
pt_br: As aplicações podem usar pontos de entrada para carregar plug-ins; por exemplo, Pygments (uma ferramenta de realce de sintaxe) pode usar lexers e estilos adicionais de pacotes instalados separadamente. Para mais informações, consulte :doc:`/guides/creating-and-discovering-plugins`.
ru: Приложения могут использовать точки входа для загрузки плагинов; например, Pygments (инструмент подсветки синтаксиса) может использовать дополнительные лексеры и стили из отдельно установленных пакетов. Подробнее об этом см. в :doc:`/guides/creating-and-discovering-plugins`.
ta: செருகுநிரல்களை ஏற்ற பயன்பாடுகள் நுழைவு புள்ளிகளைப் பயன்படுத்தலாம்; எ.கா. பைக்மென்ட்ச் (ஒரு தொடரியல் சிறப்பம்சமாக கருவி) தனித்தனியாக நிறுவப்பட்ட தொகுப்புகளிலிருந்து கூடுதல் லெக்சர்கள் மற்றும் பாணிகளைப் பயன்படுத்தலாம். இதைப் பற்றி மேலும் அறிய, காண்க: DOC: `/வழிகாட்டிகள்/உருவாக்குதல் மற்றும் கண்டுபிடித்தல்-பிளகின்ச்`.

source: The entry point file format was originally developed to allow packages built with setuptools to provide integration point metadata that would be read at runtime with :py:mod:`importlib.metadata`. It is now defined as a PyPA interoperability specification in order to allow build tools other than ``setuptools`` to publish :py:mod:`importlib.metadata` compatible entry point metadata, and runtime libraries other than :py:mod:`importlib.metadata` to portably read published entry point metadata (potentially with different caching and conflict resolution strategies).
ja: エントリポイントのファイルフォーマットは、元々は、 setuptools でビルドされたパッケージが、動作時 (ランタイム) に :py:mod:`importlib.metadata` で読み取られるであろうと思われるインテグレーションポイントメタデータを提供できるようにと開発されました。現在では、 ``setuptools`` 以外のビルドツールが :py:mod:`importlib.metadata` と互換性のあるエントリポイントのメタデータを公開し、 :py:mod:`importlib.metadata` 以外のランタイムライブラリが移植可能な形で公開されているエントリポイントのメタデータを (潜在的には、たとえ異なるキャッシングと衝突回避の戦略を採用していたとしても) 読み取ることができるようにと PyPA 相互互換性仕様において定義されています。
ru: Формат файла точки входа был первоначально разработан для того, чтобы пакеты, собранные с помощью setuptools, могли предоставлять метаданные точки интеграции, которые можно было бы прочитать во время выполнения с помощью :py:mod:`importlib. метаданные`. Теперь он определен как спецификация совместимости PyPA, чтобы позволить инструментам сборки, отличным от ``setuptools``, публиковать совместимые с :py:mod:`importlib.метаданные` метаданные точки входа, а библиотекам времени выполнения, отличным от :py:mod:`importlib. метаданные``, переносимо читать опубликованные метаданные точки входа (потенциально с различными стратегиями кэширования и разрешения конфликтов).
ta: இயக்க நேரத்தில் படிக்கப்படும் ஒருங்கிணைப்பு புள்ளி மெட்டாடேட்டாவை வழங்க செட்டுப்லூல்களுடன் கட்டப்பட்ட தொகுப்புகளை அனுமதிக்க நுழைவு புள்ளி கோப்பு வடிவம் முதலில் உருவாக்கப்பட்டது: PY: MOD: `INSPROMLIB.Metadata`. இது இப்போது ஒரு PYPA இயங்குதள விவரக்குறிப்பாக வரையறுக்கப்பட்டுள்ளது, வெளியிடுவதற்கு `` setuptools`` தவிர வேறு பல கருவிகளை அனுமதிக்க: py: mod: `importlib.metadata` இணக்கமான நுழைவு புள்ளி மேனிலை தரவு மற்றும் இயக்க நேர நூலகங்கள்: py: mod:` வெளியிடப்பட்ட நுழைவு புள்ளி மெட்டாடேட்டாவைப் படிக்க இறக்குமதி லிப்.

source: Data model
eo: Datena modelo
ja: データモデル
pt_br: Modelo de dados
ru: Модель данных
ta: தரவு மாதிரி

source: Conceptually, an entry point is defined by three required properties:
eo: Koncepte, enirpunkton difinas tri postulataj atributoj:
ja: 概念的に、エントリポイントは３個の属性を持たなければならないと定義されています:
pt_br: Conceitualmente, um ponto de entrada é definido por três propriedades necessárias:
ru: Концептуально точка входа определяется тремя необходимыми свойствами:
ta: கருத்தியல் ரீதியாக, ஒரு நுழைவு புள்ளி மூன்று தேவையான பண்புகளால் வரையறுக்கப்படுகிறது:

source: The **group** that an entry point belongs to indicates what sort of object it provides. For instance, the group ``console_scripts`` is for entry points referring to functions which can be used as a command, while ``pygments.styles`` is the group for classes defining pygments styles. The consumer typically defines the expected interface. To avoid clashes, consumers defining a new group should use names starting with a PyPI name owned by the consumer project, followed by ``.``. Group names must be one or more groups of letters, numbers and underscores, separated by dots (regex ``^\w+(\.\w+)*$``).
eo: La **grupo**, al kiu enirpunkto apartenas, indikas tian objekton, kian ĝi provizas. Ekzemple, la grupo ``console_scripts`` estas por enirpunkto al funkcio uzebla kiel komando, dum ``pygments.styles`` estas la grupo por klaso difinanta pygments-stilon. La konsumanto tipe difinas la atendatan interfacon. Por eviti konflikton, konsumanto difinanta novan grupon komencu nomon per nomo ĉe PyPI posedata de la konsumanta projekto sekvita de ``.``. Nomo de grupo devas konsisti el unu aŭ pluraj grupoj de literoj, ciferoj kaj substrekoj, apartigitaj de punktoj (laŭ la regula esprimo ``^\w+(\.\w+)*$``).
ja: エントリポイントが属する *group* は、それがどのような種類のオブジェクトを提供するのかを示します。例えば、 ``console_scripts`` グループはコマンドとして使える関数を参照するエントリポイント用であり、一方、 ``pygments.styles`` は pygments スタイルを定義するクラスを提供するグループです。利用する側 (コンシューマ) は、通常、期待するインタフェースを定義しています。衝突を避けるために、新しいグループを定義するのであればコンシューマは自身の PyPI での名前の後に ``.`` を後置したもので始まるグループ名を使うべきです。グループ名は、ひとつかそれ以上の文字・数字・アンダースコアをドット文字で区切ったもの (正規表現で ``^\w+(\.\w)*$``) でなければなりません。
pt_br: O **grupo** ao qual um ponto de entrada pertence indica que tipo de objeto ele fornece. Por exemplo, o grupo ``console_scripts`` é para pontos de entrada referentes a funções que podem ser usadas como um comando, enquanto ``pygments.styles`` é o grupo para classes que definem estilos de pigmentos. O consumidor normalmente define a interface esperada. Para evitar conflitos, os consumidores que definem um novo grupo devem usar nomes começando com um nome PyPI pertencente ao projeto do consumidor, seguido por ``.``. Os nomes dos grupos devem ser um ou mais grupos de letras, números e sublinhados, separados por pontos (regex ``^\w+(\.\w+)*$``).
ru: Группа **группа**, к которой принадлежит точка входа, указывает, какого рода объект она предоставляет. Например, группа ``console_scripts`` предназначена для точек входа, ссылающихся на функции, которые могут быть использованы в качестве команды, а ``pygments.styles`` - это группа для классов, определяющих стили pygments. Потребитель обычно определяет ожидаемый интерфейс. Чтобы избежать столкновений, потребители, определяющие новую группу, должны использовать имена, начинающиеся с имени PyPI, принадлежащего проекту-потребителю, за которым следует ``.``. Имена групп должны представлять собой одну или несколько групп букв, цифр и символов подчеркивания, разделенных точками (regex ``^\w+(\.\w+)*$``).
ta: ** குழு ** ஒரு நுழைவு புள்ளி சொந்தமானது என்பது எந்த வகையான பொருளை வழங்குகிறது என்பதைக் குறிக்கிறது. உதாரணமாக, `` கன்சோல்_ச்கிரிப்ட்ச்`` என்பது ஒரு கட்டளையாகப் பயன்படுத்தக்கூடிய செயல்பாடுகளைக் குறிக்கும் நுழைவு புள்ளிகளுக்கானது, அதே நேரத்தில் `` பைக்மென்ட்ச். நுகர்வோர் பொதுவாக எதிர்பார்த்த இடைமுகத்தை வரையறுக்கிறார்கள். மோதல்களைத் தவிர்ப்பதற்கு, ஒரு புதிய குழுவை வரையறுக்கும் நுகர்வோர் நுகர்வோர் திட்டத்திற்கு சொந்தமான PYPI பெயருடன் தொடங்கி பெயர்களைப் பயன்படுத்த வேண்டும், அதைத் தொடர்ந்து `` .``. குழு பெயர்கள் கடிதங்கள், எண்கள் மற்றும் அடிக்கோடிட்டுக் காட்டங்களின் ஒன்று அல்லது அதற்கு மேற்பட்ட குழுக்களாக இருக்க வேண்டும், அவை புள்ளிகளால் பிரிக்கப்படுகின்றன (regex ``^\ w+(\. \ W+)*$ ``).
