Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Contribute to this guide
eo: Kontribui al ĉi tiu gvidilo
ja: このガイド文書に貢献する
pt_br: Contribuir para este guia
ru: Внесите вклад в это руководство
ta: இந்த வழிகாட்டிக்கு பங்களிக்கவும்

source: The |PyPUG| welcomes contributors! There are lots of ways to help out, including:
eo: La |PyPUG| bonvenigas kontribuantojn! Jen kelke el multaj manieroj helpi nin:
ja: |PyPUG| は貢献者を歓迎します！さまざまな貢献方法があります。例えば:
pt_br: O |PyPUG| dá as boas-vindas aos(às) contribuidores(as)! Existem muitas maneiras de ajudar, incluindo:
ru: |PyPUG| приветствует участников! Существует множество способов нам помочь, в том числе:
ta: தி | பைபக் | பங்களிப்பாளர்களை வரவேற்கிறது! உட்பட உதவ நிறைய வழிகள் உள்ளன:

source: Reading the guide and giving feedback
eo: Legi la gvidilon kaj doni opiniojn pri ĝi
ja: このガイド文書を読んでフィードバックを伝える
pt_br: Lendo o guia e dando feedback
ru: Чтение руководства и предоставление обратной связи
ta: வழிகாட்டியைப் படித்து கருத்துக்களை வழங்குதல்

source: Reviewing new contributions
eo: Revizii novajn kontribuojn
ja: 新しい貢献内容を査読する
pt_br: Revisando novas contribuições
ru: Проверка новых вкладов
ta: புதிய பங்களிப்புகளை மதிப்பாய்வு செய்தல்

source: Revising existing content
eo: Poluri ekzistantan enhavon
ja: 既存の文書を修正する
pt_br: Revisando conteúdo existente
ru: Пересмотр существующего материала
ta: இருக்கும் உள்ளடக்கத்தை திருத்துதல்

source: Writing new content
eo: Verki novan enhavon
ja: 新しく文書を書くこと
pt_br: Escrevendo novo conteúdo
ru: Написание нового материала
ta: புதிய உள்ளடக்கத்தை எழுதுதல்

source: Most of the work on the |PyPUG| takes place on the `project's GitHub repository`__. To get started, check out the list of `open issues`__ and `pull requests`__. If you're planning to write or edit the guide, please read the :ref:`style guide <contributing_style_guide>`.
eo: La plejparto e la laboro pri |PyPUG| okazas ĉe `la GitHub-deponejo de la projekto <project's GitHub repository>`__. Por eki, vidu la liston de `nesolvitaj cimoj <open issues>`__ kaj `tirpetoj <pull requests>`__. Se vi planas verki aŭ redakti la gvidilon, bonvolu legi la :ref:`gvidilon pri stilo <contributing_style_guide>`.
ja: |PyPUG| のほとんどの作業は `プロジェクトのGitHubリポジトリ <project's GitHub repository>`__ で行われます。手始めに `未解決の問題 <open issues>`__ のリストをチェックアウトして(改善策の) `プルリクエスト <pull requests>`__ を送ってください。もしあなたがこのガイドに何かを書き加えたり編集したりするつもりなら、:ref:`スタイルガイド <contributing_style_guide>`__ を読みましょう。
pt_br: A maior parte do trabalho no |PyPUG| ocorre no `repositório GitHub do projeto`__. Para começar, verifique a lista de `issues abertos`__ e `pull requests`__. Se você está planejando escrever ou editar o guia, leia o :ref:`guia de estilo <contributing_style_guide>`.
ru: Большая часть работы над |PyPUG| происходит на «проектном хранилище GitHub`__. Чтобы начать, проверьте список `open issues`__ и `pull requests`__. Если вы планируете писать или редактировать руководство, пожалуйста, прочитайте :ref:`style guide <contributing_style_guide>`.
ta: | பைபக் | இல் பெரும்பாலான வேலைகள் `திட்டத்தின் அறிவிலிமையம் களஞ்சியத்தில்`. தொடங்குவதற்கு, `திறந்த சிக்கல்கள்`__ மற்றும்` கோரிக்கைகளை இழுக்கவும்` __ இன் பட்டியலைப் பாருங்கள். வழிகாட்டியை எழுதவோ திருத்தவோ நீங்கள் திட்டமிட்டால், தயவுசெய்து படிக்கவும்: குறிப்பு: `பாணி வழிகாட்டி <பங்களிப்பு_ச்டைல்_கூட்>`.

source: By contributing to the |PyPUG|, you're expected to follow the PSF's `Code of Conduct`__.
eo: Kontribuante al |PyPUG|, vi devas observi la `Kondutkodon <Code of Conduct>`__ de PSF.
ja: |PyPUG|に貢献を行うのであれば、あなたがPSFの `行動規範 <Code of Conduct>`__ に従うことが期待されています。
pt_br: Ao contribuir para o |PyPUG|, espera-se que você siga o `Código de Conduta`__ da PSF.
ru: Внося свой вклад в |PyPUG|, вы должны следовать `Нормам поведения <Code of Conduct>`__ PSF.
ta: | பைபக் |

source: Documentation types
eo: Tipoj de dokumentaro
ja: 文書の類型
pt_br: Tipos de documentação
ru: Типы документации
ta: ஆவணப்படுத்தல் வகைகள்

source: This project consists of four distinct documentation types with specific purposes. The project aspires to follow the `Diátaxis process`_ for creating quality documentation. When proposing new additions to the project please pick the appropriate documentation type.
eo: Ĉi tiu projekto konsistas el kvar malsamaj dokumentaj specoj por specifaj celoj. La projekto celas sekvi `la procezon Diátaxis <Diátaxis process>`_ por verki kvalitan dokumentaron. Kiam vi proponas novajn aldonojn al la projekto, bonvolu elekti la taŭgan dokumentan specon.
ja: 本プロジェクトは、特定の目的に合わせた四つの別個の文書類型で成り立っています。本プロジェクトでは、文書化の品質向上のために `ディアタクシスプロセス <Diátaxis process>` に従うことを強く希望します。新たに追加することを提案する場合には、いずれかの適切な文書類型を選択してください。
pt_br: Este projeto consiste em quatro tipos de documentação distintos com finalidades específicas. O projeto aspira seguir a o `processo Diátaxis`_ para criar documentação de qualidade. Ao propor novas adições ao projeto, escolha o tipo de documentação apropriado.
ru: Этот проект состоит из четырех различных типов документации с конкретными целями. Проект стремится следовать «процессу Diátaxis» для создания качественной документации. При предложении новых дополнений к проекту, пожалуйста, выберите соответствующий тип документации.
ta: இந்த திட்டம் குறிப்பிட்ட நோக்கங்களுடன் நான்கு தனித்துவமான ஆவணப்படுத்தல் வகைகளைக் கொண்டுள்ளது. தரமான ஆவணங்களை உருவாக்குவதற்கு `டியடாக்சிச் செயல்முறை`_ ஐப் பின்பற்ற இந்த திட்டம் விரும்புகிறது. திட்டத்தில் புதிய சேர்த்தல்களை முன்மொழியும்போது பொருத்தமான ஆவணப்படுத்தல் வகையைத் தேர்ந்தெடுக்கவும்.

source: Tutorials
eo: Lerniloj
ja: チュートリアル型文書
pt_br: Tutoriais
ru: Учебники
ta: பயிற்சிகள்

source: Tutorials are focused on teaching the reader new concepts by accomplishing a goal. They are opinionated step-by-step guides. They do not include extraneous warnings or information. `example tutorial-style document`_.
eo: Lernilo fokusiĝas pri instruado de la leganto pri novaj konceptoj per efektivigado de iu celo. Lernilo estas opinihava, paŝon-post-paŝa dokumento. Ĝi ne inkluzivas negravajn avertojn aŭ informojn. `ekzempla lernileca dokumento <example tutorial-style document>`_.
ja: チュートリアルは目標を達成することで読者に新しい概念を教えることに注力しています。こうするべきだという意見に従ったステップバイステップのガイドになっています。大筋に無関係な警告や情報は省略されています。`チュートリアル型文書の例 <example tutorial-style document>`_.
pt_br: Os tutoriais são focados em ensinar ao leitor novos conceitos através da realização de um objetivo. Eles são guias passo a passo opinativos. Eles não incluem avisos ou informações estranhas. `Exemplo de documento no estilo tutorial`_.
ru: Учебники нацелены на обучение читателя новым понятиям путем достижения цели. Они представляют собой пошаговые руководства, основанные на мнениях. Они не содержат лишних предупреждений или информации. `Пример документа в стиле учебника`_.
ta: பயிற்சிகள் ஒரு இலக்கை அடைவதன் மூலம் வாசகருக்கு புதிய கருத்துக்களை கற்பிப்பதில் கவனம் செலுத்துகின்றன. அவர்கள் படிப்படியான வழிகாட்டிகளாக கருதப்படுகிறார்கள். அவை வெளிப்புற எச்சரிக்கைகள் அல்லது தகவல்களைக் கொண்டிருக்கவில்லை. `எடுத்துக்காட்டு பயிற்சி-பாணி ஆவணம்`_.

source: Guides
eo: Gvidiloj
ja: ガイド型文書
pt_br: Guias
ru: Руководства
ta: வழிகாட்டிகள்

source: Guides are focused on accomplishing a specific task and can assume some level of pre-requisite knowledge. These are similar to tutorials, but have a narrow and clear focus and can provide lots of caveats and additional information as needed. They may also discuss multiple approaches to accomplishing the task. :doc:`example guide-style document <guides/packaging-namespace-packages>`.
eo: Gvidiloj estas por plenumi specifan taskon kaj povas supozi iun nivelon de scio. Tiuj similas al lerniloj sed havas mallarĝan kaj klaran fokuson kaj povas disponigi multajn avertojn kaj kromajn informojn laŭbezone. Ili ankaŭ povas diskuti plurajn metodojn por unu tasko. :doc:`ekzempla gvidila dokumento <guides/packaging-namespace-packages>`.
ja: ガイドは特定のタスクを達成することに力点を置いていて、前提となる知識のレベルをある程度仮定することができます。ガイドはチュートリアルと似ていますが、しかしガイドはもっと狭い分野に明確に焦点を当てるものであり、必要に応じて多数の注意書きを行ったり追加的な情報を盛り込んだりすることができます。ガイドでは、そのタスクを達成するための複数のやり方を議論することもできます。:doc:`ガイド型文書の例 <guides/packaging-namespace-packages>`.
pt_br: Os guias são focados em realizar uma tarefa específica e podem assumir algum nível de conhecimento pré-requisito. Eles são semelhantes aos tutoriais, mas têm um foco estreito e claro e podem fornecer muitas advertências e informações adicionais, conforme necessário. Eles também podem discutir várias abordagens para realizar a tarefa. :doc:`Exemplo de documento no estilo guia <guides/packaging-namespace-packages>`.
ru: Руководства ориентированы на выполнение конкретной задачи и могут предполагать наличие определенного уровня предварительных знаний. Они похожи на учебники, но имеют узкую и четкую направленность и могут содержать много предостережений и дополнительной информации, если это необходимо. В них также может обсуждаться несколько подходов к выполнению задачи. :doc:`пример документа в стиле руководства <guides/packaging-namespace-packages>`.
ta: வழிகாட்டிகள் ஒரு குறிப்பிட்ட பணியை நிறைவேற்றுவதில் கவனம் செலுத்துகின்றன, மேலும் அவை முன்நிபந்தனைக்கு முந்தைய அறிவை எடுத்துக் கொள்ளலாம். இவை பயிற்சிகளைப் போன்றவை, ஆனால் ஒரு குறுகிய மற்றும் தெளிவான கவனம் செலுத்துகின்றன, மேலும் தேவைக்கேற்ப நிறைய எச்சரிக்கைகள் மற்றும் கூடுதல் தகவல்களை வழங்க முடியும். பணியை நிறைவேற்றுவதற்கான பல அணுகுமுறைகளையும் அவர்கள் விவாதிக்கலாம். .

source: Discussions
eo: Diskutoj
ja: 議論型文書
pt_br: Discussões
ru: Обсуждения
ta: விவாதங்கள்

source: Discussions are focused on understanding and information. These explore a specific topic without a specific goal in mind. :doc:`example discussion-style document <discussions/install-requires-vs-requirements>`.
eo: Diskutoj estas por komprenado kaj informado. Tiuj esploras specifan temon sen specifa celo. :doc:`ekzempla diskuta dokumento <discussions/install-requires-vs-requirements>`.
ja: 議論型文書では、理解促進と情報提供に重点を置きます。議論型文書では、特定のゴールを念頭に置くことなく、ある特定の話題について深く探求します。:doc:`議論型文書の例 <discussions/install-requires-vs-requirements>`.
pt_br: As discussões são focadas em compreensão e informação. Eles exploram um tópico específico sem um objetivo específico em mente. :doc:`Exemplo de documento no estilo discussão <discussions/install-requires-vs-requirements>`.
ru: Дискуссии нацелены на понимание и получение информации. В них изучается конкретная тема без определенной цели. :doc:`пример документа в стиле дискуссии <discussions/install-requires-vs-requirements>`.
ta: புரிந்துகொள்ளுதல் மற்றும் தகவல்களில் விவாதங்கள் கவனம் செலுத்துகின்றன. இவை ஒரு குறிப்பிட்ட இலக்கை மனதில் கொண்டு ஒரு குறிப்பிட்ட தலைப்பை ஆராய்கின்றன. .

source: Specifications
eo: Specifiloj
ja: 仕様型文書
pt_br: Especificações
ru: Спецификации
ta: விவரக்குறிப்புகள்

source: Specifications are reference documentation focused on comprehensively documenting an agreed-upon interface for interoperability between packaging tools. :doc:`example specification-style document <specifications/core-metadata>`.
eo: Specifoj estas referenca dokumentaro por plene priskribi interkonsentitan interfacon por kongrueco inter iloj pri pakado. :doc:`ekzempla specifo-dokumento <specifications/core-metadata>`.
ja: 仕様型文書は、パッケージングツール間で相互運用のためのインターフェイスとして合意された事項について網羅的に文書化することに重点を置く参照用の文書です。:doc:`仕様型文書の例 <specifications/core-metadata>`.
pt_br: As especificações são documentação de referência focada na documentação abrangente de uma interface acordada para interoperabilidade entre ferramentas de empacotamento. :doc:`Exemplo de documento no estilo especificação <specifications/core-metadata>`.
ru: Спецификации - это справочная документация, сосредоточенная на всестороннем документировании согласованного интерфейса для взаимодействия между упаковочными инструментами. :doc:`example Specification-style document <specifications/core-metadata>`.
ta: விவரக்குறிப்புகள் என்பது பேக்கேசிங் கருவிகளுக்கு இடையில் இயங்குதலுக்காக ஒப்புக் கொள்ளப்பட்ட இடைமுகத்தை விரிவாக ஆவணப்படுத்துவதில் கவனம் செலுத்தும் குறிப்பு ஆவணங்கள் ஆகும். : டாக்: `எடுத்துக்காட்டு விவரக்குறிப்பு-பாணி ஆவணம் <விவரக்குறிப்புகள்/கோர்-மெட்டாடேட்டா>`.

source: Translations
eo: Tradukoj
ja: 翻訳
pt_br: Traduções
ru: Переводы
ta: மொழிபெயர்ப்புகள்

source: We use `Weblate`_ to manage translations of this project. Please visit the `packaging.python.org`_ project on Weblate to contribute.
eo: Ni uzas `Weblate`_ por administri tradukadon de ĉi tiu projekto. Bonvolu viziti la projekton `packaging.python.org`_ ĉe Weblate por kontribui.
ja: 我々は本プロジェクトの翻訳を管理するために `Weblate`_ を使用しています。 翻訳で貢献するには、Weblate上の`packaging.python.org`_ プロジェクトをご覧ください。
pt_br: Usamos `Weblate`_ para gerenciar as traduções deste projeto. Visite o projeto `packaging.python.org`_ no Weblate para contribuir.
ru: Для управления переводами этого проекта мы используем `Weblate`_. Пожалуйста, посетите проект `packaging.python.org`_ на Weblate для участия в переводе.
ta: இந்த திட்டத்தின் மொழிபெயர்ப்புகளை நிர்வகிக்க `வெப்லேட்`_ ஐப் பயன்படுத்துகிறோம். பங்களிக்க வெப்லேட்டில் உள்ள `பேக்கேசிங்.பிதான்.ஆர்ச்`_ திட்டத்தைப் பார்வையிடவும்.

source: If you are experiencing issues while you are working on translations, please open an issue on `GitHub`_.
eo: Se vi spertas problemojn dum tradukado, bonvolu raporti cimon ĉe `GitHub`_.
ja: 翻訳作業中になにか問題を感じたら、`GitHub`_ で issue を新規登録してください。
pt_br: Se você está tendo problemas enquanto trabalha nas traduções, relate o problema no `GitHub`_.
ru: Если у вас возникли проблемы во время работы над переводами, откройте вопрос (issue) на `Github`_.
ta: நீங்கள் மொழிபெயர்ப்புகளில் பணிபுரியும் போது சிக்கல்களைச் சந்திக்கிறீர்கள் என்றால், தயவுசெய்து `github`_ இல் ஒரு சிக்கலைத் திறக்கவும்.

source: Any translations of this project should follow `reStructuredText syntax`_.
eo: Traduko de ĉi tiu projekto devas sekvi `la sintakson reStructuredText <reStructuredText syntax>`_.
ja: 本プロジェクトの翻訳はすべて、 `reStructuredText 文法 <reStructuredText syntax>`_ に従わなければなりません。
pt_br: Qualquer tradução deste projeto deve seguir a `sintaxe reStructuredText`_.
ru: Любые переводы этого проекта должны соответствовать `reStructuredText syntax`_.
ta: இந்த திட்டத்தின் எந்த மொழிபெயர்ப்புகளும் `மறுசீரமைப்பு டெக்ச்ட் தொடரியல்`_ ஐப் பின்பற்ற வேண்டும்.

source: Adding a language
eo: Aldoni lingvon
ja: 言語を追加する
pt_br: Adicionando um idioma
ru: Добавление языка
ta: ஒரு மொழியைச் சேர்ப்பது

source: If your language is not listed on `packaging.python.org`_, click the button :guilabel:`Start new translation` at the bottom of the language list and add the language you want to translate.
eo: Se via lingvo ne estas listigita en `packaging.python.org`_, alklaku la butonon :guilabel:`Start new translation` ĉe la malsupro de la listo de lingvoj, kaj aldonu la lingvon al kiu vi volas traduki.
ja: もしあなたの使う言語が `packaging.python.org`_ のリストに掲載されていなければ、言語一覧の下にある :guilabel:`新しい翻訳を始める <Start new translation>` ボタンをクリックして、あなたが翻訳したい言語を追加してください。
pt_br: Se o seu idioma não estiver listado em `packaging.python.org`_, clique no botão :guilabel:`Iniciar nova tradução` na parte inferior da lista de idiomas e adicione o idioma que deseja traduzir.
ru: Если ваш язык не указан на «упаковке». python.org`_, нажмите кнопку :guilabel: «Начните новый перевод» внизу языкового списка и добавьте язык, который вы хотите перевести.
ta: உங்கள் மொழி `பேக்கேசிங்.பிதான்.ஆர்ச்`_ இல் பட்டியலிடப்படவில்லை என்றால், பொத்தானைக் சொடுக்கு செய்க: கிலாபெல்:` மொழி பட்டியலின் கீழே புதிய மொழிபெயர்ப்பைத் தொடங்கவும், நீங்கள் மொழிபெயர்க்க விரும்பும் மொழியைச் சேர்க்கவும்.

source: Following reStructuredText syntax
eo: Sekvi la sintakson reStructuredText
ja: reStructuredText文法に従う
pt_br: Seguindo a sintaxe reStructuredText
ru: После Текстовый синтаксис
ta: மறுசீரமைப்பின் தொடரியல் தொடரியல்

source: If you are not familiar with reStructuredText (RST) syntax, please read `this guide`_ before translating on Weblate.
eo: Se vi ne bone scias la sintakson reStructuredText (RST), bonvolu legi `ĉi tiun gvidilon <this guide>`_ antaŭ ol ektraduki ĉe Weblate.
ja: もしあなたがreStructuredText(RST)の書き方に慣れていないのであれば、Weblateで翻訳作業をする前に `このガイド <this guide>`_ を読んでください。
pt_br: Se você não está familiarizado com a sintaxe reStructuredText (RST), leia `este guia`_ antes de traduzir no Weblate.
ru: Если вы не знакомы с с синтаксисом reStructuredText (RST), пожалуйста, прочитайте «это руководство» перед переводом на Weblate.
ta: மறுசீரமைப்பு (RST) தொடரியல் உங்களுக்கு தெரிந்திருக்கவில்லை என்றால், வெப்லேட்டில் மொழிபெயர்ப்பதற்கு முன் `இந்த வழிகாட்டி`_ ஐப் படிக்கவும்.

source: **Do not translate the text in reference directly**
eo: **Ne traduku tekston en referenco rekte**
ja: **参照リンクのテキストをそのまま翻訳することはやめてください**
pt_br: **Não traduza o texto em referências diretamente**
ru: **Не переводите текст в ссылке напрямую**
ta: ** உரையை நேரடியாக மொழிபெயர்க்க வேண்டாம் **

source: When translating the text in reference, please do not translate them directly.
eo: Kiam vi tradukas tekston en referenco, bonvolu ne traduki ĝin rekte.
ja: 参照リンクのテキストを翻訳する時、単純に翻訳文で置き換えることはやめて下さい。
pt_br: Ao traduzir o texto em referências, não os traduza diretamente.
ru: При переводе текста ссылки, пожалуйста, не переводите его напрямую.
ta: உரையை குறிப்பில் மொழிபெயர்க்கும்போது, அவற்றை நேரடியாக மொழிபெயர்க்க வேண்டாம்.

source: Wrong: Translate the following text directly:
eo: Malĝuste: Traduki la jenon rekte:
ja: 誤: 次のテキストを単純に翻訳する:
pt_br: Errado: traduzir o texto a seguir diretamente:
ru: Неправильно: Переведить следующий текст напрямую:
ta: தவறு: பின்வரும் உரையை நேரடியாக மொழிபெயர்க்கவும்:

source: Right: Translate the following text with your own language and add the original reference:
eo: Ĝuste: Traduki la jenan tekston al via propra lingvo kaj aldoni la originalan referencon:
ja: 正: 次のテキストをあなた自身の言語に翻訳して、さらに元の参照リンクを残す:
pt_br: Correto: traduzir o texto a seguir em seu próprio idioma e adicionar a referência original:
ru: Правильно: Переведить следующий текст на свой язык и добавить оригинальную ссылку:
ta: வலது: பின்வரும் உரையை உங்கள் சொந்த மொழியுடன் மொழிபெயர்த்து அசல் குறிப்பைச் சேர்க்கவும்:

source: Building the guide locally
eo: Konstrui la gvidilon loke
ja: この文書を手元でビルドするには
pt_br: Construindo o guia localmente
ru: Локальная сборка руководства
ta: வழிகாட்டியை உள்நாட்டில் உருவாக்குதல்

source: Though not required to contribute, it may be useful to build this guide locally in order to test your changes. In order to build this guide locally, you'll need:
eo: Kvankam tio ne necesas por kontribui, estas utile konstrui ĉi tiun gvidilon loke por elprovi viajn ŝanĝojn. Por konstrui ĉi tiun gvidilon loke, vi bezonos la jenon:
ja: 貢献寄与をするために必須というわけではありませんが、この文書を手元でビルドすることはあなたが行った変更をテストするのに役に立ちます。この文書を手元でビルドするには：
pt_br: Embora não seja necessário contribuir, pode ser útil construir este guia localmente para testar suas alterações. Para construir este guia localmente, você precisará:
ru: Хотя это не требуется для внесения вклада, может быть полезно построить это руководство на местном уровне, чтобы проверить ваши изменения. Чтобы построить это руководство на местном уровне, вам нужно:
ta: பங்களிக்கத் தேவையில்லை என்றாலும், உங்கள் மாற்றங்களைச் சோதிக்க இந்த வழிகாட்டியை உள்நாட்டில் உருவாக்குவது பயனுள்ளதாக இருக்கும். இந்த வழிகாட்டியை உள்ளூரில் உருவாக்க, உங்களுக்குத் தேவை:

source: :doc:`Nox <nox:index>`. You can install or upgrade nox using ``pip``:
eo: :doc:`Nox <nox:index>`. Vi povas instali aŭ ĝisdatigi nox per ``pip``:
ja: :doc:`Nox <nox:index>` 。 ``pip`` を用いてnoxをインストールまたはアップグレードできます:
pt_br: :doc:`Nox <nox:index>`. Você pode instalar ou atualizar o nox usando o ``pip``:
ru: :doc:`Nox <nox:index>`. Вы можете установить или обновить nox с помощью ``pip``:
ta: : டாக்: `NOX <NOX: INDEX>`. `` பிப்`` ஐப் பயன்படுத்தி நீங்கள் NOX ஐ நிறுவலாம் அல்லது மேம்படுத்தலாம்:

source: Python 3.11. Our build scripts are usually tested with Python 3.11 only. See the :doc:`Hitchhiker's Guide to Python installation instructions <python-guide:starting/installation>` to install Python 3.11 on your operating system.
eo: Python 3.11. Niaj konstruaj programetoj estas ordinare testata nur per Python 3.11. Vidu :doc:`Hitchhiker's Guide to Python installation instructions <python-guide:starting/installation>` por instali Python 3.11 sur via mastruma sistemo.
ja: Python 3.11。我々のビルドスクリプトは、通常、Python 3.11でのみ試験されている。あなたの使っているOSにPython 3.11をインストールする方法については、 :doc:`Python のインストール指南のためのヒッチハッカーズガイド <python-guide:starting/installation>` を見てほしい。
pt_br: Python 3.11. Nossos scripts de construção são geralmente testados com Python 3.11. Consulte o :doc:`Guia do mochileiro para as instruções de instalação do Python <python-guide:starting/installation>` para instalar o Python 3.11 em seu sistema operacional.
ru: Python 3.11. Наши сценарии создания обычно тестируются только с Python 3.11. См. :doc:`Hitchhiker's Guide to Pythoninstall instructions <python-guide:starting/installation>` для установки Python 3.11 на вашей операционной системе.
ta: பைதான் 3.11. எங்கள் உருவாக்க ச்கிரிப்ட்கள் பொதுவாக பைதான் 3.11 உடன் மட்டுமே சோதிக்கப்படுகின்றன. பார்க்க: டாக்: `பைதான் நிறுவல் வழிமுறைகளுக்கான இட்சிகரின் வழிகாட்டி <பைதான்-வழிகாட்டி: தொடக்க/நிறுவல்>` உங்கள் இயக்க முறைமையில் பைதான் 3.11 ஐ நிறுவ.

source: To build the guide, run the following shell command in the project's root folder:
eo: Por konstrui la gvidilon, rulu la jenan konzolan komandon ĉe la radika dosierujo de la projekto:
ja: この文書をビルドするには、以下のシェルコマンドをプロジェクトのルートディレクトリで実行してください:
pt_br: Para construir o guia, execute o seguinte comando shell na pasta raiz do projeto:
ru: Для сборки руководства выполните следующую команду shell в корневом каталоге проекта:
ta: வழிகாட்டியை உருவாக்க, திட்டத்தின் ரூட் கோப்புறையில் பின்வரும் செல் கட்டளையை இயக்கவும்:

source: After the process has completed you can find the HTML output in the ``./build/html`` directory. You can open the ``index.html`` file to view the guide in web browser, but it's recommended to serve the guide using an HTTP server.
eo: Post fino de la procezo, vi povas trovi la HTML-eligaĵon en la dosierujo ``./build/html``. Vi povas malfermi la dosieron ``index.html`` por rigardi la gvidilon en TTT-legilo, sed estas rekomendate servi la gvidilon per HTTP-servilo.
ja: 処理が終わると、``./build/html`` の下にHTMLの出力ファイルが見つかるはずです。ここの ``index.html`` をブラウザで開くことでこの文書を閲覧することができますが、HTTPサーバを使って文書を提供する方がお勧めです。
pt_br: Após a conclusão do processo, você pode encontrar a saída HTML no diretório ``./build/html``. Você pode abrir o arquivo ``index.html`` para ver o guia no navegador web, mas é recomendado servir o guia usando um servidor HTTP.
ru: После завершения процесса вы можете найти выход HTML в каталоге ``./build/html``. Вы можете открыть файл ``index.html`` для просмотра руководства в веб-браузере, но рекомендуется обслуживать руководство с помощью сервера HTTP.
ta: செயல்முறை முடிந்ததும் நீங்கள் உஉகுமொ வெளியீட்டை ``./பில்ட்/HTML`` கோப்பகத்தில் காணலாம். வலை உலாவியில் வழிகாட்டியைக் காண நீங்கள் `` index.html`` கோப்பைத் திறக்கலாம், ஆனால் HTTP சேவையகத்தைப் பயன்படுத்தி வழிகாட்டியை வழங்க பரிந்துரைக்கப்படுகிறது.

source: You can build the guide and serve it via an HTTP server using the following command:
eo: Vi povas konstrui la gvidilon kaj servi ĝin per HTTP-servilo uzante la jenan komandon:
ja: HTTPサーバを用いてこの文書を提供するには、以下のコマンドを使います。:
pt_br: Você pode construir o guia e exibi-lo por meio de um servidor HTTP usando o seguinte comando:
ru: Вы можете собрать руководство и обслуживать его через сервер HTTP, используя следующую команду:
ta: நீங்கள் வழிகாட்டியை உருவாக்கி பின்வரும் கட்டளையைப் பயன்படுத்தி ஒரு HTTP சேவையகம் வழியாக பணி செய்யலாம்:

source: The guide will be browsable via http://localhost:8000.
eo: La gvidilo estos legebla ĉe http://localhost:8000.
ja: この文書は、 http://localhost:8000 から閲覧できます。
pt_br: O guia poderá ser navegado em http://localhost:8000.
ru: Руководство будет доступно для просмотра по адресу http://localhost:8000.
ta: வழிகாட்டி http: // localhost: 8000 வழியாக உலாவக்கூடியதாக இருக்கும்.

source: Where the guide is deployed
eo: Kie la gvidilo disponiĝas
ja: この文書が展開される場所
pt_br: Onde o guia é disponibilizado
ru: Где развёрнуто руководство
ta: வழிகாட்டி பயன்படுத்தப்படும் இடத்தில்
