Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: In the built wheel, with :file:`/` being the root of the archive and ``{VERSION}`` as the previous, the license files would be stored at:
eo: En la konstruita wheel, kun :file:`/` kiel la radiko de la arĥivo kaj ``{VERSION}`` sama kiel la ĉi-supra ekzemplo, la licenco-dosieroj troviĝus ĉe:
ja: ビルド済みの wheel では、 :file:`/` をルートディレクトリとし、 ``{VERSION}`` を先述の通りとして、ライセンスファイル群は次の場所に保存されるでしょう:
ru: В собранном колесе, где :file:`/` является корнем архива, а ``{VERSION}`` - предыдущей, файлы лицензии будут храниться по адресу:
ta: கட்டப்பட்ட சக்கரத்தில், உடன்: கோப்பு: `/` காப்பகத்தின் வேர் மற்றும் `` {VERSION} `` முந்தையதைப் போல, உரிமக் கோப்புகள் சேமிக்கப்படும்:

source: Finally, in the installed project, with :file:`site-packages/` being the site dir and ``{VERSION}`` as the previous, the license files would be installed to:
eo: Fine, en la instalita projekto en :file:`site-packages/`, kun ``{VERSION}`` sama kiel la ĉi-supra ekzemplo, la licenco-dosieroj instaliĝus al:
ja: 最後に、インストールされたプロジェクトでは、 :file:`site-packages/` をサイトディレクトリとし、 ``{VERSION}`` を先述の通りとして、ライセンスファイル群は次の場所にインストールされるでしょう:
ru: Наконец, в установленном проекте, где :file:`site-packages/` является диром сайта, а ``{VERSION}`` - предыдущей версией, файлы лицензии будут установлены в:
ta: இறுதியாக, நிறுவப்பட்ட திட்டத்தில், உடன்: கோப்பு: `தள-பேக்கேச்கள்/` தள அடைவு மற்றும் `` {VERSION} `` முந்தையதைப் போல, உரிமக் கோப்புகள் நிறுவப்படும்:

source: Expression examples
eo: Ekzemploj de esprimoj
ja: 表現 <Expression> の例
ru: Примеры выражений
ta: வெளிப்பாடு எடுத்துக்காட்டுகள்

source: Some additional examples of valid ``License-Expression`` values:
eo: Kelkaj pliaj ekzemploj de validaj valoroj de ``License-Expression``:
ja: いくつかの追加の ``License-Expression`` の正当な値の例:
ru: Некоторые дополнительные примеры допустимых значений ``License-Expression``:
ta: செல்லுபடியாகும் `` உரிம-வெளிப்பாடு`` மதிப்புகளின் சில கூடுதல் எடுத்துக்காட்டுகள்:

source: User Scenarios
eo: Uzkazoj
ja: ユーザシナリオ
ru: Пользовательские сценарии
ta: பயனர் காட்சிகள்

source: The following covers the range of common use cases from a user perspective, providing guidance for each. Do note that the following should **not** be considered legal advice, and readers should consult a licensed legal practitioner in their jurisdiction if they are unsure about the specifics for their situation.
ja: 以下では、それぞれにガイダンスを提供しながら、ユーザ視点からのよくあるユースケースをカバーします。以下に述べることを法律上の推奨事項であると見做すべきでは **ない** ことを銘記するとともに、読者は、それぞれの状況に応じた細部について確信を持てないならば、それを法律上の管轄範囲とするライセンスを持った法律実務家に相談するべきす。
ru: Ниже рассматривается ряд распространенных случаев использования с точки зрения пользователя и даются рекомендации по каждому из них. Обратите внимание, что нижеследующее **не** должно рассматриваться как юридическая консультация, и читатели должны проконсультироваться с лицензированным юристом в своей юрисдикции, если они не уверены в специфике своей ситуации.
ta: பின்வருபவை பயனர் கண்ணோட்டத்தில் பொதுவான பயன்பாட்டு நிகழ்வுகளின் வரம்பை உள்ளடக்கியது, ஒவ்வொன்றிற்கும் வழிகாட்டுதலை வழங்குகிறது. பின்வருபவை சட்ட ஆலோசனையாக கருதப்படக்கூடாது என்பதை நினைவில் கொள்க, மேலும் வாசகர்கள் தங்கள் நிலைமைக்கான பிரத்தியேகங்களைப் பற்றி உறுதியாக தெரியாவிட்டால், உரிமம் பெற்ற சட்ட பயிற்சியாளரை தங்கள் அதிகார வரம்பில் அணுக வேண்டும்.

source: I have a private package that won't be distributed
eo: Mi havas ne distribuotan privatan pakon
ja: 配布するつもりのないプライベートなパッケージがあります
ru: У меня есть частный пакет, который не будет распространяться
ta: என்னிடம் ஒரு தனியார் தொகுப்பு உள்ளது, அது விநியோகிக்கப்படாது

source: If your package isn't shared publicly, i.e. outside your company, organization or household, it *usually* isn't strictly necessary to include a formal license, so you wouldn't necessarily have to do anything extra here.
eo: Se via pako ne estas havebla publike (ekster via firmao, organizaĵo aŭ familio), *ordinare* ne necesas inkluzivi formalan licencon, tiel ke vi ne devas fari ion ekstre.
ja: そのパッケージが、例えば会社や組織あるいは家庭の外に公開・共有されていないなら、 *通常は* 厳格に公式のライセンス (ファイル) を含める必要があるわけではありませんし、だからここで何か追加の作業をする必要があるわけではないでしょう。
ru: Если ваш пакет не будет распространяться публично, то есть за пределами вашей компании, организации или домохозяйства, то *обычно* нет необходимости включать официальную лицензию, так что вам не придется делать здесь ничего лишнего.
ta: உங்கள் தொகுப்பு பகிரங்கமாக பகிரப்படாவிட்டால், அதாவது உங்கள் நிறுவனம், அமைப்பு அல்லது வீட்டுக்கு வெளியே, இது * வழக்கமாக * முறையான உரிமத்தை சேர்க்க கண்டிப்பாக அவசியமில்லை, எனவே நீங்கள் இங்கே கூடுதல் எதையும் செய்ய வேண்டிய அவசியமில்லை.

source: However, it is still a good idea to include ``LicenseRef-Proprietary`` as a license expression in your package configuration, and/or a copyright statement and any legal notices in a :file:`LICENSE.txt` file in the root of your project directory, which will be automatically included by packaging tools.
ja: しかしながら、それでも、パッケージングツール群によって自動的に取り込まれるであろうプロジェクトのルートディレクトリの :file:`LICENSE.txt` ファイルの中に、パッケージの設定の中にライセンス条項として ``LicenseRef-Proprietary`` や著作権情報やその他の法的通知を含めておくことは良い考えです。
ru: Тем не менее, не лишним будет включить ``LicenseRef-Proprietary`` в качестве выражения лицензии в конфигурацию пакета, и/или заявление об авторских правах и любые юридические уведомления в файл :file:`LICENSE.txt` в корне каталога вашего проекта, который будет автоматически включен средствами упаковки.
ta: எவ்வாறாயினும், உங்கள் தொகுப்பு உள்ளமைவில் உரிம வெளிப்பாடாக `` உரிமம் பெறுதல்-தனியுரிமைக்குறி`, மற்றும்/அல்லது பதிப்புரிமை அறிக்கை மற்றும் ஒரு சட்ட அறிவிப்புகளை ஒரு: கோப்பு: `உரிமம். உங்கள் திட்ட அடைவு, இது தானாக பேக்கேசிங் கருவிகளால் சேர்க்கப்படும்.

source: I just want to share my own work without legal restrictions
eo: Mi simple volas disdoni mian verkon sen jura restrikto
ja: 自分の作品を法的制限なしに共有したいだけです
ru: Я просто хочу поделиться своими работами без юридических ограничений
ta: நான் எனது சொந்த வேலையை சட்டரீதியான கட்டுப்பாடுகள் இல்லாமல் பகிர்ந்து கொள்ள விரும்புகிறேன்

source: While you aren't required to include a license, if you don't, no one has `any permission to download, use or improve your work <dontchoosealicense_>`__, so that's probably the *opposite* of what you actually want. The `MIT license <chooseamitlicense_>`__ is a great choice instead, as it's simple, widely used and allows anyone to do whatever they want with your work (other than sue you, which you probably also don't want).
eo: Kvankam oni ne devas inkluzivi licencon, se licenco mankus, neniu rajtas `elŝuti, uzi aŭ plibonigi vian verkon <dontchoosealicense_>`__, kio estas verŝajne la malo de tio, kio vi deziras. La `licenco MIT <chooseamitlicense_>`__ estas bona elekto, ĉar ĝi estas simpla, vaste uzata kaj permesas al ĉiuj fari ion ajn deziratan pri via laboro (krom procesi kontraŭ vi, kion vi verŝajne ankaŭ ne deziras).
ja: ライセンスを含めておくように要求されてはいない一方で、含めておかなければ皆が `その作品のダウンロード、使用、または改良の許可なし <dontchoosealicense_>`__ の状態になりますが、それは多分、作者が実際に望んでいることとは *真逆* のことでしょう。 `MIT ライセンス <chooseamitlicense_>`__ は、簡明で広く使われており作品に対して誰でも (多分作者も望まないでしょうが、作者相手に訴訟を起こす以外の) どんなことでも許容するので、その代替として偉大な選択肢です。
ru: Хотя вы не обязаны включать лицензию, если вы ее не включите, ни у кого не будет `никакого разрешения на скачивание, использование или улучшение вашей работы <dontchoosealicense_>`__, так что это, вероятно, *противоположное* тому, что вы на самом деле хотите. Лицензия Массачусетского технологического института <chooseamitlicense_>`__ - отличный выбор, поскольку она проста, широко используется и позволяет любому делать с вашей работой все, что он захочет (кроме как подать на вас в суд, чего вы, вероятно, тоже не хотите).
ta: நீங்கள் உரிமத்தை சேர்க்கத் தேவையில்லை என்றாலும், உங்களிடம் அவ்வாறு செய்யாவிட்டால், உங்கள் வேலையை பதிவிறக்கம் செய்ய, பயன்படுத்த அல்லது மேம்படுத்த யாருக்கும் எந்த அனுமதியும் இல்லை <dontchoosealicense_> `__, எனவே இது நீங்கள் உண்மையில் விரும்பியதற்கு * நேர்மாறாக இருக்கலாம். `எம்ஐடி உரிமம் <Choseamitlicense_> __ __ அதற்கு பதிலாக ஒரு சிறந்த தேர்வாகும், ஏனெனில் இது எளிமையானது, பரவலாகப் பயன்படுத்தப்படுகிறது மற்றும் உங்கள் வேலையுடன் யாரையும் அவர்கள் விரும்பியதைச் செய்ய அனுமதிக்கிறது (நீங்கள் வழக்குத் தொடுப்பதைத் தவிர, நீங்கள் விரும்பாதது).

source: To apply it, just paste `the text <chooseamitlicense_>`__ into a file named :file:`LICENSE.txt` at the root of your repo, and add the year and your name to the copyright line. Then, just add ``license = "MIT"`` under ``[project]`` in your :file:`pyproject.toml` if your packaging tool supports it, or in its config file/section. You're done!
eo: Por efektivigi ĝin, simple algluu `la tekston <chooseamitlicense_>`__ en dosieron nomitan :file:`LICENSE.txt` ĉe la radiko de via deponejo, kaj aldonu la jaron kaj vian nomon al la kopirajta linio. Poste, simple aldonu ``license = "MIT"`` sub ``[project]`` en :file:`pyproject.toml` se via pakilo subtenas ĝin, aŭ en ĝia agorda dosiero. Jen finite!
ja: これを適用するには、単にリポジトリのルートディレクトリにある :file:`LICENSE.txt` と名付けられたファイルに `テキスト <chooseamitlicense_>`__ を貼り付けて、年とあなたの名前をコピーライトの行に追加して下さい。それから、パッケージングツールがサポートしている場合は ``license = "MIT"`` を :file:`pyproject.toml` の中の ``[project]`` の下か、あるいは、設定ファイル・節の中に追加してください。これで出来上がりです！
ru: Чтобы применить его, просто вставьте ``текст <chooseamitlicense_>``__ в файл с именем :file:`LICENSE.txt`` в корне вашего репо, и добавьте год и ваше имя в строку копирайта. Затем просто добавьте ``license = "MIT"`` под ``[project]`` в ваш :file:`pyproject.toml`, если ваш инструмент упаковки поддерживает это, или в его конфигурационный файл/раздел. Все готово!
ta: அதைப் பயன்படுத்த, `உரையை <choseamitlicense_> __ __ என்ற கோப்பில் ஒட்டவும்: கோப்பு:` உரிமம். பின்னர், உங்கள்: கோப்பில் `` [திட்டம்] `` `` `` `` [திட்டம்] `` `` `` pyproject.toml` இன் கீழ் `` உரிமம் = "எம்ஐடி" சேர்க்கவும் அல்லது அதன் கட்டமைப்பு கோப்பு/பிரிவில் இருந்தால். நீங்கள் முடித்துவிட்டீர்கள்!

source: I want to distribute my project under a specific license
eo: Mi volas distribui mian projekton sub specifa licenco
ja: プロジェクトを特定のライセンスの下で配布したい
ru: Я хочу распространять свой проект под определенной лицензией
ta: எனது திட்டத்தை ஒரு குறிப்பிட்ட உரிமத்தின் கீழ் விநியோகிக்க விரும்புகிறேன்

source: To use a particular license, simply paste its text into a :file:`LICENSE.txt` file at the root of your repo, if you don't have it in a file starting with :file:`LICENSE` or :file:`COPYING` already, and add ``license = "LICENSE-ID"`` under ``[project]`` in your :file:`pyproject.toml` if your packaging tool supports it, or else in its config file. You can find the ``LICENSE-ID`` and copyable license text on sites like `ChooseALicense <choosealicenselist_>`__ or `SPDX <spdxlist_>`__.
eo: Por uzi iu licencon, simple metu la licencan tekston endosieron :file:`LICENSE.txt` ĉe la radiko de la deponejo (se ankoraŭ mankas dosiero, kies nomo komenciĝas per :file:`LICENSE` aŭ :file:`COPYING`), kaj aldonu ``license = "LICENCA-IDENTIGILO"`` sub ``[project]`` en :file:`pyproject.toml` (se la pakilo subtenas ĝin) aŭ en alia agorda dosiero. La ``LICENCA-IDENTIGILO`` kaj kopiebla licenca teksto troviĝas en retejoj kiel `ChooseALicense <choosealicenselist_>`__ aŭ `SPDX <spdxlist_>`__.
ja: 特定のライセンスを使用するには、もし :file:`LICENSE` または :file:`COPYING` で始まるファイルを既に置いているのでなければ、単にリポジトリのルートディレクトリにある :file:`LICENSE.txt` ファイルの中にそのテキストを貼り付けて、 使っているパッケージングツールがサポートしているなら :file:`pyproject.toml` の中の ``[project]`` の下に ``license = "LICENSE-ID"`` を追加するか、そうでなければ設定ファイルの中に追加すれば良いだけです。 `ChooseALicense <choosealicenselist_>`__ や `SPDX <spdxlist_>`__ のようなサイトに行けば、 ``LICENSE-ID`` とコピー可能なライセンス条項を見つけることができるでしょう。
ru: Чтобы использовать определенную лицензию, просто вставьте ее текст в файл :file:`LICENSE.txt` в корне вашего репозитория, если он еще не находится в файле, начинающемся с :file:`LICENSE` или :file:`COPYING`, и добавьте ``license = "LICENSE-ID"`` под ``[project]`` в вашем :file:`pyproject.toml`, если ваш инструмент упаковки поддерживает это, или в другом случае в его конфигурационном файле. Вы можете найти ``LICENSE-ID`` и копируемый текст лицензии на сайтах вроде `ChooseALicense <choosealicenselist_>`__ или `SPDX <spdxlist_>`__.
ta: ஒரு குறிப்பிட்ட உரிமத்தைப் பயன்படுத்த, அதன் உரையை ஒரு: கோப்பு: `உரிமம். `ஏற்கனவே நகலெடுக்கவும்,` `உரிமம் =" உரிமம்-ஐடி "` `[திட்டத்தின்]` `` `` உங்கள்: `pyproject.toml` இன் கீழ் சேர்க்கவும், உங்கள் பேக்கேசிங் கருவி அதை ஆதரித்தால், அல்லது அதன் கட்டமைப்பு கோப்பில் வேறு. `` உரிமம்-ஐடி`` மற்றும் நகலெடுக்கக்கூடிய உரிம உரையை `Choosealicense <chosealicenselist_> __ __ அல்லது` spdx <spdxlist_> __ __ போன்ற தளங்களில் காணலாம்.

source: Many popular code hosts, project templates and packaging tools can add the license file for you, and may support the expression as well in the future.
eo: Multaj popularaj kodgastigejoj, projekto-ŝablonoj kaj pakiloj povas aldoni la licenco-dosieron por vi kaj povos subteni la esprimon.
ja: 多くの人気のあるソースコードホスト・プロジェクトテンプレート・パッケージングツールによってライセンスファイルを加えることができ、将来に渡って表現をサポートするでしょう。
ru: Многие популярные хостинги кода, шаблоны проектов и средства упаковки могут добавить файл лицензии за вас, а в будущем, возможно, будут поддерживать и выражение.
ta: பல பிரபலமான குறியீடு ஓச்ட்கள், திட்ட வார்ப்புருக்கள் மற்றும் பேக்கேசிங் கருவிகள் உங்களுக்காக உரிமக் கோப்பைச் சேர்க்கலாம், மேலும் எதிர்காலத்திலும் வெளிப்பாட்டை ஆதரிக்கலாம்.

source: I maintain an existing package that's already licensed
eo: Mi mastrumas ekzistantan pakon sub licenco
ja: 既にライセンスが付与された既存パッケージを維持管理しています
ru: Я поддерживаю существующий пакет, который уже лицензирован
ta: ஏற்கனவே உரிமம் பெற்ற ஒரு தொகுப்பை நான் பராமரிக்கிறேன்

source: If you already have license files and metadata in your project, you should only need to make a couple of tweaks to take advantage of the new functionality.
eo: Se vi jam havas licencajn dosierojn kaj metadatenojn en via projekto, vi nur devas fari kelkajn ŝanĝetojn por uzi la novajn funkciojn.
ja: ライセンスファイルやプロジェクト内のメタデータが既に存在しているなら、新機能の利点を得るためには2,3の捻りを加えるだけで良いはずです。
ru: Если в вашем проекте уже есть лицензионные файлы и метаданные, то вам нужно будет внести всего пару изменений, чтобы воспользоваться новой функциональностью.
ta: உங்கள் திட்டத்தில் ஏற்கனவே உரிமக் கோப்புகள் மற்றும் மேனிலை தரவு இருந்தால், புதிய செயல்பாட்டைப் பயன்படுத்த நீங்கள் இரண்டு மாற்றங்களை மட்டுமே செய்ய வேண்டும்.

source: In your project config file, enter your license expression under ``license`` (``[project]`` table in :file:`pyproject.toml`), or the equivalent for your packaging tool, and make sure to remove any legacy ``license`` table subkeys or ``License ::`` classifiers. Your existing ``license`` value may already be valid as one (e.g. ``MIT``, ``Apache-2.0 OR BSD-2-Clause``, etc); otherwise, check the `SPDX license list <spdxlist_>`__ for the identifier that matches the license used in your project.
eo: En via projekta agorda dosiero, tajpu vian licenco-esprimon sub ``license`` (tabelo ``[project]`` en :file:`pyproject.toml`), aŭ la ekvivalentaĵon de via pakilo. Certigu, ke vi forigis ajnan malnovan subŝlosilojn de tabelo ``license`` aŭ klasigilojn ``License ::``. Via ekzistanta valoro por ``license`` povas jam validi (ekz. ``MIT``, ``Apache-2.0 OR BSD-2-Clause`` ktp); alie, vidu la `liston de SPDX-licencoj <spdxlist_>`__ por la identigilo por la licenco de via projekto.
ja: プロジェクト設定ファイルにおいて、ライセンス条項を ``license`` (:file:`pyproject.toml` の ``[project]`` テーブル) の下か、使っているパッケージングツールでの相当する場所に置き、古いやり方である ``license`` テーブルサブキーや ``License::`` 分類子を取り除くのを忘れないでください。既存の ``license`` 値は、そのままでも正当なもの (例えば ``MIT`` や ``Apache-2.0 OR BSD-2-Clause`` 等) かもしれません; そうでなければ、そのプロジェクトで採用しているライセンスに合致する識別子を `SPDX ライセンスリスト <spdxlist_>`__ で確認して下さい。
ru: В конфигурационном файле проекта введите выражение лицензии в ``license`` (таблица ``[project]`` в :file:`pyproject.toml`) или эквивалентное выражение для вашего инструмента упаковки, и убедитесь, что удалили все устаревшие подключи таблицы ``license`` или классификаторы ``License ::``. Возможно, существующее значение ``лицензии`` уже является действительным (например, ``MIT``, ``Apache-2.0 OR BSD-2-Clause`` и т. д.); в противном случае проверьте список лицензий <spdxlist_>`__ для идентификатора, который соответствует лицензии, используемой в вашем проекте.
ta: உங்கள் திட்ட கட்டமைப்பு கோப்பில், உங்கள் உரிம வெளிப்பாட்டை `` உரிமம்`` (`` [திட்டம்] `` அட்டவணை: கோப்பு: `pyproject.toml`), அல்லது உங்கள் பேக்கேசிங் கருவிக்கு சமமானதாக உள்ளிட்டு, எதையும் அகற்றுவதை உறுதிசெய்க மரபு `` உரிமம்`` அட்டவணை சப் கீச் அல்லது `` உரிமம் :: `` வகைப்படுத்திகள். உங்கள் இருக்கும் `` உரிமம்`` மதிப்பு ஏற்கனவே ஒன்றாக செல்லுபடியாகும் (எ.கா. இல்லையெனில், உங்கள் திட்டத்தில் பயன்படுத்தப்படும் உரிமத்துடன் பொருந்தக்கூடிய அடையாளங்காட்டிக்கு `SPDX உரிம பட்டியல் <SPDXLIST_>` __ __ ஐ சரிபார்க்கவும்.

source: Make sure to list your license files under ``license-files`` under ``[project]`` in :file:`pyproject.toml` or else in your tool's configuration file.
eo: Certe listigu viajn licenco-dosierojn sub ``license-files`` sub ``[project]`` en :file:`pyproject.toml` aŭ en la agorda dosiero de via ilo.
ja: :file:`pyproject.toml` の中の ``[project]`` の下の ``license-files`` か、使用しているツールの設定ファイルに、ライセンスファイル群を列挙しておくのを忘れないでください。
ru: Убедитесь, что вы перечислили файлы лицензий в разделе ``license-files`` под ``[project]`` в :file:`pyproject.toml` или в другом файле конфигурации вашего инструмента.
ta: உங்கள் உரிமக் கோப்புகளை `` [திட்டம்] `` `இன் கீழ்` `உரிமக் கோப்புகள்` இன் கீழ் பட்டியலிடுவதை உறுதிசெய்க: கோப்பு:` pyproject.toml` அல்லது உங்கள் கருவியின் உள்ளமைவு கோப்பில்.

source: See the :ref:`licensing-example-basic` for a simple but complete real-world demo of how this works in practice. See also the best-effort guidance on how to translate license classifiers into license expression provided by the :pep:`639` authors: `Mapping License Classifiers to SPDX Identifiers <mappingclassifierstospdx_>`__. Packaging tools may support automatically converting legacy licensing metadata; check your tool's documentation for more information.
ja: これが実際にどのように動作するのかに関する、簡明ではあるが一通り揃った実世界でのデモが、 :ref:`licensing-example-basic` に出ています。また、ライセンス分類子からライセンス条項へ対応付けるやり方に関するベストエフォートのガイダンスが :pep:`639` の著者達によって提供された `ライセンス分類子から SPDX 識別子へ <mappingclassifierstospdx_>`__ にありますので、こちらもご覧ください。パッケージングツールが、レガシーのライセンスメタデータを自動的に変換する機能を持っているかもしれませんので、さらなる情報を得るために使っているツールの説明文書を調べて下さい。
ru: Смотрите :ref:`licensing-example-basic` для простой, но полной демонстрации того, как это работает на практике. См. также руководство по переводу классификаторов лицензий в выражения лицензий, предоставленное авторами :pep:`639`: `Mapping License Classifiers to SPDX Identifiers <mappingclassifierstospdx_>`__. Средства упаковки могут поддерживать автоматическое преобразование устаревших лицензионных метаданных; для получения дополнительной информации обратитесь к документации вашего средства.
ta: ஐப் பார்க்கவும்: ref: `உரிமம்-எடுத்துக்காட்டு-அடிப்படை` இது நடைமுறையில் எவ்வாறு செயல்படுகிறது என்பதற்கான எளிய ஆனால் முழுமையான நிச உலக டெமோவுக்கு. உரிம வகைப்படுத்தல்களை உரிம வெளிப்பாட்டில் எவ்வாறு மொழிபெயர்ப்பது என்பது குறித்த சிறந்த உத்திகளையும் காண்க: PEP: `639` ஆசிரியர்கள்: `SPDX அடையாளங்காட்டிகளுக்கு மேப்பிங் உரிம வகைப்படுத்திகள் <மேப்பிங் கிளாசிஃபியர்ச்டோச்பிஎக்ச்_> ____. பேக்கேசிங் கருவிகள் மரபு உரிமம் பெறும் மெட்டாடேட்டாவை தானாக மாற்றுவதை ஆதரிக்கக்கூடும்; மேலும் தகவலுக்கு உங்கள் கருவியின் ஆவணங்களை சரிபார்க்கவும்.

source: My package includes other code under different licenses
eo: Mia pako inkluzivas alian kodon sub malsamaj licencoj
ja: 私のパッケージには異なるライセンスの他のソースコードが含まれています
ru: Мой пакет включает в себя другой код под разными лицензиями
ta: எனது தொகுப்பில் வெவ்வேறு உரிமங்களின் கீழ் பிற குறியீடு அடங்கும்

source: If your project includes code from others covered by different licenses, such as vendored dependencies or files copied from other open source software, you can construct a license expression to describe the licenses involved and the relationship between them.
ja: プロジェクトが、提供された依存関係ないし他のオープンソースソフトウェアからコピーされたファイル群のような、相異なるライセンスでカバーされたソースコードを含んでいるなら、関与するライセンスとそれらの間の関係を記述するために、ライセンス条項を構築することができます。
ru: Если ваш проект включает в себя код, полученный от других людей, на которые распространяются разные лицензии, например, зависимые файлы или файлы, скопированные из других программ с открытым исходным кодом, вы можете построить лицензионное выражение, чтобы описать соответствующие лицензии и отношения между ними.
ta: உங்கள் திட்டத்தில் விற்பனையான சார்புநிலைகள் அல்லது பிற திறந்த மூல மென்பொருளிலிருந்து நகலெடுக்கப்பட்ட கோப்புகள் போன்ற வெவ்வேறு உரிமங்களால் மூடப்பட்ட மற்றவர்களிடமிருந்து குறியீடு இருந்தால், சம்பந்தப்பட்ட உரிமங்களையும் அவற்றுக்கிடையேயான உறவை விவரிக்க உரிம வெளிப்பாட்டை உருவாக்கலாம்.

source: In short, ``License-1 AND License-2`` mean that *both* licenses apply to your project, or parts of it (for example, you included a file under another license), and ``License-1 OR License-2`` means that *either* of the licenses can be used, at the user's option (for example, you want to allow users a choice of multiple licenses). You can use parenthesis (``()``) for grouping to form expressions that cover even the most complex situations.
eo: Resume, ``Licenco-1 AND Licenco-2`` signifas, ke *ambaŭ* licencoj efektivas pri la projekto aŭ partoj de la projekto (ekzemple, la aŭtoro inkluzivis dosieron sub alia licenco), kaj ``Licenco-1 OR Licenco-2`` signifas, ke *aŭ unu aŭ la alia* el la licencoj estas uzeblaj laŭ la volo de la uzanto (ekzemple, la aŭtoro volas permesi al la aŭtoro elekti inter pluraj licencoj). Oni uzas rondajn krampojn (``()``) por grupigi esprimojn, sufiĉante por eĉ la plej komplikaj situacioj.
ja: 端的に言えば、 ``License-1 AND License-2`` では、 *両方の* ライセンスか、または、その一部 (例えば、同梱されたあるファイルがもう一つの方のライセンスの下にある) がプロジェクトに適用され、 ``License-1 OR License-2`` では、ユーザの選択によって、 *いずれか一方の* ライセンス (例えば、複数のライセンスから一つを選ぶことをユーザに許したい) を適用しても構いません。もっとも込み入った状況でさえもカバーできる表現を組み立てるためのグループ化のために括弧 (``()``) を使うことができます。
ru: Вкратце, ``Лицензия-1 И Лицензия-2`` означает, что *обе* лицензии применимы к вашему проекту или его части (например, вы включили файл под другой лицензией), а ``Лицензия-1 ИЛИ Лицензия-2`` означает, что *любая* из лицензий может быть использована по выбору пользователя (например, вы хотите предоставить пользователям возможность выбора из нескольких лицензий). Вы можете использовать круглые скобки (``()``) для группировки, чтобы сформировать выражения, которые охватывают даже самые сложные ситуации.
ta: சுருக்கமாக, `` உரிமம் -1 மற்றும் உரிமம் -2`` என்பது உங்கள் திட்டத்திற்கு அல்லது அதன் பகுதிகளுக்கு * இரண்டு * உரிமங்களும் பொருந்தும் என்று பொருள் (எடுத்துக்காட்டாக, நீங்கள் மற்றொரு உரிமத்தின் கீழ் ஒரு கோப்பை சேர்த்துள்ளீர்கள்), மற்றும் `` உரிமம் -1 அல்லது உரிமம் -2`` என்றால், பயனரின் விருப்பத்தில் * உரிமங்களில் * பயன்படுத்தப்படலாம் (எடுத்துக்காட்டாக, பயனர்களுக்கு பல உரிமங்களைத் தேர்வு செய்ய அனுமதிக்க விரும்புகிறீர்கள்). மிகவும் சிக்கலான சூழ்நிலைகளை கூட உள்ளடக்கும் வெளிப்பாடுகளை உருவாக்க குழுவிற்கு நீங்கள் அடைப்புக்குறிக்கு (`` () `) பயன்படுத்தலாம்.
