Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Within a numeric release (``1.0``, ``2.7.3``), the following suffixes are permitted and MUST be ordered as shown::
eo: Ene de numera eldono (``1.0``, ``2.7.3``), la ĉi-subaj sufiksoj estas permesataj kaj DEVAS esti ordigitaj jene::
ja: リリース番号の数字部分 (``1.0`` や ``2.7.3``) の中では、後述の接尾辞が許されており、下に示す通りに順序付けをしなければなりません::
ru: В числовом выпуске (``1.0``, ``2.7.3``) разрешены следующие суффиксы, которые ДОЛЖНЫ быть упорядочены, как показано на рисунке::
ta: ஒரு எண் வெளியீட்டிற்குள் (`` 1.0``, `` 2.7.3``), பின்வரும் பின்னொட்டுகள் அனுமதிக்கப்படுகின்றன, மேலும் காட்டப்பட்டுள்ளபடி ஆர்டர் செய்யப்பட வேண்டும் ::

source: Note that ``c`` is considered to be semantically equivalent to ``rc`` and must be sorted as if it were ``rc``. Tools MAY reject the case of having the same ``N`` for both a ``c`` and a ``rc`` in the same release segment as ambiguous and remain in compliance with the specification.
eo: Notu, ke ``c`` semantike ekvivalentas ``rc`` kaj estas ordigita kvazaŭ ĝi estis ``rc``. Ilo POVAS malakcepti la kazon de la sama ``N`` por kaj ``r`` kaj ``rc`` en la sama eldonsegmento pro ambigueco kaj tamen observi la specifon.
ja: ``c`` が意味の上で ``rc`` と同等のものであると見做されていて、恰も本当に ``rc`` であるかのように並べ替えされる点を銘記してください。ツール群は、同じリリース構成部分内に ``c`` と ``rc`` の両方に同一の ``N`` を付けたものが来た場合には曖昧であるとしてこれを拒否しても構いませんが、これでも仕様には合致しています。
ru: Обратите внимание, что ``c`` считается семантически эквивалентным ``rc`` и должен быть отсортирован так же, как если бы он был ``rc``. Инструментальные средства МОГУТ отклонить случай наличия одинакового ``N`` для ``c`` и ``rc`` в одном сегменте выпуска как неоднозначный и остаться в соответствии со спецификацией.
ta: `` சி`` சொற்பொருளாக `` rc`` க்கு சமமானதாகக் கருதப்படுகிறது, மேலும் அது `` rc`` போல வரிசைப்படுத்தப்பட வேண்டும் என்பதை நினைவில் கொள்க. ஒரு `சி`` இரண்டிற்கும் ஒரே மாதிரியான வெளியீட்டுப் பிரிவில் தெளிவற்ற அதே பிரிவில் ஒரே மாதிரியான` `n`` ஐக் கொண்ட வழக்கை கருவிகள் நிராகரிக்கலாம் மற்றும் விவரக்குறிப்புக்கு இணங்க வேண்டும்.

source: Within an alpha (``1.0a1``), beta (``1.0b1``), or release candidate (``1.0rc1``, ``1.0c1``), the following suffixes are permitted and MUST be ordered as shown::
eo: En alfa (``1.0a1``), beta (``1.0b1``) aŭ eldonkandidato (``1.0rc1``, ``1.0c1``), la ĉi-subaj sufiksoj estas permesataj kaj DEVAS esti ordigitaj jene::
ja: アルファ (``1.0a1``) 、ベータ (``1.0b1``) 、あるいはリリース候補 (``1.0rc1``, ``1.0c1``) の中では、後述の接尾辞が許されていて、示される通りに並べ替えられなければなりません::
ru: Внутри альфа-версии (``1.0a1``), бета-версии (``1.0b1``) или релиз-кандидата (``1.0rc1``, ``1.0c1``) разрешены следующие суффиксы, которые ДОЛЖНЫ быть упорядочены, как показано::
ta: ஆல்பா (`` 1.0a1``), பீட்டா (`` 1.0b1``), அல்லது வேட்பாளரை (`1.0rc1``,` `1.0c1``) வெளியிடும், பின்வரும் பின்னொட்டுகள் அனுமதிக்கப்படுகின்றன, மேலும் காட்டப்பட்டுள்ளபடி ஆர்டர் செய்யப்பட வேண்டும் ::

source: Within a post-release (``1.0.post1``), the following suffixes are permitted and MUST be ordered as shown::
eo: Ene de posteldono (``1.0.post1``), la jenaj sufiksoj estas permesataj kaj DEVAS esti ordigitaj jene::
ja: ポストリリース (``1.0.post1``) の中では、後述の接尾辞が許されていて、示す通りに並べ替えられなければなりません::
ru: Внутри пост-релиза (``1.0.post1``) разрешены следующие суффиксы, которые ДОЛЖНЫ быть упорядочены, как показано::
ta: ஒரு பிந்தைய வெளியீட்டிற்குள் (`` 1.0.post1``), பின்வரும் பின்னொட்டுகள் அனுமதிக்கப்படுகின்றன, மேலும் அவை காட்டப்பட்டுள்ளபடி ஆர்டர் செய்யப்பட வேண்டும் ::

source: Note that ``devN`` and ``postN`` MUST always be preceded by a dot, even when used immediately following a numeric version (e.g. ``1.0.dev456``, ``1.0.post1``).
eo: Notu, ke ``devN`` kaj ``postN`` DEVAS esti antaŭita de punkto, eĉ tuj post numera versio (ekz. ``1.0.dev456``, ``1.0.post1``).
ja: バージョン番号の数字部分の直後に置く場合 (例えば ``1.0.dev456`` や ``1.0.post1``) であっても、 ``devN`` と ``postN`` は、常にドットに後続しなければならないことを銘記してください。
ru: Обратите внимание, что перед ``devN`` и ``postN`` ДОЛЖНА всегда стоять точка, даже если они используются сразу после числовой версии (например, ``1.0.dev456``, ``1.0.post1``).
ta: ஒரு எண் பதிப்பை (எ.கா. `` 1.0.dev456``, `` 1.0.post1``) உடனடியாகப் பயன்படுத்தும்போது கூட, `` devn`` மற்றும் `` போச்ட்ன்`` எப்போதும் ஒரு புள்ளிக்கு முன்னதாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க.

source: Within a pre-release, post-release or development release segment with a shared prefix, ordering MUST be by the value of the numeric component.
eo: En antaŭeldona, posteldona aŭ evoluada-eldona segmento kun komuna prefikso, ordigado DEVAS esti laŭ la valoro de la numera komponanto.
ja: 共通の先行部分を持つプレリリース構成部分、ポストリリース構成部分、あるいは開発リリース構成部分の中で、数値部分の値に従って順序付けをしなければなりません。
ru: Внутри сегмента предрелиза, пострелиза или релиза разработки с общим префиксом упорядочивание ДОЛЖНО осуществляться по значению числового компонента.
ta: ஒரு முன் வெளியீட்டிற்குள், பகிரப்பட்ட முன்னொட்டுடன் வெளியீடு அல்லது மேம்பாட்டு வெளியீட்டு பிரிவுக்குள், வரிசைப்படுத்துதல் எண் கூறுகளின் மதிப்பால் இருக்க வேண்டும்.

source: The following example covers many of the possible combinations::
eo: Jen ekzemplo de multaj eblaj kombinaĵoj::
ja: 可能なバージョン番号の例を以下に示します::
ru: Следующий пример охватывает многие из возможных комбинаций::
ta: பின்வரும் எடுத்துக்காட்டு சாத்தியமான பல சேர்க்கைகளை உள்ளடக்கியது ::

source: Version ordering across different metadata versions
eo: Ordigo de versioj trans diversaj metadatenaj versioj
ja: 相異なるメタデータバージョンを通してバージョン番号を順序付けする
pt_br: Ordenação de versões em diferentes versões de metadados
ru: Упорядочивание версий в различных версиях метаданных
ta: பதிப்பு வெவ்வேறு மேனிலை தரவு பதிப்புகளில் வரிசைப்படுத்துகிறது

source: Metadata v1.0 (:pep:`241`) and metadata v1.1 (:pep:`314`) do not specify a standard version identification or ordering scheme. However metadata v1.2 (:pep:`345`) does specify a scheme which is defined in :pep:`386`.
eo: Metadatenoj v1.0 (:pep:`241`) and Metadatenoj v1.1 (:pep:`314`) ne specifas norman skemon pri identigado kaj ordigado de versioj. Tamen Metadatenoj v1.2 (:pep:`345`) ja specifas skemon difinitan en :pep:`386`.
ja: メタデータ v1.0 (pep:`241`) および メタデータ (:pep:`314`) は、標準となるバージョン番号の識別や順序付けの枠組みを指定していません。しかしながら、メタデータ v1.2 (:pep:`345`) では、 :pep:`386` で定義された枠組みを指定しています。
ru: Метаданные v1.0 (:pep:`241`) и метаданные v1.1 (:pep:`314`) не определяют стандартную схему идентификации или упорядочивания версий. Однако в метаданных v1.2 (:pep:`345`) указана схема, которая определена в :pep:`386`.
ta: மேனிலை தரவு V1.0 (: PEP: `241`) மற்றும் மேனிலை தரவு V1.1 (: PEP:` 314`) ஒரு நிலையான பதிப்பு அடையாளம் அல்லது வரிசைப்படுத்தும் திட்டத்தை குறிப்பிடவில்லை. இருப்பினும் மேனிலை தரவு V1.2 (: PEP: `345`) வரையறுக்கப்பட்ட ஒரு திட்டத்தை குறிப்பிடுகிறது: PEP:` 386`.

source: Due to the nature of the simple installer API it is not possible for an installer to be aware of which metadata version a particular distribution was using. Additionally installers required the ability to create a reasonably prioritized list that includes all, or as many as possible, versions of a project to determine which versions it should install. These requirements necessitate a standardization across one parsing mechanism to be used for all versions of a project.
eo: Pro la naturo de la simpla instalila API, instalilo ne povas scii la metadatenan version uzatan de iu distribuo. Plie instalilo postulas la kapablon krei sufiĉe prioritatigitan liston inkluzivantan ĉiom, aŭ tiom multe kiom eblas, da versioj de projekto, por determini la instalotan version. Tiaj postuloj necesigas normigadon al unu sintaksanaliza meĥanismo uzenda por ĉiuj versioj de projekto.
ja: 単純なインストーラ API の特性の故に、特定の配布物がどのバージョンのメタデータを使っているかをインストーラが意識することは不可能です。さらに、インストーラは、どのバージョンをインストールするべきであるかを決定するために、すべての、または、可能な限り多くのバージョンのプロジェクトを含む合理的に優先順位付けされたリストを作成することができるように要求されています。これらの要求事項によって、あるプロジェクトのすべてのバージョンにおいてひとつの解析メカニズムが使われるような標準化が必要とされます。
ru: Из-за природы простого API инсталлятора он не может знать, какую версию метаданных использует тот или иной дистрибутив. Кроме того, инсталляторам требовалась возможность создать разумно приоритетный список, включающий все или как можно больше версий проекта, чтобы определить, какие версии следует установить. Эти требования обуславливают необходимость стандартизации одного механизма разбора, который будет использоваться для всех версий проекта.
ta: எளிய நிறுவி ஏபிஐயின் தன்மை காரணமாக, ஒரு குறிப்பிட்ட வழங்கல் எந்த மேனிலை தரவு பதிப்பைப் பயன்படுத்துகிறது என்பதை ஒரு நிறுவி அறிந்து கொள்ள முடியாது. கூடுதலாக, நிறுவிகள் ஒரு திட்டத்தின் அனைத்து பதிப்புகளை நிறுவ வேண்டும் என்பதை தீர்மானிக்க அனைத்தையும் உள்ளடக்கிய ஒரு நியாயமான முன்னுரிமை பட்டியலை உருவாக்கும் திறன் தேவைப்பட்டது. இந்த தேவைகள் ஒரு திட்டத்தின் அனைத்து பதிப்புகளுக்கும் பயன்படுத்தப்பட வேண்டிய ஒரு பாகுபடுத்தும் பொறிமுறையில் ஒரு தரப்படுத்தல் தேவைப்படுகிறது.

source: Due to the above, this specification MUST be used for all versions of metadata and supersedes :pep:`386` even for metadata v1.2. Tools SHOULD ignore any versions which cannot be parsed by the rules in this specification, but MAY fall back to implementation defined version parsing and ordering schemes if no versions complying with this specification are available.
ja: 上記のことによって、この仕様では、全てのメタデータのバージョンに使われなければならず、メタデータ v1.2 であってさえも :pep:`386` を上書きする形で使われなければなりません。ツール類は、この仕様に示された規則に従って解釈できないバージョン番号をすべて無視するべきですが、この仕様に合致するバージョン番号がひとつも利用可能でない時には、それぞれの実装で定義されたバージョン番号の解釈や順序付けにフォールバックしても構いません。
ru: В связи с вышесказанным, эта спецификация ДОЛЖНА использоваться для всех версий метаданных и заменяет :pep:`386` даже для метаданных v1.2. Инструменты ДОЛЖНЫ игнорировать любые версии, которые не могут быть разобраны по правилам этой спецификации, но МОГУТ вернуться к схемам разбора и упорядочивания версий, определенным реализацией, если версии, соответствующие этой спецификации, недоступны.
ta: மேற்கூறியவற்றின் காரணமாக, இந்த விவரக்குறிப்பு மேனிலை தரவு மற்றும் சூப்பர்செட்களின் அனைத்து பதிப்புகளுக்கும் பயன்படுத்தப்பட வேண்டும்: PEP: `386` மேனிலை தரவு V1.2 க்கு கூட. இந்த விவரக்குறிப்பில் உள்ள விதிகளால் பாகுபடுத்த முடியாத எந்த பதிப்புகளையும் கருவிகள் புறக்கணிக்க வேண்டும், ஆனால் இந்த விவரக்குறிப்புக்கு இணங்காத பதிப்புகள் எதுவும் கிடைக்கவில்லை என்றால், வரையறுக்கப்பட்ட பதிப்பு பாகுபடுத்தல் மற்றும் வரிசைப்படுத்தும் திட்டங்களை செயல்படுத்தலாம்.

source: Distribution users may wish to explicitly remove non-compliant versions from any private package indexes they control.
eo: Uzanto de distribuo povas deziri eksplicite forigi nekongruajn versiojn el sia privata pakindekso.
ja: 配布物のユーザは、自分が管理するプライベートなパッケージインデックスにおいて、合致しないバージョン番号を明示的に除去しても構いません。
ru: Пользователи дистрибутива могут захотеть явно удалить несоответствующие версии из всех частных индексов пакетов, которые они контролируют.
ta: விநியோக பயனர்கள் தாங்கள் கட்டுப்படுத்தும் எந்தவொரு தனியார் தொகுப்பு குறியீடுகளிலிருந்தும் இணங்காத பதிப்புகளை வெளிப்படையாக அகற்ற விரும்பலாம்.

source: Compatibility with other version schemes
eo: Kongrueco kun aliaj versiaj skemoj
ja: 他のバージョン番号の枠組みとの互換性
ru: Совместимость с другими схемами версий
ta: பிற பதிப்பு திட்டங்களுடன் பொருந்தக்கூடிய தன்மை

source: Some projects may choose to use a version scheme which requires translation in order to comply with the public version scheme defined in this specification. In such cases, the project specific version can be stored in the metadata while the translated public version is published in the version field.
eo: Kelkaj projektoj povas uzi versio-skemon, kiu postulas tradukadon por observi la publikan versio-skemon difinitan en ĉi tiu specifo. Tiakaze, la projekto-specifa versio povas esti konservita en la metadatenoj, dum la tradukita publika versio estas en la versia kampo.
ja: プロジェクトの中には、この使用で定義された公開のバージョン番号枠組みに合致するために翻訳を要求するようなバージョン番号枠組みを使うことを選択するものもあります。そのような場合には、当該プロジェクトに特有のバージョン番号をメタデータに格納しておく一方で、公開のバージョン番号を version フィールドに置くことができます。
ru: Некоторые проекты могут использовать схему версий, которая требует перевода, чтобы соответствовать схеме публичных версий, определенной в данной спецификации. В таких случаях версия для конкретного проекта может храниться в метаданных, а переведенная публичная версия публикуется в поле версии.
ta: இந்த விவரக்குறிப்பில் வரையறுக்கப்பட்ட பொது பதிப்பு திட்டத்திற்கு இணங்க மொழிபெயர்ப்பு தேவைப்படும் பதிப்பு திட்டத்தைப் பயன்படுத்த சில திட்டங்கள் தேர்வு செய்யலாம். இதுபோன்ற சந்தர்ப்பங்களில், திட்ட குறிப்பிட்ட பதிப்பை மெட்டாடேட்டாவில் சேமிக்க முடியும், அதே நேரத்தில் மொழிபெயர்க்கப்பட்ட பொது பதிப்பு பதிப்பு புலத்தில் வெளியிடப்படுகிறது.

source: This allows automated distribution tools to provide consistently correct ordering of published releases, while still allowing developers to use the internal versioning scheme they prefer for their projects.
eo: Tiu permesas al aŭtomata distribuilo ĝuste ordigi eldonojn dum aŭtoroj povas uzi sian preferatan versian skemon por siaj projektoj.
ja: これによって、自動化された配布物ツール類が公開されたリリース群の一貫性のある形で正確な順序付けを提供することができる一方、開発者側では依然として自分たちのプロジェクト向けに好みの内部的なバージョン番号枠組みを使うことが許されます。
ru: Это позволяет автоматизированным средствам распространения обеспечивать стабильно корректное упорядочивание публикуемых релизов, в то же время позволяя разработчикам использовать внутреннюю схему версионирования, которую они предпочитают для своих проектов.
ta: இது தானியங்கு விநியோக கருவிகளை வெளியிடப்பட்ட வெளியீடுகளின் தொடர்ச்சியாக சரியான வரிசைப்படுத்தலை வழங்க அனுமதிக்கிறது, அதே நேரத்தில் உருவாக்குபவர்கள் தங்கள் திட்டங்களுக்கு அவர்கள் விரும்பும் உள் பதிப்பு திட்டத்தைப் பயன்படுத்த அனுமதிக்கிறது.

source: `Semantic versioning`_ is a popular version identification scheme that is more prescriptive than this specification regarding the significance of different elements of a release number. Even if a project chooses not to abide by the details of semantic versioning, the scheme is worth understanding as it covers many of the issues that can arise when depending on other distributions, and when publishing a distribution that others rely on.
eo: `Semantika versiado <Semantic versioning>`_ estas populara versio-identiga skemo pli preskriba ol ĉi tiu specifo pri la signifo de elementoj de versia numero. Eĉ se projekto elektas ne obei la detalojn de semantika versiado, indas kompreni ĝin, ĉar ĝi diskutas multajn problemojn pri dependado de aliaj distribuoj kaj pri eldonado de distribuo, de kiu aliaj dependas.
ja: `セマンティックバージョニング`_ は、リリース番号の異なる要素の重要性に関して、この仕様以前から慣例として認められた人気のあるバージョン番号の識別の枠組みです。あるプロジェクトがセマンティックバージョニングの詳細を受け入れないことを選択した場合であっても、他の配布物に依存する時や他のプロジェクトが依存する配布物を公開する時に発生する多くの課題を網羅するためにも、この枠組みは理解しておくに値します。
ru: `Semantic versioning`_ - это популярная схема идентификации версий, которая более предписательна, чем эта спецификация, в отношении значимости различных элементов номера релиза. Даже если проект решает не придерживаться деталей семантического версионирования, схему стоит понять, поскольку она охватывает многие вопросы, которые могут возникнуть при зависимости от других дистрибутивов, а также при публикации дистрибутива, на который полагаются другие.
ta: `சொற்பொருள் பதிப்பு `_ என்பது ஒரு பிரபலமான பதிப்பு அடையாளத் திட்டமாகும், இது வெளியீட்டு எண்ணின் வெவ்வேறு கூறுகளின் முக்கியத்துவத்தைப் பற்றிய இந்த விவரக்குறிப்பை விட பரிந்துரைக்கப்படுகிறது. ஒரு திட்டம் சொற்பொருள் பதிப்பின் விவரங்களுக்கு கட்டுப்படக்கூடாது என்று தேர்வுசெய்தாலும், மற்ற விநியோகங்களைப் பொறுத்து எழும் பல சிக்கல்களை இது உள்ளடக்கியுள்ளதால், மற்றவர்கள் நம்பியிருக்கும் விநியோகத்தை வெளியிடும் போது இந்த திட்டம் புரிந்து கொள்ளத்தக்கது.

source: The "Major.Minor.Patch" (described in this specification as "major.minor.micro") aspects of semantic versioning (clauses 1-8 in the 2.0.0 specification) are fully compatible with the version scheme defined in this specification, and abiding by these aspects is encouraged.
eo: La aspekto «Maĵora.Minora.Flika» (en ĉi tiu normo, «maĵora.minora.mikroa») de semantika versiado (paragrafoj 1–8 de la versio 2.0.0 de la normo) plene kongruas kun la versia skemo en ĉi tiu specifo, kaj ni rekomendas observi tian aspekton.
ja: (2.0.0 仕様の1-8 節の) セマンティックバージョニングの ("メジャー.マイナー.マイクロ" としてこの仕様に記されている) "メジャー.マイナー.パッチ" の形は、この仕様で定義されるバージョン番号枠組みと完全に互換であり、この形を受容することが推奨されています。
ru: Аспекты "Major.Minor.Patch" (описанные в данной спецификации как "major.minor.micro") семантической версионности (пункты 1-8 в спецификации 2.0.0) полностью совместимы со схемой версий, определенной в данной спецификации, и соблюдение этих аспектов приветствуется.
ta: சொற்பொருள் பதிப்பின் (இந்த விவரக்குறிப்பில் "மேசர்.மினோர்" என விவரிக்கப்பட்டுள்ளது (2.0.0 விவரக்குறிப்பில் 1-8 உட்பிரிவுகள்) இந்த விவரக்குறிப்பில் வரையறுக்கப்பட்ட பதிப்பு திட்டத்துடன் முழுமையாக ஒத்துப்போகும், மேலும் இந்த அம்சங்களை பின்பற்றுவது ஊக்குவிக்கப்படுகிறது.

source: Semantic versions containing a hyphen (pre-releases - clause 10) or a plus sign (builds - clause 11) are *not* compatible with this specification and are not permitted in the public version field.
eo: Semantika versio enhavanta streketon (antaŭeldonoj – paragrafo 10) aŭ plusosigno (konstruoj – paragrafo 11) *ne* observas ĉi tiun specifon kaj estas malpermesata en la publika versia kampo.
ja: ハイフンを含むセマンティックバージョン (pre-releases - clause 10) やプラス記号を含むセマンティックバージョン (builds - clause 11) は、この仕様と *互換性がなく* 、公開のバージョン番号フィールドでは許されていません。
ru: Семантические версии, содержащие дефис (предвыпуск - пункт 10) или знак плюс (бабочки - пункт 11), не совместимы с этой спецификацией и не разрешены в поле публичной версии.
ta: ஒரு ஐபன் (முன் -வெளியீடுகள் - பிரிவு 10) அல்லது ஒரு பிளச் அடையாளம் (கட்டடங்கள் - பிரிவு 11) கொண்ட சொற்பொருள் பதிப்புகள் * இந்த விவரக்குறிப்புடன் பொருந்தாது மற்றும் பொது பதிப்பு துறையில் அனுமதிக்கப்படாது.

source: One possible mechanism to translate such semantic versioning based source labels to compatible public versions is to use the ``.devN`` suffix to specify the appropriate version order.
eo: Unu meĥanismo por traduki tian semantikversio-bazan fonto-etikedon al kongrua publika versio estas uzi la sufikson ``.devN`` por specifi la taŭgan versian ordon.
ja: ソースラベルに基づいたそのようなセマンティックバージョニングを公開バージョン番号と互換性のあるものに翻訳する可能なメカニズムの一つは、 ``.devN`` 接尾辞を使って適切なバージョン番号の順序を指定することです。
ru: Одним из возможных механизмов перевода таких семантических версий, основанных на метках источника, в совместимые публичные версии является использование суффикса ``.devN`` для указания соответствующего порядка версий.
ta: இதுபோன்ற சொற்பொருள் பதிப்பு அடிப்படையிலான மூல லேபிள்களை இணக்கமான பொது பதிப்புகளுக்கு மொழிபெயர்ப்பதற்கான ஒரு வழிமுறை, பொருத்தமான பதிப்பு வரிசையைக் குறிப்பிட `` .devn`` பின்னொட்டைப் பயன்படுத்துவது.

source: Specific build information may also be included in local version labels.
eo: Specifaj konstruaj informoj povas ankaŭ esti inkluzivitaj en lokaj versiaj etikedoj.
ja: 特定のビルド情報も、ローカルのバージョン番号のラベルに含めても構いません。
ru: Информация о конкретной сборке также может быть включена в локальные метки версий.
ta: உள்ளக பதிப்பு லேபிள்களிலும் குறிப்பிட்ட உருவாக்க தகவல்கள் சேர்க்கப்படலாம்.

source: DVCS based version labels
eo: Versiaj etikedoj per distribuita versikontrola sistemo
ja: DVCS に基づいたバージョン番号のラベル
ru: Метки версий на базе DVCS
ta: டி.வி.சி.எச் அடிப்படையிலான பதிப்பு லேபிள்கள்

source: Many build tools integrate with distributed version control systems like Git and Mercurial in order to add an identifying hash to the version identifier. As hashes cannot be ordered reliably such versions are not permitted in the public version field.
eo: Multaj konstruiloj integras kun distribuitaj versikontrolsistemoj kiel Git kaj Mercurial por aldoni identigan haketaĵon al la versio-identigilo. Ĉar oni ne povas fidinde ordigi haketaĵojn, oni ne permesas tiajn versiojn en la publika versio-kampo.
ja: 多くのビルドツールは、バージョン識別子に識別のためのハッシュ値を付加するために、 Git や Mercurial のような分散バージョン管理システムを統合しています。ハッシュ値は信頼できる形で順序付けすることができないので、そのようなバージョン番号は公開のバージョンフィールドでは許されません。
ru: Многие инструменты сборки интегрируются с распределенными системами контроля версий, такими как Git и Mercurial, чтобы добавить идентифицирующий хэш к идентификатору версии. Поскольку хэши не могут быть надежно упорядочены, такие версии не допускаются в поле публичной версии.
ta: பதிப்பு அடையாளங்காட்டிக்கு அடையாளம் காணும் ஆசைச் சேர்க்க பல உருவாக்க கருவிகள் அறிவிலி மற்றும் மெர்குரியல் போன்ற விநியோகிக்கப்பட்ட பதிப்பு கட்டுப்பாட்டு அமைப்புகளுடன் ஒருங்கிணைக்கின்றன. ஆச்களை நம்பத்தகுந்த வகையில் ஆர்டர் செய்ய முடியாது, இதுபோன்ற பதிப்புகள் பொது பதிப்பு துறையில் அனுமதிக்கப்படாது.

source: As with semantic versioning, the public ``.devN`` suffix may be used to uniquely identify such releases for publication, while the original DVCS based label can be stored in the project metadata.
eo: Same kiel semantika versio, la publika sufikso ``.devN`` malambigue identigas tiajn eldonojn publike, dum la originala versikontrolsistema etikedo povas esti unu el la projektaj metadatenoj.
ja: セマンティックバージョニングの場合と同様に、元の DVCS ベースのラベルをプロジェクトのメタデータに格納することができない一方で、そのようなリリースを公開する際に一意に識別するために、公開の ``.devN`` 接尾辞をつけても構いません。
ru: Как и в случае с семантическим версионированием, общедоступный суффикс ``.devN`` может использоваться для уникальной идентификации таких релизов для публикации, а оригинальная метка, основанная на DVCS, может храниться в метаданных проекта.
ta: சொற்பொருள் பதிப்பைப் போலவே, பொதுமக்கள் `` .டெவ்ன்`` பின்னொட்டு இதுபோன்ற வெளியீடுகளை வெளியீட்டிற்காக தனித்துவமாக அடையாளம் காண பயன்படுத்தப்படலாம், அதே நேரத்தில் அசல் டி.வி.சி.எச் அடிப்படையிலான லேபிளை திட்ட மெட்டாடேட்டாவில் சேமிக்க முடியும்.

source: Identifying hash information may also be included in local version labels.
eo: Loka versia etikedo ankaŭ povas inkluzivi identigan haketaĵan informon.
ja: ハッシュ値の情報を識別することは、ローカルのバージョン番号ラベルに含めても構いません。
ru: Идентифицирующая хэш-информация также может быть включена в метки локальных версий.
ta: ஆச் தகவல்களை அடையாளம் காண்பது உள்ளக பதிப்பு லேபிள்களிலும் சேர்க்கப்படலாம்.

source: Olson database versioning
eo: Versiado laŭ Olson-datenbanko
ja: Olson データベースによるバージョニング
ru: Версия базы данных Олсона
ta: ஓல்சன் தரவுத்தள பதிப்பு

source: The ``pytz`` project inherits its versioning scheme from the corresponding Olson timezone database versioning scheme: the year followed by a lowercase character indicating the version of the database within that year.
eo: La projekto ``pytz`` heredas sian versian skemon el la versia skemo de la horzono-datenbanko Olson: la jaron, sekvitan de minuskla litero de la versio de la datenbanko en tiu jaro.
ja: ``pytz`` プロジェクトは、バージョニング方法を対応する Olson タイムゾーンデータベースのバージョニング方法から継承しています: 年と、それに後続する小文字の文字でその年の中でのデータベースのバージョンを示すもの。
ru: Проект ``pytz`` наследует свою схему версий от соответствующей схемы версий базы данных часового пояса Olson: год, за которым следует строчный символ, указывающий на версию базы данных в пределах этого года.
ta: `` Pytz`` திட்டம் அதன் பதிப்புத் திட்டத்தை தொடர்புடைய ஓல்சன் டைம்சோன் தரவுத்தள பதிப்பு திட்டத்திலிருந்து பெறுகிறது: அந்த ஆண்டுக்குள் தரவுத்தளத்தின் பதிப்பைக் குறிக்கும் சிறிய எழுத்து ஆண்டு.

source: This can be translated to a compliant public version identifier as ``<year>.<serial>``, where the serial starts at zero or one (for the '<year>a' release) and is incremented with each subsequent database update within the year.
eo: Tiu estas tradukebla al valida publika versio-identigilo kiel ``<jaro>.<numero>``, en kiu la numero komenciĝas ĉe nulo aŭ unuo (por la eldono ``<jaro>a``) kaj alkrementiĝas por ĉiu sekva datenbanka ĝisdatigo en la jaro.
ja: これは、 ``<year>.<serial>`` として (訳註、標準に) 適合する公開のバージョン識別子に翻訳することができ、そこでは ('<year>' リリースに対して) シリアル番号が０か１から始まって、その年の内にデータベースが更新される度に１づつ増加されます。
ru: Это можно перевести в соответствующий идентификатор публичной версии как ``<год>.<серия>``, где серия начинается с нуля или единицы (для релиза '<год>a') и увеличивается с каждым последующим обновлением базы данных в течение года.
ta: இதை ஒரு இணக்கமான பொது பதிப்பு அடையாளங்காட்டிக்கு `` <ஆண்டு> என மொழிபெயர்க்கலாம்.
