Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The C ABI (Application Binary Interface) is a common standard for sharing functionality between multiple applications. One of the strengths of the CPython C API (Application Programming Interface) is allowing Python users to tap into that functionality. However, wrapping modules by hand is quite tedious, so a number of other alternative approaches should be considered.
ja: C 言語 ABI (アプリケーションバイナリインタフェイス <Application Binary Interface>)は、複数のアプリケーションの間で機能を共有する上での一般的な標準です。CPython の C 言語 API (アプリケーションプログラミングインタフェイス <Application Programming Interface>) を使えば Python のユーザがその機能に入り込むことができます。しかしながら、手動でモジュールごとにラッピングしていくのはうんざりするような作業なので、いくつもの代替アプローチが検討されるべきです。
pt_br: A ABI C (Interface Binária de Aplicação) é um padrão comum para compartilhamento de funcionalidade entre várias aplicações. Um dos pontos fortes da API C do CPython (Interface de Programação de Aplicação) é permitir que os usuários do Python aproveitem essa funcionalidade. No entanto, empacotar módulos manualmente é muito tedioso, portanto, várias outras abordagens alternativas devem ser consideradas.
ru: C ABI (Application Binary Interface) - это общий стандарт для совместного использования функциональности несколькими приложениями. Одной из сильных сторон CPython C API (Application Programming Interface) является возможность использования этой функциональности пользователями Python. Однако создавать модули вручную довольно утомительно, поэтому следует рассмотреть ряд других альтернативных подходов.
ta: சி பநிஇ (பயன்பாட்டு பைனரி இடைமுகம்) பல பயன்பாடுகளுக்கு இடையில் செயல்பாட்டைப் பகிர்வதற்கான பொதுவான தரமாகும். Cpython C பநிஇ (பயன்பாட்டு நிரலாக்க இடைமுகம்) இன் பலங்களில் ஒன்று பைத்தான் பயனர்களை அந்த செயல்பாட்டைத் தட்ட அனுமதிக்கிறது. இருப்பினும், தொகுதிகளை கையால் மடக்குவது மிகவும் கடினமானது, எனவே பல மாற்று அணுகுமுறைகள் கருத்தில் கொள்ளப்பட வேண்டும்.

source: The approaches described below don't simplify the distribution case at all, but they *can* significantly reduce the maintenance burden of keeping wrapper modules up to date.
eo: La ĉi-subaj manieroj ne simpligas la kazon de distribuo sed *ja* povas simpligi la taskon de ĝisdatigado de volvantaj moduloj.
ja: 以下に記述するアプローチは、単に配布物での事例ということは全くなく、むしろラッパモジュールを最新に保つというメンテナンス上の重荷を大いに軽減することができるものです。
pt_br: As abordagens descritas abaixo não simplificam o caso de distribuição, mas *podem* reduzir significativamente a carga de manutenção de manter os módulos wrapper atualizados.
ru: Описанные ниже подходы не упрощают ситуацию с дистрибутивами, но они *могут* значительно снизить нагрузку на поддержку модулей-оберток в актуальном состоянии.
ta: கீழே விவரிக்கப்பட்டுள்ள அணுகுமுறைகள் விநியோக வழக்கை எளிதாக்குவதில்லை, ஆனால் அவை போர்வுற்ற தொகுதிகளை புதுப்பித்த நிலையில் வைத்திருப்பதற்கான பராமரிப்பு சுமையை கணிசமாகக் குறைக்க முடியும்.

source: In addition to being useful for the creation of accelerator modules, `Cython <https://cython.org/>`__ is also widely used for creating wrapper modules for C or C++ APIs. It involves wrapping the interfaces by hand, which gives a wide range of freedom in designing and optimising the wrapper code, but may not be a good choice for wrapping very large APIs quickly. See the `list of third-party tools <https://github.com/cython/cython/wiki/AutoPxd>`_ for automatic wrapping with Cython. It also supports performance-oriented Python implementations that provide a CPython-like C-API, such as PyPy and Pyston.
eo: Krom sia utileco por krei akcelilan modulon, `Cython <https://cython.org/>`__ estas ankaŭ vaste uzata por krei volvantan modulon de API en C aŭ C++. Por tio oni volvas la interfacojn malaŭtomate. Ekzistas multo da libereco pri fasonado kaj optimumado de la volvanta kodo. Tamen, tio eble ne estas bona elekto por rapide volvi grandegan API. Vidu la `liston de triapartiaj iloj <https://github.com/cython/cython/wiki/AutoPxd>`_ por aŭtomata volvado per Cython. Ĝi ankaŭ subtenas rapidajn Python-realigojn kun CPython-eca C-API kiel PyPy kaj Pyston.
ja: アクセラレータモジュールの作成に役に立つことに加えて、 `Cython <https://cython.org/>`__ は C 言語や C++ の API で書かれたものをラップするモジュールを作成することにも役立ちます。インターフェイスを手動でラップする作業が必要であり、それはラッパーのソースコードを設計し最適化する上では大きな自由度を与えはしますが、大規模な API を素早くラップするためにはあまり良い選択ではないかもしれません。Cython を用いた自動ラッピングについては `サードパーティが提供するツールのリスト <https://github.com/cython/cython/wiki/AutoPxd>`_ を見てください。これらは、 PyPy や Pyston のような CPython に類似した C-API を提供する性能重視の Python 実装をもサポートしています。
pt_br: Além de ser útil para a criação de módulos aceleradores, o `Cython <https://cython.org/>`__ também é amplamente utilizado para criar módulos wrapper para APIs C ou C++. Envolve o encapsulamento manual das interfaces, o que oferece uma ampla gama de liberdade no design e otimização do código do encapsulamento, mas pode não ser uma boa opção para encapsular APIs muito grandes rapidamente. Veja a `lista de ferramentas de terceiros <https://github.com/cython/cython/wiki/AutoPxd>`_ para encapsulamento automático com Cython. Ele também oferece suporte a implementações Python orientadas para o desempenho que fornecem uma API C semelhante a CPython, como PyPy e Pyston.
ru: Помимо того, что `Cython <https://cython.org/>`__ полезен для создания модулей ускорителей, он также широко используется для создания модулей-оберток для API на C или C++. Это предполагает обертывание интерфейсов вручную, что дает широкую свободу в проектировании и оптимизации кода обертки, но может быть не лучшим выбором для быстрого обертывания очень больших API. См. `список сторонних инструментов <https://github.com/cython/cython/wiki/AutoPxd>`_ для автоматического обертывания с помощью Cython. Он также поддерживает ориентированные на производительность реализации Python, которые предоставляют CPython-подобный C-API, такие как PyPy и Pyston.
ta: முடுக்கி தொகுதிகள் உருவாக்க பயனுள்ளதாக இருப்பதோடு மட்டுமல்லாமல், சி அல்லது சி ++ ஏபிஐகளுக்கான ரேப்பர் தொகுதிகள் உருவாக்க சைதான் <https://cython.org/> __ __ பரவலாகப் பயன்படுத்தப்படுகிறது. இது இடைமுகங்களை கையால் போர்த்துவதை உள்ளடக்கியது, இது ரேப்பர் குறியீட்டை வடிவமைத்து மேம்படுத்துவதில் பரந்த அளவிலான சுதந்திரத்தை அளிக்கிறது, ஆனால் மிகப் பெரிய ஏபிஐக்களை விரைவாக மடக்குவதற்கு நல்ல தேர்வாக இருக்காது. மூன்றாம் தரப்பு கருவிகளின் பட்டியலைப் பார்க்கவும் <https://github.com/cython/cython/wiki/autopxd> `_ சைதனுடன் தானியங்கி மடக்குதல். பைபி மற்றும் பிச்டன் போன்ற சிபிதான் போன்ற சி-ஏபிஐ வழங்கும் செயல்திறன் சார்ந்த பைதான் செயலாக்கங்களையும் இது ஆதரிக்கிறது.

source: :doc:`pybind11 <pybind11:index>` is a pure C++11 library that provides a clean C++ interface to the CPython (and PyPy) C API. It does not require a pre-processing step; it is written entirely in templated C++. Helpers are included for Setuptools or CMake builds. It was based on `Boost.Python <https://www.boost.org/doc/libs/1_76_0/libs/python/doc/html/index.html>`__, but doesn't require the Boost libraries or BJam.
eo: :doc:`pybind11 <pybind11:index>` estas pure C++11-a biblioteko provizanta puran C++-interfacon al la API de CPython (kaj PyPy). Ĝi ne postulas antaŭtraktadon; ĝi estas plene en ŝablona C++. Helpiloj inkluziviĝas por konstruado kun Setuptools aŭ CMake. Ĝi estis bazita sur `Boost.Python <https://www.boost.org/doc/libs/1_76_0/libs/python/doc/html/index.html>`__, sed ne postulas la Boost-bibliotekojn aŭ BJam.
ja: :doc:`pybind11 <pybind11:index>` は純粋な C++11 で書かれたライブラリで、綺麗な C++ インタフェイスを CPython (および PyPy) の C 言語 API に提供します。事前処理 (pre-processing) の段階が不要で、全体がテンプレート化された C++ で書かれています。ヘルパーツールが Setuptools や CMake ビルドに含まれています。 `Boost.Python <https://www.boost.org/doc/libs/1_76_0/libs/python/doc/html/index.html>`__ を基礎にしていますが、Boost ライブラリや BJam がなくてはダメということはありません。
pt_br: :doc:`pybind11 <pybind11:index>` é uma biblioteca C++11 pura que fornece uma interface C++ limpa para a API C do CPython (e PyPy). Não requer uma etapa de pré-processamento; ele é escrito inteiramente em C++ modelado. Auxiliares são incluídos para construções de Setuptools ou CMake. Foi baseado em `Boost.Python <https://www.boost.org/doc/libs/1_76_0/libs/python/doc/html/index.html>`__, mas não requer as bibliotecas Boost ou BJam.
ru: :doc:`pybind11 <pybind11:index>` - это чистая библиотека C++11, которая предоставляет чистый C++ интерфейс к CPython (и PyPy) C API. Она не требует предварительной обработки и написана полностью на шаблонизированном C++. В комплект включены помощники для сборки Setuptools или CMake. Он был основан на `Boost.Python <https://www.boost.org/doc/libs/1_76_0/libs/python/doc/html/index.html>`__, но не требует библиотек Boost или BJam.
ta: . இதற்கு முன் செயலாக்க படி தேவையில்லை; இது முற்றிலும் வார்ப்புரு சி ++ இல் எழுதப்பட்டுள்ளது. செட்டுப்டூல்கள் அல்லது செமேக் கட்டமைப்புகளுக்கு உதவியாளர்கள் சேர்க்கப்பட்டுள்ளனர். இது `boost.python <https://www.boost.org/doc/libs/1_76_0/libs/python/doc/html/index.html> __, ஆனால் பூச்ட் நூலகங்கள் அல்லது பிசாம் தேவையில்லை .

source: :doc:`cffi <cffi:index>` is a project created by some of the PyPy developers to make it straightforward for developers that already know both Python and C to expose their C modules to Python applications. It also makes it relatively straightforward to wrap a C module based on its header files, even if you don't know C yourself.
ja: :doc:`cffi <cffi:index>` は、 Python と C 言語の両方を知っている開発者が C 言語で書いたモジュールを Python アプリケーションから単刀直入に使えるようにと何人かの PyPy 開発者たちが作成しました。たとえ C 言語を知らなくても、 C 言語のモジュールをそのヘッダファイルに基づいてラップすることもいくらか簡単になりました。
pt_br: :doc:`cffi <cffi:index>` é um projeto criado por alguns dos desenvolvedores PyPy para torná-lo simples para desenvolvedores que já conhecem Python e C expor seus módulos C a aplicações Python. Também torna relativamente simples fazer um wrapper de um módulo C com base em seus arquivos de cabeçalho, mesmo que você não conheça C.
ru: :doc:`cffi <cffi:index>` - это проект, созданный некоторыми разработчиками PyPy, чтобы упростить разработчикам, которые уже знают Python и C, возможность использовать свои C-модули в Python-приложениях. Он также позволяет относительно просто обернуть модуль на Си на основе его заголовочных файлов, даже если вы сами не знаете Си.
ta: . சி தொகுதியை அதன் தலைப்பு கோப்புகளின் அடிப்படையில் மடிக்க இது ஒப்பீட்டளவில் நேரடியானதாக அமைகிறது.

source: One of the key advantages of ``cffi`` is that it is compatible with the PyPy JIT, allowing CFFI wrapper modules to participate fully in PyPy's tracing JIT optimisations.
eo: Unu el la ĉefavantaĝoj de ``cffi`` estas kongrueco kun la ĝustatempa tradukado de PyPy, tiel ke volvanta modulo uzanta CFFI povas plene partopreni en la spuradaj optimumigoj de la ĝustatempa tradukilo de PyPy.
ja: ``cffi`` の最も重要な利点のひとつはPyPy JIT と一緒に使えることで、CFFI ラッパモジュールが PyPy の実行中の JIT 最適化に同居できるのです。
pt_br: Uma das principais vantagens do ``cffi`` é que ele é compatível com o PyPy de JIT, permitindo que os módulos wrapper de CFFI participem totalmente das otimizações JIT de rastreamento do PyPy.
ru: Одним из ключевых преимуществ ``cffi`` является его совместимость с PyPy JIT, что позволяет модулям-оберткам CFFI полноценно участвовать в JIT-оптимизации трассировки PyPy.
ta: `` Cffi`` இன் முக்கிய நன்மைகளில் ஒன்று, இது பைபி JIT உடன் இணக்கமானது, இது CFFI ரேப்பர் தொகுதிகள் பைபியின் தடமறியும் JIT மேம்படுத்தல்களில் முழுமையாக பங்கேற்க அனுமதிக்கிறது.

source: `SWIG <http://www.swig.org/>`__ is a wrapper interface generator that allows a variety of programming languages, including Python, to interface with C and C++ code.
eo: `SWIG <http://www.swig.org/>`__ estas generilo de volva interfaco, por alvoki C/C++-kodon el multaj programlingvoj inkluzive de Python.
ja: `SWIG <http://www.swig.org/>`__ は、 Python を含むさまざまなプログラミング言語から C 言語や C++ のコードへのインタフェースを生成できるラッパインタフェース生成ツールです。
pt_br: `SWIG <http://www.swig.org/>`__ é um wrapper gerador de interface que permite uma variedade de linguagens de programação, incluindo Python, para fazer interface com código C e C++.
ru: `SWIG <http://www.swig.org/>`__ - это генератор интерфейсов-оберток, который позволяет различным языкам программирования, включая Python, взаимодействовать с кодом на C и C++.
ta: `ச்விக் <http://www.swig.org/> ____ என்பது ஒரு ரேப்பர் இடைமுக செனரேட்டர் ஆகும், இது பைதான் உள்ளிட்ட பல்வேறு நிரலாக்க மொழிகளை சி மற்றும் சி ++ குறியீட்டுடன் இடைமுகப்படுத்த அனுமதிக்கிறது.

source: The standard library's ``ctypes`` module, while useful for getting access to C level interfaces when header information isn't available, suffers from the fact that it operates solely at the C ABI level, and thus has no automatic consistency checking between the interface actually being exported by the library and the one declared in the Python code. By contrast, the above alternatives are all able to operate at the C *API* level, using C header files to ensure consistency between the interface exported by the library being wrapped and the one expected by the Python wrapper module. While ``cffi`` *can* operate directly at the C ABI level, it suffers from the same interface inconsistency problems as ``ctypes`` when it is used that way.
eo: La modulo ``ctypes`` de la norma biblioteko, kiu utilas por atingi C-interfacojn kiam ĉapaj informoj ne estas haveblaj, tamen suferas de la fakto, ke ĝi funkciigas sole ĉe la nivelo de la ABI de C kaj tial ne povas kontroli kongruecon inter la interfaco fakte eksportita de la biblioteko kaj tiu deklarita en la Python-kodo. Kompare, la ĉi-supraj alternativoj ĉiuj funkcias ĉe la nivelo de la *ABI* de C, uzante C-ĉapdosierojn por certigi kongruecon inter la interfaco eksportita de la uzata biblioteko kaj tiu atendata de la uzanta Python-modulo. Dum `cffi` *povas* funkcii rekte ĉe la nivelo de C ABI, ĝi suferas de la samaj interfaco-kongruecaj problemoj kiel ``ctypes``, se ĝi estas tiel uzata.
ja: 標準ライブラリの ``ctypes`` モジュールは、ヘッダの情報が得られない時でも C 言語レベルのインタフェイスにアクセスできる点が役に立つ一方で、 C 言語の ABI のレベルでのみ動作するため実際にエクスポートされているインタフェースと Python コード側での宣言との間の一貫性を自動的に確認する仕組みがないという点が弊害を引き起こすかもしれません。対照的に、上記の代替策はすべて C 言語の *API* のレベルで動作するので、 C 言語のヘッダファイルを使ってライブラリからエクスポートされラップされるインタフェイスと Python 側のラッパモジュールが期待しているインタフェースとの間の一貫性を保証することができます。 ``cffi`` は C 言語の ABI のレベルで直接に動作する *ことができる* 一方で、そのように使った場合には ``ctypes`` と同じく一貫性を欠いたインタフェースの問題を孕みます。
pt_br: O módulo ``ctypes`` da biblioteca padrão, embora útil para obter acesso a interfaces de nível C quando as informações do cabeçalho não estão disponíveis, sofre do fato de operar exclusivamente no nível ABI do C e, portanto, não tem verificação automática de consistência entre os interface realmente sendo exportada pela biblioteca e aquela declarada no código Python. Em contraste, as alternativas acima são todas capazes de operar no nível *API* do C, usando arquivos de cabeçalho C para garantir consistência entre a interface exportada pela biblioteca sendo empacotada e aquela esperada pelo módulo empacotador Python. Enquanto ``cffi`` *pode* operar diretamente no nível ABI do C, ele sofre dos mesmos problemas de inconsistência de interface que ``ctypes`` quando é usado dessa forma.
ru: Модуль ``ctypes'' стандартной библиотеки, хотя и полезен для получения доступа к интерфейсам уровня C, когда информация о заголовках недоступна, страдает от того, что он работает исключительно на уровне C ABI, и поэтому не имеет автоматической проверки согласованности между интерфейсом, фактически экспортируемым библиотекой, и интерфейсом, объявленным в коде Python. В отличие от этого, все вышеперечисленные альтернативы способны работать на уровне C *API*, используя заголовочные файлы C для обеспечения согласованности между интерфейсом, экспортируемым обертываемой библиотекой, и интерфейсом, ожидаемым модулем-оберткой Python. Хотя ``cffi`` *может* работать непосредственно на уровне C ABI, он страдает от тех же проблем несогласованности интерфейсов, что и ``ctypes``, когда его используют таким образом.
ta: நிலையான நூலகத்தின் `` ctypes`` தொகுதி, தலைப்பு செய்தி கிடைக்காதபோது சி நிலை இடைமுகங்களை அணுகுவதற்கு பயனுள்ளதாக இருக்கும்போது, அது சி பநிஇ மட்டத்தில் மட்டுமே இயங்குகிறது என்பதன் மூலம் பாதிக்கப்படுகிறது, இதனால் எந்த தானியங்கி நிலைத்தன்மையும் இல்லை இடைமுகம் உண்மையில் நூலகத்தால் ஏற்றுமதி செய்யப்படுகிறது மற்றும் பைதான் குறியீட்டில் அறிவிக்கப்பட்ட ஒன்று. இதற்கு நேர்மாறாக, மேலே உள்ள மாற்றுகள் அனைத்தும் சி * பநிஇ * மட்டத்தில் செயல்பட முடியும், சி தலைப்பு கோப்புகளைப் பயன்படுத்தி நூலகத்தால் ஏற்றுமதி செய்யப்படும் இடைமுகத்திற்கும் பைதான் ரேப்பர் தொகுதியால் எதிர்பார்க்கப்படுவதற்கும் இடையிலான நிலைத்தன்மையை உறுதிசெய்கிறது. `` Cffi`` * * சி பநிஇ மட்டத்தில் நேரடியாக செயல்பட முடியும் என்றாலும், அது அந்த வழியில் பயன்படுத்தப்படும்போது அதே இடைமுக முரண்பாடு சிக்கல்களால் `` ctypes`` போன்றவற்றால் பாதிக்கப்படுகிறது.

source: Alternatives for low level system access
eo: Alternativoj por malaltnivela sistema atingado
ja: 低レベルのシステムアクセスを行う代替策
pt_br: Alternativas para acesso de baixo nível ao sistema
ru: Альтернативы для низкоуровневого доступа к системе
ta: குறைந்த அளவிலான கணினி அணுகலுக்கான மாற்று வழிகள்

source: For applications that need low level system access (regardless of the reason), a binary extension module often *is* the best way to go about it. This is particularly true for low level access to the CPython runtime itself, since some operations (like releasing the Global Interpreter Lock) are simply invalid when the interpreter is running code, even if a module like ``ctypes`` or ``cffi`` is used to obtain access to the relevant C API interfaces.
ja: (理由を問わず) 低レベルのシステムにアクセスする必要のあるアプリケーションにとって、バイナリ拡張モジュールはしばしば *進むべき最良の道* です。これは、 ``ctypes`` や ``cffi`` といったモジュールが適切な C 言語の API インタフェースへのアクセスを取得するために使われている場合であってさえも、 (グローバルインタプリタロックの解除のような) いくつかの操作がインタプリタがコードを実行している時には無効であるということだけを見ても、CPython ランタイム自身の低レベル部分にアクセスする際によく当てはまると言えます。
pt_br: Para aplicações que precisam de acesso de baixo nível ao sistema (independentemente do motivo), um módulo de extensão binária geralmente *é* a melhor maneira de fazer isso. Isso é particularmente verdadeiro para o acesso de baixo nível ao próprio tempo de execução do CPython, uma vez que algumas operações (como liberar o Bloqueio Global do Interpretador) são simplesmente inválidas quando o interpretador está executando o código, mesmo se um módulo como ``ctypes`` ou ``cffi`` é usado para obter acesso às interfaces API C relevantes.
ru: Для приложений, которым нужен низкоуровневый доступ к системе (независимо от причины), модуль бинарного расширения часто *является* лучшим способом решения этой проблемы. Это особенно верно для низкоуровневого доступа к самой среде выполнения CPython, поскольку некоторые операции (например, снятие глобальной блокировки интерпретатора) просто недействительны, когда интерпретатор выполняет код, даже если для получения доступа к соответствующим интерфейсам C API используется модуль типа ``ctypes`` или ``cffi``.
ta: குறைந்த அளவிலான கணினி அணுகல் தேவைப்படும் பயன்பாடுகளுக்கு (காரணத்தைப் பொருட்படுத்தாமல்), ஒரு பைனரி நீட்டிப்பு தொகுதி பெரும்பாலும் * அதைப் பற்றிச் செல்ல சிறந்த வழியாகும். சிபிதான் இயக்க நேரத்திற்கான குறைந்த அளவிலான அணுகலுக்கு இது குறிப்பாக உண்மை, ஏனெனில் சில செயல்பாடுகள் (உலகளாவிய மொழிபெயர்ப்பாளர் பூட்டை வெளியிடுவது போன்றவை) மொழிபெயர்ப்பாளர் குறியீட்டை இயக்கும்போது வெறுமனே செல்லாது, `` ctypes`` அல்லது `` cffi` போன்ற ஒரு தொகுதி கூட இருந்தாலும் கூட தொடர்புடைய சி பநிஇ இடைமுகங்களுக்கான அணுகலைப் பெற `பயன்படுத்தப்படுகிறது.

source: For cases where the extension module is manipulating the underlying operating system or hardware (rather than the CPython runtime), it may sometimes be better to just write an ordinary C library (or a library in another systems programming language like C++ or Rust that can export a C compatible ABI), and then use one of the wrapping techniques described above to make the interface available as an importable Python module.
ja: 拡張モジュールが (CPythonのランタイムではなく) 下層のオペレーティングシステムやハードウェアを操作しようとする場合には、単純に通常の C 言語 (または C++ や Rust のような別のシステム言語で C 言語と互換性のある ABI をエクスポートできるもの) でライブラリを書いて、それを上述のようなインポート可能な Python のモジュールとしてインタフェースを構築できるラッピングテクニックを使う方が良いという場合もあるでしょう。
pt_br: Para casos em que o módulo de extensão está manipulando o sistema operacional ou hardware subjacente (em vez do tempo de execução do CPython), às vezes pode ser melhor apenas escrever uma biblioteca C comum (ou uma biblioteca em outra linguagem de programação de sistemas como C++ ou Rust que pode exportar uma ABI compatível com C) e, em seguida, usar uma das técnicas de agrupamento descritas acima para tornar a interface disponível como um módulo Python importável.
ru: Для случаев, когда модуль расширения манипулирует базовой операционной системой или аппаратным обеспечением (а не средой выполнения CPython), иногда лучше просто написать обычную библиотеку на C (или библиотеку на другом системном языке программирования, например C++ или Rust, который может экспортировать ABI, совместимый с C), а затем использовать одну из описанных выше техник обертывания, чтобы сделать интерфейс доступным в качестве импортируемого модуля Python.
ta: நீட்டிப்பு தொகுதி அடிப்படை இயக்க முறைமை அல்லது வன்பொருளைக் கையாளும் சந்தர்ப்பங்களுக்கு (சிபிதான் இயக்க நேரத்தை விட), சில நேரங்களில் ஒரு சாதாரண சி நூலகத்தை எழுதுவது நல்லது (அல்லது சி ++ அல்லது ஏற்றுமதி செய்யக்கூடிய ரச்ட் போன்ற மற்றொரு கணினி நிரலாக்க மொழியில் ஒரு நூலகம் ஒரு சி இணக்கமான ஏபிஐ), பின்னர் மேலே விவரிக்கப்பட்ட மடக்குதல் நுட்பங்களில் ஒன்றைப் பயன்படுத்தி இடைமுகத்தை இறக்குமதி செய்யக்கூடிய பைதான் தொகுதியாகக் கிடைக்கச் செய்யுங்கள்.

source: Implementing binary extensions
eo: Realigi duumajn etendaĵojn
ja: バイナリ拡張を実装する
pt_br: Implementando extensões binárias
ru: Реализация двоичных расширений
ta: பைனரி நீட்டிப்புகளை செயல்படுத்துகிறது

source: The CPython :doc:`Extending and Embedding <python:extending/index>` guide includes an introduction to writing a :doc:`custom extension module in C <python:extending/extending>`.
eo: The CPython-gvidilo :doc:`Extending and Embedding <python:extending/index>` inkluzivas enkondukon al verkado de :doc:`propra etendaĵa modulo en C <python:extending/extending>`.
ja: CPython の :doc:`拡張と埋め込み <python:extending/index>` のガイドには、 :doc:`C 言語による独自の拡張モジュール <python:extending/extending>` を書くための導入的な説明があります。
pt_br: O guia :doc:`Estendendo e Incorporando <python:extending/index>` do CPython inclui uma introdução a escrever um :doc:`módulo de extensão personalizado no C <python:extending/extending>`.
ru: Руководство CPython :doc:`Extending and Embedding <python:extending/index>` включает в себя введение в написание модуля расширения :doc:`custom extension module in C <python:extending/extending>`.
ta: Cpython: doc: `விரிவாக்குதல் மற்றும் உட்பொதித்தல் <பைதான்: விரிவாக்குதல்/குறியீட்டு>` வழிகாட்டியை எழுதுவதற்கான ஒரு அறிமுகம் அடங்கும்: doc: `C <பைதானில் தனிப்பயன் நீட்டிப்பு தொகுதி: நீட்டித்தல்/நீட்டித்தல்>`.

source: FIXME: Elaborate that all this is one of the reasons why you probably *don't* want to handcode your extension modules :)
eo: FIXME: Klarigu, ke tio estas unu el la kialoj por *ne* malaŭtomate kodi etendaĵajn modulojn ☺
ja: FIXME: これが拡張モジュールを支援ツールなしで書きたいと *思わない* であろうという理由のひとつであることを詳しく説明すること :)
pt_br: CORRIGIR: Elaborar que tudo isso é uma das razões pelas quais você provavelmente *não* deseja codificar manualmente seus módulos de extensão :)
ru: FIXME: Уточните, что все это - одна из причин, почему вы, вероятно, *не* хотите вручную кодировать свои модули расширения :)
ta: Fixme: உங்கள் நீட்டிப்பு தொகுதிகளை நீங்கள் கையால் வைக்க விரும்பாததற்கு இவை அனைத்தும் ஒரு காரணம் என்பதை விரிவாகக் கூறுங்கள் :)

source: Extension module lifecycle
eo: Vivciklo de etendaĵa modulo
ja: 拡張モジュールのライフサイクル
pt_br: Ciclo de vida dos módulos de extensão
ru: Жизненный цикл модуля расширения
ta: நீட்டிப்பு தொகுதி வாழ்க்கை சுழற்சி

source: FIXME: This section needs to be fleshed out.
eo: FIXME: Plenigu ĉi tiun paragrafon.
ja: FIXME: この節には肉付けが必要です。
pt_br: CORRIGIR: Esta seção precisa ser mais detalhada.
ru: FIXME: Этот раздел нуждается в доработке.
ta: Fixme: இந்த பகுதியை வெளியேற்ற வேண்டும்.
