Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: ``Wheel-Version`` is the version number of the Wheel specification.
eo: ``Wheel-Version`` estas la versia numero de la specifo pri Wheel.
ja: ``Wheel-Version`` は、Wheel の仕様のバージョン番号です。
pt_br: ``Wheel-Version`` é o número de versão da especificação Wheel.
ru: ``Wheel-Version`` - это номер версии спецификации Wheel.
ta: `` சக்கர-பதிப்பு`` என்பது சக்கர விவரக்குறிப்பின் பதிப்பு எண்.

source: ``Generator`` is the name and optionally the version of the software that produced the archive.
eo: ``Generator`` estas la nomo kaj, nedevige, la versio de la programo generinta la arĥivon.
ja: ``Generator`` は、そのアーカイブを作成したソフトウェアの名前で、バージョン番号を付加しても構いません。
pt_br: ``Generator`` é o nome e, opcionalmente, a versão do software que produziu o arquivo.
ru: ``Генератор`` - это имя и, опционально, версия программы, создавшей архив.
ta: `` செனரேட்டர்`` என்பது காப்பகத்தை தயாரித்த மென்பொருளின் பெயர் மற்றும் விருப்பமாக பதிப்பாகும்.

source: ``Root-Is-Purelib`` is true if the top level directory of the archive should be installed into purelib; otherwise the root should be installed into platlib.
eo: ``Root-Is-Purelib`` estas vera, se la supranivela dosierujo de la arĥivo instaliĝu al purelib, se ne, la radiko instaliĝu al platlib.
ja: ``Root-Is-Purelib`` は、アーカイブの最上位のディレクトリが pure lib へインストールされるべきものであれば true で、そうでなければ platlib へインストールされます。
pt_br: ``Root-Is-Purelib`` é verdadeiro se o diretório de nível superior do arquivo deve ser instalado em purelib; caso contrário, a raiz deve ser instalada no platlib.
ru: ``Root-Is-Purelib`` имеет значение true, если каталог верхнего уровня архива должен быть установлен в purelib; в противном случае корень должен быть установлен в platlib.
ta: `` ரூட்-ஐச்-பூரெலிப்`` வட்டத்தின் உயர் மட்ட அடைவு பியூரிலிப்பில் நிறுவப்பட வேண்டும் என்றால் உண்மைதான்; இல்லையெனில் ரூட் பிளாட்லிபில் நிறுவப்பட வேண்டும்.

source: ``Tag`` is the wheel's expanded compatibility tags; in the example the filename would contain ``py2.py3-none-any``.
eo: ``Tag`` estas la pliigitaj kongruecaj etikedoj de la wheel; en la ekzemplo, la dosiernomo enhavus ``py2.py3-none-any``.
ja: ``Tag`` は、 wheel の拡張互換性タグで、例の中ではファイル名の ``py2.py3-none-any`` の部分です。
pt_br: ``Tag`` são as tags de compatibilidade expandida do wheel; no exemplo, o nome do arquivo conteria ``py2.py3-none-any``.
ru: ``Tag`` - это расширенные теги совместимости колеса; в примере имя файла будет содержать ``py2.py3-none-any``.
ta: `` குறிச்சொல்`` என்பது சக்கரத்தின் விரிவாக்கப்பட்ட பொருந்தக்கூடிய குறிச்சொற்கள்; எடுத்துக்காட்டில் கோப்பு பெயரில் `` py2.py3-none-any-`` இருக்கும்.

source: ``Build`` is the build number and is omitted if there is no build number.
eo: ``Build`` estas la numero de la konstro; ĝi estas preterlasita, se mankas numero de la konstruo.
ja: ``Build`` は、ビルドナンバーで、もしビルドナンバーがなければ省略されます。
pt_br: ``Build`` é o número da construção e é omitido se não houver número da construção.
ru: ``Build`` - это номер сборки и опускается, если номер сборки отсутствует.
ta: `` பில்ட்`` என்பது உருவாக்க எண் மற்றும் உருவாக்க எண் இல்லாவிட்டால் தவிர்க்கப்படுகிறது.

source: A wheel installer should warn if Wheel-Version is greater than the version it supports, and must fail if Wheel-Version has a greater major version than the version it supports.
eo: Instalilo de wheel avertu, se ``Wheel-Version`` estas pli granda ol la subtenata versio, kaj devas malsukcesi, se ``Wheel-Version`` havas pli grandan maĵoran version ol la subtenatan version.
ja: wheel インストーラは、もし自身がサポートしているものより Wheel-Version が大きければ警告するべきですし、 Wheel-Version のメジャーバージョンがサポートしているものより大きい場合にはフェイルするべきです。
pt_br: Um instalador de wheel deve avisar se Wheel-Version é maior do que a versão que ele suporta, e deve falhar se Wheel-Version tiver uma versão principal maior do que a versão que ele suporta.
ru: Программа установки колеса должна предупреждать, если Wheel-Version больше, чем поддерживаемая ею версия, и должна выходить из строя, если Wheel-Version имеет большую мажорную версию, чем поддерживаемая ею версия.
ta: ஒரு சக்கர நிறுவி அது ஆதரிக்கும் பதிப்பை விட சக்கர-பதிப்பு அதிகமாக இருக்கிறதா என்று எச்சரிக்க வேண்டும், மேலும் சக்கர-பதிப்பு அது ஆதரிக்கும் பதிப்பை விட பெரிய பெரிய பதிப்பைக் கொண்டிருந்தால் தோல்வியடைய வேண்டும்.

source: Wheel, being an installation format that is intended to work across multiple versions of Python, does not generally include .pyc files.
eo: Wheel, estante instaleblaĵon por pluraj versioj de Python, ne ĝenerale inkluzivas ``.pyc``-dosierojn.
ja: Wheel は複数のバージョンの Python を跨いでも動作するように意図されたインストール用のフォーマットですが、通常は .pyc ファイルを含みません。
pt_br: O Wheel, sendo um formato de instalação destinado a funcionar em várias versões do Python, geralmente não inclui arquivos .pyc.
ru: Wheel, будучи форматом установки, предназначенным для работы с несколькими версиями Python, обычно не включает файлы .pyc.
ta: சக்கரம், பைத்தானின் பல பதிப்புகளில் வேலை செய்ய நோக்கம் கொண்ட ஒரு நிறுவல் வடிவமாக இருப்பதால், பொதுவாக .pyc கோப்புகளை சேர்க்காது.

source: Wheel does not contain setup.py or setup.cfg.
eo: Wheel ne enhavas setup.py aŭ setup.cfg.
ja: Wheel は、 setup.py ないし setup.cfg を含みません。
pt_br: Wheel não contém setup.py ou setup.cfg.
ru: Колесо не содержит setup.py или setup.cfg.
ta: சக்கரத்தில் setup.py அல்லது setup.cfg இல்லை.

source: This version of the wheel specification is based on the distutils install schemes and does not define how to install files to other locations. The layout offers a superset of the functionality provided by the existing wininst and egg binary formats.
eo: Ĉi tiu versio de la wheel-normo baziĝas sur la instalo-skemo de ``distutils`` kaj ne difinas kiel instali dosierojn al aliaj lokoj. La aranĝo estas superaro de la funkcioj provizitaj de la ekzistantaj duumaj formoj wininst kaj egg.
ja: このバージョンの wheel 仕様は、distutils のインストール方法論に基づいていて、ファイルを他の場所にインストールする方法については定義していません。既存の wininst や egg バイナリフォーマットが提供する機能の上位互換のレイアウトを提案します。
pt_br: Esta versão da especificação do wheel é baseada nos esquemas de instalação do distutils e não define como instalar arquivos em outros locais. O layout oferece um superconjunto da funcionalidade fornecida pelos formatos binários wininst e egg existentes.
ru: Эта версия спецификации wheel основана на схемах установки distutils и не определяет, как устанавливать файлы в другие места. Схема предлагает супернабор функций, предоставляемых существующими бинарными форматами wininst и egg.
ta: சக்கர விவரக்குறிப்பின் இந்த பதிப்பு தொலைதூர நிறுவல் திட்டங்களை அடிப்படையாகக் கொண்டது மற்றும் பிற இடங்களுக்கு கோப்புகளை எவ்வாறு நிறுவுவது என்பதை வரையறுக்கவில்லை. இந்த தளவமைப்பு தற்போதுள்ள வினின்ச்ட் மற்றும் முட்டை பைனரி வடிவங்களால் வழங்கப்பட்ட செயல்பாட்டின் ஒரு சூப்பர்செட்டை வழங்குகிறது.

source: The .dist-info directory
eo: La dosierujo .dist-info
ja: .dist-info ディレクトリ
pt_br: O diretório .dist-info
ru: Директория .dist-info
ta: .டிச்ட்-இன்ஃபோ அடைவு

source: Wheel .dist-info directories include at a minimum METADATA, WHEEL, and RECORD.
eo: La dosierujoj .dist-info de Wheel inkluzivas, minimume, METADATA, WHEEL, kaj RECORD.
ja: Wheel の .dist-info ディレクトリは、最低限でも METADATA ・ WHEEL ・RECORD を含みます。
pt_br: Os diretórios .dist-info de wheels incluem no mínimo METADATA, WHEEL e RECORD.
ru: Каталоги Wheel .dist-info включают в себя как минимум METADATA, WHEEL и RECORD.
ta: வீல் .டிச்ட்-இன்ஃபோ கோப்பகங்கள் குறைந்தபட்ச மேனிலை தரவு, சக்கரம் மற்றும் பதிவில் அடங்கும்.

source: METADATA is the package metadata, the same format as PKG-INFO as found at the root of sdists.
eo: METADATA estas la pakaj metadatenoj, en la sama formo kiel PKG-INFO en la radiko de fontaj distribuoj.
ja: METADATA はパッケージのメタデータで、 sdists のルートディレクトリにある PKG-INFO と同じフォーマットで記述されます。
pt_br: METADATA são os metadados do pacote, o mesmo formato do PKG-INFO encontrado na raiz dos sdists.
ru: METADATA - это метаданные пакета, в том же формате, что и PKG-INFO, которые находятся в корне sdists.
ta: மேனிலை தரவு என்பது தொகுப்பு மேனிலை தரவு ஆகும், இது SDISTS இன் வேரில் காணப்படும் பி.கே.சி-இன்ஃபோ போன்ற வடிவமாகும்.

source: WHEEL is the wheel metadata specific to a build of the package.
eo: WHEEL estas la wheel-metadatenoj specifaj al iu konstruo de la pako.
ja: WHEEL は、パッケージをビルドする部分に特化した wheel のメタデータです。
pt_br: WHEEL são os metadados de wheel específicos para uma construção do pacote.
ru: WHEEL - это метаданные колеса, специфичные для сборки пакета.
ta: சக்கரம் என்பது தொகுப்பின் கட்டமைப்பிற்கு குறிப்பிட்ட சக்கர மேனிலை தரவு ஆகும்.

source: RECORD is a list of (almost) all the files in the wheel and their secure hashes. Unlike PEP 376, every file except RECORD, which cannot contain a hash of itself, must include its hash. The hash algorithm must be sha256 or better; specifically, md5 and sha1 are not permitted, as signed wheel files rely on the strong hashes in RECORD to validate the integrity of the archive.
eo: RECORD estas listo de (preskaŭ) ĉiuj dosieroj en la wheel kaj iliaj sekuraj haketaĵoj. Male al PEP 376, ĉiu dosiero krom RECORD, kiu ne povas enhavi haketaĵon de si mem, devas inkluzivi sian haketaĵon. La haketaĵa algoritmo devas esti sha256 aŭ pli fortika; specife, md5 kaj sha1 estas malpermesataj, ĉar subskribita wheel-dosiero dependas de la fortikaj haketaĵoj en RECORD por la integrecon de la arĥivo.
ja: RECORD は、 wheel に含まれる (ほとんど) 全てのファイルとそのセキュアなハッシュ値のリストです。 PEP 376 とは異なり、自分自身のハッシュ値を内包することは不可能な RECORD を除く各ファイルのハッシュ値が含まれていなければなりません。署名済みの wheel ファイルがアーカイブの完全性を検証するのに RECORD 内の暗号学的に強いハッシュ値に依存しているので、ハッシュ計算のアルゴリズムは sha256 以上でなければならず、特に md5 とsha1 は許されません。
pt_br: RECORD é uma lista de (quase) todos os arquivos no wheel seus hashes seguros. Ao contrário da PEP 376, nenhum arquivo, exceto RECORD, pode conter um hash de si mesmo, deve incluir seu hash. O algoritmo hash deve ser sha256 ou melhor; especificamente, md5 e sha1 não são permitidos, pois os arquivos wheel assinados contam com hashes fortes em RECORD para validar a integridade do arquivo.
ru: RECORD - это список (почти) всех файлов в колесе и их защищенных хэшей. В отличие от PEP 376, каждый файл, кроме RECORD, который не может содержать хэш самого себя, должен содержать свой хэш. Алгоритм хэша должен быть sha256 или лучше; в частности, md5 и sha1 не допускаются, так как подписанные файлы колеса полагаются на надежные хэши в RECORD для подтверждения целостности архива.
ta: பதிவு என்பது சக்கரத்தில் உள்ள அனைத்து கோப்புகளையும் அவற்றின் பாதுகாப்பான ஆச்களின் (கிட்டத்தட்ட) பட்டியல். PEP 376 ஐப் போலன்றி, பதிவைத் தவிர ஒவ்வொரு கோப்பும், தன்னைத்தானே ஒரு ஆசைக் கொண்டிருக்க முடியாது, அதன் ஆசைக் கொண்டிருக்க வேண்டும். ஆச் வழிமுறை SHA256 அல்லது அதற்கு மேற்பட்டதாக இருக்க வேண்டும்; குறிப்பாக, MD5 மற்றும் SHA1 அனுமதிக்கப்படாது, ஏனெனில் கையொப்பமிடப்பட்ட சக்கர கோப்புகள் காப்பகத்தின் ஒருமைப்பாட்டை சரிபார்க்க பதிவில் உள்ள வலுவான ஆச்களை நம்பியுள்ளன.

source: PEP 376's INSTALLER and REQUESTED are not included in the archive.
eo: La INSTALLER kaj REQUESTED de PEP 376 ne estas inkluzivitaj en la arĥivo.
ja: PEP 376 の INSTALLER と REQUESTED はアーカイブに含まれません。
pt_br: INSTALLER e REQUESTED da PEP 376 não são incluídos no arquivo.
ru: В архив не включены файлы PEP 376 "INSTALLER" и "REQUESTED".
ta: PEP 376 இன் நிறுவி மற்றும் கோரப்பட்டவை காப்பகத்தில் சேர்க்கப்படவில்லை.

source: RECORD.jws is used for digital signatures. It is not mentioned in RECORD.
eo: RECORD.jws estas uzataj por ciferecaj subskriboj. Ĝi ne estas menciita en RECORD.
ja: RECORD.jws は、デジタル署名のために使われます。これについては RECORD では触れられません。
pt_br: RECORD.jws é usado para assinaturas digitais. Não é mencionado no RECORD.
ru: RECORD.jws используется для цифровых подписей. Он не упоминается в RECORD.
ta: Record.JWS டிசிட்டல் கையொப்பங்களுக்கு பயன்படுத்தப்படுகிறது. இது பதிவில் குறிப்பிடப்படவில்லை.

source: RECORD.p7s is allowed as a courtesy to anyone who would prefer to use S/MIME signatures to secure their wheel files. It is not mentioned in RECORD.
eo: RECORD.p7s estas permesata por tiuj, kiuj preferas uzi S/MIME-subskribon por sekurigi wheel-dosieron. Ĝi ne menciiĝas en RECORD.
ja: 自分の wheel ファイルを S/MIME 署名でセキュアにすることを好む人は、 RECORD.p7s を使うことができます。これについては RECORD では触れられません。
pt_br: RECORD.p7s é permitido como cortesia para qualquer pessoa que prefira usar assinaturas S/MIME para proteger seus arquivos wheels. Não é mencionado no RECORD.
ru: RECORD.p7s разрешен в качестве любезности для тех, кто предпочитает использовать подписи S/MIME для защиты своих колесных файлов. Она не упоминается в RECORD.
ta: S/MIME கையொப்பங்களை தங்கள் சக்கரக் கோப்புகளைப் பாதுகாக்க விரும்பும் எவருக்கும் மரியாதையாக Record.P7S அனுமதிக்கப்படுகிறது. இது பதிவில் குறிப்பிடப்படவில்லை.

source: During extraction, wheel installers verify all the hashes in RECORD against the file contents. Apart from RECORD and its signatures, installation will fail if any file in the archive is not both mentioned and correctly hashed in RECORD.
eo: Dum maldensigado, instalilo de wheel kontrolas ĉiujn haketaĵojn en ``RECORD`` kaj la dosierajn enhavojn. Krom ``RECORD`` kaj subskriboj, instalado malsukcesos, se ajna dosiero en la arĥivo ne estas menciita en ``RECORD`` aŭ ne kongruas kun sia haketaĵo.
ja: 展開中に wheel インストーラは RECORD 内のハッシュ値と実際のファイルの内容 (のハッシュ値) をすべて検証します。 RECORD とその署名による検証に加えて、アーカイブの中のいずれかのファイルが RECORD にリストされていないか、または、正しくハッシュされていない時にはインストールがフェイルするでしょう。
pt_br: Durante a extração, os instaladores de wheels verificam todos os hashes em RECORD em relação ao conteúdo do arquivo. Além de RECORD e suas assinaturas, a instalação falhará se qualquer arquivo no arquivo não for mencionado e com hash correto em RECORD.
ru: Во время извлечения программа установки колес сверяет все хэши в RECORD с содержимым файлов. Помимо RECORD и его сигнатур, установка завершится неудачей, если какой-либо файл в архиве не упомянут и не захеширован правильно в RECORD.
ta: பிரித்தெடுக்கும் போது, சக்கர நிறுவிகள் கோப்பு உள்ளடக்கங்களுக்கு எதிராக பதிவுசெய்யப்பட்ட அனைத்து ஆச்களையும் சரிபார்க்கின்றன. பதிவு மற்றும் அதன் கையொப்பங்களைத் தவிர, காப்பகத்தில் உள்ள எந்தவொரு கோப்பும் குறிப்பிடப்படவில்லை மற்றும் பதிவில் சரியாக ஏச் செய்யப்பட்டால் நிறுவல் தோல்வியடையும்.

source: The :file:`.dist-info/licenses/` directory
eo: La dosierujo :file:`.dist-info/licenses/`
ru: Каталог :file:`.dist-info/licenses/`
ta: தி: கோப்பு: `.டிச்ட்-இன்ஃபோ/உரிமங்கள்/` அடைவு

source: If the metadata version is 2.4 or greater and one or more ``License-File`` fields is specified, the :file:`.dist-info/` directory MUST contain a :file:`licenses/` subdirectory, which MUST contain the files listed in the ``License-File`` fields in the :file:`METADATA` file at their respective paths relative to the :file:`licenses/` directory.
eo: Se la metadatena versio estas 2.4 aŭ pli nova kaj unu aŭ pli da kampoj ``License-File`` ekzistas, do la dosierujo :file:`.dist-info/` DEVAS enhavi la subdosierujon :file:`licenses/`, kiu DEVAS enhavi la dosierojn en la kampoj ``License-File`` en la dosiero :file:`METADATA` ĉe la respektivaj dosierlokoj relativaj al la dosierujo :file:`licenses/`.
ru: Если версия метаданных 2.4 или выше и указано одно или несколько полей ``License-File``, каталог :file:`.dist-info/` ДОЛЖЕН содержать подкаталог :file:`licenses/`, который ДОЛЖЕН содержать файлы, перечисленные в полях ``License-File`` в файле :file:`METADATA`` по их соответствующим путям относительно каталога :file:`licenses/`.
ta: மேனிலை தரவு பதிப்பு 2.4 அல்லது அதற்கு மேற்பட்டது மற்றும் ஒன்று அல்லது அதற்கு மேற்பட்ட `` உரிம-கோப்பு`` புலங்கள் குறிப்பிடப்பட்டால்,: கோப்பு: `.டிச்ட்-இன்ஃபோ/` கோப்பகத்தில் ஒரு: கோப்பு: `உரிமங்கள்/` துணை அடைவு இருக்க வேண்டும், அதில் இருக்க வேண்டும் `` உரிமம்-கோப்பு`` புலங்களில் பட்டியலிடப்பட்டுள்ள கோப்புகள்: கோப்பு: `மெட்டாடேட்டா` அந்தந்த பாதைகளில் கோப்பு : கோப்பு: `உரிமங்கள்/` அடைவு.

source: The .data directory
eo: La dosierujo .data
ja: .data ディレクトリ
pt_br: O diretório .data
ru: Директория .data
ta: .டேட்டா அடைவு

source: Any file that is not normally installed inside site-packages goes into the .data directory, named as the .dist-info directory but with the .data/ extension::
eo: Iu ajn dosiero ne ordinare instalita al site-packages iras en la dosierujon .data, nomitan kiel la dosierujon .dist-info sed kun la sufikso .data/::
ja: site-packages 内に通常通りにインストールされなかったファイルはどれでも、.dist-info ディレクトリと同様に命名されるが .data/ 拡張子をつけられて .data ディレクトリに行きます::
pt_br: Qualquer arquivo que não é normalmente instalado dentro de site-packages vai para o diretório .data, nomeado como o diretório .dist-info, mas com a extensão .data/::
ru: Все файлы, которые обычно не устанавливаются внутри пакетов сайта, помещаются в каталог .data, названный так же, как и каталог .dist-info, но с расширением .data/::
ta: தள-தொகுப்புகளுக்குள் பொதுவாக நிறுவப்படாத எந்த கோப்பும் .data கோப்பகத்திற்குள் செல்கிறது, இது .dist-info கோப்பகமாக பெயரிடப்பட்டது, ஆனால் .டேட்டா/ நீட்டிப்பு ::

source: The .data directory contains subdirectories with the scripts, headers, documentation and so forth from the distribution. During installation the contents of these subdirectories are moved onto their destination paths.
eo: La dosierujo ``.data`` enhavas subdosierujojn de la programetoj, ĉapoj, dokumentoj ktp de la distribuo. Dum instalado, la enhavoj de tiuj dosierujoj kopiiĝas al siaj celaj dosierlokoj.
ja: .data ディレクトリでは、配布物からのスクリプト・ヘッダー・説明文書などをサブディレクトリに収めています。インストール中に、これらのサブディレクトリの内容を行き先となるパスへ動かします。
pt_br: O diretório .data contém subdiretórios com os scripts, cabeçalhos, documentação e assim por diante da distribuição. Durante a instalação, o conteúdo desses subdiretórios é movido para seus caminhos de destino.
ru: Каталог .data содержит подкаталоги со скриптами, заголовками, документацией и прочим из дистрибутива. Во время установки содержимое этих подкаталогов переносится на путь назначения.
ta: .டேட்டா கோப்பகத்தில் ச்கிரிப்ட்கள், தலைப்புகள், ஆவணங்கள் மற்றும் பலவற்றைக் கொண்ட துணை அடைவுகள் உள்ளன. நிறுவலின் போது இந்த துணை அடைவுகளின் உள்ளடக்கங்கள் அவற்றின் இலக்கு பாதைகளில் நகர்த்தப்படுகின்றன.

source: Signed wheel files
eo: Subskribitaj wheel-dosieroj
ja: 署名済み wheel ファイル
pt_br: Arquivos wheels assinados
ru: Подписанные файлы колес
ta: கையொப்பமிடப்பட்ட சக்கர கோப்புகள்

source: Wheel files include an extended RECORD that enables digital signatures. PEP 376's RECORD is altered to include a secure hash ``digestname=urlsafe_b64encode_nopad(digest)`` (urlsafe base64 encoding with no trailing = characters) as the second column instead of an md5sum. All possible entries are hashed, including any generated files such as .pyc files, but not RECORD which cannot contain its own hash. For example::
eo: Wheel-dosiero inkluzivas etenditan ``RECORD`` por ciferecaj subskriboj. La ``RECORD`` de PEP 376 estas modifita por inkluzivi sekuran haketaĵon ``digestname=urlsafe_b64encode_nopad(digest)`` (URL-sekura base64-kodado sen finaj signoj ``=``) kiel la duan kolumnon anstataŭ md5sum. Ĉiaj eblaj eroj havu haketaĵojn, inkluzive de generitaj dosieroj kiel ``.pyc``-dosieroj, krom ``RECORD`` mem, kiu ne povas enhavi sian propran haketaĵon. Ekzemple::
ja: Wheel ファイルは、デジタル署名を可能にした拡張 RECORD ファイルを含みます。 PEP 376 の RECORD は、 md5sum の代わりにセキュアなハッシュ値 ``digestname=urlsafe_b64encode_nopad(digest)`` (末尾に = 文字を追加しない url セーフな base64 エンコード) を二つ目のカラムとするように修正されました。生成された .pyc ファイルなども含むすべての可能なエントリにハッシュ値が付加されていますが、 RECORD は自身のハッシュ値を含むことができないので例外です。例えば::
pt_br: Os arquivos wheels incluem um RECORD estendido que permite assinaturas digitais. O RECORD da PEP 376 foi alterado para incluir um hash seguro ``digestname=urlsafe_b64encode_nopad(digest)`` (codificação base64 de urlsafe sem caracteres ao final =) como a segunda coluna em vez de um md5sum. Todas as entradas possíveis são hash, incluindo quaisquer arquivos gerados, como arquivos .pyc, mas não RECORD, que não pode conter seu próprio hash. Por exemplo::
ru: Файлы колес включают расширенную запись RECORD, которая позволяет использовать цифровые подписи. В PEP 376 RECORD изменен, чтобы включать безопасный хэш ``digestname=urlsafe_b64encode_nopad(digest)`` (кодировка urlsafe base64 без задних символов =) в качестве второго столбца вместо md5sum. Хешируются все возможные записи, включая любые сгенерированные файлы, такие как файлы .pyc, но не RECORD, который не может содержать свой собственный хеш. Например::
ta: சக்கர கோப்புகளில் டிசிட்டல் கையொப்பங்களை செயல்படுத்தும் நீட்டிக்கப்பட்ட பதிவு அடங்கும். ஒரு பாதுகாப்பான ஆச் `` டைசச்ட் பெயர் = urlsafe_b64encode_nopad (டைசச்ட்) `` `` (ட்ரெயில்ங் = எழுத்துக்கள் இல்லாத URLSAFE BASE64 குறியாக்கம்) ஒரு MD5SUM க்கு பதிலாக இரண்டாவது நெடுவரிசையாக சேர்க்க PEP 376 இன் பதிவு மாற்றப்பட்டுள்ளது. .Pyc கோப்புகள் போன்ற எந்தவொரு உருவாக்கப்பட்ட கோப்புகளும் உட்பட, சாத்தியமான அனைத்து உள்ளீடுகளும் ஆசெட் செய்யப்படுகின்றன, ஆனால் அதன் சொந்த ஆசைக் கொண்டிருக்க முடியாத பதிவு அல்ல. உதாரணமாக ::

source: The signature file(s) RECORD.jws and RECORD.p7s are not mentioned in RECORD at all since they can only be added after RECORD is generated. Every other file in the archive must have a correct hash in RECORD or the installation will fail.
eo: La subskribo-dosiero(j) RECORD.jws kaj RECORD.p7s ne menciiĝas en RECORD, ĉar ili estas nur aldoneblaj post la generado de RECORD. Ĉiu alia dosiero en la arĥivo devas havi ĝustan haketaĵon en RECORD; se ne, la instalado malsukcesos.
ja: 署名用のファイルである RECORD.jws と RECORD.p7s は、 RECORD ファイルが作成された後にしか追加できないので、RECORD ファイル内で言及されることは全くありません。アーカイブの中の他のファイルはすべて、RECORD ファイル内に正しいハッシュ値を持たなければならず、そうでなければインストールに失敗します。
pt_br: O(s) arquivo(s) de assinatura RECORD.jws e RECORD.p7s não são mencionados em RECORD, pois eles só podem ser adicionados após RECORD ser gerado. Todos os outros arquivos no arquivo devem ter um hash correto em RECORD ou a instalação falhará.
ru: Файл(ы) подписи RECORD.jws и RECORD.p7s вообще не упоминаются в RECORD, поскольку они могут быть добавлены только после создания RECORD. Все остальные файлы в архиве должны иметь правильный хэш в RECORD, иначе установка завершится неудачей.
ta: கையொப்ப கோப்பு (கள்) பதிவு. JWS மற்றும் Record.P7 கள் பதிவில் குறிப்பிடப்படவில்லை, ஏனெனில் அவை பதிவு உருவாக்கப்பட்ட பின்னரே சேர்க்க முடியும். காப்பகத்தில் உள்ள மற்ற ஒவ்வொரு கோப்பிலும் பதிவில் சரியான ஆச் இருக்க வேண்டும் அல்லது நிறுவல் தோல்வியடையும்.

source: If JSON web signatures are used, one or more JSON Web Signature JSON Serialization (JWS-JS) signatures is stored in a file RECORD.jws adjacent to RECORD. JWS is used to sign RECORD by including the SHA-256 hash of RECORD as the signature's JSON payload:
eo: Se oni uzas JSON-retsubskriboj (JWS), unu aŭ pluraj subskriboj uzantaj JSON-seriigon de JSON-retsubskribo (JWS-JS) konserviĝas en dosiero ``RECORD.jws`` apud ``RECORD``. Oni uzas JWS por subskribi ``RECORD`` inkluzivante la haketaĵon SHA-256 de ``RECORD`` kiel la JSON-ŝarĝon de la subskribo:
ja: JSON ウェブ署名が使われる場合には、ひとつかそれ以上の JSON Web Signature JSON Serialization (JWS-JS) 署名が RECORD ファイルの隣にある RECORD.jws ファイルの中に保存されます。 RECORD ファイルの SHA-256 ハッシュ値を署名の JSON ペイロードに含むことで RECORD ファイルに署名するために JWS が使われます:
ru: Если используются веб-подписи JSON, одна или несколько подписей JSON Web Signature JSON Serialization (JWS-JS) хранятся в файле RECORD.jws, примыкающем к RECORD. JWS используется для подписи RECORD путем включения SHA-256 хэша RECORD в качестве полезной нагрузки JSON подписи:
ta: சாதொபொகு வலை கையொப்பங்கள் பயன்படுத்தப்பட்டால், ஒன்று அல்லது அதற்கு மேற்பட்ட சாதொபொகு வலை கையொப்பம் சாதொபொகு சீரியலைசேசன் (JWS-JS) கையொப்பங்கள் ஒரு கோப்பு பதிவில் சேமிக்கப்படுகின்றன. பதிவுக்கு அருகிலுள்ள JWS. கையொப்பத்தின் சாதொபொகு பேலோடாக SHA-256 ஆச் பதிவின் மூலம் பதிவில் கையெழுத்திட JWS பயன்படுத்தப்படுகிறது:

source: (The hash value is the same format used in RECORD.)
eo: (La haketaĵa valoro estas la sama formo uzata en RECORD.)
ja: (ハッシュ値の書き方のフォーマットは RECORD で使われるものと同じです。)
pt_br: (O valor hash é o mesmo formato usado em RECORD.)
ru: (Хеш-значение имеет тот же формат, что и в RECORD)
ta: (ஆச் மதிப்பு என்பது பதிவில் பயன்படுத்தப்படும் அதே வடிவமாகும்.)
