Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: On Windows you can find the user base binary directory by running ``py -m site --user-site`` and replacing ``site-packages`` with ``Scripts``. For example, this could return ``C:\Users\Username\AppData\Roaming\Python36\site-packages`` so you would need to set your ``PATH`` to include ``C:\Users\Username\AppData\Roaming\Python36\Scripts``. You can set your user ``PATH`` permanently in the `Control Panel`_. You may need to log out for the ``PATH`` changes to take effect.
eo: Sur Windows, oni povas trovi la bazan duumaĵan dosierujon de uzanto rulante ``py -m site --user-site`` kaj anstataŭigante ``site-packages`` per ``Scripts``. Ekzemple, la komando povus eligi ``C:\Users\Salutnomo\AppData\Roaming\Python36\site-packages``, kaj oni agordus sian ``PATH`` inkluzivante ``C:\Users\Salutnomo\AppData\Roaming\Python36\Scripts``. Oni povas agordi sian ``PATH`` malprovizore en la `Stirpanelo <Control Panel>`_. Oni eble devas adiaŭi por efektivigi la ŝanĝojn pri ``PATH``.
ja: Windows 上では、 ``py -m site --user-site`` の結果について ``site-packages`` を ``Scripts`` で置き換えればユーザベースのバイナリ置き場となるディレクトリを見つけることができるでしょう。このコマンドは例えば ``C:\Users\Username\AppData\Roaming\Python36\site-packages`` のような結果を返すので、 ``PATH`` に ``C:\Users\Username\AppData\Roaming\Python36\Scripts`` が含まれるようにする必要があるでしょう。 `Control Panel`_ で恒久的に ``PATH`` を設定することができるでしょう。 ``PATH`` の修正が効果を持つには、一旦ログアウトする必要があるかもしれません。
pt_br: No Windows você pode encontrar o diretório binário base do usuário executando ``py -m site --user-site`` e substituindo ``site-packages`` por ``Scripts``. Por exemplo, isso poderia retornar ``C:\Users\Username\AppData\Roaming\Python36\site-packages``, então você precisaria definir seu ``PATH`` para incluir ``C:\Users\Username\AppData\Roaming\Python36\Scripts``. Você pode definir seu usuário ``PATH`` permanentemente no `Painel de Controle`_. Você pode precisar encerrar a sessão para que as alterações de ``PATH`` tenham efeito.
ru: В Windows вы можете найти двоичный каталог пользовательской базы, выполнив команду ``py -m site --user-site`` и заменив ``Site-packages`` на ``Scripts``. Например, это может вернуть ``C:\Users\Username\AppData\Roaming\Python36\site-packages``, так что вам нужно будет установить ваш ``PATH``, чтобы включить ``C:\Users\Username\AppData\Roaming\Python36\Scripts``. Вы можете установить пользовательский ``PATH'' постоянно в ``Панели управления''. Чтобы изменения ``PATH'' вступили в силу, вам может потребоваться выйти из системы.
ta: சாளரங்களில் நீங்கள் `` py -m தளத்தை-பயனர்-தளத்தை `` `` தள-தொகுப்புகள்`` `` ச்கிரிப்ட்கள்`` உடன் மாற்றுவதன் மூலம் பயனர் அடிப்படை பைனரி கோப்பகத்தைக் காணலாம். க்கு example, this could return ``C:\Users\Username\AppData\Roaming\Python36\site-packages`` so you would need பெறுநர் கணம் your ``PATH`` பெறுநர் include ``C:\Users\Username\AppData\Roaming\Python36\Scripts``. உங்கள் பயனரை `கட்டுப்பாட்டு குழு`_ இல் நிரந்தரமாக அமைக்கலாம். நடைமுறைக்கு வருவதற்கான `` பாதை` `மாற்றங்களுக்கு நீங்கள் வெளியேற வேண்டியிருக்கலாம்.

source: Install a list of requirements specified in a :ref:`Requirements File <pip:Requirements Files>`.
eo: Instali liston de postuloj en :ref:`Postulo-Dosiero <pip:Requirements Files>`.
ja: :ref:`Requirements ファイル <pip:Requirements Files>` で指定された一連の必須条件となる依存先をインストールしましょう。
pt_br: Instale uma lista de requisitos especificados em um :ref:`arquivo de requisitos <pip:Requirements Files>`.
ru: Установка списка требований, указанных в :ref:`Requirements File <pip:Requirements Files>`.
ta: A இல் குறிப்பிடப்பட்டுள்ள தேவைகளின் பட்டியலை நிறுவவும்: ref: `தேவைகள் கோப்பு <PIP: தேவைகள் கோப்புகள்>`.

source: Installing from VCS
eo: Instali el Versikontrola Sistemo
ja: VCS からインストールする
pt_br: Instalando a partir de VCS
ru: Установка из СКВ
ta: பகஅ இலிருந்து நிறுவுகிறது

source: Install a project from VCS in "editable" mode. For a full breakdown of the syntax, see pip's section on :ref:`VCS Support <pip:VCS Support>`.
eo: Instali projekton el versikontrola sistem en «redaktebla» reĝimo. Por plenaj detaloj de la sintakso, vidu la dokumentaron de pip pri :ref:`Subteno de Versikontrola Sistemo <pip:VCS Support>`.
ja: プロジェクトを VCS から "編集可能" モードでインストールしましょう。この構文を全て細かく説明したものについては、 :ref:`VCS サポート <pip:VCS Support>` の pip の節を見てください。
pt_br: Instale um projeto a partir de VCS em um modo "editável". Para um instrução completa da sintaxe, veja a seção do pip em :ref:`VCS Support <pip:VCS Support>`.
ru: Установка проекта из VCS в "редактируемом" режиме. Полное описание синтаксиса см. в разделе pip по :ref:`VCS Support <pip:VCS Support>`.
ta: பகஅ இலிருந்து ஒரு திட்டத்தை "திருத்தக்கூடிய" பயன்முறையில் நிறுவவும். தொடரியல் முழு முறிவுக்கு, பைப்பின் பகுதியைப் பார்க்கவும்: குறிப்பு: `வி.சி.எச் உதவி <பிஐபி: வி.சி.எச் ஆதரவு>`.

source: Installing from other Indexes
eo: Instali el aliaj Indeksoj
ja: 他のインデックスサイトからインストールする
pt_br: Instalando a partir de outros índices
ru: Установка из других индексов
ta: பிற குறியீடுகளிலிருந்து நிறுவுகிறது

source: Install from an alternate index
eo: Instali el alternativa indekso
ja: 代替となるインデックスサイトからインストールする
pt_br: Instalar a partir de um índice alternativo
ru: Установка из альтернативного индекса
ta: மாற்று குறியீட்டிலிருந்து நிறுவவும்

source: Search an additional index during install, in addition to :term:`PyPI <Python Package Index (PyPI)>`
eo: Dum instalado serĉi plian indekson kune kun :term:`PyPI <Python Package Index (PyPI)>`
ja: :term:`PyPI <Python Package Index (PyPI)>` に加えて、追加のインデックスサイトをインストール中に探索する
pt_br: Pesquise um índice adicional durante a instalação, além do :term:`PyPI <Python Package Index (PyPI)>`
ru: Поиск дополнительного индекса во время установки, в дополнение к :term:`PyPI <Python Package Index (PyPI)>`
ta: நிறுவலின் போது கூடுதல் குறியீட்டைத் தேடுங்கள், கூடுதலாக: கால: `பைபி <பைதான் தொகுப்பு அட்டவணை (பைபி)>`

source: Installing from a local src tree
eo: Instali el loka fonta arbo
ja: ローカルのソースツリーからインストールする
pt_br: Instalando a partir de uma árvore de fontes local
ru: Установка из локального дерева исходных кодов
ta: உள்ளக எச்.ஆர்.சி மரத்திலிருந்து நிறுவுகிறது

source: Installing from local src in :doc:`Development Mode <setuptools:userguide/development_mode>`, i.e. in such a way that the project appears to be installed, but yet is still editable from the src tree.
eo: Instali el loka fontarbo en :doc:`evoluada reĝimo <setuptools:userguide/development_mode>`, tiel ke la projekto estas instalita sed tamen modifebla ĉe la fontarbo.
ja: :doc:`開発モード <setuptools:userguide/development_mode>` 、すなわち、プロジェクトがインストールされていて、しかも、ソースツリーからへんしゅうかのうであるような方法でローカルのソースツリーからインストールすること。
pt_br: Instale a partir dos fontes locais em :doc:`Development Mode <setuptools:userguide/development_mode>`, ou seja, de tal forma que o projeto parece estar instalado, mas ainda seja editável a partir da árvore de fontes.
ru: Установка из локального src в :doc:`Режиме разработки <setuptools:userguide/development_mode>`, т.е. таким образом, что проект кажется установленным, но при этом его можно редактировать из дерева src.
ta: உள்ளக எச்.ஆர்.சியிலிருந்து நிறுவுதல்: டிஓசி: `மேம்பாட்டு முறை <செட்டப்டூல்ச்: பயனர் வழிகாட்டி/மேம்பாட்டு பயன்முறை>`, ஐ.எச்.எச். திட்டம் நிறுவப்பட்டதாகத் தோன்றும் வகையில், ஆனால் இன்னும் எச்.ஆர்.சி மரத்திலிருந்து திருத்தக்கூடியது.

source: You can also install normally from src
eo: Vi ankaŭ povas instali ordinare el fonto
ja: ソースツリーから通常通りにインストールすることも可能
pt_br: Você também pode instalar normalmente a partir dos fontes
ru: Вы также можете установить обычную установку из src
ta: நீங்கள் பொதுவாக SRC இலிருந்து நிறுவலாம்

source: Installing from local archives
eo: Instali el loka arĥivo
ja: ローカルアーカイブからインストールする
pt_br: Instalando de arquivos locais
ru: Установка из локальных архивов
ta: உள்ளக காப்பகங்களிலிருந்து நிறுவுதல்

source: Install a particular source archive file.
eo: Instali specifan fontan arĥivan dosieron.
ja: 特定のソースコードアーカイブファイルをインストールする。
pt_br: Instale um arquivo de pacote fonte em particular.
ru: Установка определенного файла исходного архива.
ta: ஒரு குறிப்பிட்ட மூல காப்பக கோப்பை நிறுவவும்.

source: Install from a local directory containing archives (and don't check :term:`PyPI <Python Package Index (PyPI)>`)
eo: Instali el loka dosierujo enhavanta arĥivojn (kaj ne kontroli :term:`PyPI <Python Package Index (PyPI)>`)
ja: アーカイブを含んだローカルのディレクトリから(しかも :term:`PyPI <Python Package Index (PyPI)>` をチェックしないで)インストールする
pt_br: Instale de um pacote contendo diretório local (e não verifique o :term:`PyPI <Python Package Index (PyPI)>`)
ru: Установите из локальной директории, содержащей архивы (и не проверяйте :term:`PyPI <Python Package Index (PyPI)>`)
ta: காப்பகங்களைக் கொண்ட உள்ளக கோப்பகத்திலிருந்து நிறுவவும் (மற்றும் சரிபார்க்க வேண்டாம்: சொல்: `பைபி <பைதான் தொகுப்பு குறியீட்டு (பைபி)>`)

source: Installing from other sources
eo: Instali el aliaj fontoj
ja: 他の場所からインストールする
pt_br: Instalando a partir de outras fontes
ru: Установка из других источников
ta: பிற மூலங்களிலிருந்து நிறுவுகிறது

source: To install from other data sources (for example Amazon S3 storage) you can create a helper application that presents the data in a format compliant with the :ref:`simple repository API <simple-repository-api>`:, and use the ``--extra-index-url`` flag to direct pip to use that index.
eo: Por instali el alia datenfonto (ekzemple el konservejo Amazon S3), oni povas krei helpan programon, kiu prezentas la datenojn kongrue kun la :ref:`simpla deponeja API <simple-repository-api>`:, kaj uzi la flagon ``--extra-index-url`` igante pip uzi tiun indekson.
ja: :ref:`simple repository API <simple-repository-api>` 準拠のフォーマットに合わせてデータを表現するようなヘルパーアプリケーションを作成して、 pip を ``--extra-index-url`` フラグでそのインデックスへ向け直すことで、他のデータソース (例えば Amazon S3 ストレージ) からインストールすることができます。
pt_br: Para instalar a partir de outras fontes de dados (por exemplo, armazenamento Amazon S3), você pode criar uma aplicação auxiliar que apresente os dados em um formato compatível com a :ref:`API de repositório simples <simple-repository-api>`, e usar o sinalizador ``--extra-index-url`` para direcionar o pip para usar esse índice.
ru: Для установки из других источников данных (например, из хранилища Amazon S3) вы можете создать вспомогательное приложение, представляющее данные в формате, совместимом с :ref:`simple repository API <simple-repository-api>:, и использовать флаг ``--extra-index-url``, чтобы направить pip на использование этого индекса.
ta: பிற தரவு மூலங்களிலிருந்து நிறுவ (எடுத்துக்காட்டாக அமேசான் எச் 3 சேமிப்பிடம்) நீங்கள் ஒரு உதவி பயன்பாட்டை உருவாக்கலாம், இது ஒரு வடிவத்தில் இணக்கமான வடிவத்தில் வழங்கலாம்: ref: `எளிய களஞ்சிய பநிஇ <எளிய-ரோபோசிட்டரி-ஏபிஐ>`:, மற்றும் ``-எக்ச்ட்ரா-இன்டெக்ச்-உர்எல்``` கொடியை அந்த குறியீட்டைப் பயன்படுத்துவதற்கு நேரடியாகப் பயன்படுத்தவும்.

source: Installing Prereleases
eo: Instali Antaŭeldonojn
ja: リリース前のバージョンをインストールする
pt_br: Instalando pré-lançamentos
ru: Установка предварительных выпусков
ta: முன்நிபந்தனைகளை நிறுவுதல்

source: Find pre-release and development versions, in addition to stable versions. By default, pip only finds stable versions.
eo: Trovi antaŭeldonajn kaj evoluadajn versiojn, aldone al stabilaj versioj. Apriore, pip nur trovas stabilajn versiojn.
ja: 安定バージョンに加えて、リリース前のバージョンや開発中のバージョンを見つけましょう。デフォルトでは pip は安定バージョンだけを探索します。
pt_br: Encontre versões de pré-lançamento e desenvolvimento, além de versões estáveis. Por padrão, pip só encontra versões estáveis.
ru: Найдите предварительные версии и версии для разработки в дополнение к стабильным версиям. По умолчанию pip находит только стабильные версии.
ta: நிலையான பதிப்புகளுக்கு கூடுதலாக, முன் வெளியீடு மற்றும் மேம்பாட்டு பதிப்புகளைக் கண்டறியவும். இயல்பாக, பிஐபி நிலையான பதிப்புகளை மட்டுமே காண்கிறது.

source: Installing "Extras"
eo: Instali «Ekstraĵojn»
ja: パッケージの "Extras" をインストールする
pt_br: Instalando "Extras"
ru: Установка "Дополнений"
ta: "கூடுதல்" நிறுவுதல்

source: Extras are optional "variants" of a package, which may include additional dependencies, and thereby enable additional functionality from the package. If you wish to install an extra for a package which you know publishes one, you can include it in the pip installation command:
eo: Ekstraĵo estas laŭvola «varianto» de pako, kiuj povas inkluzivi pliajn dependecojn kaj tiel ebligi pliajn funkciojn de la pako. Se oni deziras instali ekstraĵon por pako, kiu havas ekstraĵon, oni povas inkluzivi ĝin en la instalokomandon de pip:
ja: Extras は、パッケージのオプション的な "変種" で、追加的な依存先を加えることも可能であり、従って、パッケージの追加的な機能を有効化することができるものです。もし、one なる機能を追加するとわかっているパッケージの追加部分 (extra) をインストールしたいのであれば、次のような pip のインストールコマンドを使うことでそれを追加することができます:
pt_br: Extras são "variantes" opcionais de um pacote, que podem incluir dependências adicionais e, assim, habilitar funcionalidades adicionais do pacote. Se você deseja instalar um extra para um pacote que você sabe que publica um, você pode incluí-lo no comando de instalação pip:
ru: Дополнения - это необязательные "варианты" пакета, которые могут включать дополнительные зависимости и тем самым обеспечивать дополнительную функциональность пакета. Если вы хотите установить дополнительное расширение для пакета, который, как вы знаете, его публикует, вы можете включить его в команду установки pip:
ta: கூடுதல் ஒரு தொகுப்பின் விருப்பமான "மாறுபாடுகள்" ஆகும், இதில் கூடுதல் சார்புநிலைகள் இருக்கலாம், இதன் மூலம் தொகுப்பிலிருந்து கூடுதல் செயல்பாட்டை செயல்படுத்துகின்றன. ஒன்றை வெளியிடுவது உங்களுக்குத் தெரிந்த ஒரு தொகுப்புக்கு கூடுதல் நிறுவ விரும்பினால், நீங்கள் அதை PIP நிறுவல் கட்டளையில் சேர்க்கலாம்:

source: "Secure" in this context means using a modern browser or a tool like :command:`curl` that verifies SSL certificates when downloading from https URLs.
eo: En ĉi tiu kunteksto, «sekura» signifas uzi modernan TTT-legilon aŭ ilon kiel :command:`curl` kiu konfirmas SSL-atestilojn dum elŝutado el ``https``-retadresoj.
ja: この文脈での "Secure" とは、https の付く URL からダウンロードする際に、近代的なブラウザか :command:`curl` のようなツールを使って SSL 証明書を検証することを意味しています。
pt_br: "Segurança" neste contexto significa usar um navegador moderno ou uma ferramenta como :command:`curl` que verifica os certificados SSL ao baixar de URLs https.
ru: "Безопасный" в данном контексте означает использование современного браузера или такого инструмента, как :command:`curl`, который проверяет SSL-сертификаты при загрузке с https-адресов.
ta: இந்த சூழலில் "பாதுகாப்பானது" என்பது நவீன உலாவி அல்லது ஒரு கருவியைப் பயன்படுத்துவதாகும்: கட்டளை: `சுருட்டை` இது HTTPS முகவரி களில் இருந்து பதிவிறக்கும் போது SSL சான்றிதழ்களை சரிபார்க்கிறது.

source: Beginning with Python 3.4, ``venv`` (a stdlib alternative to :ref:`virtualenv`) will create virtualenv environments with ``pip`` pre-installed, thereby making it an equal alternative to :ref:`virtualenv`.
eo: Ekde Python 3.4, ``venv`` (alternativo al :ref:`virtualenv` en la norma biblioteko) kreas virtualan medion kun antaŭinstalita ``pip``, simile al :ref:`virtualenv`.
ja: Python 3.4 以降は (:ref:`virtualenv` の代替物で標準ライブラリに取り込まれた) ``venv``があるので、インストール済みの ``pip`` で virtualenv 環境を作成でき、それによって :ref:`virtualenv` の同等な代替物となっています。
pt_br: Começando com Python 3.4, ``venv`` (uma alternativa à biblioteca padrão para :ref:`virtualenv`) criará ambientes do virtualenv com ``pip`` pré-instalado, tornando-o uma alternativa igual a :ref:`virtualenv`.
ru: Начиная с Python 3.4, ``venv`` (stdlib-альтернатива :ref:`virtualenv`) будет создавать виртуальные среды virtualenv с предустановленным ``pip``, что делает его равноправной альтернативой :ref:`virtualenv``.
ta: பைதான் 3.4 உடன் தொடங்கி, `` வெர்வ்`` (ஒரு எச்.டி.எல்.ஐ.பி மாற்று: ref: `மெய்நிகர்என்வ்`) மெய்நிகர் ஈட்டிங் சூழல்களை முன் நிறுவப்பட்ட` `பிஐபி`` உடன் உருவாக்கும், இதனால் இது சமமான மாற்றாக அமைகிறது: குறிப்பு:` மெய்நிகர் ஈன்வ்`.

source: The compatible release specifier was accepted in :pep:`440` and support was released in :ref:`setuptools` v8.0 and :ref:`pip` v6.0
eo: La specifilo pri kongrua eldono estis akceptita en :pep:`440`, kaj :ref:`setuptools` v8.0 kaj :ref:`pip` v6.0 eksubtenis ĝin
ja: 互換性のあるリリース指定子は :pep:`440` で受容され、そのサポートが :ref:`setuptools` v8.0 と :ref:``pip` v6.0 でリリースされました
pt_br: O especificador de versão compatível foi aceito em :pep:`440` e o suporte foi lançado em :ref:`setuptools` v8.0 e :ref:`pip` v6.0
ru: Спецификатор совместимого выпуска был принят в :pep:`440` и поддержка была выпущена в :ref:`setuptools` v8.0 и :ref:`pip` v6.0
ta: இணக்கமான வெளியீட்டு விவரக்குறிப்பு ஏற்றுக்கொள்ளப்பட்டது: PEP: `440` மற்றும் உதவி வெளியிடப்பட்டது: Ref:` setuptools` v8.0 மற்றும்: Ref: `Pip` v6.0

source: Managing Application Dependencies
eo: Administri Programajn Dependecojn
ja: アプリケーションの依存関係を管理する
pt_br: Gerenciando dependências de aplicações
ru: Управление зависимостями приложений
ta: விண்ணப்ப சார்புகளை நிர்வகித்தல்

source: The :ref:`package installation tutorial <installing-packages>` covered the basics of getting set up to install and update Python packages.
eo: La :ref:`lernilo pri instalado de pako <installing-packages>` diskutis la fundamentojn pri instalado kaj ĝisdatigado de Python-pakoj.
ja: :ref:`パッケージインストールに関するチュートリアル <installing-packages>` には、 Python のパッケージをインストールしたり更新したりするための準備の基本が説明されています。
pt_br: O :ref:`tutorial de instalação do pacote <installing-packages>` cobriu os fundamentos da configuração para instalar e atualizar pacotes Python.
ru: В :ref:`учебнике по установке пакетов <installing-packages>` рассматривались основы настройки установки и обновления пакетов Python.
ta: தி: ரெஃப்: `தொகுப்பு நிறுவல் பயிற்சி <நிறுவல்-பேக்கேச்கள்>` பைதான் தொகுப்புகளை நிறுவவும் புதுப்பிக்கவும் அமைக்கப்படுவதற்கான அடிப்படைகளை உள்ளடக்கியது.

source: However, running these commands interactively can get tedious even for your own personal projects, and things get even more difficult when trying to set up development environments automatically for projects with multiple contributors.
eo: Tamen, interage ruli tiajn komandojn estas tede, eĉ por onia propra projekto, kaj eĉ pli malfacile estas starigi disvolvajn mediojn aŭtomate por projektoj kun multaj kontribuantoj.
ja: しかしながら、これらのコマンドを対話形式で実行することは、自分自身の個人的なプロジェクト向けであってもうんざりする作業になりかねないし、複数の貢献者が参加するようなプロジェクト向けに開発環境を自動的に設定することを試みる場合にはもっと困難にさえなるでしょう。
pt_br: No entanto, executar esses comandos interativamente pode se tornar tedioso até mesmo para seus próprios projetos pessoais, e as coisas ficam ainda mais difíceis ao tentar configurar ambientes de desenvolvimento automaticamente para projetos com vários contribuidores.
ru: Однако интерактивное выполнение этих команд может быть утомительным даже для ваших личных проектов, и все становится еще сложнее, когда вы пытаетесь автоматически настроить среду разработки для проектов с несколькими соавторами.
ta: எவ்வாறாயினும், இந்த கட்டளைகளை ஊடாடும் வகையில் இயக்குவது உங்கள் சொந்த திட்டங்களுக்கு கூட கடினமாகிவிடும், மேலும் பல பங்களிப்பாளர்களைக் கொண்ட திட்டங்களுக்கு தானாகவே மேம்பாட்டு சூழல்களை அமைக்க முயற்சிக்கும்போது விசயங்கள் இன்னும் கடினமாகிவிடும்.

source: This tutorial walks you through the use of :ref:`Pipenv` to manage dependencies for an application. It will show you how to install and use the necessary tools and make strong recommendations on best practices.
eo: Ĉi tiu lernilo priskribas kiel uzi :ref:`Pipenv` por administri dependecojn de programo. Ĝi klarigas kiel instali kaj uzi la necesajn ilojn, kaj rekomendegas bonajn elektojn.
ja: このチュートリアルでは、 :ref:`Pipenv` を使ってアプリケーションの依存関係を管理する方法について一通り見て回ります。必要なツール群のインストールの仕方もお見せしますし、ベストプラクティスについても強い推奨をします。
pt_br: Este tutorial orienta você no uso de :ref:`Pipenv` para gerenciar dependências para uma aplicação. Ele mostrará como instalar e usar as ferramentas necessárias e fará recomendações fortes sobre as melhores práticas.
ru: В этом руководстве вы узнаете, как использовать :ref:`Pipenv` для управления зависимостями в приложении. Оно покажет вам, как установить и использовать необходимые инструменты, а также даст рекомендации по использованию лучших практик.
ta: இந்த டுடோரியல் பயன்பாட்டின் மூலம் உங்களை அழைத்துச் செல்கிறது: ref: `பைபென்வ்` ஒரு விண்ணப்பத்திற்கான சார்புகளை நிர்வகிக்க. தேவையான கருவிகளை எவ்வாறு நிறுவுவது மற்றும் பயன்படுத்துவது மற்றும் சிறந்த நடைமுறைகளில் வலுவான பரிந்துரைகளை வழங்குவது என்பதை இது காண்பிக்கும்.

source: Keep in mind that Python is used for a great many different purposes, and precisely how you want to manage your dependencies may change based on how you decide to publish your software. The guidance presented here is most directly applicable to the development and deployment of network services (including web applications), but is also very well suited to managing development and testing environments for any kind of project.
eo: Python estas uzata por multaj diversaj celoj, kaj ĝuste kiel oni administras dependecojn dependas de la maniero de eldonado de la programo. La konsilo ĉi tie plej taŭgas por programado kaj disponigado de retservoj (inkluzive de TTT-programoj), sed ankaŭ estas bona por mastrumi programadajn kaj testajn mediojn de ĉia projekto.
ja: 覚えておいてもらいたいのは、 Python が極めて多岐に渡る目的に使用されるということと、あなたが自分のソフトウェアを公開するやり方によって依存関係を管理する正確なやり方が変化するであろうということです。ここに書かれているガイダンスは、ネットワークサービス (web アプリケーションを含む) の開発やデプロイメントには最も直接的に適用できますが、どんな種類のプロジェクトであってもその開発や試験のための環境を管理するのにとても適切であると言えるでしょう。
pt_br: Lembre-se de que Python é usado para muitos propósitos diferentes e, precisamente, como você deseja gerenciar suas dependências pode mudar com base em como você decide publicar seu software. A orientação apresentada aqui é mais diretamente aplicável ao desenvolvimento e implantação de serviços de rede (incluindo aplicações web), mas também é muito adequada para gerenciar ambientes de desenvolvimento e teste para qualquer tipo de projeto.
ru: Не забывайте, что Python используется для множества различных целей, и то, как именно вы хотите управлять зависимостями, может измениться в зависимости от того, как вы решите опубликовать свое программное обеспечение. Представленное здесь руководство наиболее непосредственно применимо к разработке и развертыванию сетевых сервисов (включая веб-приложения), но оно также очень хорошо подходит для управления средами разработки и тестирования для любого проекта.
ta: பைத்தான் பல வேறுபட்ட நோக்கங்களுக்காகப் பயன்படுத்தப்படுகிறது என்பதை நினைவில் கொள்ளுங்கள், மேலும் உங்கள் மென்பொருளை எவ்வாறு வெளியிட முடிவு செய்கிறீர்கள் என்பதன் அடிப்படையில் உங்கள் சார்புகளை எவ்வாறு நிர்வகிக்க விரும்புகிறீர்கள் என்பதை துல்லியமாக மாற்றலாம். இங்கு வழங்கப்பட்ட வழிகாட்டுதல் பிணையம் சேவைகளின் (வலை பயன்பாடுகள் உட்பட) வளர்ச்சி மற்றும் வரிசைப்படுத்தலுக்கு நேரடியாக பொருந்தும், ஆனால் எந்தவொரு திட்டத்திற்கும் வளர்ச்சி மற்றும் சோதனை சூழல்களை நிர்வகிப்பதற்கும் இது மிகவும் பொருத்தமானது.

source: For alternatives, see `Other Tools for Application Dependency Management`_.
eo: Por alternativoj, vidu la paragrafon `Aliaj Iloj por Administri Programan Dependecon <Other Tools for Application Dependency Management>`_.
ja: 他の手段については、 `アプリケーションの依存関係管理のための他のツール群 <Other Tools for Application Dependency Management>`_ を見てください。
pt_br: Para alternativas, veja `Outras ferramentas para gerenciamento de dependências de aplicações`_.
ru: Альтернативные варианты см. в разделе `Другие инструменты для управления зависимостями приложений`_.
ta: மாற்றுகளுக்கு, பயன்பாட்டு சார்பு மேலாண்மைக்கான பிற கருவிகளைப் பார்க்கவும் `_.

source: Installing Pipenv
eo: Instali Pipenv
ja: Pipenv をインストールする
pt_br: Instalando Pipenv
ru: Установка Pipenv
ta: பைபென்வ் நிறுவுதல்
