Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Be aware that this stores your password in plain text. For better security, consider an alternative like `keyring`_, setting environment variables, or providing the password on the command line.
eo: Atentu, ke tio konservas vian pasvorton en ordinara teksto. Por pli da sekureco, konsideru alternativojn kiel `keyring`_, agordadon de mediovariabloj, aŭ komandlinian disponigadon de la pasvorto.
ja: あなたのパスワードが平文で保存されることに注意してください。より良いセキュリティのために `キーリング <keyring>`_ ・環境変数での設定・コマンドラインでのパスワード供給のような代替策を検討してください。
pt_br: Esteja ciente de que isso armazena sua senha em texto simples. Para melhor segurança, considere uma alternativa como `chaveiro`_, configurando variáveis de ambiente ou fornecendo a senha na linha de comando.
ru: Имейте в виду, что при этом ваш пароль сохраняется в виде обычного текста. Для большей безопасности воспользуйтесь альтернативой вроде `keyring`_, установите переменные окружения или введите пароль в командной строке.
ta: இது உங்கள் கடவுச்சொல்லை எளிய உரையில் சேமிக்கிறது என்பதை அறிந்து கொள்ளுங்கள். சிறந்த பாதுகாப்பிற்காக, `கீரிங்`_ போன்ற மாற்றீட்டைக் கவனியுங்கள், சுற்றுச்சூழல் மாறிகள் அமைத்தல் அல்லது கடவுச்சொல்லை கட்டளை வரியில் வழங்குதல்.

source: Otherwise, set the permissions on :file:`.pypirc` so that only you can view or modify it. For example, on Linux or macOS, run:
eo: Alie, agordu la permesojn pri :file:`'.pypirc` tiel, kiel nur vi rajtas vidi aŭ modifi ĝin. Ekzemple, sur Linux aŭ macOS, rulu la jenon:
ja: そうでなければ、 :file:`.pypirc` のパーミッションを設定して、自分だけが閲覧や修正を行えるようにしてください。例えば、 Linux や macOS では次のようにします:
pt_br: Caso contrário, defina as permissões em :file:`.pypirc` para que somente você possa ver ou modificá-lo. Por exemplo, no Linux ou macOS, execute:
ru: В противном случае установите права на :file:`.pypirc`, чтобы только вы могли просматривать или изменять его. Например, в Linux или macOS выполните команду:
ta: இல்லையெனில், அனுமதிகளை அமைக்கவும்: கோப்பு: `.pypirc`, இதனால் நீங்கள் மட்டுமே அதைப் பார்க்க அல்லது மாற்ற முடியும். எடுத்துக்காட்டாக, லினக்ச் அல்லது மேகோசில், இயக்கவும்:

source: Common configurations
eo: Oftaj agordoj
ja: 共通の設定
pt_br: Configurações comuns
ru: Общие конфигурации
ta: பொதுவான உள்ளமைவுகள்

source: These examples apply to :ref:`twine`. Other projects (e.g. :ref:`flit`) also use :file:`.pypirc`, but with different defaults. Please refer to each project's documentation for more details and usage instructions.
eo: Tiuj ekzemploj validas por :ref:`twine`. Aliaj projektoj (kiel :ref:`flit`) ankaŭ uzas :file:`.pypirc`, sed kun aliaj implicitaĵoj. Bonvolu legi la dokumentaron de la projekto por pliaj detaloj kaj helpoj pri uzado.
ja: これらの例は :ref:`twine` に当てはまります。他のプロジェクト (例えば :ref:`flit`) でも :file:`.pypirc` ファイルを利用しますが、デフォルトの値が異なります。もっと詳しい情報や使い方の指南については、それぞれのプロジェクトの説明文書を参照してください。
pt_br: Esses exemplos se aplicam a :ref:`twine`. Outros projetos (por exemplo, :ref:`flit`) também usam :file:`.pypirc`, mas com padrões diferentes. Consulte a documentação de cada projeto para obter mais detalhes e instruções de uso.
ru: Эти примеры относятся к :ref:`twine`. Другие проекты (например, :ref:`flit`) также используют :file:`.pypirc`, но с другими значениями по умолчанию. За более подробной информацией и инструкциями по использованию обращайтесь к документации каждого проекта.
ta: இந்த எடுத்துக்காட்டுகள் இதற்குப் பொருந்தும்: ref: `ட்வைன்`. பிற திட்டங்கள் (எ.கா.: ref: `Flit`) மேலும் பயன்படுத்தவும்: கோப்பு:` .pypirc`, ஆனால் வெவ்வேறு இயல்புநிலைகளுடன். மேலும் விவரங்கள் மற்றும் பயன்பாட்டு வழிமுறைகளுக்கு ஒவ்வொரு திட்டத்தின் ஆவணங்களையும் பார்க்கவும்.

source: Twine's default configuration mimics a :file:`.pypirc` with repository sections for PyPI and TestPyPI:
eo: La apriora agordo de Twine imitas :file:`.pypirc` kun deponejaj sekcioj por PyPI kaj Prova PyPI:
ja: Twine のデフォルト設定は、 PyPI と TestPyPI のリポジトリ節を含んだ :file:`.pypirc` を真似ています:
pt_br: A configuração padrão do Twine imita um :file:`.pypirc` com seções de repositório para PyPI e TestPyPI:
ru: Конфигурация Twine по умолчанию имитирует файл :file:`.pypirc` с разделами репозитория для PyPI и TestPyPI:
ta: கயிறின் இயல்புநிலை உள்ளமைவு மிமிக்ச் a: கோப்பு: `.pypirc` பைபி மற்றும் டெச்ட்பிஐ ஆகியவற்றிற்கான களஞ்சிய பிரிவுகளுடன்:

source: Twine will add additional configuration from :file:`$HOME/.pypirc`, the command line, and environment variables to this default configuration.
eo: Twine aldonos al la aprioraj agordoj suplementajn agordojn el :file:`$HOME/.pypirc`, la komanda linio kaj mediaj variabloj.
ja: Twine は、 :file:`$HOME/.pypirc` からの設定に対して、コマンドラインや環境変数といった追加の設定をデフォルト設定に追加するでしょう。
pt_br: Twine irá adicionar configuração adicional de :file:`$HOME/.pypirc`, a linha de comando e variáveis de ambiente a esta configuração padrão.
ru: Twine добавит к этой конфигурации по умолчанию дополнительные настройки из :file:`$HOME/.pypirc`, командной строки и переменных окружения.
ta: கயிறு கூடுதல் உள்ளமைவைச் சேர்க்கும்: கோப்பு: `$ home/.pypirc`, கட்டளை வரி மற்றும் சுற்றுச்சூழல் மாறிகள் இந்த இயல்புநிலை உள்ளமைவுக்கு.

source: Using a PyPI token
eo: Uzi PyPI-ĵetonon
ja: PyPI トークンを使う
pt_br: Usando um token do PyPI
ru: Использование токена PyPI
ta: பைபி கிள்ளாக்கைப் பயன்படுத்துதல்

source: To set your `API token`_ for PyPI, you can create a :file:`$HOME/.pypirc` similar to:
eo: Por agordi vian `API-ĵetonon <API token>` por PyPI, vi povas krei dosieron :file:`$HOME/.pypirc` similan al la jeno:
ja: 自分の PyPI 用 `API トークン`_ を設定するには、次のような :file:`$HOME/.pypirc` を作れば良いでしょう:
pt_br: Para definir seu `token de API`_ para PyPI, você pode criar um :file:`$HOME/.pypirc` semelhante a:
ru: Чтобы установить свой `API-токен`_ для PyPI, вы можете создать :file:`$HOME/.pypirc`, подобный этому:
ta: PYPI க்கு உங்கள் `API டோக்கன்`_ ஐ அமைக்க, நீங்கள் ஒரு: கோப்பு:` $ home/.pypirc` போன்றவற்றை உருவாக்கலாம்:

source: For :ref:`TestPyPI <using-test-pypi>`, add a ``[testpypi]`` section, using the API token from your TestPyPI account.
eo: Por :ref:`Prova PyPI <using-test-pypi>`, aldonu sekcion ``[testpypi]`` uzante la API-ĵetonon por via konto ĉe Prova PyPI.
ja: :ref:`TestPyPI <using-test-pypi>` 用には、Test PyPI アカウントで作成した APIトークンを使った ``[testpypi]`` 節を追加してください。
pt_br: Para o :ref:`TestPyPI <using-test-pypi>`, adicione a seção ``[testpypi]``, usando o token de API de sua conta do TestPyPI.
ru: Для :ref:`TestPyPI <using-test-pypi>`, добавьте секцию ``[testpypi]``, используя API-токен от вашего аккаунта TestPyPI.
ta: For: ref: `TestPypi <USE-TEST-PYPI>`, `` [TestPypi] `` பகுதியைச் சேர்க்கவும், உங்கள் டெச்ட்பை கணக்கிலிருந்து பநிஇ கிள்ளாக்கைப் பயன்படுத்தி.

source: Using another package index
eo: Uzi alian pakindekson
ja: 別のパッケージインデックスを使う
pt_br: Usando outro índice de pacotes
ru: Использование индекса другого пакета
ta: மற்றொரு தொகுப்பு குறியீட்டைப் பயன்படுத்துதல்

source: To configure an additional repository, you'll need to redefine the ``index-servers`` field to include the repository name. Here is a complete example of a :file:`$HOME/.pypirc` for PyPI, TestPyPI, and a private repository:
eo: Por agordi plian deponejon, oni devas redifini la kampon ``index-servers`` inkluzivante la nomon de la deponejo. Jen plena ekzemplo de :file:`$HOME/.pypirc` por PyPI, Prova PyPI, kaj privata deponejo:
ja: 追加のリポジトリの設定を行うには、 ``index-servers`` フィールドにそのリポジトリの名前が含まれるように再定義する必要があるでしょう。PyPI と TestPyPI とプライベートなリポジトリの設定をした :file:`$HOME/.pypirc` の完全な例を示します:
pt_br: Para configurar um repositório adicional, você precisará redefinir o campo ``index-servers`` para incluir o nome do repositório. Aqui está um exemplo completo de um :file:`$HOME/.pypirc` para PyPI, TestPyPI e um repositório privado:
ru: Чтобы настроить дополнительный репозиторий, вам нужно переопределить поле ``index-servers``, включив в него имя репозитория. Вот полный пример :file:`$HOME/.pypirc` для PyPI, TestPyPI и частного репозитория:
ta: கூடுதல் களஞ்சியத்தை உள்ளமைக்க, களஞ்சிய பெயரைச் சேர்க்க `` குறியீட்டு-சேவையகங்கள்` துறையை மறுவரையறை செய்ய வேண்டும். ஒரு முழுமையான எடுத்துக்காட்டு இங்கே: கோப்பு: `$ home/.pypirc` pypi, testpypi மற்றும் ஒரு தனியார் களஞ்சியத்திற்கு:

source: Instead of using the ``password`` field, consider saving your API tokens and passwords securely using `keyring`_ (which is installed by Twine):
eo: Anstataŭ uzi la kampon ``password``, konsideru konservi viajn API-ĵetonojn kaj pasvortojn sekure per `keyring`_ (kiun Twine instalas):
ja: ``password`` フィールドを使う代わりに、 (Twineによってインストールされる) `キーリング <keyring>`_ を使って API トークンやパスワードを安全に保存することを検討してください:
pt_br: Em vez de usar o campo ``password``, considere salvar seus tokens de API e senhas com segurança usando um `chaveiro`_ (que é instalado pelo Twine):
ru: Вместо того чтобы использовать поле ``пароль``, подумайте о безопасном сохранении API-токенов и паролей с помощью `keyring`_ (которое устанавливается в Twine):
ta: `` கடவுச்சொல்`` புலத்தைப் பயன்படுத்துவதற்குப் பதிலாக, உங்கள் பநிஇ டோக்கன்கள் மற்றும் கடவுச்சொற்களை `கீரிங்`_ ஐப் பயன்படுத்தி பாதுகாப்பாக சேமிப்பதைக் கவனியுங்கள் (இது கயிறால் நிறுவப்பட்டுள்ளது):

source: ``pyproject.toml`` specification
eo: specifo ``pyproject.toml``
ja: ``pyproject.toml`` の仕様
pt_br: Especificação do ``pyproject.toml``
ru: Спецификация ``pyproject.toml``
ta: `` pyproject.toml`` விவரக்குறிப்பு

source: This is a **technical, formal specification**. For a gentle, user-friendly guide to ``pyproject.toml``, see :ref:`writing-pyproject-toml`.
eo: Jen **teĥnika formala specifo**. Por milda, facila gvidilo pri ``pyproject.toml``, vidu :ref:`writing-pyproject-toml`.
ja: これは **技術的な正式の仕様** です。 ``pyproject.toml`` の配慮があってユーザに優しいガイド文書としては、 :ref:`wriging-pyproject-toml` を見てください。
ru: Это **техническая, формальная спецификация**. Мягкое, удобное руководство по ``pyproject.toml`` см. в :ref:``writing-pyproject-toml``.
ta: இது ஒரு ** தொழில்நுட்ப, முறையான விவரக்குறிப்பு **. `` Pyproject.toml`` க்கு மென்மையான, பயனர் நட்பு வழிகாட்டிக்கு, காண்க: குறிப்பு: `எழுதுதல்-பிப்ரோசெக்ட்-டோம்`.

source: The ``pyproject.toml`` file acts as a configuration file for packaging-related tools (as well as other tools).
eo: La dosiero ``pyproject.toml`` funkcias kiel agorda dosiero por pakado-rilataj iloj (kaj aliaj iloj).
ja: ``pyproject.toml`` ファイルは、(他のツール類と同様に) パッケージング関係のツール類向けの設定ファイルとして働きます。
ru: Файл ``pyproject.toml`` выступает в качестве файла конфигурации для инструментов, связанных с упаковкой (а также других инструментов).
ta: `` Pyproject.toml`` கோப்பு பேக்கேசிங் தொடர்பான கருவிகளுக்கான (அத்துடன் பிற கருவிகளுக்கான) உள்ளமைவு கோப்பாக செயல்படுகிறது.

source: This specification was originally defined in :pep:`518` and :pep:`621`.
eo: Ĉi tiu specifo estis originale difinta en :pep:`518` kaj :pep:`621`.
ja: この仕様は、元々は :pep:`518` 及び :pep:`621` で定義されました。
ru: Эта спецификация была первоначально определена в :pep:`518` и :pep:`621`.
ta: இந்த விவரக்குறிப்பு முதலில் வரையறுக்கப்பட்டது: PEP: `518` மற்றும்: PEP:` 621`.

source: The ``pyproject.toml`` file is written in `TOML <https://toml.io>`_. Three tables are currently specified, namely :ref:`[build-system] <pyproject-build-system-table>`, :ref:`[project] <pyproject-project-table>` and :ref:`[tool] <pyproject-tool-table>`. Other tables are reserved for future use (tool-specific configuration should use the ``[tool]`` table).
eo: La dosierformo de la dosiero ``pyproject.toml`` estas `TOML <https://toml.io>`_. Jen la tri tabeloj specifitaj aktuale: :ref:`[build-system] <pyproject-build-system-table>`, :ref:`[project] <pyproject-project-table>` kaj :ref:`[tool] <pyproject-tool-table>`. Aliaj tabeloj estas rezervataj por la estonteco (ilo-specifa agordo estu en la tabelo ``[tool]`` ).
ja: ``pyproject.toml`` ファイルは `TOML <https://toml.io>`_ で書かれています。現在は、 :ref:`[build-system] <pyproject-build-system-table>` ・ :ref:`[project] <pyproject-project-table>` ・ :ref:`[tool] <pyproject-tool-table>` の３個のテーブルが制定されています。他のテーブル群は将来の使用 (ツールに特有の設定は ``[tool]`` テーブルを使うべきです) に備えて予約されています。
ru: Файл ``pyproject.toml`` написан на языке ``TOML <https://toml.io>`_. В настоящее время заданы три таблицы, а именно :ref:`[build-system] <pyproject-build-system-table>`, :ref:`[project] <pyproject-project-table>` и :ref:`[tool] <pyproject-tool-table>`. Остальные таблицы зарезервированы для будущего использования (для конфигурации конкретных инструментов следует использовать таблицу ``[tool]``).
ta: `` Pyproject.toml`` கோப்பு `டாம்ல் <https://toml.io> _ _ இல் எழுதப்பட்டுள்ளது. மூன்று அட்டவணைகள் தற்போது குறிப்பிடப்பட்டுள்ளன, அதாவது: குறிப்பு: `[பில்ட்-சிச்டம்] <pyproject- கட்டளை-அமைப்பு-அட்டவணை>`,: ref: `[திட்டம்] <pyproject-project-table>` மற்றும்: ref: `[கருவி] <pyproject-tool-table> `. பிற அட்டவணைகள் எதிர்கால பயன்பாட்டிற்காக ஒதுக்கப்பட்டுள்ளன (கருவி-குறிப்பிட்ட உள்ளமைவு `` [கருவி] `` அட்டவணை) பயன்படுத்த வேண்டும்.

source: Declaring build system dependencies: the ``[build-system]`` table
eo: Deklari konstrusistemaj dependecoj: la tabelo ``[build-system]``
ja: ビルドシステムの依存関係を宣言する: ``[build-system]`` テーブル
ru: Объявление зависимостей от системы сборки: таблица ``[build-system]``
ta: உருவாக்க அமைப்பு சார்புகளை அறிவித்தல்: `` [உருவாக்க-அமைப்பு] `` அட்டவணை

source: The ``[build-system]`` table declares any Python level dependencies that must be installed in order to run the project's build system successfully.
eo: La tabelo ``[build-system]`` deklaras iujn ajn Python-nivelajn dependecojn instalendajn por sukcese ruli la projektan konstrusistemon.
ja: ``[build-system]`` テーブルでは、プロジェクトのビルドシステムが成功裡に動作するためにインストールされていなくてはならない Python レベルの依存関係をすべて宣言します。
ru: В таблице ``[build-system]`` объявляются все зависимости уровня Python, которые должны быть установлены для успешного запуска системы сборки проекта.
ta: `` [பில்ட்-சிச்டம்] `` அட்டவணை எந்தவொரு பைதான் நிலை சார்புகளையும் அறிவிக்கிறது, இது திட்டத்தின் உருவாக்க முறையை வெற்றிகரமாக இயக்குவதற்கு நிறுவப்பட வேண்டும்.

source: The ``[build-system]`` table is used to store build-related data. Initially, only one key of the table is valid and is mandatory for the table: ``requires``. This key must have a value of a list of strings representing dependencies required to execute the build system. The strings in this list follow the :ref:`version specifier specification <version-specifiers>`.
ja: ``[build-system]`` テーブルは、ビルドに関連したデータを格納するために使われます。当初は、テーブル内に ``requires`` というたったひとつのキーだけが正当、かつ、必須とされました。このキーは、ビルドシステムを実行するのに要求される依存関係を表現する文字列のリストを値に取らなければなりません。このリストの中の文字列は、 :ref:`バージョン指定子仕様 <version-specifiers>` に従います。
pt_br: A tabela ``[build-system]`` é usada para armazenar dados relacionados a construção. Inicialmente, apenas uma chave da tabela é válida e é obrigatória para a tabela: ``requires``. Esta chave deve ter um valor de uma lista de strings que representam dependências necessárias para executar o sistema de construção. As strings nesta lista seguem a :ref:`especificação de especificadores de versão <version-specifiers>`.
ru: Таблица ``[build-system]`` используется для хранения данных, связанных со сборкой. Изначально в таблице действует только один ключ, который является обязательным для таблицы: ``requires``. Этот ключ должен иметь значение, состоящее из списка строк, представляющих зависимости, необходимые для выполнения системы сборки. Строки в этом списке соответствуют :ref:`спецификации спецификатора версии <version-specifiers>`.
ta: உருவாக்கம் தொடர்பான தரவைச் சேமிக்க `` [பில்ட்-சிச்டம்] `` அட்டவணை பயன்படுத்தப்படுகிறது. ஆரம்பத்தில், அட்டவணையின் ஒரு விசை மட்டுமே செல்லுபடியாகும் மற்றும் அட்டவணைக்கு கட்டாயமாகும்: `` தேவை``. இந்த விசையானது உருவாக்க அமைப்பை இயக்கத் தேவையான சார்புகளைக் குறிக்கும் சரங்களின் பட்டியலின் மதிப்பைக் கொண்டிருக்க வேண்டும். இந்த பட்டியலில் உள்ள சரங்கள் பின்வருமாறு: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>`.

source: An example ``[build-system]`` table for a project built with ``setuptools`` is:
eo: Jen ekzempla tabelo ``[build-system]`` por projekto konstruita per ``setuptools``:
ja: ``setuptools`` と共にビルドされるプロジェクトにおける ``[build-system]`` の例は:
ru: Пример таблицы ``[build-system]`` для проекта, собранного с помощью ``setuptools``:
ta: ஒரு எடுத்துக்காட்டு `` [பில்ட்-சிச்டம்] `` `` setuptools`` உடன் கட்டப்பட்ட ஒரு திட்டத்திற்கான அட்டவணை:

source: Build tools are expected to use the example configuration file above as their default semantics when a ``pyproject.toml`` file is not present.
eo: Konstruilo uzu la ĉi-supran ekzemplan agordan dosieron kiel la implicitan semantikon, se mankas dosiero ``pyproject.toml``.
ja: ビルドツール群は、 ``pyproject.toml`` ファイルが存在しない場合には、上に例示された設定ファイルをデフォルトのセマンティクスとして使用することを期待されています。
ru: Предполагается, что инструменты сборки будут использовать приведенный выше пример конфигурационного файла в качестве семантики по умолчанию, если файл ``pyproject.toml`` отсутствует.
ta: `` Pyproject.toml`` கோப்பு இல்லாதபோது, மேலே உள்ள எடுத்துக்காட்டு உள்ளமைவு கோப்பை அவற்றின் இயல்புநிலை சொற்பொருளாகப் பயன்படுத்தும் என்று எதிர்பார்க்கப்படுகிறது.

source: Tools should not require the existence of the ``[build-system]`` table. A ``pyproject.toml`` file may be used to store configuration details other than build-related data and thus lack a ``[build-system]`` table legitimately. If the file exists but is lacking the ``[build-system]`` table then the default values as specified above should be used. If the table is specified but is missing required fields then the tool should consider it an error.
eo: Ilo ne postulu la ekziston de la tabelo ``[build-system]``. Dosiero ``pyproject.toml`` povas esti uzita por agordaj detaloj aliaj ol konstruo-rilataj datenoj kaj tial ne havi tabelon ``[build-system]``. Se la dosiero ekzistas sed la tabelo ``[build-system]`` mankas, do oni uzu la apriorajn valorojn specifitajn ĉi-supre. Se la tabelo estas specifita sed postulitaj kampoj mankas, do ilo konsideru tion kiel eraron.
ja: ツール類は、 ``[build-system]`` テーブルの存在を (必須のものとして) 要求するべきではありません。 ``pyproject.toml`` ファイルにはビルドに関係するデータ以外の設定の詳細を格納して使われることがあるので、 ``[build-system`` テーブルが存在していなくても正当なものであると言えます。ファイルは存在するが ``[build-system]`` テーブルが欠けている場合、上記のデフォルトの値を使用するべきです。テーブルは存在しているけれども必須のフィールドが欠けている場合には、ツールはこれをエラーであると判断するべきです。
ru: Инструменты не должны требовать наличия таблицы ``[build-system]``. Файл ``pyproject.toml`` может использоваться для хранения конфигурационных данных, отличных от данных, связанных со сборкой, и поэтому в нем может отсутствовать таблица ``[build-system]``, что вполне законно. Если файл существует, но в нем отсутствует таблица ``[build-system]``, то следует использовать значения по умолчанию, как указано выше. Если таблица указана, но в ней отсутствуют необходимые поля, то инструмент должен считать это ошибкой.
ta: கருவிகளுக்கு `` [பில்ட்-சிச்டம்] `` அட்டவணையின் இருப்பு தேவையில்லை. உருவாக்கம் தொடர்பான தரவைத் தவிர வேறு உள்ளமைவு விவரங்களைச் சேமிக்க ஒரு `` pyproject.toml`` கோப்பு பயன்படுத்தப்படலாம், இதனால் `` [உருவாக்க-அமைப்பு] `` சட்டபூர்வமாக அட்டவணை இல்லை. கோப்பு உள்ளது, ஆனால் `` [பில்ட்-சிச்டம்] `` அட்டவணை இல்லாதிருந்தால், மேலே குறிப்பிடப்பட்டுள்ள இயல்புநிலை மதிப்புகள் பயன்படுத்தப்பட வேண்டும். அட்டவணை குறிப்பிடப்பட்டாலும், தேவையான புலங்களைக் காணவில்லை என்றால், கருவி அதை பிழையாகக் கருத வேண்டும்.

source: To provide a type-specific representation of the resulting data from the TOML file for illustrative purposes only, the following `JSON Schema <https://json-schema.org>`_ would match the data format:
eo: Por provizi tipo-specifan prezento de la rezultaj datenoj el la TOML-dosiero sole por klarigado, la jena `JSON-Skemo <https://json-schema.org>`_ kongruus kun la datena formo:
ja: TOMLファイルからのデータで実例を示す目的だけに使われるようなタイプ特有の表現を提供するためには、後述の `JSON スキーマ <https://json-schema.org>`_ がデータフォーマットとして適しているでしょう:
ru: Чтобы обеспечить специфическое представление результирующих данных из файла TOML только для иллюстрации, следующая `JSON Schema <https://json-schema.org>`_ будет соответствовать формату данных:
ta: விளக்கமான நோக்கங்களுக்காக மட்டுமே டாம்ல் கோப்பிலிருந்து இதன் விளைவாக வரும் தரவின் வகை-குறிப்பிட்ட பிரதிநிதித்துவத்தை வழங்க, பின்வரும் `json Schema <https://json-schema.org>` _ தரவு வடிவத்துடன் பொருந்தும்:

source: Declaring project metadata: the ``[project]`` table
eo: Deklari projektajn metadatenojn: la tabelo ``[project]``
ja: プロジェクトのメタデータを宣言する: ``[project]`` テーブル
ru: Объявление метаданных проекта: таблица ``[project]``
ta: திட்ட மெட்டாடேட்டாவை அறிவித்தல்: `` [திட்டம்] `` அட்டவணை

source: The ``[project]`` table specifies the project's :ref:`core metadata <core-metadata>`.
eo: La tabelo ``[project]`` specifas la :ref:`kernajn metadatenojn <core-metadata>` de la projekto.
ja: ``[project]`` テーブルは、プロジェクトの :ref:`コアとなるメタデータ <core-metadata>` を定義します。
ru: Таблица ``[project]`` определяет метаданные ядра проекта <core-metadata>`.
ta: `` [திட்டம்] `` அட்டவணை திட்டத்தின் குறிப்பிடுகிறது: குறிப்பு: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>`.

source: There are two kinds of metadata: *static* and *dynamic*. Static metadata is specified in the ``pyproject.toml`` file directly and cannot be specified or changed by a tool (this includes data *referred* to by the metadata, e.g. the contents of files referenced by the metadata). Dynamic metadata is listed via the ``dynamic`` key (defined later in this specification) and represents metadata that a tool will later provide.
eo: Ekzistas du specoj de metadatenoj: *statika* kaj *dinamika*. Statika metadateno estas specifita en la dosiero ``pyproject.toml`` rekte kaj ne estas specifebla nek modifebla per ilo (tio inkluzivas datenojn *menciitajn* de la metadatenoj, ekz. la enhavoj de dosieroj referencitaj en la metadatenoj). Dinamika metadateno estas enlistigitaj per la ŝlosilo ``dynamic`` (difinita poste en ĉi tiu normo) kaj prezentas metadateno provizotan de ilo.
ja: メタデータにはふたつの種類があります: *静的* なものと *動的* なものです。静的なメタデータは ``pyproject.toml`` ファイルで直接指定されていて、ツール側では指定したり変更したりできません (これは、例えばメタデータが参照するファイルの内容のような、メタデータによって *参照* されるデータを含みます)。動的なメタデータは ``dynamic`` キー (この仕様内で後で定義します) を経由して一覧化されていて、ツール側が後から提供することになるでしょう。
pt_br: Existem dois tipos de metadados: *estáticos* e *dinâmicos*. Metadados estáticos são especificados diretamente no arquivo ``pyproject.toml`` e não podem ser especificados ou alterados por uma ferramenta (isso inclui dados *referenciados* pelo metadados, por exemplo, o conteúdo de arquivos referenciados pelos metadados). Os metadados dinâmicos são listados por meio da chave ``dynamic`` (definido posteriormente nesta especificação) e representam os metadados que uma ferramenta fornecerá posteriormente.
ru: Существует два вида метаданных: *статические* и *динамические*. Статические метаданные указываются непосредственно в файле ``pyproject.toml`` и не могут быть указаны или изменены инструментом (сюда входят данные, на которые ссылаются метаданные, например, содержимое файлов, на которые ссылаются метаданные). Динамические метаданные перечисляются с помощью ключа ``dynamic`` (определяется позже в этой спецификации) и представляют собой метаданные, которые инструмент предоставит позже.
ta: இரண்டு வகையான மேனிலை தரவு உள்ளன: *நிலையான *மற்றும் *டைனமிக் *. நிலையான மேனிலை தரவு `` pyproject.toml`` கோப்பில் நேரடியாக குறிப்பிடப்பட்டுள்ளது, மேலும் இது ஒரு கருவியால் குறிப்பிடப்படவோ அல்லது மாற்றவோ முடியாது (இதில் மெட்டாடேட்டாவால் குறிப்பிடப்பட்ட தரவு * அடங்கும், எ.கா. மெட்டாடேட்டாவால் குறிப்பிடப்பட்ட கோப்புகளின் உள்ளடக்கங்கள்). மாறும் மேனிலை தரவு `` டைனமிக்`` விசை வழியாக பட்டியலிடப்பட்டுள்ளது (இந்த விவரக்குறிப்பில் பின்னர் வரையறுக்கப்படுகிறது) மற்றும் ஒரு கருவி பின்னர் வழங்கும் மெட்டாடேட்டாவைக் குறிக்கிறது.

source: The lack of a ``[project]`` table implicitly means the :term:`build backend <Build Backend>` will dynamically provide all keys.
eo: La manko de tabelo ``[project]`` implicas, ke la :term:`konstrua malfasado <Build Backend>` dinamike provizos ĉiujn ŝlosilojn.
ja: ``[project]`` テーブルが欠損している場合は、暗黙理に、 :term:`ビルドバックエンド <Build Backend>` が動的にすべてのキーを準備することを意味します。
ru: Отсутствие таблицы ``[project]`` неявно означает, что :term:`build backend <Build Backend>` будет динамически предоставлять все ключи.
ta: ஒரு `` [திட்டம்] `` அட்டவணை மறைமுகமாக: காலப்பகுதி: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>` எல்லா விசைகளையும் மாறும்.
