Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: This is a list of currently active interoperability specifications maintained by the Python Packaging Authority. The process for updating these standards, and for proposing new ones, is documented on `pypa.io <https://www.pypa.io/en/latest/specifications/>`__.
eo: Jen listo de aktuale aktivaj specifoj pri kunfunkcipovo mastrumataj de la Python-Pakada Aŭtoritato. La procedo pri ĝisdatigado de tiujn normoj kaj proponado de novaj normoj priskribiĝas ĉe `pypa.io <https://www.pypa.io/en/latest/specifications/>`__.
ja: これは、 Python パッケージングオーソリティが維持管理している現時点で有効な相互互換性の使用です。これらの標準を更新し新たな標準を提案するプロセスは、 `pypa.io <https://www.pypa.io/en/latest/specifications/>`__ に文書化されています。
pt_br: Esta é uma lista de especificações de interoperabilidade atualmente ativas mantidas pela Python Packaging Authority. O processo de atualização desses padrões e de proposição de novos está documentado em `pypa.io <https://www.pypa.io/en/latest/specifications/>`__.
ru: Это список активных на данный момент спецификаций совместимости, поддерживаемых Python Packaging Authority. Процесс обновления этих стандартов и предложения новых задокументирован на сайте `pypa.io <https://www.pypa.io/en/latest/specifications/>`__.
ta: இது பைதான் பேக்கேசிங் ஆணையத்தால் பராமரிக்கப்படும் தற்போது செயலில் உள்ள இயங்குதன்மை விவரக்குறிப்புகளின் பட்டியல். இந்த தரங்களை புதுப்பிப்பதற்கான செயல்முறை, மற்றும் புதியவற்றை முன்மொழியுவதற்காக, `pypa.io <https://www.pypa.io/en/latest/specifications/> __.

source: Index hosted attestations
eo: Indekse gastigitaj atestoj
ru: Аттестаты, размещенные в индексе
ta: குறியீட்டு புரவலன் சான்றுகள்

source: This specification was originally defined in :pep:`740`.
eo: Ĉi tiu specifo estis originale difinita en :pep:`740`.
ja: この仕様は、元々は :pep:`740` で定義されました。
ru: Эта спецификация была первоначально определена в :pep:`740`.
ta: இந்த விவரக்குறிப்பு முதலில் வரையறுக்கப்பட்டது: PEP: `740`.

source: :pep:`740` includes changes to the HTML and JSON index APIs. These changes are documented in the :ref:`simple-repository-api` under :ref:`simple-repository-api-base` and :ref:`json-serialization`.
eo: :pep:`740` inkluzivas ŝanĝojn pri la indeksaj API-oj en HTML kaj JSON. Tiuj ŝanĝoj estas priskribitaj en :ref:`simple-repository-api` sub :ref:`simple-repository-api-base` kaj :ref:`json-serialization`.
ru: :pep:`740` включает изменения в HTML и JSON API индексов. Эти изменения документированы в разделах :ref:`Simple-repository-api` под :ref:`Simple-repository-api-base` и :ref:`json-serialization`.
ta: : PEP: `740` உஉகுமொ மற்றும் சாதொபொகு குறியெண் பநிஇ களில் மாற்றங்களை உள்ளடக்கியது. இந்த மாற்றங்கள்: ref: `Simple-reposition-api` இன் கீழ் ஆவணப்படுத்தப்பட்டுள்ளன: ref:` எளிய-ரோபோசிட்டரி-ஆபி-பேச்` மற்றும்: குறிப்பு: `json-cerialization`.

source: Upload endpoint changes
eo: Ŝanĝoj pri alŝuta finpunkto
ru: Загрузка изменений конечной точки
ta: இறுதிப்புள்ளி மாற்றங்களை பதிவேற்றவும்

source: The "legacy" upload API is not standardized. See `PyPI's Upload API documentation <https://docs.pypi.org/api/upload/>`_ for how attestations are uploaded.
eo: La «malnova» alŝuta API ne estas normigita. Vidu `la dokumentaron de la Alŝuta API de PyPI <https://docs.pypi.org/api/upload/>`_ pri alŝutado de atestoj.
ru: «Устаревший» API выгрузки не стандартизирован. О том, как загружаются аттестаты, см. документацию по API выгрузки `PyPI <https://docs.pypi.org/api/upload/>`_.
ta: "லெகசி" பதிவேற்ற பநிஇ தரப்படுத்தப்படவில்லை. `PYPI இன் பதிவேற்ற பநிஇ ஆவணங்கள் <https://docs.pypi.org/api/upload/>` _ சான்றுகள் எவ்வாறு பதிவேற்றப்படுகின்றன என்பதைப் பார்க்கவும்.

source: Attestation objects
eo: Atestaj objektoj
ru: Объекты аттестации
ta: சான்றளிப்பு பொருள்கள்

source: An attestation object is a JSON object with several required keys; applications or signers may include additional keys so long as all explicitly listed keys are provided. The required layout of an attestation object is provided as pseudocode below.
eo: Atesta objekto estas JSON-objekto kun pluraj postulataj ŝlosiloj. Programo aŭ subskribanto povas inkluzivi ekstrajn ŝlosilojn, se ĉiuj eksplicite menciitaj ŝlosiloj ekzistas. Jen pseŭdokodo pri la postulata aranĝo de atesta objekto.
ru: Объект аттестации - это объект JSON с несколькими обязательными ключами; приложения или подписывающие лица могут включать дополнительные ключи при условии, что все явно перечисленные ключи будут предоставлены. Требуемый макет объекта аттестации представлен в виде псевдокода ниже.
ta: ஒரு சான்றளிப்பு பொருள் என்பது பல தேவையான விசைகளைக் கொண்ட சாதொபொகு பொருள்; வெளிப்படையாக பட்டியலிடப்பட்ட அனைத்து விசைகளும் வழங்கப்படும் வரை பயன்பாடுகள் அல்லது கையொப்பமிட்டவர்கள் கூடுதல் விசைகளை உள்ளடக்கியிருக்கலாம். ஒரு சான்றளிப்பு பொருளின் தேவையான தளவமைப்பு கீழே உள்ள சூடோகோடாக வழங்கப்படுகிறது.

source: A full data model for each object in ``transparency_entries`` is provided in :ref:`appendix`. Attestation objects **SHOULD** include one or more transparency log entries, and **MAY** include additional keys for other sources of signed time (such as an :rfc:`3161` Time Stamping Authority or a `Roughtime <https://blog.cloudflare.com/roughtime>`__ server).
eo: Plena datenmodelo de ĉiu objekto en ``transparency_entries`` troviĝas en la :ref:`apendico <appendix>`. Atesta objekto **INKLUZIVU** unu aŭ plurajn travidebleco-protokolerojn kaj **POVAS** inkluzivi pliajn ŝlosilojn pri aliaj fontoj de tempo de subskribo (kiel Tempindika-Aŭtoritato laŭ :rfc:`3161` aŭ servilo `Roughtime <https://blog.cloudflare.com/roughtime>`__).
ru: Полная модель данных для каждого объекта в ``transparency_entries`` приведена в :ref:``appendix``. Объекты аттестации **ДОЛЖНЫ** включать одну или несколько записей журнала прозрачности, и **МОГУТ** включать дополнительные ключи для других источников подписанного времени (таких как :rfc:`3161` Time Stamping Authority или `Roughtime <https://blog.cloudflare.com/roughtime>`__ сервер).
ta: `` வெளிப்படைத்தன்மை_இஎன்டரிசில் உள்ள ஒவ்வொரு பொருளுக்கும் ஒரு முழு தரவு மாதிரி வழங்கப்பட்டுள்ளது: குறிப்பு: `பின் இணைப்பு`. சான்றளிப்பு பொருள்கள் ** ** ஒன்று அல்லது அதற்கு மேற்பட்ட வெளிப்படைத்தன்மை பதிவு உள்ளீடுகளை உள்ளடக்கியிருக்க வேண்டும், மேலும் ** கையொப்பமிடப்பட்ட நேரத்தின் பிற ஆதாரங்களுக்கான கூடுதல் விசைகளை உள்ளடக்கியிருக்கலாம் (AN: RFC: `3161` நேர முத்திரையிடும் அதிகாரம் அல்லது` rogatime <https: .

source: Attestation objects are versioned; this PEP specifies version 1. Each version is tied to a single cryptographic suite to minimize unnecessary cryptographic agility. In version 1, the suite is as follows:
eo: Atesta objekto havas version; ĉi tiu PEP specifas version 1. Ĉiu versio estas ligita al unu ĉifraro por minimumigi nenecesan ĉifran facilmovecon. Jen la ĉifraro de versio 1:
ru: Объекты аттестации имеют версии; данный PEP определяет версию 1. Каждая версия привязана к одному криптографическому набору, чтобы минимизировать ненужную криптографическую маневренность. В версии 1 этот набор выглядит следующим образом:
ta: சான்றளிப்பு பொருள்கள் பதிக்கப்பட்டவை; இந்த PEP பதிப்பு 1 ஐக் குறிப்பிடுகிறது. தேவையற்ற கிரிப்டோகிராஃபிக் சுறுசுறுப்பைக் குறைக்க ஒவ்வொரு பதிப்பும் ஒற்றை கிரிப்டோகிராஃபிக் தொகுப்புடன் பிணைக்கப்பட்டுள்ளது. பதிப்பு 1 இல், தொகுப்பு பின்வருமாறு:

source: Certificates are specified as X.509 certificates, and comply with the profile in :rfc:`5280`.
eo: Atestiloj specifiĝas kiel atestiloj X.509, kaj observas la profilon en :rfc:`5280`.
ru: Сертификаты указываются как сертификаты X.509 и соответствуют профилю в :rfc:`5280`.
ta: சான்றிதழ்கள் x.509 சான்றிதழ்களாக குறிப்பிடப்படுகின்றன, மேலும் இதில் சுயவிவரத்துடன் இணங்கவும்: RFC: `5280`.

source: The message signature algorithm is ECDSA, with the P-256 curve for public keys and SHA-256 as the cryptographic digest function.
eo: La mesaĝa subskriba algoritmo estas ECDSA, kun la kurbo P-256 por publikaj ŝlosiloj kaj SHA-256 kiel la ĉifra haketaĵa funkcio.
ru: Алгоритм подписи сообщений - ECDSA, с кривой P-256 для открытых ключей и SHA-256 в качестве функции криптографического дайджеста.
ta: செய்தி கையொப்ப வழிமுறை ஈ.சி.டி.எச்.ஏ ஆகும், பொது விசைகளுக்கான பி -256 வளைவு மற்றும் கிரிப்டோகிராஃபிக் டைசச்ட் செயல்பாடாக சா -256 ஆகியவை உள்ளன.

source: Future PEPs may change this suite (and the overall shape of the attestation object) by selecting a new version number.
eo: Estonta PEP povos ŝanĝi tiun ĉifraron (kaj la formon de la atesta objekto) elektante novan versian numeron.
ru: Будущие PEP могут изменить этот набор (и общую форму объекта аттестации), выбрав новый номер версии.
ta: எதிர்கால PEP கள் புதிய பதிப்பு எண்ணைத் தேர்ந்தெடுப்பதன் மூலம் இந்த தொகுப்பை (மற்றும் சான்றளிப்பு பொருளின் ஒட்டுமொத்த வடிவத்தை) மாற்றக்கூடும்.

source: Attestation statement and signature generation
eo: Atesta aserto kaj generado de subskribo
ru: Создание аттестационного листа и подписи
ta: சான்றளிப்பு அறிக்கை மற்றும் கையொப்ப தலைமுறை

source: The *attestation statement* is the actual claim that is cryptographically signed over within the attestation object (i.e., the ``envelope.statement``).
eo: La *atesta aserto* estas la fakta aserto ĉifre subskribita per la atesta objekto (``envelope.statement``).
ru: Заявление об аттестации* - это фактическое утверждение, которое криптографически подписывается внутри объекта аттестации (т.е. ``конверт.заявление``).
ta: * சான்றளிப்பு அறிக்கை * என்பது சான்றளிப்பு பொருளுக்குள் கிரிப்டோகிராஃபிக்காக கையொப்பமிடப்பட்ட உண்மையான கூற்று (அதாவது, `` உறை. ச்டேட்டமென்ட்``).

source: The attestation statement is encoded as a `v1 in-toto Statement object <https://github.com/in-toto/attestation/blob/v1.0/spec/v1.0/statement.md>`__, in JSON form. When serialized the statement is treated as an opaque binary blob, avoiding the need for canonicalization.
eo: La atesta aserto estas kodita kiel `entuta aserta objekto de versio 1 <https://github.com/in-toto/attestation/blob/v1.0/spec/v1.0/statement.md>`__, en formo JSON. Dum seriigo, la aserto estas pritraktata kiel opaka duumaĵo, sen bezono de kanonigo.
ru: Заявление об аттестации кодируется как объект `v1 in-toto Statement <https://github.com/in-toto/attestation/blob/v1.0/spec/v1.0/statement.md>`__, в форме JSON. При сериализации заявление рассматривается как непрозрачный двоичный блок, что позволяет избежать необходимости канонизации.
ta: சான்றளிப்பு அறிக்கை `வி 1 இன்-டோட்டோ அறிக்கை பொருளாக <https://github.com/in-toto/attestation/blob/v1.0/spec/v1.0/statement.md> வடிவம். வரிசைப்படுத்தப்பட்டால், அறிக்கை ஒரு ஒளிபுகா பைனரி குமிழியாக கருதப்படுகிறது, நியமனமயமாக்கலின் தேவையைத் தவிர்க்கிறது.

source: In addition to being a v1 in-toto Statement, the attestation statement is constrained in the following ways:
eo: Aldone al la limigoj pri entuta aserto de versio 1, la atesta aserto estas limigita jene:
ru: Помимо того, что аттестационное заявление является v1 in-toto Statement, оно ограничено следующим образом:
ta: ஒரு வி 1 இன்-டோட்டோ அறிக்கையாக இருப்பதோடு மட்டுமல்லாமல், சான்றளிப்பு அறிக்கை பின்வரும் வழிகளில் கட்டுப்படுத்தப்பட்டுள்ளது:

source: The in-toto ``subject`` **MUST** contain only a single subject.
eo: La entuta ``subject`` **DEVAS** enhavi nur unu temon.
ru: In-toto ``субъект`` **ДОЛЖЕН** содержать только один субъект.
ta: இன்-டோட்டோ `` பொருள்`` ** ** ஒரே ஒரு விசயத்தை மட்டுமே கொண்டிருக்க வேண்டும்.

source: ``subject[0].name`` is the distribution's filename, which **MUST** be a valid :ref:`source distribution <source-distribution-format>` or :ref:`wheel distribution <binary-distribution-format>` filename.
eo: ``subject[0].name`` estas la dosiernomo de la distribuo, kiu **DEVAS** esti valida dosiernomo por :ref:`fonta distribuo <source-distribution-format>` or :ref:`wheel-distribuo <binary-distribution-format>`.
ru: ``subject[0].name`` - это имя файла дистрибутива, которое **МОЖЕТ** быть действительным именем файла :ref:`source distribution <source-distribution-format>` или :ref:`wheel distribution <binary-distribution-format>`.
ta: `` பொருள் [0] .பெயர்`` என்பது விநியோகத்தின் கோப்பு பெயர், இது ** ** செல்லுபடியாகும்: குறிப்பு: `மூல வழங்கல் <மூல-விநியோக-வடிவ>` அல்லது: குறிப்பு: `சக்கர வழங்கல் <பைனரி-விநியோக-- வடிவம்> `கோப்பு பெயர்.

source: ``subject[0].digest`` **MUST** contain a SHA-256 digest. Other digests **MAY** be present. The digests **MUST** be represented as hexadecimal strings.
eo: ``subject[0].digest`` **DEVAS** enhavi SHA-256-haketaĵon. Aliaj haketaĵoj **POVAS** ankaŭ ĉeesti. La haketaĵoj **DEVAS** esti deksesumaj signoĉenoj.
ru: ``subject[0].digest`` **МОЖНО** содержать дайджест SHA-256. Другие дайджесты **МОГУТ** присутствовать. Дайджесты **МОГУТ** быть представлены в виде шестнадцатеричных строк.
ta: `` பொருள் [0] .digest`` ** கட்டாயம் ** ஒரு SHA-256 டைசெச்டைக் கொண்டிருக்க வேண்டும். பிற செரிமானங்கள் ** இருக்கலாம் ** இருக்கலாம். செரிமானங்கள் ** ** எக்சாடெசிமல் சரங்களாக குறிப்பிடப்பட வேண்டும்.

source: The following ``predicateType`` values are supported:
eo: La jenaj valoroj de ``predicateType`` estas subtenataj:
ru: Поддерживаются следующие значения ``predicateType``:
ta: பின்வரும் `` முன்னுரிமைப் வகை`` மதிப்புகள் ஆதரிக்கப்படுகின்றன:

source: `PyPI Publish Attestation <https://docs.pypi.org/attestations/publish/v1>`__: ``https://docs.pypi.org/attestations/publish/v1``
ru: `PyPI Публикация аттестации <https://docs.pypi.org/attestations/publish/v1>`__: `https://docs.pypi.org/attestations/publish/v1``
ta: `PYPI சான்றிதழை வெளியிடுங்கள் <https://docs.pypi.org/atestations/publish/v1>` __: `` https: // docs.pypi.org/சான்றுகள்/வெளியீடு/v1``

source: The signature over this statement is constructed using the `v1 DSSE signature protocol <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md>`__, with a ``PAYLOAD_TYPE`` of ``application/vnd.in-toto+json`` and a ``PAYLOAD_BODY`` of the JSON-encoded statement above. No other ``PAYLOAD_TYPE`` is permitted.
eo: La signaturo pri tiu aserto estas konstruita per `la subskriba protokolo DSSE v1 <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md>`__, kun ``PAYLOAD_TYPE`` de ``application/vnd.in-toto+json`` kaj ``PAYLOAD_BODY`` de la JSON-kodita aserto ĉi-supra. Nenia alia``PAYLOAD_TYPE`` estas permesata.
ru: Подпись под этим утверждением построена с использованием протокола подписи DSSE <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md>`__, с ``PAYLOAD_TYPE`` из ``application/vnd.in-toto+json`` и ``PAYLOAD_BODY`` из JSON-кодированного утверждения выше. Никакой другой ``PAYLOAD_TYPE`` не допускается.
ta: இந்த அறிக்கையின் கையொப்பம் `வி 1 டி.எச்.எச்.இ கையொப்ப நெறிமுறை <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md> __ உடன், ஒரு` `bayode_type` `` `விண்ணப்பம்/vnd.in-toto+json`` மற்றும் ஒரு` `பேலோட்_போடி`` இன் மேலே JSON- குறியிடப்பட்ட அறிக்கை. வேறு `` பேலோட்_ டைப்`` அனுமதிக்கப்படவில்லை.

source: Provenance objects
eo: Originpruvaj objektoj
ru: Объекты, имеющие происхождение
ta: ஆதார பொருள்கள்

source: The index will serve uploaded attestations along with metadata that can assist in verifying them in the form of JSON serialized objects.
eo: La indekso provizos alŝutitajn atestojn kune kun metdatenoj por konfirmi ilin en la formo de JSON-seriigitaj objektoj.
ru: Индекс будет обслуживать загруженные аттестации вместе с метаданными, которые могут помочь в их проверке, в виде сериализованных объектов JSON.
ta: மெட்டாடேட்டாவுடன் பதிவேற்றிய சான்றிதழ்களை இந்த குறியீடு வழங்கும், அவை சாதொபொகு தொடர் பொருள்களின் வடிவத்தில் சரிபார்க்க உதவக்கூடும்.

source: These *provenance objects* will be available via both the Simple Index and JSON-based Simple API as described above, and will have the following layout:
eo: Tiuj *originpruvaj objektoj* disponiĝas per kaj la Simpla Indeksa API kaj JSON-baza Simpla API ĉi -supraj, kaj havas la jenan aranĝon:
ru: Эти объекты *provenance* будут доступны как через Simple Index, так и через JSON-based Simple API, как описано выше, и будут иметь следующий вид:
ta: இந்த * ஆதார பொருள்கள் * மேலே விவரிக்கப்பட்டுள்ளபடி எளிய குறியீட்டு மற்றும் JSON- அடிப்படையிலான எளிய பநிஇ வழியாக கிடைக்கும், மேலும் பின்வரும் தளவமைப்பு இருக்கும்:

source: or, as pseudocode:
eo: aŭ, kiel pseŭdokodo:
ru: или, как псевдокод:
ta: அல்லது, சூடோகோடாக:

source: ``version`` is ``1``. Like attestation objects, provenance objects are versioned, and this PEP only defines version ``1``.
eo: ``version`` estas ``1``. Kiel atestaj objektoj, originpruvaj objektoj havas versiojn, kaj ĉi tiu PEP nur difinas la version ``1``.
ru: ``версия`` - ``1``. Как и объекты аттестации, объекты подтверждения имеют версии, и в этом PEP определена только версия ``1``.
ta: `` பதிப்பு`` இது `` 1``. சான்றளிப்பு பொருள்களைப் போலவே, ஆதாரப் பொருள்களும் பதிக்கப்பட்டுள்ளன, மேலும் இந்த PEP பதிப்பை `` 1`` மட்டுமே வரையறுக்கிறது.

source: ``attestation_bundles`` is a **required** JSON array, containing one or more "bundles" of attestations. Each bundle corresponds to a signing identity (such as a Trusted Publishing identity), and contains one or more attestation objects.
eo: ``attestation_bundles`` estas **deviga** JSON-listo, enhavanta unu aŭ pluraj «faskoj» da atestoj. Ĉiu fasko respondas al subskriba identeco (kiel Fidata Eldona Identeco) kaj enhavas unu aŭ plurajn atestajn objektojn.
ru: ``attestation_bundles`` - это **обязательный** массив JSON, содержащий один или несколько "пучков" аттестаций. Каждый пакет соответствует идентификатору подписи (например, идентификатору доверенной публикации) и содержит один или несколько объектов аттестации.
ta: `` சான்றளிப்பு_பண்டில்ச்`` என்பது ஒரு ** தேவை ** சாதொபொகு வரிசை, இதில் ஒன்று அல்லது அதற்கு மேற்பட்ட "மூட்டைகள்" சான்றுகள் உள்ளன. ஒவ்வொரு மூட்டையும் கையொப்பமிடும் அடையாளத்திற்கு ஒத்திருக்கிறது (நம்பகமான வெளியீட்டு அடையாளம் போன்றவை), மேலும் ஒன்று அல்லது அதற்கு மேற்பட்ட சான்றளிப்பு பொருள்களைக் கொண்டுள்ளது.

source: As noted in the ``Publisher`` model, each ``AttestationBundle.publisher`` object is specific to its Trusted Publisher but must include at minimum:
eo: Kiel notite en la modelo ``Publisher``, ĉiu objekto ``AttestationBundle.publisher`` estas specifa al sia Fidata Eldonanto, sed devas inkluzivi minimume la jenon:
ru: Как отмечается в модели ``Издатель``, каждый объект ``AttestationBundle.publisher`` специфичен для своего Доверенного Издателя, но должен включать в себя как минимум:
ta: `` வெளியீட்டாளர்` மாதிரியில் குறிப்பிட்டுள்ளபடி, ஒவ்வொரு `` சான்றளிப்பு. பப்ளிசர்`` பொருளும் அதன் நம்பகமான வெளியீட்டாளருக்கு குறிப்பிட்டது, ஆனால் குறைந்தபட்சம் சேர்க்கப்பட வேண்டும்:

source: A ``kind`` key, which **MUST** be a JSON string that uniquely identifies the kind of Trusted Publisher.
eo: Ŝlosilo ``kind``, kiu **DEVAS** esti JSON-signoĉeno unike identigantan la specon de Fidata Eldonanto.
ru: Ключ ``kind``, который **МОЖЕТ** быть строкой JSON, уникально идентифицирующей тип доверенного издателя.
ta: ஒரு `` வகையான`` விசை, இது ** ** ஒரு சாதொபொகு சரம் இருக்க வேண்டும், இது நம்பகமான வெளியீட்டாளரை தனித்துவமாக அடையாளம் காணும்.

source: A ``claims`` key, which **MUST** be a JSON object containing any context-specific claims retained by the index during Trusted Publisher authentication.
eo: Ŝlosilo ``claims``, kiu **DEVAS** esti JSON-objekto enhavanta ajnajn kunteksto-specifajn asertojn retenatajn de la indekso dum aŭtentikigo per Fidata Eldonanto.
ru: Ключ ``claims``, который **МОЖЕТ** быть JSON-объектом, содержащим любые контекстно-специфические требования, сохраненные индексом во время аутентификации Trusted Publisher.
ta: நம்பகமான வெளியீட்டாளர் அங்கீகாரத்தின் போது குறியீட்டால் தக்கவைக்கப்பட்ட எந்தவொரு சூழல்-குறிப்பிட்ட உரிமைகோரல்களையும் கொண்ட ஒரு `` உரிமைகோரல்கள்` `விசையானது ** ஒரு சாதொபொகு பொருளாக இருக்க வேண்டும்.

source: All other keys in the publisher object are publisher-specific.
eo: Ĉiuj aliaj ŝlosiloj en la objekto publisher estas specifaj al la eldonanto.
ru: Все остальные ключи в объекте publisher являются специфическими для издателя.
ta: வெளியீட்டாளர் பொருளின் மற்ற அனைத்து விசைகளும் வெளியீட்டாளர் சார்ந்தவை.

source: Each array of attestation objects is a superset of the ``attestations`` array supplied by the uploaded through the ``attestations`` field at upload time, as described in :ref:`upload-endpoint` and :ref:`changes-to-provenance-objects`.
eo: Ĉiu listo de atestaj objektoj estas superaro de la listo ``attestation`` donita de la alŝutinto per la kampo ``attestations`` dum alŝutado, laŭ :ref:`upload-endpoint` kaj :ref:`changes-to-provenance-objects`.
ru: Каждый массив объектов аттестации является надмножеством массива ``аттестаций``, предоставленного загружаемым через поле ``аттестации`` во время загрузки, как описано в :ref:`upload-endpoint` и :ref:`changes-to-provenance-objects`.
ta: சான்றளிக்கும் பொருள்களின் ஒவ்வொரு வரிசையும் பதிவேற்றப்பட்ட நேரத்தில் பதிவேற்றப்பட்ட `` சான்றுகள்`` வரிசையின் ஒரு சூப்பர்செட் ஆகும், இதில் விவரிக்கப்பட்டுள்ளபடி: குறிப்பு: ref: `பதிவேற்ற-எண்ட் பாயிண்ட்` மற்றும்: ref:` மாற்றங்கள்- பெறுநர் avownance-bocticals`.

source: Changes to provenance objects
eo: Ŝanĝoj al originpruvaj objektoj
ru: Изменить объекты подтверждения
ta: ஆதார பொருள்களில் மாற்றங்கள்

source: Provenance objects are *not* immutable, and may change over time. Reasons for changes to the provenance object include but are not limited to:
eo: Originpruvaj objektoj *ne* estas neŝanĝeblaj kaj povas ŝanĝiĝi dum tempo. Jen neplena listo de kialoj por ŝanĝi originpruvajn objektojn:
ru: Объекты провенанса *не* неизменяемы и могут изменяться с течением времени. Причины изменения объекта провенанса включают, но не ограничиваются ими:
ta: ஆதார பொருள்கள் * மாறாதவை அல்ல, காலப்போக்கில் மாறக்கூடும். ஆதாரப் பொருளில் மாற்றங்களுக்கான காரணங்கள் பின்வருவனவற்றை உள்ளடக்குகின்றன, ஆனால் அவை மட்டுப்படுத்தப்படவில்லை:

source: Addition of new attestations for a pre-existing signing identity: the index **MAY** choose to allow additional attestations by pre-existing signing identities, such as newer attestation versions for already uploaded files.
eo: Aldono de novaj atestoj far jam ekzistanta subskriba identeco: la indekso **POVAS** permesi plian ateston far jam ekzistanta subsigriba identeco, ekzemple novan atestan version por jam alŝutinta dosiero.
ru: Добавление новых аттестаций для уже существующего идентификатора подписи: индекс **МОЖЕТ** разрешить дополнительные аттестации для уже существующих идентификаторов подписи, например, новые версии аттестаций для уже загруженных файлов.
ta: முன்பே இருக்கும் கையொப்பமிடும் அடையாளத்திற்கான புதிய சான்றுகளைச் சேர்ப்பது: ஏற்கனவே பதிவேற்றப்பட்ட கோப்புகளுக்கான புதிய சான்றளிப்பு பதிப்புகள் போன்ற முன்பே இருக்கும் கையொப்பமிடும் அடையாளங்கள் மூலம் கூடுதல் சான்றுகளை அனுமதிக்க குறியீட்டு ** தேர்வு செய்யலாம்.

source: Addition of new signing identities and associated attestations: the index **MAY** choose to support attestations from sources other than the file's uploader, such as third-party auditors or the index itself. These attestations may be performed asynchronously, requiring the index to insert them into the provenance object *post facto*.
ru: Добавление новых идентификаторов подписи и связанных с ними аттестаций: индекс **МОЖЕТ** поддерживать аттестации из источников, отличных от загрузчика файла, таких как сторонние аудиторы или сам индекс. Эти аттестации могут выполняться асинхронно, требуя от индекса вставлять их в объект провенанса *постфактум*.
ta: புதிய கையொப்பமிடும் அடையாளங்கள் மற்றும் அதனுடன் தொடர்புடைய சான்றுகள்: குறியீட்டு ** ** மூன்றாம் தரப்பு தணிக்கையாளர்கள் அல்லது குறியீட்டு போன்ற கோப்பின் பதிவேற்றியவரைத் தவிர வேறு மூலங்களிலிருந்து சான்றுகளை ஆதரிக்க ** தேர்வு செய்யலாம். இந்த சான்றுகள் ஒத்திசைவற்ற முறையில் செய்யப்படலாம், அவற்றை ஆதாரப் பொருளில் செருக குறியீடு தேவைப்படுகிறது *பிந்தைய உண்மை *.

source: Attestation verification
eo: Konfirmado de atestado
ru: Проверка аттестации
ta: சான்றளிப்பு சரிபார்ப்பு
