Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Note that this example used a library that preserves TOML formatting. This is not a requirement for editing by any means but rather is a "nice to have" feature.
eo: Notu, ke tiu ekzemplo uzis bibliotekon konservantan TOML-aranĝon. Tio ne estas postulata por modifado, sed utilas.
ja: この例では、TOML フォーマッティングを保存するライブラリを使っていることに留意してください。これは、決して編集することに対する要求事項というわけではなく、むしろ "あったらいいね <nice to have>" 的なものです。
ru: Обратите внимание, что в этом примере использовалась библиотека, сохраняющая форматирование TOML. Это ни в коем случае не является обязательным условием редактирования, а скорее "приятная возможность".
ta: இந்த எடுத்துக்காட்டு டாம்ல் வடிவமைப்பைப் பாதுகாக்கும் ஒரு நூலகத்தைப் பயன்படுத்தியது என்பதை நினைவில் கொள்க. இது எந்த வகையிலும் திருத்துவதற்கான தேவை அல்ல, மாறாக "இருப்பது நல்லது" அம்சமாகும்.

source: The following is an example of how to read a stream of arbitrary metadata blocks.
eo: Jen ekzemplo de kiel legi fluon da arbitraj metadatenaj blokoj.
ja: 任意のメタデータブロックのストリームをどのように読み取るかの例を以下に示します。
ru: Ниже приведен пример чтения потока произвольных блоков метаданных.
ta: தன்னிச்சையான மேனிலை தரவு தொகுதிகளின் ச்ட்ரீமை எவ்வாறு படிப்பது என்பதற்கு பின்வருபவை ஒரு எடுத்துக்காட்டு.

source: Recommendations
eo: Rekomendoj
ja: 推奨事項
ru: Рекомендации
ta: பரிந்துரைகள்

source: Tools that support managing different versions of Python should attempt to use the highest available version of Python that is compatible with the script's ``requires-python`` metadata, if defined.
eo: Ilo, kiu administras diversajn versiojn de Python, uzu la plej novan version de Python kongruan kun la metadateno ``requires-python`` de la programeto, se ĝi ekzistas.
ja: 異なるバージョンの Python を管理する機能を持つツール類は、スクリプトの ``requires-python`` メタデータと互換性のある Python のバージョンのうちの利用可能な最も新しい版を使うことを試みるべきです。
ru: Инструменты, поддерживающие управление различными версиями Python, должны пытаться использовать самую высокую доступную версию Python, совместимую с метаданными скрипта ``requires-python``, если они определены.
ta: பைத்தானின் வெவ்வேறு பதிப்புகளை நிர்வகிப்பதை ஆதரிக்கும் கருவிகள், ச்கிரிப்டின் ``-பைதான்`` மெட்டாடேட்டாவுடன் பொருந்தக்கூடிய பைத்தானின் மிக உயர்ந்த பதிப்பைப் பயன்படுத்த முயற்சிக்க வேண்டும்.

source: October 2023: This specification was conditionally approved through :pep:`723`.
eo: Oktobro 2023: Ĉi tiu specifo estis kondiĉe aprobita per :pep:`723`.
ja: 2023年10月: :pep:`723` を通じて、この仕様が条件付きで承認されました。
ru: Октябрь 2023 года: Эта спецификация была условно утверждена через :pep:`723`.
ta: அக்டோபர் 2023: இந்த விவரக்குறிப்பு நிபந்தனையுடன் அங்கீகரிக்கப்பட்டது: PEP: `723`.

source: January 2024: Through amendments to :pep:`723`, the ``pyproject`` metadata block type was renamed to ``script``, and the ``[run]`` table was dropped, making the ``dependencies`` and ``requires-python`` keys top-level. Additionally, the specification is no longer provisional.
eo: Januaro 2024: Per ŝanĝoj al :pep:`723`, la nomo de la metadatena bloko ``pyproject `` ŝanĝiĝis al ``script``, kaj la tabelo ``[run]`` estis forigita, estigante la ŝlosilojn ``dependencies`` kaj ``requires-python`` supranivelaj. Cetere, la specifo ne plu estas provizora.
ja: 2024年1月: :pep:`723` に対する修正を通じて、 ``pyproject`` メタデータブロックのタイプが ``script`` に改名され、 ``dependencies`` キーと ``require-python`` キーがトップレベルに昇格する形で ``[run]`` テーブルが廃止されました。さらに、この仕様はもはや暫定的なものではなくなりました。
ru: Январь 2024 года: Благодаря поправкам к :pep:`723`, тип блока метаданных ``pyproject`` был переименован в ``скрипт``, а таблица ``[ запускать]`` была удалена, сделав ключи ``зависимости`` и ``запросы-python`` ключами верхнего уровня. Кроме того, спецификация больше не является предварительной.
ta: சனவரி 2024: திருத்தங்கள் மூலம்: PEP: `723`,` `பைபிரோசெக்ட்`` மேனிலை தரவு பிளாக் வகை` `ச்கிரிப்ட்`` என மறுபெயரிடப்பட்டது, மற்றும்` `ரன்]` `அட்டவணை கைவிடப்பட்டது,` `சார்புகளை உருவாக்கியது `மற்றும்` `-பைதான்`` விசைகள் முதல் நிலை தேவை. கூடுதலாக, விவரக்குறிப்பு இனி தற்காலிகமாக இல்லை.

source: Names and normalization
eo: Nomoj kaj normigo
ja: 名前と正規化
ru: Имена и нормализация
ta: பெயர்கள் மற்றும் இயல்பாக்கம்

source: This specification defines the format that names for packages and extras are required to follow. It also describes how to normalize them, which should be done before lookups and comparisons.
eo: Ĉi tiu specifo difinas la formon de nomoj de pakoj kaj ekstraĵoj. Ĝi ankaŭ priskribas normigon de nomoj, kiun oni faru antaŭ serĉado kaj komparado.
ja: この仕様では、パッケージや追加物の名前が従うことを要求されるフォーマットを定義します。あわせて、ルックアップや比較を行う前に行われるべき標準化方法についても記述します。
ru: Эта спецификация определяет формат, которому должны соответствовать имена пакетов и дополнений. Она также описывает, как их нормализовать, что следует делать перед поиском и сравнением.
ta: தொகுப்புகள் மற்றும் கூடுதல் அம்சங்களுக்கான பெயர்கள் பின்பற்ற வேண்டிய வடிவமைப்பை இந்த விவரக்குறிப்பு வரையறுக்கிறது. அவற்றை எவ்வாறு இயல்பாக்குவது என்பதையும் இது விவரிக்கிறது, இது தேடல்கள் மற்றும் ஒப்பீடுகளுக்கு முன் செய்யப்பட வேண்டும்.

source: Name format
eo: Nomformo
ja: 名前のフォーマット
ru: Формат имени
ta: பெயர் வடிவம்

source: A valid name consists only of ASCII letters and numbers, period, underscore and hyphen. It must start and end with a letter or number. This means that valid project names are limited to those which match the following regex (run with :py:data:`re.IGNORECASE`)::
eo: Valida nomo konsistas nur el Askiaj literoj, ciferoj, punkto, substreko kaj streketo. Ĝi devas komenciĝi kaj finiĝi per litero aŭ cifero. Alivorte, valida projekta nomo devas konformi al la jena regula esprimo (rulu kun :py:data:`re.IGNORECASE`)::
ja: 正当な名前は ASCII 文字・数字・ピリオド・アンダースコア・ハイフンだけで構成されているものです。名前の先頭と末尾は文字か数字でなければなりません。正当なプロジェクト名は、次の正規表現に (``re.IGNORECASE`` 付きで) マッチするものに限られるということになります::
ru: Правильное имя состоит только из букв и цифр ASCII, точки, подчеркивания и дефиса. Оно должно начинаться и заканчиваться буквой или цифрой. Это означает, что допустимые имена проектов ограничены теми, которые соответствуют следующему regex (выполняется с :py:data:`re.IGNORECASE`)::
ta: செல்லுபடியாகும் பெயர் ASCII கடிதங்கள் மற்றும் எண்கள், காலம், அடிக்கோடிட்டு மற்றும் ஐபன் ஆகியவற்றைக் கொண்டுள்ளது. இது ஒரு கடிதம் அல்லது எண்ணுடன் தொடங்கி முடிக்க வேண்டும். இதன் பொருள் செல்லுபடியாகும் திட்ட பெயர்கள் பின்வரும் ரீசெக்சுடன் பொருந்தக்கூடியவற்றுடன் மட்டுப்படுத்தப்பட்டுள்ளன (இயங்கும்: PY: தரவு: `Re.ignorecase`) ::

source: Name normalization
eo: Normigo de nomo
ja: 名前の正規化
ru: Нормализация имен
ta: பெயர் இயல்பாக்குதல்

source: The name should be lowercased with all runs of the characters ``.``, ``-``, or ``_`` replaced with a single ``-`` character. This can be implemented in Python with the re module:
eo: Oni minuskligu la nomon kaj anstataŭigu sinsekvon de la signoj ``.``, ``-``, aŭ ``_`` per unu signo ``-``. Oni povas fari tion en Python per la modulo ``re``:
ja: 名前は、すべての文字を小文字にして、 ``.`` ・ ``,`` ・ ``_`` の文字が連続で１個以上出現したらそれを単独の ``-`` の文字に置き換えるべきです。これは、 Python の re モジュールを使って実装することができます:
pt_br: O nome deve ser colocado em letras minúsculas com todos os caracteres ``.``, ``-`` ou ``_`` substituídos por um único caractere ``-``. Isso pode ser implementado em Python com o módulo re:
ru: Имя должно быть написано в нижнем регистре с заменой всех пробелов символов ``.``, ``-`` или ``_`` на один символ ``-``. Это можно реализовать в Python с помощью модуля re:
ta: ```,` `-``, அல்லது` `_`` ஒரு ஒற்றை` `-`` எழுத்துடன் மாற்றப்பட்ட எழுத்துக்களின் அனைத்து ரன்களிலும் பெயர் குறைவாக இருக்க வேண்டும். இதை RE தொகுதிக்கு பைதானில் செயல்படுத்தலாம்:

source: This means that the following names are all equivalent:
eo: Tio signifas, ke la jenajn nomoj estas ĉiuj ekvivalentaj:
ja: 次に挙げる名前はすべて同等ということになります:
pt_br: Isso significa que os seguintes nomes são todos equivalentes:
ru: Это означает, что все следующие имена эквивалентны:
ta: இதன் பொருள் பின்வரும் பெயர்கள் அனைத்தும் சமமானவை:

source: ``friendly-bard`` (normalized form)
eo: ``afabla-bardo`` (normigita formo)
ja: ``friendly-bard`` (正規化形式)
pt_br: ``friendly-bard`` (forma normalizada)
ru: ``friendly-bard`` (нормализованная форма)
ta: `` நட்பு-கார்ட்`` (இயல்பாக்கப்பட்ட வடிவம்)

source: ``Friendly-Bard``
eo: ``Afabla-Bardo``
ta: `` நட்பு-கார்ட்``

source: ``FRIENDLY-BARD``
eo: ``AFABLA-BARDO``
ta: `` நட்பு-கார்ட்``

source: ``friendly.bard``
eo: ``afabla.bardo``
ta: `` நட்பு. பார்ட்``

source: ``friendly_bard``
eo: ``afabla_bardo``
ta: `` நட்பு_பார்ட்``

source: ``friendly--bard``
eo: ``afabla--bardo``
ta: `` நட்பு-பார்ட்``

source: ``FrIeNdLy-._.-bArD`` (a *terrible* way to write a name, but it is valid)
eo: ``AfAbLa-._.-bArDo`` (*aĉa* maniero skribi nomon, sed valida)
ja: ``FrIeNdLy-._.-bArD`` ( *ひどい* 書き方の名前の例だが、正当である)
ru: ``FrIeNdLy-._.-bArD`` (это *ужасный* способ написания имени, но он действителен)
ta: `` நட்பு -._.- பார்ட்`` (ஒரு பெயரை எழுத ஒரு * பயங்கரமான * வழி, ஆனால் அது செல்லுபடியாகும்)

source: September 2015: The specification of name normalized was approved through :pep:`503 <503#normalized-names>`.
eo: Septembro 2015: La specifo de normigo de nomoj estis aprobita per :pep:`503 <503#normalized-names>`.
ja: 2015年9月: :pep:`503 <503#normalized-names>` を通じて名前の正規化に関わる仕様が承認されました。
ru: Сентябрь 2015 г: Спецификация имени нормализованные была одобрена через :pep:`503 <503#нормализованные названия>`.
ta: செப்டம்பர் 2015: இயல்பாக்கப்பட்ட பெயரின் விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `503 <503#இயல்பாக்கப்பட்ட-பெயர்கள்>`.

source: November 2015: The specification of valid names was approved through :pep:`508 <508#names>`.
eo: Novembro 2015: La specifo de validaj nomoj estis aprobita per :pep:`508 <508#names>`.
ja: 2015年11月: :pep:`508 <508#名前>` を通じて正当な名前に関する仕様が承認されました。
ru: Ноябрь 2015 г: Спецификация допустимых имен была одобрена через :pep:`508 <508#names>`.
ta: நவம்பர் 2015: செல்லுபடியாகும் பெயர்களின் விவரக்குறிப்பு அங்கீகரிக்கப்பட்டது: PEP: `508 <508#பெயர்கள்>`.

source: Platform compatibility tags
eo: Platformo-kongruecaj etikedoj
ja: プラットフォームの互換性タグ
pt_br: Tags de compatibilidade de plataforma
ru: Теги совместимости платформ
ta: இயங்குதள பொருந்தக்கூடிய குறிச்சொற்கள்

source: Platform compatibility tags allow build tools to mark distributions as being compatible with specific platforms, and allows installers to understand which distributions are compatible with the system they are running on.
eo: Per etikedoj pri platforma kongrueco, konstruilo povas marki distribuon kongrua kun specifitaj platformoj, kaj instalilo povas scii, kiuj distribuoj kongruas kun la aktuala sistemo.
ja: プラットフォーム相互互換性タグは、特定のプラットフォームと互換であるとビルドツールが配布物にマークを付けることができるようにし、インストーラが自身が動作しているシステムと互換であるのはどの配布物であるかを理解できるようにします。
pt_br: As tags de compatibilidade de plataforma permitem que ferramentas de construção marquem as distribuições como sendo compatíveis com plataformas específicas e permitem que os instaladores entendam quais distribuições são compatíveis com o sistema em que estão executando.
ru: Метки совместимости с платформами позволяют инструментам сборки помечать дистрибутивы как совместимые с определенными платформами, а установщикам - понимать, какие дистрибутивы совместимы с системой, на которой они работают.
ta: இயங்குதள பொருந்தக்கூடிய குறிச்சொற்கள் குறிப்பிட்ட தளங்களுடன் பொருந்தக்கூடியதாக இருப்பதைக் குறிக்க கருவிகளை உருவாக்க அனுமதிக்கின்றன, மேலும் அவை இயங்கும் கணினியுடன் எந்த விநியோகங்கள் இணக்கமாக உள்ளன என்பதை நிறுவிகள் புரிந்துகொள்ள அனுமதிக்கிறது.

source: The tag format is ``{python tag}-{abi tag}-{platform tag}``.
eo: La etikeda formo estas ``{python tag}-{abi tag}-{platform tag}``.
ja: タグの書式は、 ``{python tag}-{abi tag}-{platform tag}`` です。
pt_br: Oformato da tag é ``{python tag}-{abi tag}-{platform tag}``.
ru: Формат тегов - ``{python tag}-{abi tag}-{platform tag}``.
ta: குறிச்சொல் வடிவம் `` {python tag}-{abi tag}-{platform tag} ``.

source: python tag
eo: python etikedo
ja: python タグ
ru: метка python
ta: பைதான் குறிச்சொல்

source: 'py27', 'cp33'
ta: அப்பாக், நிரம்பியுள்ளது

source: 'cp32dmu', 'none'
ja: 'cp33dmu' ・ 'none'
ta: 'cp32dmu', 'எதுவுமில்லை'

source: 'linux_x86_64', 'any'
ta: 'லினக்ச்_எக்ச் 86_64', 'ஏதேனும்'

source: For example, the tag ``py27-none-any`` indicates compatibility with Python 2.7 (any Python 2.7 implementation) with no abi requirement, on any platform.
eo: Ekzemple, la etikedo ``py27-none-any`` signifas kongruecon kun Python 2.7 (ajna realigo de Python 2.7) sen postuloj pri ABI, sur ajna platformo.
ja: 例えば、``py27-none-any`` というタグは、abi に対する要求なしに任意のプラットフォームで Python 2.7 (任意の Python 2.7 実装) との互換性を持つことを意味します。
pt_br: Por exemplo, a tag ``py27-none-any`` indica compatibilidade com Python 2.7 (qualquer implementação Python 2.7), com nenhum requisito de ABI, em qualquer plataforma.
ru: Например, тег ``py27-none-any`` указывает на совместимость с Python 2.7 (любой реализацией Python 2.7) без требования abi, на любой платформе.
ta: எடுத்துக்காட்டாக, `` py27-none-any-`` என்ற குறிச்சொல் பைதான் 2.7 (எந்த பைதான் 2.7 செயல்படுத்தல்) உடன் பொருந்தக்கூடிய தன்மையைக் குறிக்கிறது, எந்தவொரு தளத்திலும் பநிஇ தேவை இல்லை.

source: The ``wheel`` built package format includes these tags in its filenames, of the form ``{distribution}-{version}(-{build tag})?-{python tag}-{abitag}-{platform tag}.whl``. Other package formats may have their own conventions.
eo: La konstruita pakformo ``wheel`` inkluzivas tiujn etikedojn en dosiernomoj laŭ la formo ``{distribuo}-{versio}(-{konstruetikedo})?-{pythonetikedo}-{abietikedo}-{platformetikedo}.whl``. Alia pakformo povas havi sian propran konvencion.
ja: ``wheel`` ビルド済みパッケージのフォーマットは、ファイル名の中にこのようなタグを ``{distribution}-{version}(-{build tag})?-{python tag}-{abitag}-{platform tag}.whl`` の形で包含しています。他のパッケージフォーマットにはそれぞれ独自の慣習があるかもしれません。
pt_br: O formato de pacote construído ``wheel`` inclui essas tags em seus nomes de arquivo, no formato ``{distribution}-{version}(-{build tag})?-{python tag}-{abitag}-{platform tag} .whl``. Outros formatos de pacote podem ter suas próprias convenções.
ru: Формат собранных пакетов ``wheel`` включает эти теги в имена файлов, имеющие вид ``{distribution}-{version}(-{build tag})?-{python tag}-{abitag}-{platform tag}.whl``. Другие форматы пакетов могут иметь свои собственные соглашения.
ta: `` சக்கரம்`` கட்டப்பட்ட தொகுப்பு வடிவத்தில் இந்த குறிச்சொற்கள் அதன் கோப்பு பெயர்களில், `{distribution}-{version} (-{build tag})? .whl``. பிற தொகுப்பு வடிவங்களில் அவற்றின் சொந்த மரபுகள் இருக்கலாம்.

source: Any potential spaces in any tag should be replaced with ``_``.
eo: Ajna ebla spaco en ajna etikedo estu anstataŭigita per ``_``.
ja: どのようなタグであれ、その中に潜在的に含まれる空白文字は ``_`` で置換されるべきです。
pt_br: Quaisquer espaços em potencial em alguma tag deve ser substituído por ``_``.
ru: Любые потенциальные пробелы в любом теге должны быть заменены на ``_``.
ta: எந்தவொரு குறிச்சொல்லிலும் உள்ள எந்த சாத்தியமான இடங்களும் `` _`` உடன் மாற்றப்பட வேண்டும்.

source: Python Tag
eo: Python-Etikedo
ja: Python タグ
pt_br: A tag Python
ru: Метка Python
ta: பைதான் குறிச்சொல்

source: The Python tag indicates the implementation and version required by a distribution. Major implementations have abbreviated codes, initially:
eo: La Python-etikedo indikas la realigon kaj version postulatajn de distribuo. Ĉefaj realigoj havas mallongajn kodojn, komence:
ja: Python タグは、配布物が必要とする実装やバージョンを示します。主要な実装には短縮系のコードがあって、当初は:
pt_br: A tag Python indica a implementação e a versão exigida por uma distribuição. As principais implementações têm códigos abreviados, inicialmente:
ru: Метка Python указывает на реализацию и версию, требуемую дистрибутивом. Основные реализации изначально имеют сокращенные коды:
ta: பைதான் குறிச்சொல் ஒரு விநியோகத்தால் தேவைப்படும் செயல்படுத்தல் மற்றும் பதிப்பைக் குறிக்கிறது. முக்கிய செயலாக்கங்கள் ஆரம்பத்தில் சுருக்கமான குறியீடுகளைக் கொண்டுள்ளன:

source: py: Generic Python (does not require implementation-specific features)
eo: py: Ĝenerala Python (ne postulas funkciojn de specifaj realigoj)
ja: py: 一般的な Python (実装に特有な機能を要求しません)
pt_br: py: Python genérico (não requer recursos específicos de implementação)
ru: py: Generic Python (не требует специфических особенностей реализации)
ta: PY: பொதுவான பைதான் (செயல்படுத்தல்-குறிப்பிட்ட நற்பொருத்தங்கள் தேவையில்லை)

source: cp: CPython
ta: சிபி: cpython

source: ip: IronPython
ta: ஐபி: அயர்ன் பிதான்

source: pp: PyPy
ta: பிபி: பைபி

source: jy: Jython
ta: நீங்கள்: உத்தான்

source: Other Python implementations should use :py:data:`sys.implementation.name <sys.implementation>`.
eo: Aliaj realigoj de Python uzu :py:data:`sys.implementation.name <sys.implementation>`.
ja: 他の Python 実装には :py:data:`sys.implementation.name <sys.implementation>` を用いるべきです。
ru: Другие реализации Python должны использовать :py: данные:`sys.implementation. название <sys.implementation>`.
ta: பிற பைதான் செயலாக்கங்கள் பயன்படுத்தப்பட வேண்டும்: PY: தரவு: `sys.implementation.name <sys.implementation>`.

source: The version is ``py_version_nodot``. CPython gets away with no dot, but if one is needed the underscore ``_`` is used instead. PyPy should probably use its own versions here ``pp18``, ``pp19``.
eo: La versio estas ``py_version_nodot``. CPython povas uzi senpunktan version, sed se disigilo necesas, oni uzas ``_`` anstataŭe. PyPy uzu siajn proprajn versiojn kiel ``pp18``, ``pp19``.
ja: バージョンは ``py_version_nodot`` です。 CPython は no dot にせずに済ませますが、必要な場合には代わりにアンダースコア文字 ``_`` が使用されます。 PyPy は、おそらく、ここに ``pp18`` や ``pp19`` といったそれ自身のバージョンを使います。
pt_br: A versão é ``py_version_nodot``. CPython fica sem ponto, mas se um for necessário, o sublinhado ``_`` é usado em seu lugar. PyPy provavelmente deve usar suas próprias versões aqui ``pp18``, ``pp19``.
ru: Версия - это ``py_version_nodot``. CPython обходится без точки, но если она необходима, то вместо нее используется знак подчеркивания ``_``. PyPy, вероятно, должен использовать здесь свои собственные версии ``pp18``, ``pp19``.
ta: பதிப்பு `` py_version_nodot``. சிபிதான் எந்த புள்ளியும் இல்லாமல் விலகிச் செல்கிறது, ஆனால் ஒருவருக்கு தேவைப்பட்டால் அடிக்கோடிட்ட `` _`` அதற்கு பதிலாக பயன்படுத்தப்படுகிறது. பைபி தனது சொந்த பதிப்புகளை இங்கே `` பிபி 18``, `` பிபி 19`` பயன்படுத்த வேண்டும்.

source: The version can be just the major version ``2`` or ``3`` ``py2``, ``py3`` for many pure-Python distributions.
eo: La versio povas esti simple la maĵoran version ``2`` aŭ ``3`` ``py2``, ``py3`` por multaj pure Python-aj distribuoj.
ja: 多くの純 Python 配布物では、バージョンは ``2`` や ``3`` や ``py2`` ・ ``py3`` といったメジャーバージョンだけにしておくことができます。
pt_br: A versão pode ser apenas a versão principal ``2`` ou ``3`` ``py2``, ``py3`` para muitas distribuições de Python puro.
ru: Версия может быть просто основной версией ``2`` или ``3`` ``py2``, ``py3`` для многих дистрибутивов pure-Python.
ta: பல தூய-பைதான் விநியோகங்களுக்கு `` 2` அல்லது `` 3` `` py2``, `` 3` `` py2`` என்ற முக்கிய பதிப்பாக பதிப்பு இருக்க முடியும்.

source: Importantly, major-version-only tags like ``py2`` and ``py3`` are not shorthand for ``py20`` and ``py30``. Instead, these tags mean the packager intentionally released a cross-version-compatible distribution.
eo: Grave, etikedo nur pri la maĵora versio kiel ``py2`` kaj ``py3`` ne estas mallongigoj de ``py20`` kaj ``py30``. Tiuj signifas, ke la pakinto intence eldonis plurversie kongruan distribuon.
ja: 重要なことは、 ``py2`` や ``py3`` のような major-version-only タグは ``py20`` や ``py30`` の短縮形であるわけではないということです。そうではなくて、これらのタグは、パッケージ作成者がいくつものバージョンに互換性を持つ配布物を意図的にリリースしたのです。
pt_br: É importante ressaltar que as tags somente da versão principal, como ``py2`` e ``py3``, não são abreviações para ``py20`` e ``py30``. Em vez disso, essas tags significam que o empacotador lançou intencionalmente uma distribuição compatível com várias versões.
ru: Важно отметить, что такие теги, как ``py2`` и ``py3``, относящиеся только к мажорным версиям, не являются сокращением для ``py20`` и ``py30``. Напротив, эти метки означают, что упаковщик намеренно выпустил кросс-версионный совместимый дистрибутив.
ta: முக்கியமாக, `` py2`` மற்றும் `py3` போன்ற முக்கிய-பதிப்பு-மட்டும் குறிச்சொற்கள்` `py20`` மற்றும்` `py30`` ஆகியவற்றுக்கு சுருக்கெழுத்து அல்ல. அதற்கு பதிலாக, இந்த குறிச்சொற்கள் பேக்கேசர் வேண்டுமென்றே குறுக்கு-பதிப்பு-இணக்கமான விநியோகத்தை வெளியிட்டன.

source: A single-source Python 2/3 compatible distribution can use the compound tag ``py2.py3``. See `Compressed Tag Sets`_, below.
eo: Unufonta distribuo kongrua kun Python 2 kaj 3 povas uzi la kombinitan etikedon ``py2.py3``. Vidu `Densigitajn Etikedarojn <Compressed Tag Sets>`_ ĉi-sube.
ja: 単一ソースで Python 2/3 に互換性を持つ配布物は、合成タグ ``py2.py3`` を用いることができます。 後述の `タグの圧縮された組み合わせ <Compressed Tag Sets>`_ を参照してください。
pt_br: Uma distribuição compatível com Python 2/3 de fonte única pode usar a tag composta ``py2.py3``. Consulte `Conjuntos de tags compactadas`_, abaixo.
ru: Дистрибутив с одним источником, совместимый с Python 2/3, может использовать составной тег ``py2.py3``. См. раздел ``Сжатые наборы тегов``, ниже.
ta: ஒற்றை மூல பைதான் 2/3 இணக்கமான வழங்கல் `` py2.py3`` என்ற கலவை குறிச்சொல்லைப் பயன்படுத்தலாம். கீழே `சுருக்கப்பட்ட குறிச்சொல் தொகுப்புகள்`_ ஐப் பார்க்கவும்.

source: ABI Tag
eo: ABI-Etikedo
ja: ABI タグ
pt_br: A tag ABI
ru: Тег ABI
ta: அபி நாள்

source: The ABI tag indicates which Python ABI is required by any included extension modules. For implementation-specific ABIs, the implementation is abbreviated in the same way as the Python Tag, e.g. ``cp33d`` would be the CPython 3.3 ABI with debugging.
eo: La ABI-etikedo indikas la ABI-on de Python subtenatan de inkluzivita etendaĵo-modulo. Por realigo-specifa ABI, la realigo estas mallongigita same kiel la Python-etikedo; ekz. ``cp33d`` estas la ABI de CPython 3.3 kun sencimigpovo.
ja: ABI タグは、いずれかの拡張モジュールによってどのような Python ABI が要求されているのかを示します。実装依存の ABI 群については、実装 (の名前) は、たとえば ``cp33d`` がデバッグオプション付きの CPython 3.3 ABI のことを指すように、 Python タグと同様のやり方で短縮したものを使います。
pt_br: A tag ABI indica qual ABI do Python é necessária para qualquer módulo de extensão incluído. Para ABIs específicos de implementação, a implementação é abreviada da mesma forma que a tag Python, por exemplo ``cp33d`` seria o ABI CPython 3.3 com depuração.
ru: Метка ABI указывает, какой ABI Python требуется для всех включенных модулей расширения. Для ABI, специфичных для конкретной реализации, реализация сокращается так же, как и тег Python, например, ``cp33d`` будет означать CPython 3.3 ABI с отладкой.
ta: சேர்க்கப்பட்ட எந்தவொரு நீட்டிப்பு தொகுதிகளுக்கும் பைதான் பநிஇ தேவை என்பதை பநிஇ குறிச்சொல் குறிக்கிறது. செயல்படுத்தல்-குறிப்பிட்ட ABI கள், செயல்படுத்தல் பைதான் குறிச்சொல்லைப் போலவே சுருக்கமாக உள்ளது, எ.கா. `` cp33d`` பிழைத்திருத்தத்துடன் சிபிதான் 3.3 பநிஇ இருக்கும்.

source: The CPython stable ABI is ``abi3`` as in the shared library suffix.
eo: La stabila ABI de CPython estas ``abi3`` kiel la sufikso de la komuna biblioteko.
ja: CPython の安定版 ABI のことは、共有ライブラリの拡張子と同様に ``abi3`` と書きます。
pt_br: A ABI estável do CPython é ``abi3`` como no sufixo da biblioteca compartilhada.
ru: Стабильный ABI CPython - ``abi3``, как и суффикс разделяемой библиотеки.
ta: பகிரப்பட்ட நூலக பின்னொட்டைப் போலவே `` abi3`` என்பது cpython stable abi ஆகும்.
