Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Virtually all current physical devices use one of the ARM architectures. ``x86`` and ``x86_64`` are supported for use in the emulator. ``x86`` has not been supported as a development platform since 2020, and no new emulator images have been released since then.
eo: Preskaŭ ĉiuj realaj aparatoj uzas unu el la ARM-arĥitekturoj. ``x86`` kaj ``x86_64`` estas subtenataj por uzado en imitilo. ``x86`` ne plu estas subtenata kiel evoluada platformo ekde 2020, kaj nova imitilo ne eldoniĝis post 2020.
ru: Практически все современные физические устройства используют одну из архитектур ARM. Для использования в эмуляторе поддерживаются ``x86`` и ``x86_64``. ``x86`` не поддерживается в качестве платформы разработки с 2020 года, и с тех пор не было выпущено ни одного нового образа эмулятора.

source: iOS uses the schema :file:`ios_{x}_{y}_{arch}_{sdk}`, indicating compatibility with iOS ``x.y`` or later, on the ``arch`` architecture, using the ``sdk`` SDK.
eo: iOS uzas la skemon :file:`ios_{x}_{y}_{arch}_{sdk}`, por kongrueco kun versio ``x.y`` (aŭ pli nova) de iOS, sur la arĥitekturo ``arch``, uzante la SDK ``sdk``.
ru: iOS использует схему :file:`ios_{x}_{y}_{arch}_{sdk}`, указывающую на совместимость с iOS ``x.y`` или более поздней версии, на архитектуре ``arch``, с использованием ``sdk`` SDK.

source: The value of ``x`` and ``y`` correspond to the major and minor version number of the iOS release, respectively. They must both be positive integers. The version number always includes a major *and* minor version, even if Apple's official version numbering only refers to the major value. For example, a ``ios_13_0_arm64_iphonesimulator`` indicates compatibility with iOS 13 or later.
eo: La valoroj de ``x`` kaj ``y`` respondas al la maĵora kaj minora versio-numeroj de iOS respektive. Ili ambaŭ devas esti pozitivaj entjeroj. La versio-numero ĉiam inkluzivas *kaj* maĵoran *kaj* minoran versiojn, eĉ se oficiala versio de Apple nur uzas la maĵoran numeron. Ekzemple, ``ios_13_0_arm64_iphonesimulator`` indikas kongruecon kun iOS 13 aŭ pli nova.
ru: Значения ``x`` и ``y`` соответствуют номеру мажорной и минорной версии релиза iOS, соответственно. Оба они должны быть положительными целыми числами. Номер версии всегда включает в себя мажорную *и* минорную версии, даже если официальная нумерация версий Apple ссылается только на мажорное значение. Например, ``ios_13_0_arm64_iphonesimulator`` указывает на совместимость с iOS 13 или более поздней версией.

source: The value of ``arch`` must match the value of :py:func:`platform.machine()` on the system.
eo: La valoro de ``arch`` devas egali la valoron de :py:func:`platform.machine()` sur la sistemo.
ru: Значение ``arch`` должно совпадать со значением :py:func:`platform.machine()` в системе.

source: The value of ``sdk`` must be either ``iphoneos`` (for physical devices), or ``iphonesimulator`` (for device simulators). These SDKs have the same API surface, but are incompatible at the binary level, even if they are running on the same CPU architecture. Code compiled for an arm64 simulator will not run on an arm64 device.
eo: La valoro de ``sdk`` devas esti aŭ ``iphoneos`` (por reala aparato), aŭ ``iphonesimulator`` (por imitilo de aparato). La SDK-oj havas la saman API-surfacon sed ne kongruas inter si je la duumaĵa nivelo, eĉ se ili uzas la saman ĉefprocesoran arĥitekturon. Kodo tradukita por arm64-imitilo ne ruliĝas sur arm64-aparato.
ru: Значение ``sdk` должно быть либо ``iphoneos`` (для физических устройств), либо ``iphonesimulator`` (для симуляторов устройств). Эти SDK имеют одинаковую поверхность API, но несовместимы на бинарном уровне, даже если они работают на одной архитектуре процессора. Код, скомпилированный для симулятора arm64, не будет работать на устройстве arm64.

source: The combination of :file:`{arch}_{sdk}` is referred to as the "multiarch". There are three possible values for multiarch:
eo: La kombinaĵo de :file:`{arch}_{sdk}` nomiĝas la «multarĥitekturo». Ekzistas tri eblaj valoroj de la multarĥitekturo:
ru: Комбинация :file:`{arch}_{sdk}` называется "multiarch". Существует три возможных значения для multiarch:

source: ``arm64_iphoneos``, for physical iPhone/iPad devices. This includes every iOS device manufactured since ~2015;
eo: ``arm64_iphoneos``, por fizikaj aparatoj iPhone/iPad. Tiuj inkluzivas ĉiajn iOS-aparatojn produktitajn post ~2015;
ru: ``arm64_iphoneos``, для физических устройств iPhone/iPad. Сюда входят все iOS-устройства, выпущенные с ~2015 года;

source: ``arm64_iphonesimulator``, for simulators running on Apple Silicon macOS hardware; and
eo: ``arm64_iphonesimulator``, por imitilo sur aparato Apple Silicon kun macOS; kaj
ru: ``arm64_iphonesimulator``, для симуляторов, работающих на оборудовании Apple Silicon macOS; и

source: ``x86_64_iphonesimulator``, for simulators running on x86_64 hardware.
eo: ``x86_64_iphonesimulator``, por imitilo sur aparato x86_64.
ru: ``x86_64_iphonesimulator``, для симуляторов, работающих на оборудовании x86_64.

source: December 2023: The tags for iOS were approved through :pep:`730`.
eo: Decembro 2023: La etikedoj pri iOS estis aprobitaj per :pep:`730`.
ru: Декабрь 2023 года: Теги для iOS были одобрены через :pep:`730`.

source: March 2024: The tags for Android were approved through :pep:`738`.
eo: Marto 2024: La etikedoj pri Android estis aprobitaj per :pep:`738`.
ru: Март 2024 года: Теги для Android были одобрены через :pep:`738`.

source: TOML_ type: table
eo: Tipo de TOML_: tabelo
ja: TOML_ 型: テーブル
pt_br: Tipo TOML_: tabela
ru: TOML_ тип: таблица

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`License-File <core-metadata-license-file>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`License-File <core-metadata-license-file>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`License-File <core-metadata-license-file>`

source: Examples:
ru: Примеры:

source: The keywords "**MUST**", "**MUST NOT**", "**REQUIRED**", "**SHALL**", "**SHALL NOT**", "**SHOULD**", "**SHOULD NOT**", "**RECOMMENDED**", "**MAY**", and "**OPTIONAL**"" in this document are to be interpreted as described in :rfc:`2119`.
eo: La ŝlosilvortoj **«DEVAS» (MUST, SHALL)**, **«DEVAS NE» (MUST NOT, SHALL NOT)**, **«POSTULATA» (REQUIRED)**, **«-U» (SHOULD)**, **«NE -U» (SHOULD NOT)**, **«REKOMENDATA» (RECOMMENDED)**, **«POVAS» (MAY)** kaj **«NEDEVIGA» (OPTIONAL)**" en ĉi tiu dokumento estas interpretataj laŭ :rfc:`2119`.
ru: Ключевые слова "**MUST**", "**MUST NOT**", "**REQUIRED**", "**SHALL**", "**SHALL NOT**", "**SHOULD**", "**SHOULD NOT**", "**RECOMMENDED**", "**MAY**" и "**OPTIONAL**" в этом документе должны интерпретироваться, как описано в :rfc:`2119`.

source: This spec proposes the inclusion of a meta tag on the responses of every successful request to a simple API page, which contains a name attribute of ``pypi:repository-version``, and a content that is a :ref:`version specifiers specification <version-specifiers>` compatible version number, which is further constrained to ONLY be Major.Minor, and none of the additional features supported by :ref:`the version specifiers specification <version-specifiers>`.
ru: Эта спецификация предлагает включение мета-тега в ответы на каждый успешный запрос к простой странице API, который содержит атрибут имени ``pypi:repository-version`` и содержимое, которое является совместимым с :ref:``спецификацией версий <version-specifiers>` номером версии, который далее ограничивается тем, что он может быть только Major.Minor, и ни одной из дополнительных возможностей, поддерживаемых :ref:``спецификацией версий <version-specifiers>`.

source: This would end up looking like:
eo: Tio aspektus jene:
ru: В итоге это будет выглядеть так:

source: API Version History
eo: Versio-historio de la API
ru: История версий API

source: This section contains only an abbreviated history of changes, as marked by the API version number. For a full history of changes including changes made before API versioning, see :ref:`History <simple-repository-history>`.
eo: Tiu sekcio enhavas nur mallongan historion de ŝanĝoj laŭ la versia numero de la API. Por plena historio de ŝanĝoj inkluzive de ŝanĝoj faritaj antaŭ ekstarigo de versioj de la API, vidu :ref:`la Historion <simple-repository-history>`.
ru: Этот раздел содержит только сокращенную историю изменений, отмеченную номером версии API. Полную историю изменений, включая изменения, сделанные до появления версий API, смотрите в :ref:`History <simple-repository-history>`.

source: API version 1.0: Initial version of the API, declared with :pep:`629`.
eo: Versio 1.0 de la API: la unua versio de la API, deklarita per :pep:`629`.
ru: Версия API 1.0: Начальная версия API, объявленная с помощью :pep:`629`.

source: API version 1.1: Added ``versions``, ``files[].size``, and ``files[].upload-time`` metadata to the JSON serialization, declared with :pep:`700`.
eo: Versio 1.1. de la API: Aldonis la metadatenojn ``versions``, ``files[].size``, kaj ``files[].upload-time`` al la JSON-seriigo, deklaritajn per :pep:`700`.
ru: API версии 1.1: Добавлены метаданные ``версии``, ``файлы[].размер`` и ``файлы[].время загрузки`` в сериализацию JSON, объявленную с помощью :pep:`700``.

source: API version 1.2: Added repository "tracks" metadata, declared with :pep:`708`.
eo: Versio 1.2 de la API: aldonis deponejajn metadatenojn pri «spurado», deklaritajn per :pep:`708`.
ru: API версии 1.2: Добавлены метаданные репозитория "треки", объявленные с помощью :pep:`708`.

source: API version 1.3: Added provenance metadata, declared with :pep:`740`.
eo: Versio 1.3 de la API: aldonis metadatenojn pri originpruvo, deklaritajn per :pep:`740`.
ru: API версии 1.3: Добавлены метаданные о происхождении, объявленные с помощью :pep:`740`.

source: A repository **MAY** include a ``data-core-metadata`` attribute on a file link.
eo: Deponejo **POVAS** inkluzivi atributon ``data-core-metadata`` sur dosiero-hiperligo.
ru: Хранилище **МОЖЕТ** включать атрибут ``data-core-metadata`` в ссылку на файл.

source: The repository **SHOULD** provide the hash of the Core Metadata file as the ``data-core-metadata`` attribute's value using the syntax ``<hashname>=<hashvalue>``, where ``<hashname>`` is the lower cased name of the hash function used, and ``<hashvalue>`` is the hex encoded digest. The repository **MAY** use ``true`` as the attribute's value if a hash is unavailable.
eo: La deponejo **PROVIZU** la haketaĵon de la dosiero de Kernaj Metadatenoj kiel la valoron de la atributo ``data-core-metadata`` laŭ la sintakso ``<nomo-de-haketaĵo>=<valoro-de-haketaĵo>``, en kiu ``<nomo-de-haketaĵo>`` estas la minuskla nomo de la uzita haketaĵa funkcio kaj ``<valoro-de-haketaĵo>`` estas la deksesume kodita valoro de la haketaĵa funkcio. La deponejo **POVAS** uzi ``true`` kiel la valoron de la atributo, se haketaĵo ne estas disponebla.
ru: Хранилище **ДОЛЖНО** предоставить хэш файла основных метаданных в качестве значения атрибута ``data-core-metadata``, используя синтаксис ``<hashname>=<hashvalue>``, где ``<hashname>`` - это имя используемой хэш-функции, а ``<hashvalue>`` - шестнадцатеричный дайджест. Хранилище **МОЖЕТ** использовать ``true`` в качестве значения атрибута, если хэш недоступен.

source: A repository **MAY** include a ``data-dist-info-metadata`` attribute on a file link.
eo: Deponejo **POVAS** inkluzivi atributon ``data-dist-info-metadata`` sur dosiero-hiperligo.
ru: Хранилище **МОЖЕТ** включать атрибут ``data-dist-info-metadata`` в ссылку на файл.

source: Index clients **MAY** consume this key if present, as a legacy fallback for ``data-core-metadata``.
eo: Indekso-kliento **POVAS** uzi tiun ŝlosilon, se ĝi ekzistas, kiel evitindan sinonimon de ``data-core-metadata``.
ru: Индексные клиенты **МОГУТ** использовать этот ключ, если он присутствует, в качестве традиционного запасного варианта для ``data-core-metadata``.

source: ``data-dist-info-metadata`` was standardized with :pep:`658` and renamed to ``data-core-metadata`` with :pep:`714`.
eo: ``data-dist-info-metadata`` estis normigita per :pep:`658`, kaj ĝia nomo ŝanĝiĝis al ``data-core-metadata`` per :pep:`714`.
ru: ``data-dist-info-metadata`` была стандартизирована в :pep:`658` и переименована в ``data-core-metadata`` в :pep:`714`.

source: A repository **MAY** include a ``data-requires-python`` attribute on a file link. This exposes the :ref:`core-metadata-requires-python` metadata field for the corresponding release. Where this is present, installer tools **SHOULD** ignore the download when installing to a Python version that doesn't satisfy the requirement. For example:
eo: Deponejo **POVAS** inkluzivi atributon ``data-requires-python`` sur dosiera hiperligo. Tiu respondas al la metadatena kampo :ref:`core-metadata-requires-python` por la eldono. Se tiu ekzistas, instalilo **IGNORU** la elŝuton por instalado al Python-versio ne plenumanta la postulon. Ekzemple:
ru: Репозиторий **МОЖЕТ** включать атрибут ``data-requires-python`` в ссылку на файл. Он раскрывает поле метаданных :ref:`core-metadata-requires-python` для соответствующего релиза. При наличии этого атрибута инструменты установки **ДОЛЖНЫ** игнорировать загрузку при установке на версию Python, которая не удовлетворяет этому требованию. Например:

source: The ``data-provenance`` attribute was added with API version 1.3.
eo: La atributo ``data-provenance`` estis aldonita por versio 1.3 de la API.
ru: Атрибут ``data-provenance`` был добавлен в API версии 1.3.

source: This URL must respond with a JSON encoded dictionary that has four keys:
eo: Tiu URL devas respondi per JSON-kodita vortaro enhavanta kvar ŝlosilojn:
ru: В ответ на этот URL должен прийти словарь в кодировке JSON, состоящий из четырех ключей:

source: ``versions``: A list of version strings specifying all of the project versions uploaded for this project. The value of ``versions`` is logically a set, and as such may not contain duplicates, and the order of the versions is not significant.
eo: ``versions``: Listo de versio-signoĉenoj specifantaj ĉiujn projektajn versiojn alŝutitajn de la projekto. La valoro de ``versions`` estas logika aro; tial, ĝi ne povas enhavi duoblaĵon, kaj la ordo de la versioj ne gravas.
ru: ``версии``: Список строк версий, определяющих все версии проекта, загруженные для этого проекта. Значение ``версий`` логически является множеством, и поэтому не может содержать дубликатов, а порядок версий не имеет значения.

source: Because servers may hold "legacy" data from before the adoption of :ref:`the version specifiers specification (VSS) <version-specifiers>`, version strings currently cannot be required to be valid VSS versions, and therefore cannot be assumed to be orderable using the VSS rules. However, servers **SHOULD** use normalized VSS versions where possible.
ru: Поскольку серверы могут содержать "устаревшие" данные, полученные до принятия :ref:`the version specifiers specification (VSS) <version-specifiers>`, в настоящее время нельзя требовать, чтобы строки версий были действительными версиями VSS, и поэтому нельзя считать, что они могут быть упорядочены с использованием правил VSS. Тем не менее, серверы **ДОЛЖНЫ** использовать нормализованные версии VSS, где это возможно.

source: The ``versions`` key was added with API version 1.1.
eo: La ŝlosilo ``versions`` estis aldonita por versio 1.1 de la API.
ru: Ключ ``версии`` был добавлен в API версии 1.1.

source: ``core-metadata``: An **optional** key that indicates that metadata for this file is available, via the same location as specified in :ref:`the API metadata file specification <simple-repository-api-metadata-file>` (``{file_url}.metadata``). Where this is present, it **MUST** be either a boolean to indicate if the file has an associated metadata file, or a dictionary mapping hash names to a hex encoded digest of the metadata's hash.
eo: ``core-metadata``: **Nedeviga** ŝlosilo indikanta, ke metadatenoj de tiu dosiero disponeblas ĉe la sama loko specifita en :ref:`la normo pri metadatenaj dosiero por API <simple-repository-api-metadata-file>` (``{file_url}.metadata``). Se ĝi ekzistas, ĝi **DEVAS** esti aŭ bulea valoro (indikanta, ĉu asociita metadatena dosiero ekzistas) aŭ vortaro, kiu asocias nomojn de haketaĵoj al deksesume koditaj haketaĵoj de la metadatenoj.
ru: ``core-metadata``: **опциональный** ключ, указывающий, что метаданные для этого файла доступны в том же месте, которое указано в :ref:спецификации файла метаданных API <simple-repository-api-metadata-file>` (``{file_url}.metadata``). Там, где он присутствует, он **МОЖЕТ** быть либо булевым значением, указывающим, есть ли у файла связанный файл метаданных, либо словарем, отображающим имена хэшей на шестнадцатеричный дайджест хэша метаданных.

source: ``dist-info-metadata``: An **optional**, deprecated alias for ``core-metadata``.
eo: ``dist-info-metadata``: **Nedeviga**, evitinda sinonimo de ``core-metadata``.
ru: ``dist-info-metadata``: **опциональный**, устаревший псевдоним для ``core-metadata``.

source: Index clients **MAY** consume this key if present, as a legacy fallback for ``core-metadata``.
eo: Indekso-kliento **POVAS** uzi tiun ŝlosilon, se ĝi ekzistas, kiel evitindan sinonimon de ``core-metadata``.
ru: Индексные клиенты **МОГУТ** использовать этот ключ, если он присутствует, в качестве традиционного запасного варианта для ``ядра-метаданных``.

source: ``dist-info-metadata`` was standardized with :pep:`658` and renamed to ``core-metadata`` with :pep:`714`.
eo: ``dist-info-metadata`` estis normigita per :pep:`658`, kaj ĝia nomo ŝanĝiĝis al ``core-metadata`` per :pep:`714`.
ru: ``dist-info-metadata`` был стандартизирован в :pep:`658` и переименован в ``core-metadata`` в :pep:`714`.

source: ``size``: A **mandatory** key. It **MUST** contain an integer which is the file size in bytes.
eo: ``size``: Ŝlosilo, kiu **DEVAS** ekzisti kaj **DEVAS** enhavi entjeron, kiu estas la grando de la dosiero en bajtoj.
ru: ``размер``: **обязательный** ключ. Он **ДОЛЖЕН** содержать целое число, которое представляет собой размер файла в байтах.

source: The ``size`` key was added with API version 1.1.
eo: La ŝlosilo ``size`` estis aldonita por versio 1.1 de la API.
ru: Ключ ``размер`` был добавлен в API версии 1.1.

source: ``upload-time``: An **optional** key that, if present, **MUST** contain a valid ISO 8601 date/time string in the format ``yyyy-mm-ddThh:mm:ss.ffffffZ`` which represents the time the file was uploaded to the index.
eo: ``upload-time``: Ŝlosilo kiu **POVAS** manki, kiu (se ĝi ekzistas) **DEVAS** enhavi validan datotempan signoĉenon laŭ ISO 8601 en la formo ``jjjj-mm-ttThh:mm:ss.ffffffZ``, kiu prezentas la tempon, kiam la dosiero estis alŝutita al la indekso.
ru: ``время загрузки``: **опциональный** ключ, который, если присутствует, **ДОЛЖЕН** содержать действительную строку даты/времени ISO 8601 в формате ``yyyy-mm-ddThh:mm:ss.ffffffZ``, которая представляет время, когда файл был загружен в индекс.

source: As indicated by the ``Z`` suffix, the upload time **MUST** use the UTC timezone. The fractional seconds part of the timestamp (the ``.ffffff`` part) is optional, and if present may contain up to 6 digits of precision. If a server does not record upload time information for a file, it **MAY** omit the ``upload-time`` key.
eo: Laŭ la sufikso ``Z``, la alŝuta tempo **DEVAS** esti la Universala Kunordigita Tempo. La frakcia sekunda parto de la tempo (la parto ``.ffffff``) estas nedeviga kaj povas enhavi maksimume ses ciferojn. Se servilo ne registras alŝutan tempon de dosiero, ĝi **POVAS** preterlasi la ŝlosilon ``upload-time``.
ru: Как указывает суффикс ``Z'', время загрузки **МОЖНО** использовать часовой пояс UTC. Дробная секундная часть временной метки (часть ``.ffffff``) необязательна, и если она присутствует, то может содержать до 6 цифр точности. Если сервер не записывает информацию о времени загрузки файла, он **МОЖЕТ** опустить ключ ``upload-time``.

source: The ``upload-time`` key was added with API version 1.1.
eo: La ŝlosilo ``upload-time`` estis aldonita por versio 1.1 de la API.
ru: Ключ ``время загрузки`` был добавлен в API версии 1.1.

source: The ``provenance`` field was added with API version 1.3.
eo: La kampo ``provenance`` estis aldonita por versio 1.3 de la API.
ru: Поле ``provenance`` было добавлено в API версии 1.3.

source: **JSON:** ``application/vnd.pypi.simple.v1+json``
ru: **JSON:** ``приложение/vnd.pypi. простой.v1+json``

source: ``$type/$subtype``
eo: ``$tipo/$subtipo``
ru: ``$тип/$подтип``

source: ``$type/*``
eo: ``$tipo/*``
ru: ``$тип/*``

source: Provide complete source distributions
eo: Provizi plenajn fontajn distribuojn
ja: 完全な形のソースコード配布物を提供する

source: The vast majority of downstream packagers prefer to build packages from source, rather than use the upstream-provided binary packages. In some cases, using sources is actually required for the package to be included in the distribution. This is also true of pure Python packages that provide universal wheels. The reasons for using source distributions may include:
eo: Preskaŭ ĉiuj malsuprulaj pakantoj preferas konstrui pakojn el fonto, ne uzi la duumajn pakojn provizitajn de supruloj. Kelkfoje, uzado de la fonto estas deviga por inkluzivi la pakon en la distribuon. Tio ankaŭ estas vera pri pako konsistanta nur el Python provizanta universalan wheel. Jen iuj kialoj por uzi fontan distribuon:
ja: ダウンストリームのパッケージ作業者の大多数は、アップストリーム側が提供するバイナリのパッケージを使ってやるよりも、ソースコードからパッケージをビルドすることを好みます。いくつかの場合には、パッケージを配布物に同梱してもらうためにソースコードを使うことが要求されていることもあります。これは、また、汎用 <universal> の wheel を提供する純 Python のパッケージにも当てはまります。ソースコード配布物を用いる理由には次のようなものがあるでしょう:

source: Being able to audit the source code of all packages.
eo: La kapablo inspekti la fontkodon de ĉiuj pakoj.
ja: すべてのパッケージのソースコードを監査することができるようにするため。

source: Being able to run the test suite and build documentation.
eo: La kapablo ruli la testaron kaj konstrui la dokumentaron.
ja: 試験一式を動作させることができるようにし、また、説明文書をビルドすることができるようにするため。

source: Being able to easily apply patches, including backporting commits from the project's repository and sending patches back to the project.
eo: La kapablo facile fliki, inkluzive de retroporti modifojn el la projekta deponejo kaj submeti flikaĵojn al la projekto.
ja: プロジェクトのリポジトリからのバックポートされたコミットを含めてパッチの適用が容易にできるようにするため、また、逆にプロジェクトへパッチを送ることができるようにするため。

source: Being able to build on a specific platform that is not covered by upstream builds.
eo: La kapablo konstrui sur specifa platformo ne provizita de supruloj.
ja: アップストリームのビルドではカバーされていない特定のプラットフォームでのビルドができるようにするため。

source: Being able to build against specific versions of system libraries.
eo: La kapablo bindi al specifaj versioj de sistemaj bibliotekoj.
ja: システムのライブラリの特定のバージョンに対してビルドができるようにするため。

source: Having a consistent build process across all Python packages.
eo: Havi koheran konstruprocedon por ĉiaj Python-pakoj.
ja: すべての Python パッケージを通じて守備一貫したビルドプロセスを保持するため。

source: While it is usually possible to build packages from a Git repository, there are a few important reasons to provide a static archive file instead:
eo: Kvankam ofte oni povas konstrui pakon el Git-deponejo, ekzistas kelkaj gravaj kialoj por anstataŭe disponigi statikan arĥivon:
ja: 通常は、 Git リポジトリからパッケージをビルドすることができますが、代わりに静的なアーカイブファイルを提供する重要ないくつかの理由があります:

source: Fetching a single file is often more efficient, more reliable and better supported than e.g. using a Git clone. This can help users with poor Internet connectivity.
eo: Elŝutado de unu dosiero estas ofte pli rapida, pli dependema kaj pli bone subtenata ol ekz. uzi ``git clone``. Tio povas helpi tiajn uzantojn, kies Interreta konekto malbonas.
ja: 単一のファイルをダウンロードする方が、より効率が良く、より信頼できて、例えば Git clone を使うよりも良くサポートされていることがしばしばです。これによって、貧弱なインターネット接続性の元にあるユーザを助けることができます。
