Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: ``keywords``
ru: ``ключевые слова``
ta: `` முக்கிய வார்த்தைகள்``

source: This will help PyPI's search box to suggest your project when people search for these keywords.
eo: Tio helpos la serĉilon de PyPI sugesti vian projekton, kiam oni serĉas tiujn ŝlosilvortojn.
ja: これは、 PyPI 上の検索でキーワードが与えられた時にこのプロジェクトをサジェストするのを助けます。
pt_br: Isso ajudará a caixa de pesquisa do PyPI a sugerir o seu projeto quando as pessoas procuram essas palavras-chave.
ru: Это поможет поисковой строке PyPI предлагать ваш проект при поиске по этим ключевым словам.
ta: இந்த முக்கிய வார்த்தைகளை மக்கள் தேடும்போது உங்கள் திட்டத்தை பரிந்துரைக்க இது பைபியின் தேடல் பெட்டியை உதவும்.

source: ``classifiers``
ja: ``分類詞 <classifiers>``
ru: `` классификаторы ``
ta: `` வகைப்படுத்திகள்``

source: A list of PyPI classifiers that apply to your project. Check the `full list of possibilities <classifier-list_>`_.
eo: Listo de PyPI-klasigiloj rilataj al via projekto. Jen la `plena listo de klasigiloj <classifier-list_>`_.
ja: プロジェクトに合致する PyPI 分類子 <classifier> のリスト。 `可能な分類子のリスト <classifier-list_>`_ を参照してください。
pt_br: Uma lista de classificadores do PyPI que se aplicam ao seu projeto. Verifique a `lista completa de possibilidades <classifier-list_>`_.
ru: Список классификаторов PyPI, которые применимы к вашему проекту. Проверьте `полный список возможностей <classifier-list_>`_.
ta: உங்கள் திட்டத்திற்கு பொருந்தும் PYPI வகைப்படுத்திகளின் பட்டியல். `சாத்தியக்கூறுகளின் முழு பட்டியலையும் சரிபார்க்கவும் <வகைப்படுத்தி-பட்டியல்_>` _.

source: Although the list of classifiers is often used to declare what Python versions a project supports, this information is only used for searching and browsing projects on PyPI, not for installing projects. To actually restrict what Python versions a project can be installed on, use the :ref:`requires-python` argument.
ja: あるプロジェクトが Python のどのバージョンをサポートしているのかを宣言するために分類子 <classifiers> がよく使われますが、この情報は PyPI 上のプロジェクトを検索し閲覧するためにのみ使われるのであって、プロジェクトをインストールするためには使われません。あるプロジェクトが Python のどのバージョンでならインストールされ得るのかを実際に制約するためには、 :ref:`requires-python` 引数を使ってください。
ru: Хотя список классификаторов часто используется для объявления того, какие версии Python поддерживает проект, эта информация используется только для поиска и просмотра проектов на PyPI, но не для установки проектов. Чтобы действительно ограничить, на каких версиях Python может быть установлен проект, используйте аргумент :ref:`requires-python`.
ta: ஒரு திட்டம் ஆதரிக்கும் பைதான் பதிப்புகள் என்ன என்பதை அறிவிக்க வகைப்படுத்திகளின் பட்டியல் பெரும்பாலும் பயன்படுத்தப்பட்டாலும், இந்த செய்தி திட்டங்களை நிறுவுவதற்கு அல்ல, PYPI இல் திட்டங்களைத் தேடுவதற்கும் உலாவுவதற்கும் மட்டுமே பயன்படுத்தப்படுகிறது. ஒரு திட்டத்தை நிறுவக்கூடிய பைதான் பதிப்புகளை உண்மையில் கட்டுப்படுத்த, பயன்படுத்தவும்: ref: `-பைதான் தேவை.

source: To prevent a package from being uploaded to PyPI, use the special ``Private :: Do Not Upload`` classifier. PyPI will always reject packages with classifiers beginning with ``Private ::``.
eo: Por malhelpi alŝuti pakon al PyPI, uzu la specialan klasigilon ``Private :: Do Not Upload``. PyPI ĉiam malakceptas pakon de klasigilo komenciĝanta per ``Private ::``.
ja: パッケージが PyPI にアップロードされるのを防ぐには、 ``Private :: Do Not Upload`` 分類子を使いましょう。``Private ::`` で始まる分類子を付けられたパッケージを PyPI は常に拒否します。
ru: Чтобы предотвратить загрузку пакета в PyPI, используйте специальный классификатор ``Private :: Do Not Upload``. PyPI всегда будет отклонять пакеты с классификаторами, начинающимися с ``Private ::``.
ta: ஒரு தொகுப்பு PYPI இல் பதிவேற்றப்படுவதைத் தடுக்க, சிறப்பு `` தனிப்பட்ட :: பதிவேற்ற வேண்டாம்`` வகைப்படுத்தியைப் பயன்படுத்தவும். `` தனிப்பட்ட :: `` உடன் தொடங்கி வகைப்படுத்திகளுடன் தொகுப்புகளை PYPI எப்போதும் நிராகரிக்கும்.

source: A list of URLs associated with your project, displayed on the left sidebar of your PyPI project page.
eo: Listo de retadresoj asociitaj al via projekto, montrotaj sur la maldekstra flankpanelo de via projekta paĝo ĉe PyPI.
ja: プロジェクトに関連のある URL のリストで、PyPI 上のプロジェクトページの左サイドバーに表示されるもの。
pt_br: Uma lista de URLs associadas ao seu projeto, exibida na barra lateral esquerda da página do projeto PyPI.
ru: Список URL-адресов, связанных с вашим проектом, отображаемый на левой боковой панели страницы проекта PyPI.
ta: உங்கள் திட்டத்துடன் தொடர்புடைய முகவரி களின் பட்டியல், உங்கள் PYPI திட்ட பக்கத்தின் இடது பக்கப்பட்டியில் காட்டப்படும்.

source: See :ref:`well-known-labels` for a listing of labels that PyPI and other packaging tools are specifically aware of, and `PyPI's project metadata docs <https://docs.pypi.org/project_metadata/#project-urls>`_ for PyPI-specific URL processing.
eo: Vidu :ref:`well-known-labels` por listo de etikedoj bone konataj de PyPI kaj aliaj pakiloj, kaj `la dokumentaron de PyPI pri projektaj metadatenoj <https://docs.pypi.org/project_metadata/#project-urls>`_ por PyPI-specifa pritraktado de retadresoj.
ru: См. :ref:`well-known-labels` для списка меток, о которых PyPI и другие инструменты упаковки знают, и `PyPI's project metadata docs <https://docs.pypi.org/project_metadata/#project-urls>`_ для обработки URL, специфичных для PyPI.
ta: காண்க: குறிப்பு: பைபி மற்றும் பிற பேக்கேசிங் கருவிகள் குறிப்பாக அறிந்த லேபிள்களின் பட்டியலுக்கு `நன்கு அறியப்பட்ட-லேபிள்கள்`, மற்றும்` பைபியின் திட்ட மேனிலை தரவு டாக்ச் <https://docs.pypi.org/project_metadata/#project-urls > `_ PYPI- குறிப்பிட்ட முகவரி செயலாக்கத்திற்கு.

source: Note that if the label contains spaces, it needs to be quoted, e.g., ``Website = "https://example.com"`` but ``"Official Website" = "https://example.com"``.
eo: Notu, ke se la etikedo enhavas spacetojn, ĝi devas esti encitiligita, ekz. ``Website = "https://example.com"`` sed ``"Official Website" = "https://example.com"``.
ru: Обратите внимание, что если метка содержит пробелы, ее нужно заключить в кавычки, например, ``Website = «https://example.com»``, но ``«Официальный сайт» = «https://example.com»``.
ta: லேபிளில் இடைவெளிகள் இருந்தால், அதை மேற்கோள் காட்ட வேண்டும், எ.கா., `` வலைத்தளம் = "https://example.com" .

source: Users are advised to use :ref:`well-known-labels` for their project URLs where appropriate, since consumers of metadata (like package indices) can specialize their presentation.
eo: Uzanto uzu :ref:`bone konatajn etikedojn <well-known-labels>` por projektaj retadresoj taŭge, ĉar iloj pri metadatenoj (kiel pakindeksoj) povas pli bone montri tiujn.
ru: Пользователям рекомендуется использовать :ref:`well-known-labels` для URL-адресов своих проектов, где это уместно, поскольку потребители метаданных (например, индексов пакетов) могут специализировать их представление.
ta: பயனர்கள் பயன்படுத்த அறிவுறுத்தப்படுகிறார்கள்: ref: `நன்கு அறியப்பட்ட-லேபிள்கள்` தங்கள் திட்ட முகவரி களுக்கு பொருத்தமான இடங்களில், மெட்டாடேட்டாவின் நுகர்வோர் (தொகுப்பு குறியீடுகள் போன்றவை) தங்கள் விளக்கக்காட்சியை நிபுணத்துவம் பெற முடியும்.

source: For example in the following metadata, neither ``MyHomepage`` nor ``"Download Link"`` is a well-known label, so they will be rendered verbatim:
eo: Ekzemple, en la jenaj metadatenoj, ne ``MyHomepage`` nek ``"Download Link"`` estas bone konata etikedo kaj tial montriĝos laŭvorte:
ru: Например, в следующих метаданных ни ``MyHomepage``, ни ``«Download Link»`` не являются известными метками, поэтому они будут отображены дословно:
ta: எடுத்துக்காட்டாக, பின்வரும் மெட்டாடேட்டாவில், `` MyHomePage`` அல்லது `` "பதிவிறக்கம் இணைப்பு" `` என்பது ஒரு நன்கு அறியப்பட்ட சிட்டை, எனவே அவை சொற்களஞ்சியமாக வழங்கப்படும்:

source: Whereas in this metadata ``HomePage`` and ``DOWNLOAD`` both have well-known equivalents (``homepage`` and ``download``), and can be presented with those semantics in mind (the project's home page and its external download location, respectively).
eo: Tamen en ĉi tiu metadateno, ambaŭ ``HomePage`` kaj ``DOWNLOAD`` ekvivalentas bone konatajn etikedojn (``homepage`` kaj ``download``) kaj estas prezenteblaj tiel (kiel la ĉefpaĝo kaj la elŝutejo de la projekto respektive).
ru: В то время как в этих метаданных ``HomePage`` и ``DOWNLOAD`` имеют общеизвестные эквиваленты (``homepage`` и ``download``), и могут быть представлены с учетом этой семантики (домашняя страница проекта и его внешнее место загрузки, соответственно).
ta: இந்த மெட்டாடேட்டாவில் `` முகப்புப்பக்கத்தில்`` மற்றும் `பதிவிறக்கம்`` இரண்டும் நன்கு அறியப்பட்ட சமமானவை (` `முகப்புப்பக்கத்தை`` மற்றும்` பதிவிறக்கம்``) கொண்டுள்ளன, மேலும் அந்த சொற்பொருளை மனதில் கொண்டு வழங்கலாம் (திட்டத்தின் முகப்புப் பக்கம் மற்றும் அதன் வெளிப்புற பதிவிறக்க இடம் முறையே).

source: Advanced plugins
eo: Altnivelaj kromprogramoj
ja: 先進的なプラグイン
pt_br: Plugins avançados
ru: Расширенные плагины
ta: மேம்பட்ட செருகுநிரல்கள்

source: Some packages can be extended through plugins. Examples include Pytest_ and Pygments_. To create such a plugin, you need to declare it in a subtable of ``[project.entry-points]`` like this:
eo: Kelkaj pakoj estas etendeblaj per kromprogramoj, ekzemple Pytest_ kaj Pygments_. Por krei tian kromprogramon, oni devas deklari ĝin en subtabelo de ``[project.entry-points]`` jene:
ja: パッケージの中にはプラグインを使って拡張できるものがあります。例としては、Pytest_ や Pygments_ が挙げられます。そのようなプラグインを作成するためには、以下のように ``[project.entry-points]`` のサブテーブルで宣言する必要があります:
pt_br: Alguns pacotes podem ser estendidos através de plugins. Exemplos incluem Pytest_ e Pygments_. Para criar tal plugin, você precisa declará-lo em uma subtabela de ``[project.entry-points]`` assim:
ru: Некоторые пакеты могут быть расширены с помощью плагинов. В качестве примера можно привести Pytest_ и Pygments_. Чтобы создать такой плагин, нужно объявить его в подтаблице ``[project.entry-points]`` следующим образом:
ta: சில தொகுப்புகளை செருகுநிரல்கள் மூலம் நீட்டிக்க முடியும். எடுத்துக்காட்டுகளில் பைடெச்ட்_ மற்றும் பைக்மென்ட்ச்_ ஆகியவை அடங்கும். அத்தகைய சொருகி உருவாக்க, நீங்கள் அதை `` [Project.entry- புள்ளிகள்] `` இதைப் போன்ற ஒரு துணைப்பிரிவில் அறிவிக்க வேண்டும்:

source: See the :ref:`Plugin guide <plugin-entry-points>` for more information.
eo: Vidu la :ref:`Gvidilon pri kromprogramoj <plugin-entry-points>` por pliaj informoj.
ja: 詳しくは、 :ref:`プラグインガイド <plugin-entry-points>` を見てください。
pt_br: Veja o :ref:`guia Plugin <plugin-entry-points>` para mais informações.
ru: Дополнительную информацию см. в :ref:`Руководство по плагинам <plugin-entry-points>`.
ta: பார்க்க: ref: `சொருகி வழிகாட்டி <சொருகி-நுழைவு புள்ளிகள்>` மேலும் தகவலுக்கு.

source: A full example
eo: Plena ekzemplo
ja: 完全な例
pt_br: Um exemplo completo
ru: Полный пример
ta: ஒரு முழு சான்று

source: Think twice before applying an upper bound like ``requires-python = "<= 3.10"`` here. `This blog post <requires-python-blog-post_>`_ contains some information regarding possible problems.
eo: Estu singarda pri supraj limoj kiel ``requires-python = "<= 3.10"`` ĉi tie. `Jen artikolo <requires-python-blog-post_>`_ pri eblaj problemoj.
ja: ここで ``requires-python = "<=3.10"`` のような上限を設定する前に、よくよく考えてください。起きる可能性のある問題に関するいくらかの情報が `このブログ記事 <requires-python-blog-post_>`_ にあります。
pt_br: Pense duas vezes antes de aplicar um limite superior como ``requires-python = "<= 3.10"`` aqui. `Este post de blog <requires-python-blog-post_>`_ contém algumas informações sobre possíveis problemas.
ru: Подумайте дважды, прежде чем применять здесь верхнюю границу вроде ``requires-python = "<= 3.10"``. ``Эта запись в блоге <requires-python-blog-post_>`` содержит некоторую информацию о возможных проблемах.
ta: ``-பைதான் = "<= 3.10" `` இங்கே. `இந்த வலைப்பதிவு இடுகையில் <-பைதான்-பிளாக்-போச்ட்_>` _ சாத்தியமான சிக்கல்கள் தொடர்பான சில தகவல்களைக் கொண்டுள்ளது.

source: The Python Packaging User Guide (PyPUG) is a collection of tutorials and guides for packaging Python software.
eo: La Manlibro por Python-Uzantoj pri Pakado (PyPUG) estas kolekto da lerniloj kaj gvidiloj pri pakado de Python-programoj.
ja: Python パッケージングユーザガイド (PyPUG) は、Python ソフトウェアのパッケージングに関するチュートリアルやガイドを集めたものです。
pt_br: O Guia de Usuário para Empacotamento de Python (PyPUG) é uma coleção de tutoriais e guias para empacotar software Python.
ru: Руководство пользователя по упаковке Python (PyPUG) - это коллекция учебников и руководств по упаковке программ на Python.
ta: பைதான் பேக்கேசிங் பயனர் கையேடு (பைபக்) என்பது பைதான் மென்பொருளை பேக்கேசிங் செய்வதற்கான பயிற்சிகள் மற்றும் வழிகாட்டிகளின் தொகுப்பாகும்.

source: python, packaging, guide, tutorial
eo: python, pakado, gvidilo, lernilo
ja: python ・ パッケージング・ガイド・チュートリアル
pt_br: python, packaging, guide, tutorial, empacotamento, guia
ru: python, упаковка, руководство, учебник
ta: பைதான், பேக்கேசிங், வழிகாட்டி, பயிற்சி

source: Python Packaging User Guide
eo: Manlibro por Python-Uzantoj pri Pakado
ja: Pythonパッケージユーザーガイド（Python Packaging User Guide）
pt_br: Guia de Usuário para Empacotamento de Python
ru: Руководство пользователя по созданию Python’ьих пакетов
ta: பைதான் பேக்கேசிங் பயனர் கையேடு

source: Welcome to the *Python Packaging User Guide*, a collection of tutorials and references to help you distribute and install Python packages with modern tools.
eo: Bonvenon al *Manlibro por Python-Uzantoj pri Pakado*, kolekto de lerniloj kaj gvidiloj por helpi vin distribui kaj instali Python-pakojn per modernaj iloj.
ja: *Python パッケージングユーザガイド* へようこそ、チュートリアルとリファレンスであなたが近代的なツールを使ってパッケージを配布・インストールするのをお手伝いします。
pt_br: Seja bem-vindo(a) ao *Guia de Usuário para Empacotamento de Python*, uma coleção de tutoriais e referências para lhe ajudar a distribuir e instalar pacotes Python com ferramentas modernas.
ru: Добро пожаловать в *Руководство пользователя по упаковке Python*, коллекцию руководств и ссылок, которые помогут вам распространять и устанавливать пакеты Python с помощью современных инструментов.
ta: நவீன கருவிகளுடன் பைதான் தொகுப்புகளை விநியோகிக்கவும் நிறுவவும் உதவும் பயிற்சிகள் மற்றும் குறிப்புகளின் தொகுப்பான *பைதான் பேக்கேசிங் பயனர் கையேடு *க்கு வருக.

source: This guide is maintained on `GitHub`_ by the :doc:`Python Packaging Authority <pypa:index>`. We happily accept :doc:`contributions and feedback <contribute>`. 😊
eo: Jen gvidilo mastrumata ĉe `GitHub`_ far :doc:`Python Packaging Authority <pypa:index>`. Ni dankeme akceptas :doc:`kontribuojn kaj komentojn <contribute>`. 😊
ja: このガイドは、:doc:`Python パッケージングオーソリティ <pypa:index>` によって `GitHub`_ 上で維持管理されています。:doc:`貢献とフィードバック <contribute>` を大いに歓迎します。😊
pt_br: Este guia é mantido no `GitHub`_ pela :doc:`Python Packaging Authority <pypa:index>`. Aceitamos :doc:`contribuição e feedback <contribute>`. 😊
ru: Это руководство поддерживается на `GitHub`_ силами :doc:`Python Packaging Authority <pypa:index>`. Мы с радостью принимаем :doc:`дополнения и отзывы <contribute>`. 😊
ta: இந்த வழிகாட்டி `கிதுப்`_ இல் பராமரிக்கப்படுகிறது: டாக்:` பைதான் பேக்கேசிங் ஆணையம் <பைபா: குறியீட்டு> `. நாங்கள் மகிழ்ச்சியுடன் ஏற்றுக்கொள்கிறோம்: டாக்: `பங்களிப்புகள் மற்றும் பின்னூட்டங்கள் <பங்களிப்பு>`. .

source: Overview and Flow
eo: Superrigardo kaj Fluo
ja: 概要と流れ
pt_br: Visão geral e fluxo
ru: Обзор и поток
ta: கண்ணோட்டம் மற்றும் ஓட்டம்

source: Building your understanding of Python packaging is a journey. Patience and continuous improvement are key to success. The overview and flow sections provide a starting point for understanding the Python packaging ecosystem.
eo: Komprenado de pakado de Python estas vojaĝo. Pacienco kaj daŭra plibonigado necesas por sukceso. La paragrafoj pri superrigardo kaj laborfluo estas deirpunkto por kompreni la Python-pakadan ekosistemon.
ja: Python のパッケージングに関する理解を醸成することは旅をするようなものです。忍耐と継続的な改善が成功への鍵となります。概要と流れの章では、Python のパッケージングのエコシステムを理解するための出発点を提供します。
pt_br: Construir sua compreensão de empacotamento do Python é uma jornada. Paciência e aprimoramento contínua são fundamentais para o sucesso. As seções de visão geral e fluxo fornecem um ponto de partida para entender o ecossistema de empacotamentos do Python.
ru: Понимание упаковки Python - это путешествие. Терпение и постоянное совершенствование - ключ к успеху. Разделы "Обзор" и "Поток" служат отправной точкой для понимания экосистемы упаковки Python.
ta: பைதான் பேக்கேசிங் பற்றிய உங்கள் புரிதலை உருவாக்குவது ஒரு பயணம். பொறுமை மற்றும் தொடர்ச்சியான முன்னேற்றம் ஆகியவை வெற்றிக்கு முதன்மை. கண்ணோட்டம் மற்றும் ஓட்ட பிரிவுகள் பைதான் பேக்கேசிங் சுற்றுச்சூழல் அமைப்பைப் புரிந்துகொள்வதற்கான தொடக்க புள்ளியை வழங்குகின்றன.

source: The :doc:`overview` explains Python packaging and its use when preparing and distributing projects. This section helps you build understanding about selecting the tools and processes that are most suitable for your use case. It includes what packaging is, the problems that it solves, and key considerations.
ja: :doc:`概要 <overview>` では、 Python でのパッケージングとプロジェクトを準備して配布する時にどのように使うかを説明します。この節では、ツールの選定やユースケースに最適なプロセスについての理解を醸成します。パッケージングとは何か、それが解決する問題、そして鍵となる考慮事項を含みます。
pt_br: A :doc:`overview` explica empacotamento do Python e seu uso ao preparar e distribuir projetos. Esta seção ajuda você a construir compreensão sobre a seleção das ferramentas e processos que são mais adequados para o seu caso de uso. Inclui o que é o empacotamento, os problemas que resolve e as principais considerações.
ru: В :doc:`обзор` рассказывается об упаковке Python и ее использовании при подготовке и распространении проектов. Этот раздел поможет вам понять, как выбрать инструменты и процессы, наиболее подходящие для вашего случая использования. В нем рассказывается о том, что такое упаковка, какие проблемы она решает, а также о ключевых моментах.
ta: தி: டாக்: `கண்ணோட்டம்` திட்டங்களைத் தயாரிக்கும் மற்றும் விநியோகிக்கும் போது பைதான் பேக்கேசிங் மற்றும் அதன் பயன்பாட்டை விளக்குகிறது. உங்கள் பயன்பாட்டு வழக்குக்கு மிகவும் பொருத்தமான கருவிகள் மற்றும் செயல்முறைகளைத் தேர்ந்தெடுப்பது பற்றிய புரிதலை உருவாக்க இந்த பிரிவு உங்களுக்கு உதவுகிறது. பேக்கேசிங் என்றால் என்ன, அது தீர்க்கும் சிக்கல்கள் மற்றும் முக்கிய பரிசீலனைகள் இதில் அடங்கும்.

source: To get an overview of the workflow used to publish your code, see :doc:`packaging flow <flow>`.
eo: Por superrigardo pri la laborfluo por eldoni kodon, vidu :doc:`pakadan fluon <flow>`.
ja: あなたのソースコードを公開するために用いられるワークフローの概要を得たければ、 :doc:`パッケージングフロー <flow>` を見てください。
pt_br: Para obter uma visão geral do fluxo de trabalho usado para publicar seu código, consulte :doc:`fluxo de empacotamento <flow>`.
ru: Чтобы получить представление о рабочем процессе, используемом для публикации вашего кода, смотрите :doc:`packaging flow <flow>`.
ta: உங்கள் குறியீட்டை வெளியிடப் பயன்படுத்தப்படும் பணிப்பாய்வுகளின் கண்ணோட்டத்தைப் பெற, காண்க: டாக்: `பேக்கேசிங் ஓட்டம் <uflue>`.

source: Tutorials walk through the steps needed to complete a project for the first time. Tutorials aim to help you succeed and provide a starting point for future exploration. The :doc:`tutorials/index` section includes:
eo: Lernilo helpas vin paŝon post paŝo krei projekton kiel komencanto. Lerniloj celas helpi vin sukcesi kaj provizi komencpunkton por plua esplorado. La sekcio :doc:`tutorials/index` enhavas la jenon:
ja: チュートリアルでは、初めてプロジェクトを完成させる際に必要な諸段階を一通り眺めます。チュートリアルは、将来の探検のための出発点を提供することであなたの成功を助けます。 :doc:`チュートリアル <tutorials/index>` の節には次のものが含まれます:
pt_br: Os tutoriais passam pelas etapas necessárias para completar um projeto pela primeira vez. Os tutoriais visam ajudá-lo a ter sucesso e fornecer um ponto de partida para a exploração futura. A seção :doc:`tutorials/index` inclui:
ru: Учебники рассказывают о шагах, необходимых для выполнения проекта в первый раз. Учебники призваны помочь вам добиться успеха и стать отправной точкой для дальнейших исследований. Раздел :doc:`tutorials/index` включает:
ta: பயிற்சிகள் முதல் முறையாக ஒரு திட்டத்தை முடிக்க தேவையான படிகளை கடந்து செல்கின்றன. பயிற்சிகள் உங்களுக்கு வெற்றிபெற உதவுவதையும் எதிர்கால ஆய்வுக்கு ஒரு தொடக்க புள்ளியை வழங்குவதையும் நோக்கமாகக் கொண்டுள்ளன. தி: டாக்: `டுடோரியல்கள்/குறியீட்டு` பிரிவில் பின்வருவன அடங்கும்:

source: A :doc:`tutorial on installing packages <tutorials/installing-packages>`
eo: :doc:`Lernilo pri instalado de pakoj <tutorials/installing-packages>`
ja: :doc:`パッケージをインストールするためのチュートリアル <tutorials/installing-packages>`
pt_br: Um :doc:`tutorial sobre como instalar pacotes <tutorials/installing-packages>`
ru: A :doc:`учебник по установке пакетов <tutorials/installing-packages>`
ta: ப: டிஓசி: `தொகுப்புகளை நிறுவுவதற்கான பயிற்சி <பயிற்சிகள்/நிறுவல்-பேக்கேச்கள்>`

source: A :doc:`tutorial on managing application dependencies <tutorials/managing-dependencies>` in a version controlled project
eo: :doc:`Lernilo pri administrado de programaj dependecoj <tutorials/managing-dependencies>` en versikontrolata projekto
ja: バージョンを管理しているプロジェクトでの :doc:`アプリケーションの依存関係を管理するためのチュートリアル <tutorials/managing-dependencies>`
pt_br: Um :doc:`tutorial sobre como gerenciar dependências de aplicações <tutorials/managing-dependencies>` em um projeto com controle de versão
ru: Учебник по управлению зависимостями приложений <tutorials/managing-dependencies>` в проекте с контролем версий
ta: ப: டாக்: `விண்ணப்ப சார்புகளை நிர்வகிப்பதற்கான பயிற்சி <பயிற்சிகள்/நிர்வாக-சார்புநிலைகள்>` பதிப்பு கட்டுப்படுத்தப்பட்ட திட்டத்தில்

source: A :doc:`tutorial on packaging and distributing <tutorials/packaging-projects>` your project
eo: :doc:`Lernilo pri pakado kaj distribuado <tutorials/packaging-projects>` de via projekto
ja: あなたのプロジェクトの :doc:`パッケージングと配布のためのチュートリアル <tutorials/packaging-projects>`
pt_br: Um :doc:`tutorial sobre como empacotar e distribuir <tutorials/packaging-projects>` seu projeto
ru: Учебник по упаковке и распространению <tutorials/packaging-projects> вашего проекта
ta: ப: டாக்: `பேக்கேசிங் மற்றும் விநியோகித்தல் பற்றிய பயிற்சி <டுடோரியல்கள்/பேக்கேசிங்-திட்டங்கள்>` உங்கள் திட்டம்

source: Guides provide steps to perform a specific task. Guides are more focused on users who are already familiar with Python packaging and are looking for specific information.
eo: Gvidilo detalas paŝojn por iu tasko. Gvidilo estas por uzanto jam konanta pakadon de Python kaj serĉas specifajn informojn.
ja: ガイド文書は、特定のタスクを実行するためのステップを提供します。ガイド文書は、すでに Python のパッケージングに慣れていて、特定の情報を探しているようなユーザに、より強く焦点を合わせています。
pt_br: Guias fornecem etapas para executar uma tarefa específica. Guias são mais focados em usuários que já estão familiarizados com a empacotamento do Python e estão procurando informações específicas.
ru: Руководства содержат шаги по выполнению конкретной задачи. Руководства в большей степени ориентированы на пользователей, которые уже знакомы с упаковкой Python и ищут конкретную информацию.
ta: வழிகாட்டிகள் ஒரு குறிப்பிட்ட பணியைச் செய்ய நடவடிக்கைகளை வழங்குகின்றன. பைதான் பேக்கேசிங்கை ஏற்கனவே அறிந்த மற்றும் குறிப்பிட்ட தகவல்களைத் தேடும் பயனர்களுக்கு வழிகாட்டிகள் அதிக கவனம் செலுத்துகின்றன.

source: The :doc:`guides/index` section provides "how to" instructions in three major areas: package installation; building and distributing packages; miscellaneous topics.
eo: La sekcio :doc:`guides/index` priskribas lernilajn instrukciojn pri tri ĉeftemoj: instalado de pako; konstruado kaj distribuado de pako; aliaj temoj.
ja: :doc:`ガイド <guides/index>` 節では、パッケージインストール; パッケージの作成と配布; その他の話題という３個の主要な分野について "ハウツー <how to>" となる指示を提供します。
pt_br: A seção :doc:`guides/index` fornece instruções de "como fazer" em três áreas principais: instalação de pacotes; construção e distribuição de pacotes; diversos tópicos.
ru: Раздел :doc:`guides/index` содержит инструкции "как делать" в трех основных областях: установка пакетов; сборка и распространение пакетов; различные темы.
ta: தி: டாக்: `வழிகாட்டிகள்/குறியீட்டு` பிரிவு மூன்று முக்கிய பகுதிகளில்" எப்படி "அறிவுறுத்தல்களை வழங்குகிறது: தொகுப்பு நிறுவல்; தொகுப்புகளை உருவாக்குதல் மற்றும் விநியோகித்தல்; இதர தலைப்புகள்.

source: Explanations and Discussions
eo: Klarigoj kaj Diskutoj
ja: 説明と議論
pt_br: Explicações e discussões
ru: Объяснения и обсуждения
ta: விளக்கங்கள் மற்றும் விவாதங்கள்

source: :doc:`discussions/deploying-python-applications`
ja: :doc:`議論/Python アプリケーションを配置する <discussions/deploying-python-applications>`
ru: :doc:`обсуждения/развертывание-python-приложений`
ta: : டாக்: `விவாதங்கள்/வரிசைப்படுத்தல்-பைதான்-பயன்பாடுகள்`
