Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: ``~=3.1.0, != 3.1.3``: version 3.1.0 or later, but not version 3.1.3 and not version 3.2.0 or later.
eo: ``~=3.1.0, != 3.1.3``: versio 3.1.0 aŭ pli nova, sed ne versio 3.1.3, nek versio 3.2.0, nek pli nova.
ja: ``~=3.1.0, != 3.1.3``: バージョン 3.1.0 またはそれ以降、しかし、バージョン 3.1.3 ではなく、バージョン 3.2.0 またはそれ以降でもない。
ru: ``~=3.1.0, != 3.1.3``: версия 3.1.0 или более поздняя, но не версия 3.1.3 и не версия 3.2.0 или более поздняя.
ta: `` ~ = 3.1.0,! = 3.1.3``: பதிப்பு 3.1.0 அல்லது அதற்குப் பிறகு, ஆனால் பதிப்பு 3.1.3 அல்ல, பதிப்பு 3.2.0 அல்லது அதற்குப் பிறகு அல்ல.

source: Direct references
eo: Rektaj referencoj
ja: 直接参照
ru: Прямые ссылки
ta: நேரடி குறிப்புகள்

source: Some automated tools may permit the use of a direct reference as an alternative to a normal version specifier. A direct reference consists of the specifier ``@`` and an explicit URL.
eo: Kelkaj aŭtomataj iloj permesas rektan referencon anstataŭ ordinara versio-specifilo. Rekta referenco konsistas el la specifilo ``@`` kaj eksplicita retadreso.
ja: 自動化ツールの中には、通常のバージョン指定子の代替として直接参照の使用を許すものがあります。直接参照は、それを指定する ``@`` と明示された URL から構成されます。
ru: Некоторые автоматизированные инструменты могут разрешить использование прямой ссылки в качестве альтернативы обычному спецификатору версии. Прямая ссылка состоит из спецификатора ``@`` и явного URL.
ta: சில தானியங்கி கருவிகள் சாதாரண பதிப்பு விவரக்குறிப்புக்கு மாற்றாக நேரடி குறிப்பைப் பயன்படுத்த அனுமதிக்கலாம். ஒரு நேரடி குறிப்பு ``@`` மற்றும் வெளிப்படையான முகவரி ஆகியவற்றைக் கொண்டுள்ளது.

source: Whether or not direct references are appropriate depends on the specific use case for the version specifier. Automated tools SHOULD at least issue warnings and MAY reject them entirely when direct references are used inappropriately.
eo: Ĉu aŭ ne rekta referenco taŭgas, dependas de la specifa uzkazo de la versio-specifilo. Aŭtomata ilo almenaŭ AVERTU pri tio kaj POVAS malakcepti tion, kiam rekta referenco estis uzita maltaŭge.
ja: 直接参照が適切であるか否かは、バージョン指定子に対する特定のユースケースに依存します。自動化ツール群は、少なくとも警告を発行するべきで、直接参照が不適切に使われた場合には全体を拒否しても構いません。
ru: Уместны ли прямые ссылки или нет, зависит от конкретного случая использования спецификатора версии. Автоматизированные инструменты ДОЛЖНЫ как минимум выдавать предупреждения, а могут и полностью отклонять их, если прямые ссылки используются неуместно.
ta: நேரடி குறிப்புகள் பொருத்தமானதா இல்லையா என்பது பதிப்பு விவரக்குறிப்புக்கான குறிப்பிட்ட பயன்பாட்டு வழக்கைப் பொறுத்தது. தானியங்கு கருவிகள் குறைந்தபட்சம் எச்சரிக்கைகளை வழங்க வேண்டும், மேலும் நேரடி குறிப்புகள் தகாத முறையில் பயன்படுத்தப்படும்போது அவற்றை முழுமையாக நிராகரிக்கலாம்.

source: Public index servers SHOULD NOT allow the use of direct references in uploaded distributions. Direct references are intended as a tool for software integrators rather than publishers.
eo: Servilo de publika indekso NE PERMESU rektan referencon en alŝutita distribuo. Rekta referenco estas por integriloj de programoj, ne por eldonantoj.
ja: 公開のインデックスサーバは、アップロードされた配布物中での直接参照の使用を許すべきではありません。直接参照は、公開者 <publishers> 向けではなくてソフトウェアインテグレータ向けのツールとして意図されたものです。
ru: Публичные индексные серверы НЕ ДОЛЖНЫ разрешать использование прямых ссылок в загружаемых дистрибутивах. Прямые ссылки предназначены для интеграторов программного обеспечения, а не для издателей.
ta: பதிவேற்றிய விநியோகங்களில் நேரடி குறிப்புகளைப் பயன்படுத்த பொது குறியீட்டு சேவையகங்கள் அனுமதிக்கக்கூடாது. நேரடி குறிப்புகள் வெளியீட்டாளர்களைக் காட்டிலும் மென்பொருள் ஒருங்கிணைப்பாளர்களுக்கான கருவியாக கருதப்படுகின்றன.

source: Depending on the use case, some appropriate targets for a direct URL reference may be an sdist or a wheel binary archive. The exact URLs and targets supported will be tool dependent.
eo: Depende de la uzkazo, rekta retadresa referenco povas montri fontan distribuon aŭ duuman arĥivon wheel. La permesataj formoj de subtenataj retadresoj kaj celoj dpeendas de la ilo.
ja: ユースケースに依存しますが、 URL の直接参照の適切な使い所は sdist や wheel のバイナリアーカイブでしょう。正確な URL やターゲットのサポートがあるかどうかはツール次第です。
ru: В зависимости от случая использования, некоторыми подходящими целями для прямой URL-ссылки могут быть sdist или бинарный архив wheel. Точные URL-адреса и поддерживаемые цели зависят от инструмента.
ta: பயன்பாட்டு வழக்கைப் பொறுத்து, நேரடி முகவரி குறிப்புக்கான சில பொருத்தமான இலக்குகள் ஒரு SDIST அல்லது சக்கர பைனரி காப்பகமாக இருக்கலாம். ஆதரிக்கப்படும் சரியான முகவரி கள் மற்றும் இலக்குகள் கருவி சார்ந்ததாக இருக்கும்.

source: For example, a local source archive may be referenced directly::
eo: Ekzemple, oni povas rekte referenci lokan fontan arĥivon::
ja: 例えば、ローカルのソースコードアーカイブが直接に参照されるかもしれません::
ru: Например, на локальный исходный архив можно ссылаться напрямую::
ta: எடுத்துக்காட்டாக, ஒரு உள்ளக மூல காப்பகம் நேரடியாக குறிப்பிடப்படலாம் ::

source: Alternatively, a prebuilt archive may also be referenced::
eo: Alternative, oni povas referenci antaŭkonstruitan arĥivon::
ja: あるいは、ビルド済みのアーカイブが参照されるかもしれません::
ru: В качестве альтернативы можно сослаться на предварительно собранный архив::
ta: மாற்றாக, முன்பே கட்டப்பட்ட காப்பகமும் குறிப்பிடப்படலாம் ::

source: All direct references that do not refer to a local file URL SHOULD specify a secure transport mechanism (such as ``https``) AND include an expected hash value in the URL for verification purposes. If a direct reference is specified without any hash information, with hash information that the tool doesn't understand, or with a selected hash algorithm that the tool considers too weak to trust, automated tools SHOULD at least emit a warning and MAY refuse to rely on the URL. If such a direct reference also uses an insecure transport, automated tools SHOULD NOT rely on the URL.
eo: Ĉiu rekta referenco ne al loka dosiera URL SPECIFU sekuran transportan meĥanismon (kiel ekzemple ``https``) KAJ inkluzivu atendatan haketaĵan valoron en la URL por konfirmado. Se rekta referenco specifiĝas sen informoj pri haketaĵo, aŭ kun haketaĵa informo ne komprenebla de la ilo, aŭ kun haketaĵa algoritmo konsiderata tro malforta far la ilo, aŭtomata ilo minimume AVERTU kaj POVAS rifuzi dependi de la URL. Se rekta referenco ankaŭ uzas nesekuran transporton, aŭtomata ilo NE DEPENDU de la URL.
ja: ローカルにあるファイルを指す URL への参照ではない直接参照は、すべて、 (``https`` のような) 安全な転送メカニズムを指定するべきであり、かつ、検証の目的で URL の中に期待されるハッシュ値を含むべきです。直接参照でハッシュ値の情報が含まれていなかったりツールが理解できないハッシュ値の情報が含まれていたり、採用されているハッシュアルゴリズムが信頼するには弱すぎるとツールが判断したりした場合には、自動化ツールは少なくとも警告を発するべきであり、その URL に依存することを拒否しても構いません。もしそのような直接参照が安全でない転送手段を使っているなら、自動化ツールはその URL に依存するべきではありません。
ru: Все прямые ссылки, не относящиеся к URL локального файла, ДОЛЖНЫ указывать безопасный транспортный механизм (например, ``https``) И включать ожидаемое хэш-значение в URL для целей проверки. Если прямая ссылка указана без какой-либо информации о хэше, с информацией о хэше, которую инструмент не понимает, или с выбранным алгоритмом хэша, который инструмент считает слишком слабым, чтобы доверять ему, автоматизированные инструменты ДОЛЖНЫ, по крайней мере, выдать предупреждение и МОГУТ отказаться использовать URL. Если такая прямая ссылка также использует небезопасный транспорт, автоматизированные инструменты НЕ ДОЛЖНЫ полагаться на URL.
ta: உள்ளக கோப்பு முகவரி ஐக் குறிப்பிடாத அனைத்து நேரடி குறிப்புகளும் ஒரு பாதுகாப்பான போக்குவரத்து பொறிமுறையை (`` https`` போன்றவை) குறிப்பிட வேண்டும் மற்றும் சரிபார்ப்பு நோக்கங்களுக்காக முகவரி இல் எதிர்பார்க்கப்படும் ஆச் மதிப்பை சேர்க்க வேண்டும். எந்தவொரு ஆச் தகவலும் இல்லாமல் ஒரு நேரடி குறிப்பு குறிப்பிடப்பட்டால், கருவி புரிந்து கொள்ளாத ஆச் தகவலுடன், அல்லது தேர்ந்தெடுக்கப்பட்ட ஆச் வழிமுறையுடன் கருவி நம்புவதற்கு மிகவும் பலவீனமாக கருதுகிறது, தானியங்கி கருவிகள் குறைந்தபட்சம் ஒரு எச்சரிக்கையை வெளியிட வேண்டும் மற்றும் முகவரி ஐ நம்ப மறுக்கக்கூடும். அத்தகைய நேரடி குறிப்பு பாதுகாப்பற்ற போக்குவரத்தையும் பயன்படுத்தினால், தானியங்கி கருவிகள் முகவரி ஐ நம்பக்கூடாது.

source: It is RECOMMENDED that only hashes which are unconditionally provided by the latest version of the standard library's :py:mod:`hashlib` module be used for source archive hashes. At time of writing, that list consists of ``'md5'``, ``'sha1'``, ``'sha224'``, ``'sha256'``, ``'sha384'``, and ``'sha512'``.
eo: Por fontarĥiva haketaĵo, estas REKOMENDATE nur uzi haketaĵojn senkondiĉe disponigeblajn en la plej nova versio de la modulo :py:mod:`hashlib` en la norma biblioteko. Aktuale, tiaj haketaĵoj estas ``'md5'``, ``'sha1'``, ``'sha224'``, ``'sha256'``, ``'sha384'`` kaj ``'sha512'``.
ja: ソースコードアーカイブのハッシュ値計算には、標準ライブラリの :py:mod:`hashlib` モジュールの最新版が無条件に提供するハッシュだけを用いることを推奨します。本文書の執筆時点では、 'md5' ・ 'sha1' ・ 'sha224' ・ 'sha256' ・ 'sha384' ・ 'sha512' が該当します。
ru: РЕКОМЕНДУЕТСЯ использовать для хэшей исходных архивов только те хэши, которые безоговорочно предоставляются последней версией модуля :py:mod:`hashlib` стандартной библиотеки. На момент написания статьи в этот список входят ``md5``, ``sha1``, ``sha224``, ``sha256``, ``sha384`` и ``sha512``.
ta: நிலையான நூலகத்தின் அண்மைக் கால பதிப்பால் நிபந்தனையின்றி வழங்கப்படும் ஆச்கள் மட்டுமே பரிந்துரைக்கப்படுகின்றன: PY: MOD: `ஆச்லிப்` தொகுதி மூல காப்பக ஆச்களுக்கு பயன்படுத்தப்பட வேண்டும். எழுதும் நேரத்தில், அந்த பட்டியலில் `` 'md5'``, ``' '' 'சா 1'``, ``' சா 224'```, `'' சா 256'```,` '' சா 384'``, மற்றும் `'' சா 512'`` ஆகியவற்றைக் கொண்டுள்ளது.

source: For source archive and wheel references, an expected hash value may be specified by including a ``<hash-algorithm>=<expected-hash>`` entry as part of the URL fragment.
eo: Por referencoj al fonta arĥivo aŭ wheel, oni povas specifi atendatan haketaĵan valoron inkluzivante eron ``<haketada-algoritmo>=<atendata-haketaĵo>`` kiel parton de la URL-fragmento.
ja: ソースコードアーカイブと wheel を参照するためには、期待されるハッシュ値は URL の一部として ``<hash-algorithm>=<expected-hash>`` エントリに含まれる形で指定されるでしょう。
ru: Для ссылок на исходный архив и колесо ожидаемое хэш-значение может быть указано путем включения записи ``<hash-algorithm>=<expected-hash>`` в качестве части фрагмента URL.
ta: மூல காப்பகம் மற்றும் சக்கர குறிப்புகளுக்கு, `` <ஆச்-அல்காரிதம்> = <எதிர்பார்க்கப்படும்-ஆச்> `` முகவரி துண்டின் ஒரு பகுதியாக நுழைவு ஆகியவற்றைச் சேர்ப்பதன் மூலம் எதிர்பார்க்கப்படும் ஆச் மதிப்பு குறிப்பிடப்படலாம்.

source: For version control references, the ``VCS+protocol`` scheme SHOULD be used to identify both the version control system and the secure transport, and a version control system with hash based commit identifiers SHOULD be used. Automated tools MAY omit warnings about missing hashes for version control systems that do not provide hash based commit identifiers.
ja: バージョンコントロールの参照のためには、バージョン管理システムと安全な転送手段の両方を特定するために ``VCS+プロトコル`` の書き方が使われるべきで、ハッシュ値で表現したコミット識別子を伴ったバージョン管理システムが使われるべきです。自動化ツール群は、ハッシュ値で表したコミット識別子を持たないバージョン管理システムではハッシュ値がなくても警告を省略しても構いません。
ru: Для ссылок на систему контроля версий схема ``VCS+protocol`` ДОЛЖНА использоваться для идентификации как системы контроля версий, так и безопасного транспорта, и ДОЛЖНА использоваться система контроля версий с идентификаторами фиксаций на основе хэшей. Автоматизированные инструменты МОГУТ не выдавать предупреждения об отсутствии хэшей для систем контроля версий, которые не предоставляют идентификаторы фиксации на основе хэшей.
ta: பதிப்பு கட்டுப்பாட்டு குறிப்புகளுக்கு, பதிப்பு கட்டுப்பாட்டு அமைப்பு மற்றும் பாதுகாப்பான போக்குவரத்து இரண்டையும் அடையாளம் காண `` வி.சி.எச்+நெறிமுறை`` திட்டம் பயன்படுத்தப்பட வேண்டும், மேலும் ஆச் அடிப்படையிலான கமிட் அடையாளங்காட்டிகளுடன் ஒரு பதிப்பு கட்டுப்பாட்டு அமைப்பு பயன்படுத்தப்பட வேண்டும். ஆச் அடிப்படையிலான கமிட் அடையாளங்காட்டிகளை வழங்காத பதிப்பு கட்டுப்பாட்டு அமைப்புகளுக்கான ஆச்களைக் காணவில்லை என்ற எச்சரிக்கைகளை தானியங்கு கருவிகள் தவிர்க்கலாம்.

source: To handle version control systems that do not support including commit or tag references directly in the URL, that information may be appended to the end of the URL using the ``@<commit-hash>`` or the ``@<tag>#<commit-hash>`` notation.
eo: Por versikontrola sistemo ne ebliganta inkluzivi referencon al enmeto aŭ etikedo rekte en la retadreson, oni povas postmeti tiajn informojn ĉe la fino de la retadreso laŭ la notacio ``@<haketaĵo-de-enmeto>`` aŭ ``@<tag>#<haketaĵo-de-enmeto>``.
ja: コミットやタグへの参照を URL 内に直接書くことをサポートしないバージョン管理システムを扱うためには、 そのような情報は、 ``@<コミットのハッシュ値>`` や ``@<タグ>#<コミットのハッシュ値>`` という表記方法を用いて URL の末尾に追加しても構いません。
ru: Для работы с системами контроля версий, которые не поддерживают включение ссылок на коммит или тег непосредственно в URL, эта информация может быть добавлена в конец URL с помощью нотации ``@<commit-hash>`` или ``@<tag>#<commit-hash>``.
ta: முகவரி இல் நேரடியாக கமிட் அல்லது டேக் குறிப்புகள் உட்பட ஆதரிக்காத பதிப்பு கட்டுப்பாட்டு அமைப்புகளைக் கையாள, அந்த செய்தி `` `<கமிட்-ஆச்>` அல்லது ``@<குறிச்சொல்>#<கமிட்-ஆச்> `` குறியீட்டைப் பயன்படுத்தி முகவரி இன் முடிவில் சேர்க்கப்படலாம்.

source: This isn't *quite* the same as the existing VCS reference notation supported by pip. Firstly, the distribution name is moved in front rather than embedded as part of the URL. Secondly, the commit hash is included even when retrieving based on a tag, in order to meet the requirement above that *every* link should include a hash to make things harder to forge (creating a malicious repo with a particular tag is easy, creating one with a specific *hash*, less so).
eo: Tio ne estas *ekzakte* sama kiel la ekzistanta versikontrolsistemo-referenca notacio de pip. Unue, la distribuonomo estas movita antaŭen, ne integrita kiel parto de la retadreso. Due, la haketaĵo de la enmeto estas inkluzivita eĉ dum prenado per etikedo, por plenumi la postulon, ke *ĉiu* hiperligo inkluzivu haketaĵon por malhelpi falsadon (estas facile krei fideponejon kun iu deponejo; estas malpli facile krei fideponejon kun specifa *haketaĵo*).
ja: これは、 pip がサポートするような既存の VCS 参照の表記方法とは *非常に* 異なります。第一に、配布物の名称が URL の一部として埋め込まれるのではなく、前方に移動しています。第二に、タグに基づいて取得する場合であっても、 (特定のタグを伴う悪意あるリポジトリを作成することは容易で、特定の *ハッシュ値* を伴うものはより困難であることから) 偽造をより困難にするために *あらゆる* リンクにハッシュ値が含まれているべきであるという要求に従うために、コミットのハッシュ値が含まれています。
ru: Это не совсем то же самое, что существующая нотация ссылок на VCS, поддерживаемая pip. Во-первых, имя дистрибутива переносится вперёд, а не вставляется в URL. Во-вторых, хэш коммита включается даже при поиске по тегу, чтобы выполнить требование выше, что *каждая* ссылка должна включать хэш, чтобы затруднить подделку (создать вредоносное репо с определённым тегом легко, а создать репо с определённым *хэшем* - менее).
ta: இது PIP ஆல் ஆதரிக்கப்படும் தற்போதுள்ள பகஅ குறிப்பு குறியீட்டைப் போலவே இல்லை. முதலாவதாக, விநியோக பெயர் முகவரி இன் ஒரு பகுதியாக உட்பொதிக்கப்பட்டதை விட முன்னால் நகர்த்தப்படுகிறது. இரண்டாவதாக, ஒரு குறிச்சொல்லின் அடிப்படையில் மீட்டெடுக்கும்போது கூட, கமிட் ஆச் சேர்க்கப்பட்டுள்ளது, மேலே உள்ள தேவையை நிறைவு செய்வதற்காக *ஒவ்வொரு *இணைப்பும் விசயங்களை உருவாக்க கடினமாக இருக்க ஒரு ஆச் இருக்க வேண்டும் (ஒரு குறிப்பிட்ட குறிச்சொல்லுடன் தீங்கிழைக்கும் ரெப்போவை உருவாக்குவது எளிதானது, ஒரு குறிப்பிட்ட *ஆச் *உடன் ஒன்றை உருவாக்குகிறது, குறைவாக).

source: Remote URL examples::
eo: Ekzemploj de foraj retadresoj::
ja: リモート URL の例::
ru: Примеры удаленных URL::
ta: தொலைநிலை முகவரி எடுத்துக்காட்டுகள் ::

source: File URLs
eo: Dosieraj retadresoj
ja: ファイルを指す URL 群
ru: URL-адреса файлов
ta: கோப்பு முகவரி கள்

source: File URLs take the form of ``file://<host>/<path>``. If the ``<host>`` is omitted it is assumed to be ``localhost`` and even if the ``<host>`` is omitted the third slash MUST still exist. The ``<path>`` defines what the file path on the filesystem that is to be accessed.
eo: Dosiera retadreso havas la formon ``file://<gastiganto>/<vojo>``. Se la ``<gastiganto>`` mankas, tio implicas ``localhost``. Eĉ se la ``<gastiganto>`` mankas, la tria suprenstreko DEVAS tamen ekzisti. La ``<vojo>`` difinas la dosierlokan vojon ĉe la dosiersistemo atingota.
ja: ファイル URL は、 ``file://<host>/<path>`` の形を取ります。 ``<host>`` が省略された場合は ``localhost`` であるものと想定され、 ``<host>`` が省略された場合であってさえも３個目のスラッシュが存在していなければなりません。 ``<path>`` は、これからアクセスされるであろうファイルシステム上のファイルパスです。
ru: URL-адреса файлов имеют вид ``file://<host>/<path>``. Если ``<host>`` опущен, предполагается, что это ``localhost``, и даже если ``<host>`` опущен, третья косая черта ДОЛЖНА существовать. Параметр ``<path>`` определяет путь к файлу в файловой системе, к которому необходимо получить доступ.
ta: கோப்பு முகவரி கள் `` கோப்பு: // <ஓச்ட்>/<athe> `` வடிவத்தை எடுக்கின்றன. `` <ஓச்ட்> `` தவிர்க்கப்பட்டால், அது `` உள்ளக ஓச்ட்`` என்று கருதப்படுகிறது, மேலும் `` <ஓச்ட்> `` தவிர்க்கப்பட்டாலும் கூட மூன்றாவது சாய்வு இன்னும் இருக்க வேண்டும். `` <athe> `` `அணுக வேண்டிய கோப்பு முறைமையின் கோப்பு பாதை என்ன என்பதை வரையறுக்கிறது.

source: On the various \*nix operating systems the only allowed values for ``<host>`` is for it to be omitted, ``localhost``, or another FQDN that the current machine believes matches its own host. In other words, on \*nix the ``file://`` scheme can only be used to access paths on the local machine.
eo: Sur la diversaj Unisekcaj mastrumaj sistemoj, la nuraj permesataj valoroj por ``<gastiganto>`` estas manko, ``localhost``, aŭ alia plene kvalifikita nomregno (FQDN), kiu egalas la gastiganton de la aktuala maŝino. Alivorte, sur Unikso, la skemo ``file://`` nur povas atingi vojojn ĉe la loka maŝino.
ja: さまざまな \*nix オペレーティングシステムでは、 ``<host>`` に許される唯一の値は、省略時の ``localhost`` か、現在のマシーンが自分自身であると信じている別の FQDN です。換言すれば、 \*nix 上では、ローカルマシン上のパスにアクセスするための ``file://`` スキームだけが使用可能であるということです。
ru: В различных операционных системах \*nix единственным допустимым значением для ``<host>`` является опущение, ``localhost`` или другое FQDN, которое, по мнению текущей машины, соответствует ее собственному хосту. Другими словами, в \*nix схема ``file://`` может использоваться только для доступа к путям на локальной машине.
ta: பல்வேறு \*நிக்ச் இயக்க முறைமைகளில், `` <ஓச்ட்> `` க்கான ஒரே அனுமதிக்கப்பட்ட மதிப்புகள், அதைத் தவிர்க்க வேண்டும், `` உள்ளக ஓச்ட்`` அல்லது தற்போதைய இயந்திரம் நம்பும் மற்றொரு fqdn அதன் சொந்த ஓச்டுடன் பொருந்துகிறது. வேறு வார்த்தைகளில் கூறுவதானால், `` கோப்பு: // `` திட்டத்தை உள்ளக கணினியில் பாதைகளை அணுக மட்டுமே பயன்படுத்த முடியும்.

source: On Windows the file format should include the drive letter if applicable as part of the ``<path>`` (e.g. ``file:///c:/path/to/a/file``). Unlike \*nix on Windows the ``<host>`` parameter may be used to specify a file residing on a network share. In other words, in order to translate ``\\machine\volume\file`` to a ``file://`` url, it would end up as ``file://machine/volume/file``. For more information on ``file://`` URLs on Windows see `MSDN <https://web.archive.org/web/20130321051043/http://blogs.msdn.com/b/ie/archive/2006/12/06/file-uris-in-windows.aspx>`_.
eo: Sur Windows, la dosierformo inkluzivu la diskliteron, se tiu ekzistas, kiel parton de la ``<vojo>`` (ekz. ``file:///c:/vojo/al/dosiero``). Malsimile al Unikso, sur Windows la parametro ``<gastiganto>`` povas specifi foran dosieron en reto. Alivorte, ``\\maŝino\volumo\dosiero`` tradukita al ``file://``-adreso estas ``file://maŝino/volumo/dosiero``. Por pliaj informoj pri ``file://``-adresoj ĉe Windows, vidu `MSDN <https://web.archive.org/web/20130321051043/http://blogs.msdn.com/b/ie/archive/2006/12/06/file-uris-in-windows.aspx>`_.
ja: Windows では、ファイルフォーマットは、もし可能なら (例えば ``file:///c:/path/to/a/file`` のように) ``<path>`` の一部としてドライブレターを含んでいるべきです。 \*nix とは異なり、 Windows 上では ``<host>`` パラメータは、ネットワーク共有上にあるファイルを指定するために使われます。換言すれば、 ``\\machine\volume\file`` を ``file://`` url に翻訳するために、最終的に ``file://machine/volume/file`` の形になるでしょう。Windows における ``file://`` URL についてもっと詳しい情報を知るためには、 `MSDN <https://web.archive.org/web/20130321051043/http://blogs.msdn.com/b/ie/archive/2006/12/06/file-uris-in-windows.aspx>`_ を見てください。
ru: В Windows формат файла должен включать букву диска, если это применимо, как часть ``<пути>`` (например, ``file:///c:/path/to/a/file``). В отличие от \*nix в Windows параметр ``<host>`` может использоваться для указания файла, находящегося на сетевом ресурсе. Другими словами, если перевести ``\\\machine\volume\file`` в урл ``file://``, то в итоге получится ``file://machine/volume/file``. Дополнительную информацию об URL-адресах ``file://`` в Windows можно найти в `MSDN <https://web.archive.org/web/20130321051043/http://blogs.msdn.com/b/ie/archive/2006/12/06/file-uris-in-windows.aspx>`_.
ta: சாளரங்களில் கோப்பு வடிவத்தில் `` <ath> `` (எ.கா. `` `` கோப்பு: /// சி:/பாத்/டு/ஏ/கோப்பு``) இன் ஒரு பகுதியாக பொருந்தினால் இயக்கி கடிதத்தை சேர்க்க வேண்டும். சாளரங்களில் \*நிக்ச் போலல்லாமல் `` <ஓச்ட்> `` பிணையம் பங்கில் வசிக்கும் கோப்பைக் குறிப்பிட அளவுரு பயன்படுத்தப்படலாம். வேறு வார்த்தைகளில் கூறுவதானால், `` \\ இயந்திர \ தொகுதி \ கோப்பு`` ஒரு `` கோப்பு: // `` முகவரி க்கு மொழிபெயர்க்க, இது `` கோப்பு: // இயந்திரம்/தொகுதி/கோப்பு`` என முடிவடையும். சாளரங்களில் `` கோப்பு: // `` urls பற்றிய கூடுதல் தகவலுக்கு `msdtn <https://web.archive.org/web/20130321051043/http://blogs.

source: Summary of differences from pkg_resources.parse_version
eo: Resumo pri diferencoj de pkg_resources.parse_version
ja: pkg_resources.parse_version からの相違点のまとめ
pt_br: Resumo das diferenças em relação a pkg_resources.parse_version
ru: Краткое описание отличий от pkg_resources.parse_version
ta: Pkg_resources.parse_version இலிருந்து வேறுபாடுகளின் சுருக்கம்

source: Note: this comparison is to ``pkg_resources.parse_version`` as it existed at the time :pep:`440` was written. After the PEP was accepted, setuptools 6.0 and later versions adopted the behaviour described here.
eo: Notu: tiu komparo estis al ``pkg_resources.parse_version``, kiam :pep:`440` estis verkita. Post la aprobo de la PEP, setuptools 6.0 kaj postaj versioj adoptis la konduton priskribitan ĉi tie.
ru: Примечание: это сравнение с ``pkg_resources.parse_version`` в том виде, в котором он существовал на момент написания :pep:`440`. После того, как PEP был принят, setuptools 6.0 и более поздние версии приняли описанное здесь поведение.
ta: குறிப்பு: இந்த ஒப்பீடு `` pkg_resources.parse_version`` அந்த நேரத்தில் இருந்ததைப் போல: PEP: `440` எழுதப்பட்டது. PEP ஏற்றுக்கொள்ளப்பட்ட பிறகு, செட்டுப்டூல்ச் 6.0 மற்றும் பின்னர் பதிப்புகள் இங்கு விவரிக்கப்பட்டுள்ள நடத்தையை ஏற்றுக்கொண்டன.

source: Local versions sort differently, this specification requires that they sort as greater than the same version without a local version, whereas ``pkg_resources.parse_version`` considers it a pre-release marker.
eo: Loka versio estas ordigita alimaniere. Ĉi tiu specifo postulas, ke loka versio estu pli granda ol la sama versio sen loka versio, dum ``pkg_resources.parse_version`` konsideras ĝin kiel markon de antaŭeldono.
ja: ローカルバージョンの順序付けは異なっていて、この仕様では、ローカルバージョンなしの同バージョンのものよりも後に来るものとして順序付けを行うように要求していますが、他方で、 ``pkg_resources.parse_version`` はそれ (訳註、ローカルバージョン) をプレリリースのマーカーの一つであると見做しています。
ru: Локальные версии сортируются по-разному, эта спецификация требует, чтобы они сортировались как большие, чем та же версия без локальной версии, в то время как ``pkg_resources.parse_version`` считает это маркером предрелизности.
ta: உள்ளக பதிப்புகள் வித்தியாசமாக வரிசைப்படுத்துகின்றன, இந்த விவரக்குறிப்புக்கு உள்ளக பதிப்பு இல்லாமல் ஒரே பதிப்பை விட அதிகமாக வரிசைப்படுத்த வேண்டும், அதேசமயம் `` pkg_resources.parse_version`` இது ஒரு முன் வெளியீட்டுக்கு முந்தைய குறிப்பானாக கருதுகிறது.

source: This specification purposely restricts the syntax which constitutes a valid version while ``pkg_resources.parse_version`` attempts to provide some meaning from *any* arbitrary string.
eo: Ĉiu tiu specifo intence restriktas la sintakson de valida versio, dum ``pkg_resources.parse_version`` provas analizi *iun ajn* signoĉenon.
ja: この仕様では、正当なバージョン番号を構成する文法を意図的に制限していますが、他方で ``pkg_resources.parse_version`` では *あらゆる* 任意の文字列から何らかの意味を汲み取るように試みます。
ru: Эта спецификация намеренно ограничивает синтаксис, который представляет собой правильную версию, в то время как ``pkg_resources.parse_version`` пытается получить некоторое значение из *любой* произвольной строки.
ta: இந்த விவரக்குறிப்பு சரியான பதிப்பை உருவாக்கும் தொடரியல் வேண்டுமென்றே கட்டுப்படுத்துகிறது, அதே நேரத்தில் `` pkg_resources.parse_version`` * எந்த * தன்னிச்சையான சரத்திலிருந்து சில அர்த்தங்களை வழங்க முயற்சிக்கிறது.
