Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: For the use of selecting a version+format, the most useful of these is ``$type/$subtype``, as that is the only way to actually specify the version and format you want.
eo: Por elekti version kaj dosierformon, la plej utila el tiuj estas ``$tipo/$subtipo``, ĉar tio estas la sola maniero specifi la deziratajn version kaj dosierformon.
ja: バージョン＋フォーマット <version+format> の選択に使うには、これらのうちで最も役に立つのは ``$type/$subtype`` で、望みのバージョンとフォーマットを実際に指定する唯一の方法だからです。
ru: Для выбора версии+формата наиболее полезным из них является ``$тип/$подтип``, поскольку это единственный способ действительно указать нужную версию и формат.
ta: ஒரு பதிப்பு+வடிவமைப்பைத் தேர்ந்தெடுப்பதைப் பயன்படுத்துவதற்கு, இவற்றில் மிகவும் பயனுள்ளதாக இருக்கும் `` $ வகை/$ துணை வகை``, ஏனெனில் நீங்கள் விரும்பும் பதிப்பு மற்றும் வடிவமைப்பைக் குறிப்பிடுவதற்கான ஒரே வழி இதுதான்.

source: The order of the content types listed in the ``Accept`` header does not have any specific meaning, and the server **SHOULD** consider all of them to be equally valid to respond with. If a client wishes to specify that they prefer a specific content type over another, they may use the ``Accept`` header's `quality value <https://developer.mozilla.org/en-US/docs/Glossary/Quality_values>`_ syntax.
ja: ``Accept`` ヘッダに列挙されたコンテント型の順序は、なんら特定の意味を持たず、サーバ側ではその全てをそれを使って応答するために等しく正当なものと **考えるべきです** 。クライアント側が特定のコンテント型を他のものよりも好むことを指定したいならば、 ``Accept`` ヘッダの `quality バリュー <https://developer.mozilla.org/en-US/docs/Glossary/Quality_values>`_ の文法を使っても構いません。
ru: Порядок следования типов содержимого, перечисленных в заголовке ``принять``, не имеет конкретного значения, и сервер **ДОЛЖЕН** считать, что все они одинаково подходят для ответа. Если клиент хочет указать, что он предпочитает определенный тип содержимого другому, он может использовать синтаксис ``принять`` в заголовке ``значение качества <https://developer.mozilla.org/en-US/docs/Glossary/Quality_values>`_.
ta: `` ஏற்றுக்கொள்` தலைப்பில் பட்டியலிடப்பட்ட உள்ளடக்க வகைகளின் வரிசையில் எந்த குறிப்பிட்ட அர்த்தமும் இல்லை, மேலும் சேவையகம் ** ** அவை அனைத்தும் பதிலளிக்க சமமாக செல்லுபடியாகும் என்று கருத வேண்டும். ஒரு வாடிக்கையாளர் அவர்கள் ஒரு குறிப்பிட்ட உள்ளடக்க வகையை மற்றொன்றுக்கு மேல் விரும்புகிறார்கள் என்பதைக் குறிப்பிட விரும்பினால், அவர்கள் `` ஏற்றுக்கொள் `தலைப்பின்` தர மதிப்பு <https://developer.mozilla.org/en-us/docs/glossary/quality_values> _ தொடரியல் பயன்படுத்தலாம்.

source: This allows a client to specify a priority for a specific entry in their ``Accept`` header, by appending a ``;q=`` followed by a value between ``0`` and ``1`` inclusive, with up to 3 decimal digits. When interpreting this value, an entry with a higher quality has priority over an entry with a lower quality, and any entry without a quality present will default to a quality of ``1``.
ja: これは、 ``;q=`` とこれに後続する10進数で3桁までの ``0`` 以上 ``1`` 以下の値を付加することによって ``Accept`` ヘッダ内の特定のエントリの優先度をクライアントが指定することを可能にします。この値を解釈する際には、より高い q 値 (quality 値) のエントリがより低い品質のものよりも優先され、q 値を持たないものはデフォルトで ``1`` であると解釈されます。
ru: Это позволяет клиенту указать приоритет для конкретной записи в заголовке ``Принять``, добавив ``;q=``, за которым следует значение от ``0`` до ``1`` включительно, содержащее до 3 десятичных цифр. При интерпретации этого значения запись с более высоким качеством имеет приоритет перед записью с более низким качеством, и любая запись без присутствующего качества будет по умолчанию иметь качество ``1``.
ta: ஒரு கிளையன்ட் ஒரு குறிப்பிட்ட நுழைவுக்கான முன்னுரிமையை அவர்களின் `` ஏற்றுக்கொள்` `தலைப்பில் குறிப்பிட அனுமதிக்கிறது,` `; q =` `தொடர்ந்து` `0`` மற்றும்` 1`` உள்ளடக்கிய, 3 தசம இலக்கங்களுடன். இந்த மதிப்பை விளக்கும் போது, உயர் தரத்துடன் கூடிய நுழைவுக்கு குறைந்த தரத்துடன் நுழைவதை விட முன்னுரிமை உள்ளது, மேலும் தகுதி இல்லாத எந்தவொரு நுழைவும் `` 1`` தரத்திற்கு இயல்புநிலையாக இருக்கும்.

source: However, clients should keep in mind that a server is free to select **any** of the content types they've asked for, regardless of their requested priority, and it may even return a content type that they did **not** ask for.
eo: Tamen, kliento memoru, ke servilo rajtas elekti **ajnan* el la petitaj enhavtipoj, malgraŭ la donitaj prioritatoj, kaj eĉ enhavtipon **ne** petitan.
ja: しかしながら、サーバはクライアント側から要請されたコンテント型の **どれ** を選んでも構わないということ、そして、サーバはクライアントが **要請しなかった** コンテント型で返答しても構わないということを、クライアントは心に留めておくべきです。
ru: Однако клиентам следует помнить, что сервер может выбрать **любой** из запрошенных ими типов содержимого, независимо от их приоритета, и даже может вернуть тип содержимого, который они **не* запрашивали.
ta: எவ்வாறாயினும், ஒரு சேவையகம் அவர்கள் கேட்டுக் கொண்ட உள்ளடக்க வகைகளில் ** ** ஐக் கோரப்பட்ட முன்னுரிமையைப் பொருட்படுத்தாமல் தேர்ந்தெடுக்க இலவசம் என்பதை நினைவில் கொள்ள வேண்டும், மேலும் அவர்கள் செய்த உள்ளடக்க வகையை கூட ** ** கேட்கவில்லை.

source: To aid clients in determining the content type of the response that they have received from an API request, this spec requires that servers always include a ``Content-Type`` header indicating the content type of the response. This is technically a backwards incompatible change, however in practice `pip has been enforcing this requirement <https://github.com/pypa/pip/blob/cf3696a81b341925f82f20cb527e656176987565/src/pip/_internal/index/collector.py#L123-L150>`_ so the risks for actual breakages is low.
eo: Por helpi kliento determini la enhavtipon de la respondo al API-peto, ĉi tiu specifo postulas, ke servilo ĉiam inkluzivu ĉapon``Content-Type`` pri la enhavtipo de la respondo. Tio estas teĥnike ne retrokongrua ŝanĝo. Tamen praktike `pip devigas ĉi tiun postulon <https://github.com/pypa/pip/blob/cf3696a81b341925f82f20cb527e656176987565/src/pip/_internal/index/collector.py#L123-L150>`_. Tial la risko de reala rompo estas malgranda.
ja: API へのリクエストから受けとった応答のコンテント型を決定するにあたってクライアントを補助するために、この仕様では、応答のコンテント型を示す ``Content-Type`` ヘッダをサーバが常に含めることを要求している。これは、技術的には後方互換性のない変更ですが、実際には `pip ` はすでにこの要求事項 <https://github.com/pypa/pip/blob/cf3696a81b341925f82f20cb527e656176987565/src/pip/_internal/index/collector.py#L123-L150>`_ を強制していますので、実際に何かを壊すリスクは低いでしょう。
ru: Чтобы помочь клиентам определить тип содержимого ответа, который они получили в результате запроса API, данная спецификация требует, чтобы серверы всегда включали заголовок ``Содержание-Тип``, указывающий на тип содержимого ответа. Технически это изменение несовместимо с обратными требованиями, однако на практике `pip соблюдает это требование <https://github.com/pypa/pip/blob/cf3696a81b341925f82f20cb527e656176987565/src/pip/_internal/index/collector.py#L123-L150>`_, так что риск реальных поломок невелик.
ta: பநிஇ கோரிக்கையிலிருந்து அவர்கள் பெற்ற பதிலின் உள்ளடக்க வகையை தீர்மானிக்க வாடிக்கையாளர்களுக்கு உதவ, இந்த விவரக்குறிப்புகள் எப்போதும் பதிலின் உள்ளடக்க வகையைக் குறிக்கும் `` உள்ளடக்க-வகை`` தலைப்பு ஆகியவற்றை எப்போதும் சேர்க்க வேண்டும். இது தொழில்நுட்ப ரீதியாக பின்னோக்கி பொருந்தாத மாற்றமாகும், இருப்பினும் நடைமுறையில் `பிஐபி இந்த தேவையை அமல்படுத்துகிறது <https://github.com/pypa/pip/bip/cf3696a81b341925f82f8cb527e656176987565/src/pip/_internal/collector.py#-123-150> _

source: An example of how a client can operate would look like:
eo: Jen ekzemplo de funkciado de kliento:
ja: クライアントがどのように運用できるかの例は次のように見えるでしょう:
ru: Пример работы клиента может выглядеть следующим образом:
ta: ஒரு வாடிக்கையாளர் எவ்வாறு செயல்பட முடியும் என்பதற்கான எடுத்துக்காட்டு போல் இருக்கும்:

source: If a client wishes to only support HTML or only support JSON, then they would just remove the content types that they do not want from the ``Accept`` header, and turn receiving them into an error.
eo: Se kliento volus nur subteni HTML aŭ JSON, do ĝi simple forigus nevolatan enhavtipon el la ĉapo ``Accept``, tiel ke ricevi tion estus erare.
ja: クライアント側が、 HTML だけを、または JSON だけをサポートしたいと望むなら、 ``Accept`` ヘッダから望まないコンテント型を単に取り除くでしょうし、(望まないものを) 受け取ったらエラーにすることでしょう。
ru: Если клиент хочет поддерживать только HTML или только JSON, то он просто удалит типы контента, которые ему не нужны, из заголовка ``принять``, и превратит их получение в ошибку.
ta: ஒரு வாடிக்கையாளர் உஉகுமொ ஐ மட்டுமே ஆதரிக்க விரும்பினால் அல்லது சாதொபொகு ஐ மட்டுமே ஆதரிக்க விரும்பினால், அவர்கள் விரும்பாத உள்ளடக்க வகைகளை `` ஏற்றுக்கொள்` தலைப்பிலிருந்து அகற்றி, அவற்றைப் பெறுவதை பிழையாக மாற்றிவிடுவார்கள்.

source: Alternative Negotiation Mechanisms
eo: Alternativaj Marĉandaj Meĥanismoj
ja: 代わりの交渉機構 <Negotiation Mechanisms>
ru: Альтернативные механизмы переговоров
ta: மாற்று பேச்சுவார்த்தை வழிமுறைகள்

source: While using HTTP's Content negotiation is considered the standard way for a client and server to coordinate to ensure that the client is getting an HTTP response that it is able to understand, there are situations where that mechanism may not be sufficient. For those cases this spec has alternative negotiation mechanisms that may *optionally* be used instead.
ja: HTTP でのコンテンツネゴシエーションを使うことがクライアントとサーバが協調してクライアントが理解することができる HTTP 応答を得られることを確実にする標準的な方法である一方で、このメカニズムで十分とは言えないような状況が存在します。そのような場合向けに、この仕様には、 *オプションとして* 代わりに使っても構わない代わりの交渉機構 <alternative negotiation mechanisms> があります。
ru: Хотя использование согласования содержимого HTTP считается стандартным способом координации действий клиента и сервера для обеспечения того, чтобы клиент получал понятный ему HTTP-ответ, бывают ситуации, когда этого механизма может быть недостаточно. Для таких случаев в данной спецификации предусмотрены альтернативные механизмы согласования, которые могут *факультативно* использоваться вместо него.
ta: HTTP இன் உள்ளடக்க பேச்சுவார்த்தையைப் பயன்படுத்துவது ஒரு கிளையன்ட் மற்றும் சேவையகத்திற்கான ஒருங்கிணைப்புக்கான நிலையான வழியாக கருதப்படுகிறது, வாடிக்கையாளர் புரிந்து கொள்ளக்கூடிய ஒரு HTTP பதிலைப் பெறுகிறார் என்பதை உறுதிப்படுத்த, அந்த வழிமுறை போதுமானதாக இல்லாத சூழ்நிலைகள் உள்ளன. அந்த நிகழ்வுகளுக்கு இந்த விவரக்குறிப்பில் மாற்று பேச்சுவார்த்தை வழிமுறைகள் உள்ளன, அவை அதற்கு பதிலாக * விருப்பமாக * பயன்படுத்தப்படலாம்.

source: URL Parameter
eo: URL-Parametro
ja: URL パラメータ
ru: Параметр URL
ta: முகவரி அளவுரு

source: Servers that implement the Simple API may choose to support a URL parameter named ``format`` to allow the clients to request a specific version of the URL.
eo: Servilo realiganta la Simplan API povas eble subteni retadresan parametron nomitan ``format`` por peti specifan version de la retadreso.
ru: Серверы, реализующие Simple API, могут поддерживать параметр URL с именем ``формат``, чтобы позволить клиентам запрашивать определенную версию URL.
ta: எளிய பநிஇ ஐ செயல்படுத்தும் சேவையகங்கள் முகவரி இன் குறிப்பிட்ட பதிப்பைக் கோர வாடிக்கையாளர்களை அனுமதிக்க `` வடிவமைப்பு`` என்ற முகவரி அளவுருவை ஆதரிக்க தேர்வு செய்யலாம்.

source: The value of the ``format`` parameter should be **one** of the valid content types. Passing multiple content types, wild cards, quality values, etc... is **not** supported.
eo: La valoro de la parametro ``format`` estu **unu** el la validaj enhavtipoj. Ne subtenataj estas pluraj enhavtipoj, ĵokero, kvalito-valoro ktp.
ja: ``format`` パラメータの値は、正当なコンテント型のうちの **ひとつ** であるべきです。複数のコンテント型を渡すことやワイルドカード、quality 値などはサポートされて **いません** 。
ru: Значение параметра ``формат'' должно быть **одним** из допустимых типов содержимого. Передача нескольких типов содержимого, подстановочных карт, качественных значений и т. д. **не поддерживается.
ta: `` வடிவமைப்பு`` அளவுருவின் மதிப்பு சரியான உள்ளடக்க வகைகளில் ** ஒன்று ** ஆக இருக்க வேண்டும். பல உள்ளடக்க வகைகள், காடு கார்டுகள், தர மதிப்புகள் போன்றவற்றை கடந்து செல்வது ... ** அல்ல ** ஆதரிக்கப்படவில்லை.

source: Supporting this parameter is optional, and clients **SHOULD NOT** rely on it for interacting with the API. This negotiation mechanism is intended to allow for easier human based exploration of the API within a browser, or to allow documentation or notes to link to a specific version+format.
eo: Ĉi tiu parametro ne estas subtenenda. Kliento **NE DEPENDU** de ĝi por interagi kun la API. La marĉanda meĥanismo estas por pli facila homa esplorado de la API en TTT-legilo aŭ por permesi hiperligon al specifa versio kaj formo en dokumentaro aŭ notoj.
ja: このパラメータをサポートすることはオプションで、 API とやりとりするクライアントはこれを **当てにするべきではありません** 。このネゴシエーションメカニズムは、人間がブラウザ内で API をより簡単に調査することができるようにすることを意図したもの、ないし、説明文書やノートから特定の version+format にリンクすることができるようにすることを意図したものです。
ru: Поддержка этого параметра необязательна, и клиенты **НЕ ДОЛЖНЫ** полагаться на него при взаимодействии с API. Этот механизм согласования предназначен для того, чтобы облегчить изучение API в браузере, а также для того, чтобы в документации или примечаниях можно было ссылаться на конкретную версию+формат.
ta: இந்த அளவுருவை ஆதரிப்பது விருப்பமானது, மேலும் வாடிக்கையாளர்கள் ** பநிஇ உடன் தொடர்புகொள்வதற்கு ** இதை நம்பக்கூடாது. இந்த பேச்சுவார்த்தை பொறிமுறையானது உலாவிக்குள் ஏபிஐக்கு எளிதாக மனித அடிப்படையிலான ஆய்வை அனுமதிப்பதற்காக அல்லது ஆவணங்கள் அல்லது குறிப்புகளை ஒரு குறிப்பிட்ட பதிப்பு+வடிவமைப்போடு இணைக்க அனுமதிப்பதற்காக நோக்கமாக உள்ளது.

source: Servers that do not support this parameter may choose to return an error when it is present, or they may simple ignore its presence.
eo: Servilo ne subtenanta tiun parametron povas raporti eraron se ĝi ĉeestas aŭ simple ignori ĝin.
ja: このパラメータをサポートしないサーバの側では、これの存在時にはエラーを返すことを選択しても構いませんし、単にその存在を無視しても構いません。
ru: Серверы, не поддерживающие этот параметр, могут возвращать ошибку при его наличии или просто игнорировать его присутствие.
ta: இந்த அளவுருவை ஆதரிக்காத சேவையகங்கள் பிழையைக் கொண்டிருக்கும்போது அதைத் திருப்பித் தரத் தேர்வுசெய்யலாம் அல்லது அவை எளிமையாக அதன் இருப்பை புறக்கணிக்கக்கூடும்.

source: When a server does implement this parameter, it **SHOULD** take precedence over any values in the client's ``Accept`` header, and if the server does not support the requested format, it may choose to fall back to the ``Accept`` header, or choose any of the error conditions that standard server-driven content negotiation typically has (e.g. ``406 Not Available``, ``303 Multiple Choices``, or selecting a default type to return).
ja: サーバがこのパラメータを実装していない時は、クライアントの ``Accept`` ヘッダ内の値に何があってもそれに **高い優先度を与えるべき** で、要求されたフォーマットをサーバがサポートしていないなら ``Accept`` ヘッダにフォールバックすることを選択しても良いし、標準的なサーバ側が駆動するコンテントネゴシエーションが典型的に持っているエラーコンディション (例えば、 ``406 Not Available`` や ``303 Multiple Choices`` 、ないし、応答のデフォルトの型) のどれでもひとつを選択しても構いません。
ru: Когда сервер реализует этот параметр, он **ДОЛЖЕН** иметь приоритет над любыми значениями в заголовке ``Принять`` клиента, и если сервер не поддерживает запрашиваемый формат, он может вернуться к заголовку ``Принять`` или выбрать любое из условий ошибки, которые обычно имеет стандартное согласование содержимого, управляемое сервером (например, ``406 Недоступен``, ``303 Несколько вариантов`` или выбор типа по умолчанию для возврата).
ta: ஒரு சேவையகம் இந்த அளவுருவை செயல்படுத்தும்போது, அது ** கிளையண்டின் `` ஏற்றுக்கொள்` தலைப்பில் உள்ள எந்தவொரு மதிப்புகளையும் விட ** முன்னுரிமை பெற வேண்டும், மேலும் சேவையகம் கோரப்பட்ட வடிவமைப்பை ஆதரிக்கவில்லை என்றால், அது `` ஏற்றுக்கொள்` தலைப்பு `` `ஏற்றுக்கொள்ளும் எந்தவொரு பிழையும் தேர்வு செய்யத் தேர்வுசெய்யலாம், அல்லது நிலையான சேவையக பேச்சுவார்த்தை பொதுவாகக் கிடைக்காது,` 406, திரும்புவதற்கான இயல்புநிலை வகை).

source: Endpoint Configuration
eo: Agordado de Finpunkto
ja: エンドポイントの設定
ru: Конфигурация конечной точки
ta: இறுதிப்புள்ளி உள்ளமைவு

source: This option technically is not a special option at all, it is just a natural consequence of using content negotiation and allowing servers to select which of the available content types is their default.
eo: Tiu opcio teĥnike ne estas speciala opcio, sed nur natura konsekvenco de la uzadon de enhavo-marĉandado, permesante al servilo elekti sian aprioraĵon el la haveblaj enhavtipoj.
ja: このオプションは、技術的には何ら特別なオプションではなく、コンテントネゴシエーションを使用することに伴う自然な結果であり、利用可能なコンテント型のいずれかを自身のデフォルトとしてサーバが選択することを許すものです。
ru: Эта опция технически не является специальной опцией вообще, это просто естественное следствие использования согласования содержимого и разрешения серверам выбирать, какой из доступных типов содержимого является их типом по умолчанию.
ta: இந்த விருப்பம் தொழில்நுட்ப ரீதியாக ஒரு சிறப்பு விருப்பமல்ல, இது உள்ளடக்க பேச்சுவார்த்தைகளைப் பயன்படுத்துவதன் இயல்பான விளைவு மற்றும் கிடைக்கக்கூடிய உள்ளடக்க வகைகளில் எது அவற்றின் இயல்புநிலை என்பதைத் தேர்ந்தெடுக்க சேவையகங்களை அனுமதிக்கிறது.

source: If a server is unwilling or unable to implement the server-driven content negotiation, and would instead rather require users to explicitly configure their client to select the version they want, then that is a supported configuration.
eo: Se servilo ne volas aŭ ne povas subteni la servila enhavomarĉandado kaj volas postuli, ke uzanto eksplicu la deziratan version, tio estas permesata.
ja: あるサーバがサーバ主導のコンテントネゴシエーションを実装したくないか実装することができなくて、むしろユーザに対してクライアントが望むバージョンを選択するように明示的に要求するのであれば、それはサポートされているコンフィグレーションのひとつです。
ru: Если сервер не хочет или не может реализовать согласование содержимого, управляемое сервером, и предпочитает, чтобы пользователи явно настраивали свой клиент для выбора нужной им версии, то такая конфигурация поддерживается.
ta: ஒரு சேவையகம் விருப்பமில்லாமல் அல்லது சேவையகத்தால் இயக்கப்படும் உள்ளடக்க பேச்சுவார்த்தையை செயல்படுத்த முடியாவிட்டால், அதற்கு பதிலாக பயனர்கள் தங்கள் வாடிக்கையாளரை அவர்கள் விரும்பும் பதிப்பைத் தேர்ந்தெடுக்க வெளிப்படையாக கட்டமைக்க வேண்டும் என்றால், அது ஒரு உதவி உள்ளமைவு.

source: To enable this, a server should make multiple endpoints (for instance, ``/simple/v1+html/`` and/or ``/simple/v1+json/``) for each version+format that they wish to support. Under that endpoint, they can host a copy of their repository that only supports one (or a subset) of the content-types. When a client makes a request using the ``Accept`` header, the server can ignore it and return the content type that corresponds to that endpoint.
eo: Por tio, servilo disponigu plurajn finpunktoj (ekzemple, ``/simple/v1+html/`` kaj/aŭ ``/simple/v1+json/``) po unu por ĉiu paro de versio kaj dosierformo subtenata. Ĉe finpunkto, servilo povas gastigi kopion de la deponejo nur subtenanta unu (aŭ subaron) el la enhavtipoj. Kiam kliento petas uzante la ĉapon ``Accept``, la servilo povas ignori tion kaj liveri la enhavtipon por la finpunkto.
ja: これを有効にするためには、サーバは、複数のエンドポイント (例えば、 ``/simple/v1+html/`` と ``/simple/v1+json/`` のいずれかまたは両方) をサポートしたいと考える version+format のそれぞれにするべきです。このようなエンドポイントのもとでは、コンテント型のひとつ (またはサブセット) をサポートするリポジトリのコピーをホストすることができます。クライアントが ``Accept`` ヘッダを使ってリクエストした時に、サーバはそれを無視して当該エンドポイントに対応するコンテント型を返すことができます。
ru: Для этого сервер должен создать несколько конечных точек (например, ``/простой/v1+html/`` и/или ``/простой/v1+json/``) для каждой версии+формата, которые он хочет поддерживать. Под этой конечной точкой они могут разместить копию своего хранилища, которая поддерживает только один (или подмножество) из типов содержимого. Когда клиент делает запрос с использованием заголовка ``Принять``, сервер может проигнорировать его и вернуть тип содержимого, соответствующий данной конечной точке.
ta: இதை இயக்க, ஒரு சேவையகம் பல இறுதிப் புள்ளிகளை உருவாக்க வேண்டும் (உதாரணமாக, ``/எளிய/v1+html/`` மற்றும்/அல்லது `/simple/v1+json/` `) அவர்கள் ஆதரிக்க விரும்பும் ஒவ்வொரு பதிப்பிற்கும். அந்த இறுதிப்புள்ளியின் கீழ், உள்ளடக்க வகைகளின் ஒன்றை (அல்லது துணைக்குழு) மட்டுமே ஆதரிக்கும் தங்கள் களஞ்சியத்தின் நகலை அவர்கள் வழங்க முடியும். `` ஏற்றுக்கொள்` தலைப்பைப் பயன்படுத்தி ஒரு கிளையன்ட் கோரிக்கையைச் செய்யும்போது, சேவையகம் அதைப் புறக்கணித்து, அந்த இறுதிப் புள்ளியுடன் ஒத்த உள்ளடக்க வகையை திருப்பித் தரலாம்.

source: For clients that wish to require specific configuration, they can keep track of which version+format a specific repository URL was configured for, and when making a request to that server, emit an ``Accept`` header that *only* includes the correct content type.
eo: Kliento, kiu volas postuli specifitan agordon, povas memori la version kaj dosierformon de specifita deponeja retadreso, kaj (dum sendado de peto al tiu servilo) sendi ĉapon ``Accept`` *nur* inkluzivantan la ĝustan enhavtipon.
ja: 特定のコンフィグレーションを要求したいと願うクライアントにとっては、ある特定のリポジトリ URL にどんな version+format が設定されたかを追跡することができますし、そのサーバへのリクエストを作成する時に正しいコンテント型 **だけ** を含んだ ``Accept`` ヘッダを発出することができます。
ru: Для клиентов, которые хотят требовать определенной конфигурации, они могут отслеживать, для какой версии+формата был сконфигурирован конкретный URL репозитория, и при запросе к этому серверу выдавать заголовок ``Принять``, который *только* включает правильный тип содержимого.
ta: குறிப்பிட்ட உள்ளமைவு தேவைப்படும் வாடிக்கையாளர்களுக்கு, ஒரு குறிப்பிட்ட களஞ்சிய முகவரி எந்த பதிப்பு+வடிவமைக்கப்பட்டது என்பதை அவர்கள் கண்காணிக்க முடியும், மேலும் அந்த சேவையகத்திற்கு ஒரு கோரிக்கையைச் செய்யும்போது, * சரியான உள்ளடக்க வகையை உள்ளடக்கிய ஒரு `` `ஏற்றுக்கொள்`` தலைப்பை வெளியிடுங்கள்.

source: TUF Support - PEP 458
eo: Subteno de TUF – PEP 458
ja: TUF サポート - PEP 458
ta: TUF உதவி - PEP 458

source: :pep:`458` requires that all API responses are hashable and that they can be uniquely identified by a path relative to the repository root. For a Simple API repository, the target path is the Root of our API (e.g. ``/simple/`` on PyPI). This creates challenges when accessing the API using a TUF client instead of directly using a standard HTTP client, as the TUF client cannot handle the fact that a target could have multiple different representations that all hash differently.
eo: :pep:`458` postulas, ke ĉiu API-respondo estu haketebla kaj unike identigebla per dosierloko relativa al la deponeja radiko. Por deponejo de simpla API, la cela dosierloko estas la Radiko de nia API (ekz. ``/simple/`` ĉe PyPI). Tio estas problema dum uzado de la API per TUF-kliento anstataŭ ordinara HTTP-kliento, ĉar la TUF-kliento ne povas pritrakti la fakton, ke celo povas havi plurajn malsamajn prezentaojn de malsamaj haketaĵoj.
ja: :pep:`458` は、すべての API 応答がハッシュ可能で、リポジトリのルートからの相対パスによって一意に識別できることを要求しています。シンプル API リポジトリでは、ターゲットのパスは、我々の API のルート (例えば、 PyPI における ``/simple/``) です。標準の HTTP クライアントを使う代わりに TUF クライアントを使って API にアクセスする時にはこれが試練を生み出しますが、それというのは、ハッシュが相異なるような複数の異なる表現形式をターゲットが持っているかもしれないという事実を TUF クライアントが扱えないからです。
ta: . ஒரு எளிய பநிஇ களஞ்சியத்திற்கு, இலக்கு பாதை எங்கள் பநிஇ இன் வேர் (எ.கா. ``/எளிய/`` பைபியில்). ஒரு நிலையான HTTP கிளையண்டைப் பயன்படுத்துவதற்குப் பதிலாக ஒரு TUF கிளையண்டைப் பயன்படுத்தி பநிஇ ஐ அணுகும்போது இது சவால்களை உருவாக்குகிறது, ஏனெனில் ஒரு இலக்கு அனைத்து வித்தியாசமான பிரதிநிதித்துவங்களைக் கொண்டிருக்கக்கூடும் என்ற உண்மையை TUF கிளையன்ட் கையாள முடியாது.

source: :pep:`458` does not specify what the target path should be for the Simple API, but TUF requires that the target paths be "file-like", in other words, a path like ``simple/PROJECT/`` is not acceptable, because it technically points to a directory.
eo: :pep:`458` ne specifas la celan dosierlokon por la Simpla API, sed TUF postulas, ke cela dosierloko estu «dosiereca»: alivorte, dosierloko kiel ``simple/PROJEKTO/`` ne validas, ĉar ĝi estas dosierujo.
ja: :pep:`458` は、どんなターゲットパスがシンプル API 向けであるべきかについて指定していませんが、 TUF はターベットパスが "ファイルライク <file-like>" であることを要求し、換言すれば、 ``simple/PROJECT/.`` のようなパスは技術的にはディレクトリを指し示しているので受け入れ不可能です。
ta: :pep:`458` does not specify what the target பாதை should be க்கு the Simple பநிஇ, but TUF requires that the target paths be "file-like", in மற்றொன்று words, a பாதை like ``simple/PROJECT/`` is not acceptable, because it technically பிரிவகம் பெறுநர் a directory.
