Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: This document specifies a common format of recording information about Python :term:`projects <Project>` installed in an environment. A common metadata format allows tools to query, manage or uninstall projects, regardless of how they were installed.
eo: Ĉi tiu dokumento specifas komunan dosierformon pri informoj pri Python-:term:`projektoj <Project>` instalitaj en medio. Komuna metadatena dosierformo permesas serĉi, administri aŭ malinstali projektojn ĉiel instalitajn.
ja: この説明文書では、ある環境にインストールされた Python :term:`プロジェクト <Project>` に関する情報を記録するための共通フォーマットについて指定します。共通メタデータフォーマットがあれば、プロジェクトがどのようにインストールされたかに関わりなく、ツールがプロジェクトについて問い合わせを行い、管理し、あるいはアンインストールすることが可能になります。
pt_br: Este documento especifica um formato comum de gravação de informações sobre :term:`projetos <Projeto>` Python instalados em um ambiente. Um formato de metadados comum permite que as ferramentas consultem, gerenciem ou desinstalem projetos, independentemente de como foram instalados.
ru: Этот документ определяет общий формат записи информации о Python :term:`проектах <Project>`, установленных в среде. Общий формат метаданных позволяет инструментам запрашивать, управлять или удалять проекты, независимо от того, как они были установлены.
ta: இந்த ஆவணம் பைதான் பற்றிய தகவல்களைப் பதிவுசெய்வதற்கான பொதுவான வடிவமைப்பைக் குறிப்பிடுகிறது: கால: `திட்டங்கள் <திட்டம்>` சூழலில் நிறுவப்பட்டுள்ளது. ஒரு பொதுவான மேனிலை தரவு வடிவம் திட்டங்களை எவ்வாறு நிறுவினாலும் அவற்றை வினவ, நிர்வகிக்க அல்லது நிறுவல் நீக்க கருவிகளை அனுமதிக்கிறது.

source: Almost all information is optional. This allows tools outside the Python ecosystem, such as Linux package managers, to integrate with Python tooling as much as possible. For example, even if an installer cannot easily provide a list of installed files in a format specific to Python tooling, it should still record the name and version of the installed project.
ja: ほとんど全ての情報が必須ではないものです。これによって、Linux のパッケージ管理機構のような Python のエコシステムの外にあるツールを Python のツールの使い方と最大限に統合することができます。例えば、ある Python ツールに特化したフォーマットで書かれたインストール済みファイルのリストをインストーラがすぐには提供できない場合でさえも、インストール済みのプロジェクトの名前とバージョンを記録するべきです。
pt_br: Quase todas as informações são opcionais. Isso permite que ferramentas fora do ecossistema Python, como gerenciadores de pacotes Linux, se integrem com as ferramentas Python tanto quanto possível. Por exemplo, mesmo se um instalador não puder fornecer facilmente uma lista de arquivos instalados em um formato específico para as ferramentas Python, ele ainda deve registrar o nome e a versão do projeto instalado.
ru: Почти вся информация является необязательной. Это позволяет инструментам вне экосистемы Python, таким как менеджеры пакетов Linux, интегрироваться с инструментарием Python настолько, насколько это возможно. Например, даже если программа установки не может легко предоставить список установленных файлов в формате, характерном для инструментария Python, она все равно должна записывать имя и версию установленного проекта.
ta: கிட்டத்தட்ட எல்லா தகவல்களும் விருப்பமானவை. இது பைதான் சுற்றுச்சூழல் அமைப்புக்கு வெளியே உள்ள கருவிகளை லினக்ச் தொகுப்பு மேலாளர்கள் போன்ற கருவிகளை பைதான் கருவியுடன் முடிந்தவரை ஒருங்கிணைக்க அனுமதிக்கிறது. எடுத்துக்காட்டாக, பைதான் கருவிக்கு குறிப்பிட்ட வடிவத்தில் நிறுவப்பட்ட கோப்புகளின் பட்டியலை ஒரு நிறுவி எளிதாக வழங்க முடியாவிட்டாலும், அது நிறுவப்பட்ட திட்டத்தின் பெயர் மற்றும் பதிப்பை இன்னும் பதிவு செய்ய வேண்டும்.

source: Each project installed from a distribution must, in addition to files, install a "``.dist-info``" directory located alongside importable modules and packages (commonly, the ``site-packages`` directory).
eo: Ĉiu projekto instalita el distribuo devas, krom dosieroj, instali dosierujon ``.dist-info`` apud la importeblaj moduloj kaj pakoj (ofte en la dosierujo ``site-packages``).
ja: 配布物からインストールされた各プロジェクトは、一連のファイルの他に、インポート可能なモジュールやパッケージの隣に位置する "``.dist-info``" ディレクトリもインストールします (通常は ``site-packages`` ディレクトリ) 。
pt_br: Cada projeto instalado de uma distribuição deve, além dos arquivos, instalar um diretório "``.dist-info``" localizado junto com os módulos e pacotes importáveis (comumente, o diretório ``site-packages``).
ru: Каждый проект, устанавливаемый из дистрибутива, помимо файлов, должен устанавливать каталог "``.dist-info``", расположенный рядом с импортируемыми модулями и пакетами (обычно это каталог ``ite-packages``).
ta: ஒரு விநியோகத்திலிருந்து நிறுவப்பட்ட ஒவ்வொரு திட்டமும், கோப்புகளுக்கு மேலதிகமாக, இறக்குமதி செய்யக்கூடிய தொகுதிகள் மற்றும் தொகுப்புகளுடன் (பொதுவாக, `` தள-பேக்கேச்கள்` கோப்பகம்) அமைந்துள்ள ஒரு ".dist-info``" கோப்பகத்தை நிறுவ வேண்டும்.

source: This directory is named as ``{name}-{version}.dist-info``, with ``name`` and ``version`` fields corresponding to :ref:`core-metadata`. Both fields must be normalized (see the :ref:`name normalization specification <name-normalization>` and the :ref:`version normalization specification <version-specifiers-normalization>`), and replace dash (``-``) characters with underscore (``_``) characters, so the ``.dist-info`` directory always has exactly one dash (``-``) character in its stem, separating the ``name`` and ``version`` fields.
eo: Tiu dosierujo nomiĝas ``{name}-{version}.dist-info``, kun la kampoj ``name`` kaj ``version`` same kiel :ref:`core-metadata`. Ambaŭ kampoj devas esti normigitaj (vidu :ref:`la normon pri normigo de nomoj <name-normalization>` kaj :ref:`la normon pri normigo de versioj <version-specifiers-normalization>`), kun streketoj (``-``) anstataŭigitaj per substreketoj (``_``) , tiel ke la dosierujo ``.dist-info`` havas ekzakte unu streketon (``-``) en ĝia nomo (krom la dosiersufikso), kiu apartigas la kampojn ``name`` kaj ``version``.
ja: このディレクトリは ``{name}-{version}.dist-info`` という名前で、 ``name`` と ``version`` のフィールドが :ref:`コアとなるメタデータ <core-metadata>` に対応しています。両方のフィールドは正規化 (各フィールドにおける正規化の定義については、それぞれ :ref:`名称正規化の仕様 <name-normalization>` と :ref:`バージョン正規化の仕様 <version-specifiers-normalization>` を見てください) されていなければならず、かつ、ダッシュ (``-``) の文字をアンダースコア (``_``) で置き換えることで ``.dist-info`` ディレクトリが常に正確にひとつだけのダッシュ (``-``) 文字をそのファイル名基幹部に持ち、それによって ``name`` と ``version`` フィールドを分割していなければなりません。
ru: Этот каталог называется ``{имя}-{версия}.dist-info``, а поля ``имя`` и ``версия`` соответствуют :ref:`core-metadata``. Оба поля должны быть нормализованы (см. спецификации :ref:`name normalization specification <name-normalization>` и :ref:`version normalization specification <version-specifiers-normalization>`) и заменять символы тире (``-``) на символы подчеркивания (``_``), поэтому каталог ``.dist-info`` всегда имеет ровно один символ тире (``-``) в своей строке, разделяющий поля ``name`` и ``version``.
ta: இந்த அடைவு `{name}-{version} .dist-info``,` `பெயர்`` மற்றும்` `பதிப்பு`` உடன் தொடர்புடைய புலங்களுடன் பெயரிடப்பட்டுள்ளது: ref:` கோர்-மெட்டாடேட்டா`. இரண்டு புலங்களும் இயல்பாக்கப்பட வேண்டும் (பார்க்க: ref: `பெயர் இயல்பாக்குதல் விவரக்குறிப்பு <பெயர்-இயல்பாக்கம்>` மற்றும்: ref: `பதிப்பு இயல்பாக்கம் விவரக்குறிப்பு <பதிப்பு-விவரித்தல்-இயல்பாக்கம்>`), மற்றும் டாசை மாற்றவும் (`` -``) அண்டர்ச்கோர் (`` _``) எழுத்துக்களைக் கொண்ட எழுத்துக்கள், எனவே `` .டிச்ட்-இன்ஃபோ`` கோப்பகத்தில் எப்போதும் ஒரு கோடு (`` -``) அதன் தண்டுகளில் உள்ள தன்மை, `` பெயர்`` மற்றும் `` பதிப்பு`` புலங்களை பிரிக்கிறது.

source: Historically, tools have failed to replace dot characters or normalize case in the ``name`` field, or not perform normalization in the ``version`` field. Tools consuming ``.dist-info`` directories should expect those fields to be unnormalized, and treat them as equivalent to their normalized counterparts. New tools that write ``.dist-info`` directories MUST normalize both ``name`` and ``version`` fields using the rules described above, and existing tools are encouraged to start normalizing those fields.
ja: 歴史的には、ツール類はドット文字の置換や ``name`` フィールドにおける大文字小文字の正規化に失敗すしたり、 ``version`` フィールドの正規化をしなかったり、ということを繰り返してきました。 ``.dist-info`` ディレクトリを利用する側のツールは、そのようなフィールドが正規化されていることを期待するべきではなく、それらを対応する正規化済みのものと同じものだと考えて取り扱うべきです。 ``.dist-info`` ディレクトリに書き込むツールをこれから作るなら、そのツールは ``name`` と ``version`` の両方のフィールドを上記の規則に従って正規化しなければならず、既存のツールもこれらのフィールドの正規化を始めることが推奨されています。
pt_br: Historicamente, as ferramentas falharam em substituir caracteres de ponto ou normalizar maiúsculas e minúsculas no campo ``name``, ou não realizar a normalização no campo ``version``. Ferramentas que consomem diretórios ``.dist-info`` devem esperar que esses campos sejam desnormalizados e tratá-los como equivalentes a suas contrapartes normalizadas. Novas ferramentas que escrevem diretórios ``.dist-info`` DEVEM normalizar ambos os campos ``name`` e ``version`` usando as regras descritas acima, e as ferramentas existentes são encorajadas a começar a normalizar esses campos.
ru: Исторически сложилось так, что инструменты не заменяют символы точки или не нормализуют регистр в поле ``имя``, или не выполняют нормализацию в поле ``версия``. Утилиты, использующие каталоги ``.dist-info``, должны ожидать, что эти поля будут ненормализованными, и рассматривать их как эквивалентные нормализованным аналогам. Новые инструменты, записывающие каталоги ``.dist-info``, ДОЛЖНЫ нормализовать поля ``name`` и ``version``, используя правила, описанные выше, а существующим инструментам рекомендуется начать нормализацию этих полей.
ta: வரலாற்று ரீதியாக, கருவிகள் டாட் எழுத்துக்களை மாற்றவோ அல்லது வழக்கை `` பெயர்`` துறையில் இயல்பாக்கவோ தவறிவிட்டன, அல்லது `` பதிப்பு`` புலத்தில் இயல்பாக்கத்தை செய்யக்கூடாது. `` .Dist-info`` கோப்பகங்களை உட்கொள்ளும் கருவிகள் அந்தத் துறைகள் அசாதாரணப்படுத்தப்படும் என்று எதிர்பார்க்க வேண்டும், மேலும் அவற்றை அவற்றின் இயல்பாக்கப்பட்ட சகாக்களுக்கு சமமாக கருதுகின்றன. `` .Dist-info`` கோப்பகங்களை எழுதும் புதிய கருவிகள் மேலே விவரிக்கப்பட்ட விதிகளைப் பயன்படுத்தி `` பெயர்``` மற்றும் `` பதிப்பு`` இரண்டையும் இயல்பாக்க வேண்டும், மேலும் ஏற்கனவே இருக்கும் கருவிகள் அந்த துறைகளை இயல்பாக்கத் தொடங்க ஊக்குவிக்கப்படுகின்றன.

source: The ``.dist-info`` directory's name is formatted to unambiguously represent a distribution as a filesystem path. Tools presenting a distribution name to a user should avoid using the normalized name, and instead present the specified name (when needed prior to resolution to an installed package), or read the respective fields in Core Metadata, since values listed there are unescaped and accurately reflect the distribution. Libraries should provide API for such tools to consume, so tools can have access to the unnormalized name when displaying distribution information.
eo: La nomo de dosierujo ``.dist-info`` estas aranĝita por malambigue prezenti distribuon kiel dosiersisteman lokon. Ilo prezentanta nomon de distribuo al uzanto evitu uzi la normigitan nomon kaj anstataŭe prezentu la specifitan nomon (laŭbezone antaŭ solvado al instalita pako), aŭ legu la respektivajn kampojn en Kernaj Metadatenoj, ĉar tieaj valoroj ne havas kodŝanĝojn kaj precize reflektas la distribuon. Bibliotekoj provizu API pri la nenormigita nomo por prezentado de informoj pri distribuo far tia ilo.
ja: ``.dist-info`` ディレクトリの名前は、曖昧さのない形で配布物をファイルシステム上のパスとして表現するためにフォーマットされています。配布物の名前をユーザに提示するツールは、正規化された名前を使うのを避け、 (インストール済みパッケージへの名前解決より前に必要な場合には) 代わりに指定された名前を提示するか、または、コアとなるメタデータの適切なフィールドの値はエスケープ処理もされておらず配布物を正確に反映しているのでそこから読み取った名前を提示するべきです。ライブラリは、配布物の情報を表示する時にツールが正規化されていない名前にアクセスできるように、そのようなツール群が利用できるような API を提供するべきです。
ru: Имя каталога ``.dist-info`` форматируется для однозначного представления дистрибутива в виде пути к файловой системе. Утилиты, представляющие пользователю имя дистрибутива, должны избегать использования нормализованного имени, а вместо этого представлять указанное имя (если это необходимо до разрешения установленного пакета) или читать соответствующие поля в Core Metadata, поскольку значения, перечисленные там, не имеют кодировки и точно отражают дистрибутив. Библиотеки должны предоставлять API для таких инструментов, чтобы инструменты могли иметь доступ к ненормализованному имени при отображении информации о дистрибутиве.
ta: `` .Dist-info`` கோப்பகத்தின் பெயர் வடிவமைக்கப்பட்டுள்ளது, இது ஒரு விநியோகத்தை ஒரு கோப்பு முறைமை பாதையாக பிரதிநிதித்துவப்படுத்துகிறது. ஒரு பயனருக்கு விநியோக பெயரை வழங்கும் கருவிகள் இயல்பாக்கப்பட்ட பெயரைப் பயன்படுத்துவதைத் தவிர்க்க வேண்டும், அதற்கு பதிலாக குறிப்பிட்ட பெயரை வழங்க வேண்டும் (நிறுவப்பட்ட தொகுப்புக்கு தீர்வு காண்பதற்கு முன்பு தேவைப்படும்போது), அல்லது அந்தந்த புலங்களை கோர் மெட்டாடேட்டாவில் படிக்கவும், ஏனெனில் அங்கு பட்டியலிடப்பட்ட மதிப்புகள் வெளியிடப்படாதவை மற்றும் துல்லியமாக உள்ளன விநியோகத்தை பிரதிபலிக்கிறது. அத்தகைய கருவிகளை உட்கொள்வதற்கு நூலகங்கள் பநிஇ ஐ வழங்க வேண்டும், எனவே விநியோக தகவல்களைக் காண்பிக்கும் போது கருவிகள் சிறப்பான பெயரை அணுகலாம்.

source: This ``.dist-info`` directory may contain the following files, described in detail below:
eo: Tiu dosierujo ``.dist-info`` povas enhavi la jenajn dosierojn, priskribotajn ĉi-sube:
ja: この ``.dist-info`` ディレクトリには、以下に詳細を述べるこれらのファイルを置くことができます:
ru: Этот каталог ``.dist-info`` может содержать следующие файлы, подробно описанные ниже:
ta: இந்த `.dist-info`` கோப்பகத்தில் பின்வரும் கோப்புகள் இருக்கலாம், இது கீழே விரிவாக விவரிக்கப்பட்டுள்ளது:

source: ``METADATA``: contains project metadata
eo: ``METADATA``: enhavas projektajn metadatenojn
ja: ``METADATA``: プロジェクトのメタデータを含みます
pt_br: ``METADATA``: contém metadados do projeto
ru: ``METADATA``: содержит метаданные проекта
ta: `` மெட்டாடேட்டா``: திட்ட மெட்டாடேட்டாவைக் கொண்டுள்ளது

source: ``RECORD``: records the list of installed files.
eo: ``RECORD``: registras la liston de instalitaj dosieroj.
ja: ``RECORD``: インストールされるファイルを列挙して記録します。
pt_br: ``RECORD``: registra a lista de arquivos instalados.
ru: ``RECORD``: записывает список установленных файлов.
ta: `` பதிவு``: நிறுவப்பட்ட கோப்புகளின் பட்டியலை பதிவு செய்யுங்கள்.

source: ``INSTALLER``: records the name of the tool used to install the project.
eo: ``INSTALLER``: registras la nomon de la ilo uzita por instali la projekton.
ja: ``INSTALLER``: プロジェクトをインストールするのに使われるツールの名前を記録します。
pt_br: ``INSTALLER``: registra o nome da ferramenta usada para instalar o projeto.
ru: ``INSTALLER``: записывает имя инструмента, используемого для установки проекта.
ta: `` நிறுவி``: திட்டத்தை நிறுவ பயன்படுத்தப்படும் கருவியின் பெயரை பதிவு செய்கிறது.

source: ``entry_points.txt``: see :ref:`entry-points` for details
eo: ``entry_points.txt``: vidu :ref:`entry-points` por detaloj
ja: ``entry_points.txt``: 詳細については :ref:`entry-points` を見てください
pt_br: ``entry_points.txt``: veja :ref:`entry-points` para mais detalhes
ru: ``entry_points.txt``: подробности см. в :ref:`entry-points``
ta: `` entry_points.txt``: காண்க: குறிப்பு: விவரங்களுக்கு `நுழைவு புள்ளிகள்`

source: ``direct_url.json``: see :ref:`direct-url` for details
eo: ``direct_url.json``: vidu :ref:`direct-url` por detaloj
ja: ``direct_url.json``: 詳細については :ref:`direct-url` を見てください
pt_br: ``direct_url.json``: veja :ref:`direct-url` para mais detalhes
ru: ``direct_url.json``: подробности см. в :ref:`direct-url``
ta: `` stread_url.json``: காண்க: குறிப்பு: விவரங்களுக்கு `நேரடி-உர்எல்`

source: The ``METADATA`` file is mandatory. All other files may be omitted at the installing tool's discretion. Additional installer-specific files may be present.
eo: La dosiero ``METADATA`` estas deviga. Ĉiuj aliaj dosieroj estas preterlaseblaj laŭ la instalilo. Pliaj instalilo-specifaj dosieroj povas ĉeesti.
ja: ``METADATA`` ファイルは必須です。これ以外の全てのファイルは、インストールツールの最良で省略可能です。インストーラ独自のファイルが他に存在しても構いません。
pt_br: O arquivo ``METADATA`` é obrigatório. Todos os outros arquivos podem ser omitidos a critério da ferramenta de instalação. Arquivos adicionais específicos do instalador podem estar presentes.
ru: Файл ``METADATA`` является обязательным. Все остальные файлы могут быть опущены по усмотрению программы установки. Могут присутствовать дополнительные файлы, специфичные для программы установки.
ta: `` மெட்டாடேட்டா`` கோப்பு கட்டாயமாகும். நிறுவும் கருவியின் விருப்பப்படி மற்ற எல்லா கோப்புகளும் தவிர்க்கப்படலாம். கூடுதல் நிறுவி-குறிப்பிட்ட கோப்புகள் இருக்கலாம்.

source: :file:`licenses/`: contains license files.
eo: :file:`licenses/`: enhavas licenco-dosierojn.
ru: :file:`licenses/`: содержит файлы лицензий.
ta: : கோப்பு: `உரிமங்கள்/`: உரிமக் கோப்புகளைக் கொண்டுள்ளது.

source: The :ref:`binary-distribution-format` specification describes additional files that may appear in the ``.dist-info`` directory of a :term:`Wheel`. Such files may be copied to the ``.dist-info`` directory of an installed project.
eo: La specifo :ref:`binary-distribution-format` priskribas tiujn kromajn dosierojn, kiuj povas aperi en la dosierujo ``.dist-info`` de :term:`Wheel`. Tiaj dosieroj povas esti kopiitaj al la dosierujo ``.dist-info`` de instalita projekto.
ja: :ref:`binary-distribution-format` 仕様では、 :term:`Wheel` の ``.dist-info`` ディレクトリに出現するかもしれない追加のファイルについて記述しています。そのようなファイルをインストールされたプロジェクトの ``.dist-info`` ディレクトリにコピーしても構いません。
pt_br: A especificação :ref:`binary-distribution-format` descreve arquivos adicionais que podem aparecer no diretório ``.dist-info`` de um :term:`Wheel`. Esses arquivos podem ser copiados para o diretório ``.dist-info`` de um projeto instalado.
ru: Спецификация :ref:`binary-distribution-format` описывает дополнительные файлы, которые могут появиться в директории ``.dist-info`` для :term:`Wheel`. Такие файлы могут быть скопированы в каталог ``.dist-info`` установленного проекта.
ta: தி: ref: `பைனரி-விநியோக-வடிவ விவரக்குறிப்பு` விவரக்குறிப்பு `` .dist-info`` கோப்பகத்தில் தோன்றக்கூடிய கூடுதல் கோப்புகளை விவரிக்கிறது: கால: `சக்கரம்`. இத்தகைய கோப்புகள் நிறுவப்பட்ட திட்டத்தின் `` .dist-info`` கோப்பகத்திற்கு நகலெடுக்கப்படலாம்.

source: The previous versions of this specification also specified a ``REQUESTED`` file. This file is now considered a tool-specific extension, but may be standardized again in the future. See `PEP 376 <https://www.python.org/dev/peps/pep-0376/#requested>`_ for its original meaning.
eo: La antaŭaj versioj de ĉi tiu normo ankaŭ specifis la dosieron ``REQUESTED``. Tiu dosiero estas nun rigardata kiel ilo-specifa etendaĵo, sed povas esti normigita denove estontece. Vidu `PEP 376 <https://www.python.org/dev/peps/pep-0376/#requested>`_ por ĝia originala signifo.
ja: この仕様の以前のバージョンでは、 ``REQUESTED`` ファイルも指定していました。このファイルは、現在ではツール特有の拡張であると見做されていますが、いつか再び標準化されるかもしれません。その元々の意味するところについては、 `PEP 376 <https://www.python.org/dev/peps/pep-0376/#requested>`_ を見てください。
pt_br: As versões anteriores desta especificação também especificavam um arquivo ``REQUESTED``. Este arquivo agora é considerado uma extensão específica da ferramenta, mas pode ser padronizado novamente no futuro. Consulte `PEP 376 <https://www.python.org/dev/peps/pep-0376/#requested>`_ para seu significado original.
ru: В предыдущих версиях этой спецификации также указывался файл ``REQUESTED`` Сейчас этот файл считается расширением, специфичным для конкретного инструмента, но в будущем он может быть стандартизирован. Его первоначальное значение см. в `PEP 376 <https://www.python.org/dev/peps/pep-0376/#requested>`_.
ta: இந்த விவரக்குறிப்பின் முந்தைய பதிப்புகள் ஒரு `` கோரப்பட்ட`` கோப்பையும் குறிப்பிடுகின்றன. இந்த கோப்பு இப்போது கருவி சார்ந்த நீட்டிப்பாக கருதப்படுகிறது, ஆனால் எதிர்காலத்தில் மீண்டும் தரப்படுத்தப்படலாம். `PEP 376 <https://www.python.org/dev/peps/pep-0376/#requested>` _ அதன் அசல் அர்த்தத்திற்கு பார்க்கவும்.

source: The METADATA file
eo: La dosiero METADATA
ja: METADATA ファイル
pt_br: O arquivo METADATA
ru: Файл METADATA
ta: மேனிலை தரவு கோப்பு

source: The ``METADATA`` file contains metadata as described in the :ref:`core-metadata` specification, version 1.1 or greater.
eo: La dosiero ``METADATA`` enhavas metadatenojn laŭ la specifo :ref:`core-metadata`, versio 1.1 aŭ pli nova.
ja: ``METADATA`` ファイルには、 :ref:`コアとなるメタデータ <core-metadata>` 仕様のバージョン 1.1 またはそれ以降で記述されているようなメタデータを含みます。
pt_br: O arquivo ``METADATA`` contém metadados conforme descrito na especificação :ref:`core-metadata`, versão 1.1 ou superior.
ru: Файл ``METADATA`` содержит метаданные, описанные в спецификации :ref:`core-metadata``, версии 1.1 или выше.
ta: `` மெட்டாடேட்டா`` கோப்பில் விவரிக்கப்பட்டுள்ளபடி மேனிலை தரவு உள்ளது: ref: `கோர்-மெட்டாடேட்டா` விவரக்குறிப்பு, பதிப்பு 1.1 அல்லது அதற்கு மேற்பட்டது.

source: The ``METADATA`` file is mandatory. If it cannot be created, or if required core metadata is not available, installers must report an error and fail to install the project.
eo: La dosiero ``METADATA`` estas deviga. Se ĝi ne estas kreebla aŭ se postulataj kernaj metadatenoj mankas, instalilo devas sciigi pri eraro kaj malsukcesigi la instaladon de la projekto.
ja: ``METADATA`` ファイルは必須のものです。このファイルを作成することができない場合や、必須のコアとなるメタデータが入手できない場合には、インストーラはエラーを発生させてプロジェクトのインストールを失敗させなければなりません。
pt_br: O arquivo ``METADATA`` é obrigatório. Se não puder ser criado ou se os metadados principais necessários não estiverem disponíveis, os instaladores devem relatar um erro e falhar ao instalar o projeto.
ru: Файл ``METADATA`` является обязательным. Если он не может быть создан или если необходимые метаданные ядра отсутствуют, программа установки должна сообщить об ошибке и не установить проект.
ta: `` மெட்டாடேட்டா`` கோப்பு கட்டாயமாகும். அதை உருவாக்க முடியாவிட்டால், அல்லது தேவைப்படும் கோர் மேனிலை தரவு கிடைக்கவில்லை என்றால், நிறுவிகள் பிழையைப் புகாரளித்து திட்டத்தை நிறுவத் தவறிவிட்டன.

source: The RECORD file
eo: La dosiero RECORD
ja: RECORD ファイル
pt_br: O arquivo RECORD
ru: Файл RECORD
ta: பதிவு கோப்பு

source: The ``RECORD`` file holds the list of installed files. It is a CSV file containing one record (line) per installed file.
eo: La dosiero ``RECORD`` tenas la liston de instalitaj dosieroj. Ĝi estas diskoma dosiero enhavanta po unu rikordo (linio) por ĉiu instalita dosiero.
ja: ``RECORD`` ファイルには、インストールされたファイル群を列挙します。CSV ファイルで、インストールされたファイルを１行に一つずつ書き込みます。
pt_br: O arquivo ``RECORD`` contém a lista de arquivos instalados. É um arquivo CSV contendo um registro (linha) por arquivo instalado.
ru: Файл ``RECORD`` содержит список установленных файлов. Это CSV-файл, содержащий по одной записи (строке) на каждый установленный файл.
ta: `` பதிவு`` கோப்பு நிறுவப்பட்ட கோப்புகளின் பட்டியலைக் கொண்டுள்ளது. இது நிறுவப்பட்ட கோப்புக்கு ஒரு பதிவு (வரி) கொண்ட காபிம கோப்பு.

source: The CSV dialect must be readable with the default ``reader`` of Python's ``csv`` module:
eo: La dialekto de diskoma dosiero devas esti legebla per la apriora ``reader`` de la modulo ``csv`` de Python:
ja: CSV の亜種としては、 Python の ``csv`` モジュールの ``reader`` で読めるものでなければなりません:
pt_br: O dialeto CSV deve ser legível com o ``reader`` padrão do módulo ``csv`` do Python:
ru: Диалект CSV должен быть доступен для чтения с помощью стандартного ``reader`` модуля Python ``csv``:
ta: சி.எச்.வி பேச்சுவழக்கு பைத்தானின் `` சி.எச்.வி`` தொகுதியின் இயல்புநிலை `` ரீடர்`` உடன் படிக்கக்கூடியதாக இருக்க வேண்டும்:

source: field delimiter: ``,`` (comma),
eo: Disigilo de kampoj: ``,`` (komo),
ja: フィールド区切り文字: ``,`` (コンマ)、
pt_br: delimitador de campo: ``,`` (vírgula),
ru: разделитель полей: ``,`` (запятая),
ta: புலம் டிலிமிட்டர்: ``, `` (கமா),

source: quoting char: ``"`` (straight double quote),
eo: Citilo: ``"`` (neŭtra duobla citilo),
ja: 引用符: ``"`` (ストレートダブルクォート)、
pt_br: caractere de aspas: ``"`` (aspas duplas),
ru: Кавычки: ``''`` (прямая двойная кавычка),
ta: கரியை மேற்கோள் காட்டுதல்: `` "` `(நேராக இரட்டை மேற்கோள்),

source: line terminator: either ``\r\n`` or ``\n``.
eo: linifino: aŭ ``\r\n`` aŭ ``\n``.
ja: 行末文字: ``\r\n`` か ``\n`` のいずれか一方。
pt_br: terminador de linha: ``\r\n`` ou ``\n``.
ru: терминатор строки: либо ``\r\n``, либо ``\n``.
ta: வரி டெர்மினேட்டர்: ஒன்று `` \ r \ n`` அல்லது `` \ n``.
