Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: A :term:`pyproject.toml` file is strongly recommended. The presence of a :file:`pyproject.toml` file itself does not bring much. [#]_ What is actually strongly recommended is the ``[build-system]`` table in :file:`pyproject.toml`.
eo: Dosiero :term:`pyproject.toml` estas rekomendegata. La ekzisto de dosiero :file:`pyproject.toml` mem ne tre gravas. [#]_ Tio, kio estas rekomendegata, estas la tabelo ``[build-system]`` en :file:`pyproject.toml`.
ja: :term:`pyproject.toml` ファイルは強く推奨されています。:file:`pyproject.toml` ファイルが存在すること自体は多くをもたらすものではありません。 [#]_ 実際に強く推奨されているものは、:file:`pyproject.toml` の中の ``[build-system]`` テーブルです。
pt_br: Um arquivo :term:`pyproject.toml` é fortemente recomendado. A presença de um arquivo :file:`pyproject.toml` em si não traz muita coisa. [#]_ O que é realmente recomendado é a tabela ``[build-system]`` no :file:`pyproject.toml`.
ru: Настоятельно рекомендуется наличие файла :term:`pyproject.toml`. Само по себе наличие файла :file:`pyproject.toml` мало что дает. [#]_ Что действительно настоятельно рекомендуется, так это таблица ``[build-system]`` в :file:`pyproject.toml`.
ta: ப: கால: `pyproject.toml` கோப்பு கடுமையாக பரிந்துரைக்கப்படுகிறது. A இன் இருப்பு: கோப்பு: `pyproject.toml` கோப்பே அதிகம் கொண்டு வராது. .

source: Note that it has influence on the build isolation feature of pip, see below.
eo: Notu, ke tio influas la konstruado-izolan funkcion de pip; vidu ĉi-sube.
ja: 以下のように、これが pip のビルド隔離機能に影響を与えるということを銘記してください。
pt_br: Observe que isso tem influência no recurso de isolamento de construção do pip, veja abaixo.
ru: Обратите внимание, что это влияет на функцию изоляции сборки в pip, см. ниже.
ta: BIP இன் உருவாக்க தனிமைப்படுத்தும் அம்சத்தில் இது செல்வாக்கைக் கொண்டுள்ளது என்பதை நினைவில் கொள்க, கீழே காண்க.

source: No, :file:`setup.py` can exist in a modern :ref:`setuptools` based project. The :term:`setup.py` file is a valid configuration file for setuptools that happens to be written in Python. However, the following commands are deprecated and **MUST NOT** be run anymore, and their recommended replacement commands should be used instead:
eo: Ne, :file:`setup.py` povas ekzisti en moderna :ref:`setuptools`-baza projekto. La dosiero :term:`setup.py` estas valida agorda dosiero por setuptools, verkita en Python. Tamen, la jenaj komandoj estas evitindaj; oni **DEVAS NE** ruli tiujn, kaj oni anstataŭe uzu la rekomendatajn anstataŭantajn komandojn:
ja: いいえ、 :file:`setup.py` は、近代的な :ref:`setuptools` ベースのプロジェクトにあっても構いません。 :term:`setup.py` ファイルは、たまたま Python で書かれている setuptools 向けの正当な設定ファイルなのです。しかしながら、以下のコマンド群は非推奨になっていてもはや実行することは **許されず** 、その代わりに以下のようなコマンドを使用するべきです:
pt_br: Não, :file:`setup.py` pode existir em um projeto moderno baseado em :ref:`setuptools`. O arquivo :term:`setup.py` é um arquivo de configuração válido para setuptools que foi escrito em Python. No entanto, os seguintes comandos for descontinuados e **NÃO DEVEM** ser mais executados, e seus comandos de substituição recomendados devem ser usados:
ru: Нет, :file:`setup.py` может существовать в современном проекте, основанном на :ref:`setuptools`. Файл :term:`setup.py` является допустимым конфигурационным файлом для setuptools, который, как оказалось, написан на Python. Однако следующие команды устарели и **НЕ ДОЛЖНЫ** больше выполняться, и вместо них следует использовать рекомендуемые команды-заменители:
ta: இல்லை,: கோப்பு: `setup.py` ஒரு நவீனத்தில் இருக்க முடியும்: குறிப்பு:` setuptools` அடிப்படையிலான திட்டம். தி: கால: `setup.py` கோப்பு என்பது பைத்தானில் எழுதப்படும் செட்டுப்டூல்களுக்கான சரியான உள்ளமைவு கோப்பு. இருப்பினும், பின்வரும் கட்டளைகள் நீக்கப்பட்டன, ** இனி இயக்கப்படக்கூடாது, மேலும் அவற்றின் பரிந்துரைக்கப்பட்ட மாற்று கட்டளைகள் அதற்கு பதிலாக பயன்படுத்தப்பட வேண்டும்:

source: ``python -m build``
ta: `` பைதான் -எம் பில்ட்``

source: For more details:
eo: Por pliaj detaloj:
ja: より詳しくは:
pt_br: Para mais detalhes:
ru: Более подробная информация:
ta: மேலும் விவரங்களுக்கு:

source: Where to start?
eo: De kie komenci?
ja: どこから始めましょうか？
pt_br: Onde começar?
ru: С чего начать?
ta: எங்கு தொடங்குவது?

source: The :term:`project` must contain a :file:`pyproject.toml` file at the root of its source tree that contains a ``[build-system]`` table like so:
eo: La :term:`projekto <project>` devas ĉe la radiko de sia fontarbo enhavi dosieron :file:`pyproject.toml` enhavantan tabelon ``[build-system]`` jene:
ja: :term:`プロジェクト <project>` のソースコードツリーのルート部分には、次に示すように、 ``[build-system]`` テーブルを含む :file:`pyproject.toml` がなければなりません:
pt_br: O :term:`projeto` deve conter um arquivo :file:`pyproject.toml` na raiz de sua árvore de fontes que contém uma tabela ``[build-system]`` como esta:
ru: Термин :term:`project` должен содержать в корне дерева исходников файл :file:`pyproject.toml`, который содержит таблицу ``[build-system]``, как показано ниже:
ta: தி: கால: `திட்டம்` இருக்க வேண்டும் ஒரு: கோப்பு:` pyproject.toml` அதன் மூல மரத்தின் மூலத்தில் `` [பில்ட்-சிச்டம்] `` அட்டவணை போன்றவற்றைக் கொண்டுள்ளது:

source: This is the standardized method of letting :term:`build frontends <Build Frontend>` know that :ref:`setuptools` is the :term:`build backend <Build Backend>` for this project.
eo: Tio estas la norma metodo por sciigi :term:`konstruan fasadon <Build Frontend>`, ke :ref:`setuptools` estas la :term:`konstrua malfasado <Build Backend>` por la projekto.
ja: これは、 :term:`ビルドフロントエンド <Build Frontend>` にこのプロジェクトの :term:`ビルドバックエンド <Build Backend>` は :ref:`setuptools` だと知らせるための標準化されたやり方です。
pt_br: Este é o método padronizado para permitir que :term:`frontends de construção <Build Frontend>` saibam que :ref:`setuptools` é o :term:`backend de construção <Build Backend>` para este projeto.
ru: Это стандартный способ сообщить :term:`build frontends <Build Frontend>` о том, что :ref:`setuptools` является :term:`build backend <Build Backend>` для этого проекта.
ta: இது அனுமதிக்கும் தரப்படுத்தப்பட்ட முறையாகும்: கால: `முன்பக்கத்தை உருவாக்குங்கள் <உருவாக்கம்>` இதை அறிந்து கொள்ளுங்கள்: குறிப்பு: `செட்டுப்டூல்ச்` என்பது: கால:` இந்த திட்டத்திற்கு பின்தளத்தில் கட்ட உருவாக்கு <பின்தளத்தில் உருவாக்கு>.

source: Note that the presence of a :file:`pyproject.toml` file (even if empty) triggers :ref:`pip` to change its default behavior to use *build isolation*.
eo: Notu ke la ĉeesto de dosiero :file:`pyproject.toml` (eĉ malplena) igas :ref:`pip` ŝanĝi la aprioran konduton al uzo de *konstrua izolado*.
ja: (空のファイルであっても) :file:`pyproject.toml` ファイルが存在していれば、 :ref:`pip` が *ビルド隔離 <build isolation>* を取り扱うデフォルトの動きが変わることに注意してください。
pt_br: Observe que a presença de um arquivo :file:`pyproject.toml` (mesmo que vazio) aciona :ref:`pip` para alterar seu comportamento padrão para usar *isolamento de construção*.
ru: Обратите внимание, что наличие файла :file:`pyproject.toml` (даже если он пуст) заставляет :ref:`pip` изменить свое поведение по умолчанию на использование *изоляции сборки*.
ta: A: FILE: `pyproject.toml` கோப்பு (காலியாக இருந்தாலும்) தூண்டுகிறது என்பதை நினைவில் கொள்க: Ref:` pip` அதன் இயல்புநிலை நடத்தையை மாற்ற *தனிமைப்படுத்தலை *.

source: :ref:`distributing-packages`
ja: :ref:`配布パッケージ <distributing-packages>`
ta: : Ref: `விநியோகிக்கும்-பேக்கேச்கள்`

source: :ref:`pyproject-build-system-table`
ru: :ref:`pyproject-сборка-система-таблица`
ta: : ref: `பைப்ரோசெக்ட்-பில்ட்-சிச்டம்-டேபிள்`

source: How to handle additional build-time dependencies?
eo: Kiel pritrakti pliajn konstrutempajn dependecojn?
ja: 追加的なビルド時の依存関係をどのように扱うのですか？
pt_br: Como lidar com dependências de tempo de construção adicionais?
ru: Как обрабатывать дополнительные зависимости во время сборки?
ta: கூடுதல் உருவாக்க நேர சார்புகளை எவ்வாறு கையாள்வது?

source: On top of setuptools itself, if :file:`setup.py` depends on other third-party libraries (outside of Python's standard library), those must be listed in the ``requires`` list of the ``[build-system]`` table, so that the build frontend knows to install them when building the :term:`distributions <Distribution Package>`.
eo: Krom setuptools mem, se :file:`setup.py` dependas de alia triapartia bibilioteko (ekster la norma biblioteko de Python), la listo ``requires`` de la tabelo ``[build-system]`` devas inkluzivi ĝin, por ke la konstrua fasado instalos ĝin dum konstruado de la :term:`distribuo <Distribution Package>`.
ja: setuptools それ自体の上に、もし :file:`setup.py` が他の (Python の標準ライブラリの外側の) 第三者のライブラリに依存しているのであれば、 :term:`配布物 <Distribution Package>` をビルドする際にビルドフロトンエンドがそれらをインストールする必要があることを知るために、 ``[build-system]`` テーブルの ``require`` リストに挙げられていなければなりません。
pt_br: Além do próprio setuptools, se :file:`setup.py` depende de outras bibliotecas de terceiros (fora da biblioteca padrão do Python), elas devem ser listadas na lista ``requires`` do ``[build-system ]`` tabela, para que o frontend de construção saiba instalá-los ao construir as :term:`distribuições <Pacote de Distribuição>`.
ru: Помимо самой setuptools, если :file:`setup.py` зависит от других сторонних библиотек (вне стандартной библиотеки Python), они должны быть перечислены в списке ``requires`` таблицы ``[build-system]``, чтобы фронтенд сборки знал, что их нужно установить при сборке :term:`distributions <Distribution Package>`.
ta: செடிப்டூல்களின் மேல், என்றால்: கோப்பு: `setup.py` மற்ற மூன்றாம் தரப்பு நூலகங்களை (பைத்தானின் நிலையான நூலகத்திற்கு வெளியே) சார்ந்துள்ளது .

source: For example, a :file:`setup.py` file such as this:
eo: Ekzemple, jena dosiero :file:`setup.py`:
ja: 例えば、このような :file:`setup.py` ファイルがあれば:
pt_br: Por exemplo, um arquivo :file:`setup.py` como este:
ru: Например, файл :file:`setup.py` выглядит следующим образом:
ta: எடுத்துக்காட்டாக, ஒரு: கோப்பு: இது போன்ற `setup.py` கோப்பு:

source: requires a :file:`pyproject.toml` file like this (:file:`setup.py` stays unchanged):
eo: postulas dosieron :file:`pyproject.toml` jene (:file:`setup.py` restas senŝanĝe):
ja: :file:`pyproject.toml` ファイルはこのようであることが要求されます (:file:`setup.py` には変更なし):
pt_br: requer um arquivo :file:`pyproject.toml` como este (:file:`setup.py` permanece inalterado):
ru: требует наличия такого файла :file:`pyproject.toml` (:file:`setup.py` остается неизменным):
ta: ஒரு: கோப்பு: `pyproject.toml` இது போன்ற கோப்பு (: கோப்பு:` setup.py` மாறாமல் இருக்கும்):

source: What is the build isolation feature?
eo: Kio estas la konstruo-izolada funkcio?
ja: ビルド隔離機能とは何でしょうか？
pt_br: Qual é o recurso de isolamento de compilação?
ru: Что такое изоляция сборки?
ta: உருவாக்க தனிமைப்படுத்தல் நற்பொருத்தம் என்ன?

source: Build frontends typically create an ephemeral virtual environment where they install only the build dependencies (and their dependencies) that are listed under ``build-system.requires`` and trigger the build in that environment.
eo: Konstrua fasado tipe kreas provizoran virtualan medion, en kiu instaliĝas nur la konstruaj dependaĵoj (kaj la dependaĵoj de dependaĵoj) en la listo de ``build-system.requires``, kaj konstruas en tiu medio.
ja: 典型的な場合、ビルドフロントエンドは、 ``build-system.requires`` の下に列挙されているビルド時の依存関係 (と、その依存関係)だけをインストールする先としての一時的な仮想環境を作成し、その環境内でビルドを開始します。
pt_br: Frontends de construção normalmente criam um ambiente virtual efêmero onde instalam apenas as dependências de construção (e suas dependências) listadas em ``build-system.requires`` e acionam a construção nesse ambiente.
ru: Обычно фронтенды сборки создают эфемерное виртуальное окружение, в котором устанавливают только те зависимости сборки (и их зависимости), которые перечислены в ``build-system.requires``, и запускают сборку в этом окружении.
ta: முன்பக்கங்களை உருவாக்குவது பொதுவாக ஒரு இடைக்கால மெய்நிகர் சூழலை உருவாக்குகிறது, அங்கு அவை `` பில்ட்-சிச்டம்.நான் ``` இன் கீழ் பட்டியலிடப்பட்டுள்ள உருவாக்க சார்புகளை (மற்றும் அவற்றின் சார்புகளை) மட்டுமே நிறுவுகின்றன, மேலும் அந்த சூழலில் கட்டமைப்பைத் தூண்டுகின்றன.

source: For some projects this isolation is unwanted and it can be deactivated as follows:
eo: Por kelkaj projektoj, tia izolado estas nedezirata kaj malaktivigebla jene:
ja: この隔離が不要な一部のプロジェクト向けには、以下のようにすれば (隔離を) 非活性化することができます:
pt_br: Para alguns projetos este isolamento é indesejado e pode ser desativado da seguinte forma:
ru: Для некоторых проектов эта изоляция нежелательна, и ее можно отключить следующим образом:
ta: சில திட்டங்களுக்கு இந்த தனிமைப்படுத்தல் தேவையற்றது, அதை பின்வருமாறு செயலிழக்கச் செய்யலாம்:

source: ``python -m build --no-isolation``
ta: `` பைதான் -எம் பில்ட் -இல்லை -தனிமைப்படுத்தல்``

source: ``python -m pip install --no-build-isolation``
ta: `` பைதான் -எம் பிஐபி நிறுவல்-இல்லை-பில்ட்-ஐசோலேசன்``

source: How to handle packaging metadata?
eo: Kiel enmeti pakajn metadatenojn?
ja: パッケージのメタデータをどのように扱えば良いでしょうか？
pt_br: Como lidar com metadados de empacotamento?
ru: Как обрабатывать метаданные упаковки?
ta: பேக்கேசிங் மெட்டாடேட்டாவை எவ்வாறு கையாள்வது?

source: All static metadata can optionally be moved to a ``[project]`` table in :file:`pyproject.toml`.
eo: Ĉiaj statikaj metadatenoj estas nedevige moveblaj al tabelo ``[project]`` en :file:`pyproject.toml`.
ja: 静的なメタデータはすべて、 :file:`pyproject.toml` の ``[project]`` テーブルへ移しても構いません。
pt_br: Todos os metadados estáticos podem opcionalmente ser movidos para uma tabela ``[project]`` em :file:`pyproject.toml`.
ru: Все статические метаданные по желанию могут быть перенесены в таблицу ``[проект]`` в :file:`pyproject.toml`.
ta: அனைத்து நிலையான மெட்டாடேட்டாவையும் விருப்பமாக `` [திட்டம்] `` அட்டவணை: கோப்பு: `pyproject.toml` க்கு மாற்றலாம்.

source: can be entirely replaced by a :file:`pyproject.toml` file like this:
eo: estas plene anstataŭigebla per :file:`pyproject.toml` jene:
ja: このように :file:`pyproject.toml` ファイルで完全に置き換えることも可能です:
pt_br: pode ser totalmente substituído por um arquivo :file:`pyproject.toml` como este:
ru: может быть полностью заменен файлом :file:`pyproject.toml`, например, таким:
ta: ஒரு: கோப்பு: `pyproject.toml` இது போன்ற கோப்பு:

source: Read :ref:`pyproject-project-table` for the full specification of the content allowed in the ``[project]`` table.
eo: Vidu :ref:`pyproject-project-table` por la plena specifo pri la enhavo permesata en la tabelo ``[project]``.
ja: ``[project]`` テーブルで許される内容の完全な仕様については、 :ref:`<pyproject-project-table>` を読んでください。
pt_br: Leia :ref:`pyproject-project-table` para a especificação completa do conteúdo permitido na tabela ``[project]``.
ru: Читайте :ref:`pyproject-project-table` для полной спецификации содержимого, допустимого в таблице ``[project]``.
ta: படிக்க: குறிப்பு: `` [திட்டம்] `` அட்டவணையில் அனுமதிக்கப்பட்ட உள்ளடக்கத்தின் முழு விவரக்குறிப்புக்கு `pyproject-project-table`.

source: How to handle dynamic metadata?
eo: Kiel enmeti dinamikajn metadatenojn?
ja: 動的なメタデータをどのように取り扱いますか？
pt_br: Como lidar com metadados dinâmicos?
ru: Как обрабатывать динамические метаданные?
ta: மாறும் மெட்டாடேட்டாவை எவ்வாறு கையாள்வது?

source: If some packaging metadata fields are not static they need to be listed as ``dynamic`` in this ``[project]`` table.
eo: Se iu paka metadatena kampo ne estas statika, ĝi devas esti markita kiel ``dynamic`` en tiu tabelo ``[project]``.
ja: パッケージングであるメタデータフィールドが静的ではないならば、 ``[project]`` テーブルの ``dynamic`` に列挙する必要があります。
pt_br: Se alguns campos de metadados de empacotamento não forem estáticos, eles precisam ser listados como ``dynamic`` nesta tabela ``[project]``.
ru: Если некоторые поля метаданных упаковки не являются статическими, их нужно указать как ``динамические`` в этой таблице ``[проект]``.
ta: சில பேக்கேசிங் மேனிலை தரவு புலங்கள் நிலையானதாக இல்லாவிட்டால், இந்த `` திட்டத்தில்] `` அட்டவணையில் அவை `` டைனமிக்`` என பட்டியலிடப்பட வேண்டும்.

source: can be modernized as follows:
eo: estas modernigebla jene:
ja: 以下のように近代化することができるでしょう:
pt_br: pode ser modernizado desta forma:
ru: можно модернизировать следующим образом:
ta: பின்வருமாறு நவீனமயமாக்கலாம்:

source: :ref:`declaring-project-metadata-dynamic`
ja: :ref:`プロジェクトのメタデータを動的であると宣言する <declaring-project-metadata-dynamic>`
ru: :ref:`декларирование метаданных проекта-динамический`
ta: : குறிப்பு: `அறிவித்தல்-திட்ட-மெட்டாடேட்டா-டைனமிக்`

source: What if something that can not be changed expects a ``setup.py`` file?
eo: Kiel fari, se io neŝanĝebla atendas dosieron ``setup.py``?
ja: 変更不能ななにかが ``setup.py`` ファイルがあるものと期待していたらどうしますか？
pt_br: E se alguma coisa que não possa ser alterar esperar um arquivo ``setup.py``?
ru: Что делать, если что-то, что нельзя изменить, ожидает файл ``setup.py``?
ta: மாற்ற முடியாத ஒன்று `` setup.py`` கோப்பை எதிர்பார்க்கிறது என்றால் என்ன செய்வது?

source: For example, a process exists that can not be changed easily and it needs to execute a command such as ``python setup.py --name``.
eo: Ekzemple, ekzistas procezo ne facile ŝanĝebla, kiu devas ruli komandon kiel ``python setup.py --name``.
ja: 例えば、簡単には変更することができないプロセスが存在していて、それが ``python setup.py --name`` のようなコマンドの実行を必要としてる場合。
pt_br: Por exemplo, existe um processo que não pode ser alterado facilmente e precisa executar um comando como ``python setup.py --name``.
ru: Например, существует процесс, который нельзя легко изменить, и ему нужно выполнить команду типа ``python setup.py --name``.
ta: எடுத்துக்காட்டாக, எளிதாக மாற்ற முடியாத ஒரு செயல்முறை உள்ளது, மேலும் இது `` பைதான் setup.py --name`` போன்ற கட்டளையை இயக்க வேண்டும்.

source: It is perfectly fine to leave a :file:`setup.py` file in the project source tree even after all its content has been moved to :file:`pyproject.toml`. This file can be as minimalistic as this:
eo: Estas bone lasi dosieron :file:`setup.py` en la projekta fontarbo, eĉ post oni movis ĉiom da enhavo al :file:`pyproject.toml`. La dosiero povas esti tiel minimuma kiel la jeno:
ja: たとえ全ての内容が :file:`pyproject.toml` へ移された後であっても、プロジェクトのソースコードツリーに `setup.py` を残すことは完全に問題のないことです。このファイルの最小限の姿はこのようになります:
pt_br: É perfeitamente normal deixar um arquivo :file:`setup.py` na árvore de fontes do projeto mesmo depois de todo o seu conteúdo ter sido movido para :file:`pyproject.toml`. Este arquivo pode ser tão minimalista quanto este:
ru: Совершенно нормально оставлять файл :file:`setup.py` в дереве исходников проекта даже после того, как все его содержимое было перемещено в :file:`pyproject.toml`. Этот файл может быть таким минималистичным:
ta: ஒரு: கோப்பு: `setup.py` கோப்பை திட்ட மூல மரத்தில் அதன் அனைத்து உள்ளடக்கங்களும் நகர்த்திய பின்னரும் விட்டுவிடுவது மிகவும் நல்லது: கோப்பு:` pyproject.toml`. இந்த கோப்பு இதைப் போலவே மிகச்சிறியதாக இருக்கலாம்:

source: :doc:`setuptools:build_meta`
ta: : டாக்: `செட்ப்டூல்ச்: பில்ட்_மெட்டா`

source: Multi-version installs
eo: Plurversiaj instaloj
ja: 複数バージョンのインストール
pt_br: Instalações de várias versões
ru: Установка нескольких версий
ta: பல பதிப்பு நிறுவல்கள்

source: easy_install allows simultaneous installation of different versions of the same project into a single environment shared by multiple programs which must ``require`` the appropriate version of the project at run time (using ``pkg_resources``).
eo: easy_install permesas samtempan instaladon de malsamaj versioj de la sama projekto en unu medio komuna por pluraj programoj, kiuj devas postuli taŭgan version de la projekto rultempe (per ``pkg_resources``).
ja: easy_install を使えば、異なるバージョンの同一プロジェクトをひとつの環境に同時にインストールして、なおかつ、それぞれ動作時にプロジェクトの特定のバージョンを (``pkg_resources`` での指定を通じて) ``要求 <require>`` する複数のプログラムをその環境で動作させることができます。
pt_br: easy_install permite a instalação simultânea de diferentes versões do mesmo projeto em um único ambiente compartilhado por vários programas que devem exigir (``require``) a versão apropriada do projeto em tempo de execução (usando ``pkg_resources``).
ru: easy_install позволяет одновременно устанавливать различные версии одного и того же проекта в единое окружение, разделяемое несколькими программами, которые должны ``требовать`` соответствующую версию проекта во время выполнения (используя ``pkg_resources``).
ta: ஈசி_ச்டால் ஒரே திட்டத்தின் வெவ்வேறு பதிப்புகளை ஒரே நேரத்தில் பல நிரல்களால் பகிரப்பட்ட ஒற்றை சூழலில் நிறுவ அனுமதிக்கிறது, இது திட்டத்தின் பொருத்தமான பதிப்பை இயக்க நேரத்தில் (`` pkg_resources`` ஐப் பயன்படுத்த வேண்டும்).

source: For many use cases, virtual environments address this need without the complication of the ``require`` directive. However, the advantage of parallel installations within the same environment is that it works for an environment shared by multiple applications, such as the system Python in a Linux distribution.
eo: Por multaj uzkazoj, virtuala medio solvas tion sen la komplikaĵo de la direktivo ``require``. Tamen, la avantaĝo de paralelaj instalaĵoj en la sama medio estas, ke tio funkcias por medio uzata de pluraj programoj, ekzemple por la sistema Python en Linux-distribuo.
ja: 多くのユースケースでは、 ``require`` ディレクティブを混乱させる事なく、仮想環境がこのような需要を満たします。しかしながら、同一環境内に(複数バージョンを)並行してインストールすることの利点は、Linux 配布物におけるシステム側の Python のように、複数のアプリケーションによって共有される環境で動作することです。
pt_br: Para muitos casos de uso, ambientes virtuais atendem a essa necessidade sem a complicação da diretiva ``require``. No entanto, a vantagem de instalações paralelas dentro do mesmo ambiente é que funciona para um ambiente compartilhado por várias aplicações, como o sistema Python em uma distribuição Linux.
ru: Для многих случаев использования виртуальные среды решают эту задачу без усложнения директивы ``require``. Однако преимущество параллельной установки в одной среде заключается в том, что она работает для среды, разделяемой несколькими приложениями, например, для системы Python в дистрибутиве Linux.
ta: பல பயன்பாட்டு நிகழ்வுகளுக்கு, மெய்நிகர் சூழல்கள் இந்த தேவையை `` தேவை` 'கட்டளை இல்லாமல் நிவர்த்தி செய்கின்றன. இருப்பினும், ஒரே சூழலுக்குள் இணையான நிறுவல்களின் நன்மை என்னவென்றால், இது லினக்ச் விநியோகத்தில் கணினி பைதான் போன்ற பல பயன்பாடுகளால் பகிரப்பட்ட சூழலுக்கு வேலை செய்கிறது.
