Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Once you have this layout, simply configure your webserver to serve the root directory with autoindex enabled. For an example using the built in Web server in `Twisted`_, you would simply run ``twistd -n web --path .`` and then instruct users to add the URL to their installer's configuration.
eo: Kun tia aranĝo, simple igu vian TTT-servilon servi la radikan dosierujon kun aŭtomata indekso. Ekzemple, uzante la aprioran TTT-servilon en `Twisted`_, simple rulu ``twistd -n web --path .`` kaj igu la uzantojn aldoni la retadreson al la agordoj de la instalilo.
ja: この配置ができあがったら、あとはルートディレクトリを自動インデックス付きでウェブサーバから提供するように設定するだけです。 `Twisted`_ の組み込みウェブサーバを使う例では、単に ``twisted -n web --path.`` を走らせておいて、ユーザに対してこのURLをインストーラの設定に加えるように指示するだけです。
pt_br: Assim que tiver esse layout, basta configurar seu servidor web para servir o diretório raiz com o autoindex habilitado. Para um exemplo usando o servidor Web embutido em `Twisted`_, você simplesmente executaria ``twistd -n web --path .`` e então instruiria os usuários a adicionar a URL à configuração de seu instalador.
ru: Как только вы получите эту схему, просто настройте свой веб-сервер на обслуживание корневого каталога с включенным автоиндексом. Для примера, используя встроенный веб-сервер в `Twisted`_, вы просто запустите ``twistd -n web --path .``, а затем попросите пользователей добавить URL в конфигурацию их программы установки.
ta: இந்த தளவமைப்பை நீங்கள் பெற்றவுடன், ஆட்டோஇண்டெக்ச் இயக்கப்பட்ட ரூட் கோப்பகத்தை வழங்க உங்கள் வெப்சர்வரை உள்ளமைக்கவும். `ட்விச்டட்`_ இல் உள்ள கட்டமைக்கப்பட்ட வலை சேவையகத்தைப் பயன்படுத்துவதற்கு, நீங்கள்` `ட்விச்ட்ட் -என் வலை -பாதையை இயக்குவீர்கள் .`` பின்னர் பயனர்கள் தங்கள் நிறுவியின் உள்ளமைவில் முகவரி ஐ சேர்க்க அறிவுறுத்துங்கள்.

source: Existing projects
eo: Ekzistantaj projektoj
ja: 既存のプロジェクト
pt_br: Projetos existentes
ru: Существующие проекты
ta: தற்போதுள்ள திட்டங்கள்

source: Package upload
eo: Alŝuto de pako
ja: パッケージアップロード
pt_br: Envio de pacotes
ru: Загрузка пакетов
ta: தொகுப்பு பதிவேற்றம்

source: PyPI fall-through [2]_
eo: Retroiro al PyPI [2]_
ja: PyPI フォールスルー [2]_
pt_br: Padrão do PyPI [2]_
ru: Падение PyPI [2]_
ta: பைபி வீழ்ச்சி-த்ரூ [2] _

source: Additional notes
eo: Pliaj notoj
ja: 補遺
pt_br: Notas adicionais
ru: Дополнительные замечания
ta: கூடுதல் குறிப்புகள்

source: multiple indexes with inheritance, with syncing, replication, fail-over; mirroring
eo: pluraj indeksoj kun heredado, kun sinkronigo, replikado, rezervosistemo; spegulado
ja: 同期、複製、フェールオーバ、ミラーリングが可能な複数のインデックス
pt_br: múltiplos índices com herança, com sincronização, replicação, tolerância a falhas; espelhamento
ru: множественные индексы с наследованием, с синхронизацией, репликацией, отказоустойчивостью; зеркалирование
ta: பரம்பரை கொண்ட பல குறியீடுகள், ஒத்திசைவு, பிரதி, தோல்வி; பிரதிபலிப்பு

source: :ref:`pypiserver`
ru: :ссылка:`pypiserver`
ta: : குறிப்பு: `பைபிசெவர்`

source: unmaintained; also cached proxying; authentication, authorisation
eo: nemastrumata; ankaŭ kaŝmemora perado; aŭtentikigo, rajtigo
ja: メンテナンスされていない; またプロクシでキャッシュ; 認証、認可
pt_br: sem manutenção; também faz proxy de cache; autenticação, autorização
ru: не поддерживается; также кэшированное проксирование; аутентификация, авторизация
ta: மதிப்பிடப்படாதது; தற்காலிகமாக தற்காலிகமாக சேமிக்கப்பட்டது; ஏற்பு, ஏற்பு

source: unmaintained; serve files in GitHub
eo: nemastrumata; servi dosierojn ĉe GitHub
ja: メンテナンスされていない; GitHub内のファイルを提供する
pt_br: sem manutenção; serve arquivos no GitHub
ru: не поддерживается; служебные файлы на GitHub
ta: மதிப்பிடப்படாதது; கிதுபில் கோப்புகளை பரிமாறவும்

source: :ref:`pulppython`
ru: :ссылка:`pulppython`
ta: : சிவப்பு: `கூழ் பைதான்`

source: also mirroring, proxying; plugin for Pulp
eo: ankaŭ spegulado, perado; kromaĵo por Pulp
ja: また、ミラーリング、プロクシ利用; Pulp 用のプラグイン
pt_br: também espelhamento, proxy; plugin para Pulp
ru: также зеркалирование, проксирование; плагин для Pulp
ta: பிரதிபலிக்கும், ப்ராக்சிங்; கூழ் சொருகி

source: also mirroring; manual synchronisation
eo: ankaŭ spegulado; malaŭtomata sinkronigo
ja: また、ミラーリング; 手動の同期
pt_br: também espelhamento; sincronização manual
ru: также зеркальное отображение; ручная синхронизация
ta: மேலும் பிரதிபலிக்கும்; கையேடு ஒத்திசைவு

source: :ref:`dumb-pypi`
ru: :ссылка:`dumb-pypi`
ta: : குறிப்பு: `டம்ப்-பைபி`

source: not a server, but a static file site generator
eo: ne servilo, sed statikdosiera retejogenerilo
ja: サーバではなくて、静的ファイルのサイトのジェネレータ
pt_br: não é um servidor, mas um gerador de site de arquivo estático
ru: не сервер, а генератор сайтов со статическими файлами
ta: ஒரு சேவையகம் அல்ல, ஆனால் நிலையான கோப்பு தள செனரேட்டர்

source: :ref:`httpserver`
ru: : ссылка:`httpserver`
ta: : குறிப்பு: `httpserver`

source: standard-library
ja: 標準ライブラリ
pt_br: biblioteca padrão
ru: стандартная библиотека
ta: நிலையான-நூலகம்

source: `Apache <https://httpd.apache.org/>`_
ta: `அப்பாச்சி <https://httpd.apache.org/>` _

source: using `mod_rewrite <https://httpd.apache.org/docs/current/mod/mod_rewrite.html>`_ and `mod_cache_disk <https://httpd.apache.org/docs/current/mod/mod_cache_disk.html>`_, you can cache requests to package indexes through an Apache server
eo: uzante `mod_rewrite <https://httpd.apache.org/docs/current/mod/mod_rewrite.html>`_ kaj `mod_cache_disk <https://httpd.apache.org/docs/current/mod/mod_cache_disk.html>`_, vi povas enkaŝmemirigi petojn al pakindeksoj per Apache-servilo
ja: `mod_rewrite <https://httpd.apache.org/docs/current/mod/mod_rewrite.html>`_ および `mod_cache_disk <https://httpd.apache.org/docs/current/mod/mod_cache_disk.html>`_ を用いて、Apache サーバ経由のパッケージインデックスへのリクエストをキャッシュすることができます
pt_br: usando `mod_rewrite <httpd.apache.org/docs/current/mod/mod_rewrite.html>`_ e `mod_cache_disk <https://httpd.apache.org/docs/current/mod/mod_cache_disk.html> `_, você pode armazenar em cache as solicitações para índices de pacotes por meio de um servidor Apache
ru: Используя `мод_перезаписи <https://httpd.apache.org/docs/current/mod/mod_rewrite.html>`_ и `мод_кэш_диска <https://httpd.apache.org/docs/current/mod/mod_cache_disk.html>`_, вы можете кэшировать запросы к индексам пакетов через сервер Apache
ta: using `mod_rewrite <https://httpd.apache.org/docs/current/mod/mod_rewrite.html>`_ and `mod_cache_disk <https://httpd.apache.org/docs/current/mod/mod_cache_disk.html> `_, அப்பாச்சி சேவையகம் மூலம் குறியீடுகளை தொகுப்பு குறியீடுகளுக்கு கேச் செய்யலாம்

source: For complete documentation of the simple repository protocol, see :ref:`simple repository API <simple-repository-api>`.
eo: Por plena dokumentaro pri la simpla deponeja protokolo, vidu :ref:`la simplan deponejan API <simple-repository-api>`.
ja: 単純なリポジトリプロトコルの完全な説明文書としては、 :ref:`simple repository API <simple-repository-api>` を見てください。
pt_br: Para a documentação completa do protocolo de repositório simples, veja :ref:`API de repositório simples <simple-repository-api>`..
ru: Полную документацию по протоколу простого репозитория смотрите в :ref:`simple repository API <simple-repository-api>`.
ta: எளிய களஞ்சிய நெறிமுறையின் முழுமையான ஆவணங்களுக்கு, காண்க: குறிப்பு: `எளிய களஞ்சிய பநிஇ <எளிய-ரோபோசிட்டரி-ஏபிஐ>`.

source: Can be configured to fall back to PyPI (or another package index) if a requested package is missing.
eo: Estas agordebla por uzi PyPI (aŭ alian pakindekson), se petita pako mankas.
ja: 要求されたパッケージが存在しなければ、 PyPI (もしくは他のパッケージインデックス) へフォールバックするように設定しておくことができます。
pt_br: Pode ser configurado para recorrer ao PyPI (ou outro índice de pacote) se um pacote solicitado estiver ausente.
ru: Может быть настроен на возврат к PyPI (или другому индексу пакетов), если запрашиваемый пакет отсутствует.
ta: கோரப்பட்ட தொகுப்பு காணவில்லை எனில், PYPI (அல்லது மற்றொரு தொகுப்பு குறியீட்டு) க்கு திரும்புவதற்கு கட்டமைக்க முடியும்.

source: **Guides** are focused on accomplishing a specific task and assume that you are already familiar with the basics of Python packaging. If you're looking for an introduction to packaging, see :doc:`/tutorials/index`.
eo: **Gvidilo** temas pri plenumado de iu tasko kaj supozas, ke vi jam scias la fundamentojn pri la pakado de Python. Se vi serĉas enkondukon al pakado, vidu :doc:`/tutorials/index`.
ja: **ガイド文書** は特定のタスクを達成することに重点を置くもので、読者が Python のパッケージングの基礎について既に馴染みがあるものと仮定しています。パッケージングの導入的な説明を探しているのであれば :doc:`/tutorials/index` を見てください。
pt_br: **Guias** se concentram em realizar uma tarefa específica e presumem que você já esteja familiarizado com os fundamentos do empacotamento do Python. Se você está procurando uma introdução ao empacotamento, veja :doc:`/tutorials/index`.
ru: **Руководства** направлены на выполнение конкретной задачи и предполагают, что вы уже знакомы с основами упаковки в Python. Если вы ищете введение в упаковку, смотрите :doc:`/tutorials/index`.
ta: ** வழிகாட்டிகள் ** ஒரு குறிப்பிட்ட பணியை நிறைவேற்றுவதில் கவனம் செலுத்துகின்றன, மேலும் பைதான் பேக்கேசிங்கின் அடிப்படைகளை நீங்கள் ஏற்கனவே அறிந்திருக்கிறீர்கள் என்று கருதுகிறீர்கள். நீங்கள் பேக்கேசிங்கிற்கான அறிமுகத்தைத் தேடுகிறீர்களானால், காண்க: டாக்: `/டுடோரியல்கள்/குறியீட்டு`.

source: Package index mirrors and caches
eo: Pakindeksaj speguloj kaj kaŝmemoroj
ja: パッケージインデックスのミラーとキャッシュ
pt_br: Espelhos e caches de índice de pacotes
ru: Зеркала и кэш индексов пакетов
ta: தொகுப்பு குறியீட்டு கண்ணாடிகள் மற்றும் தற்காலிக சேமிப்புகள்

source: Mirroring or caching of PyPI (and other :term:`package indexes <Package Index>`) can be used to speed up local package installation, allow offline work, handle corporate firewalls or just plain Internet flakiness.
eo: Spegulado aŭ enkaŝmemorigo de PyPI (aŭ alia :term:`pakindekso <Package Index>`) povas rapidigi instaladon de loka pako, ebligi senkonektan funkciadon, kongrui kun entreprena fajromuro aŭ maski malbonan Interretan konekton.
ja: PyPI (あるいは他の :term:`パッケージインデックス <Package Index>`) のミラーやキャッシュがあると、手元でパッケージをインストールするのが速くなったり、オフラインでインストールできたり、会社のファイアウォール経由でもできたり、あるいは、単純にインターネットがあてにならなくてもインストールできたりします。
pt_br: O espelhamento ou cache do PyPI (e outros :term:`índices de pacotes <Índice de Pacotes>`) pode ser usado para acelerar a instalação do pacote local, permitir o trabalho offline, lidar com firewalls corporativos ou simplesmente falhas na Internet.
ru: Зеркалирование или кэширование PyPI (и других : термин:`индексов пакетов <Пакетный индекс>`) может быть использовано для ускорения локальной установки пакетов, для работы в автономном режиме, для работы с корпоративными брандмауэрами или для обычного интернет-флакинга.
ta: PYPI இன் பிரதிபலிப்பு அல்லது தற்காலிக சேமிப்பு (மற்றும் பிற: கால: `தொகுப்பு குறியீடுகள் <தொகுப்பு குறியீட்டு>`) உள்ளக தொகுப்பு நிறுவலை விரைவுபடுத்தவும், இணைப்பில்லாத வேலையை அனுமதிக்கவும், கார்ப்பரேட் ஃபயர்வால்களைக் கையாளவும் அல்லது வெற்று இணையத் துடிப்பு ஆகியவற்றைப் பயன்படுத்தவும் பயன்படுத்தப்படலாம்.

source: There are multiple classes of options in this area:
eo: Ekzistas pluraj klasoj de opcioj en tiu areo:
ja: この領域のオプションには複数のクラスがあります:
pt_br: Existem várias classes de opções nesta área:
ru: В этой области существует несколько классов опций:
ta: இந்த பகுதியில் பல வகை விருப்பங்கள் உள்ளன:

source: local/hosted caching of package indexes.
eo: loka/gastigita kaŝmemoro de pakindeksoj.
ja: パッケージインデックスのローカルまたはホストされたキャッシュ。
pt_br: fazer cache local/hospedado de índices de pacotes.
ru: локальное/хостинговое кэширование индексов пакетов.
ta: தொகுப்பு குறியீடுகளின் உள்ளூர்/ஓச்ட் செய்யப்பட்ட தற்காலிக சேமிப்பு.

source: local/hosted mirroring of a package index. A mirror is a (whole or partial) copy of a package index, which can be used in place of the original index.
eo: loka/gastigita spegulado de pakindekso. Spegulo estas (plena aŭ parta) kopio de pakindekso uzebla anstataŭ la originalo.
ja: パッケージインデックスのローカルまたはホストされたミラーリング。ミラーとは、パッケージインデックスの (全体または一部の) コピーで、オリジナルのインデックスの代わりに使うことができます。
pt_br: fazer espelhamento local/hospedado de um índice de pacotes. Um espelho é uma cópia (total ou parcial) de um índice de pacotes, que pode ser usado no lugar do índice original.
ru: локальное/хостовое зеркалирование индекса пакета. Зеркало - это (полная или частичная) копия индекса пакета, которая может использоваться вместо оригинального индекса.
ta: ஒரு தொகுப்பு குறியீட்டின் உள்ளூர்/ஓச்ட் பிரதிபலிப்பு. ஒரு கண்ணாடி என்பது ஒரு தொகுப்பு குறியீட்டின் ஒரு (முழு அல்லது பகுதி) நகலாகும், இது அசல் குறியீட்டுக்கு பதிலாக பயன்படுத்தப்படலாம்.

source: private package index with fall-through to public package indexes (for example, to mitigate dependency confusion attacks), also known as a proxy.
eo: privata pakindekso kun retroiro al publikaj pakindeksoj (ekzemple por malhelpi atakon per konfuzo de dependeco), ankaŭ konata kiel perilo.
ja: (例えば依存関係を混乱させる攻撃を緩和するための) 公開のパッケージインデックスへフォールスルーする機能を持ったプライベートなパッケージインデックスで、プロクシーとも呼ばれる。
pt_br: índice de pacotes privados com alternativa para os índices de pacotes públicos (por exemplo, para mitigar ataques de confusão de dependência), também conhecido como proxy.
ru: Частный индекс пакетов с переходом к публичным индексам пакетов (например, для защиты от атак, вызывающих путаницу зависимостей), также известный как прокси.
ta: பொது தொகுப்பு குறியீடுகளுக்கு வீழ்ச்சி கொண்ட தனியார் தொகுப்பு குறியீடு (எடுத்துக்காட்டாக, சார்பு குழப்ப தாக்குதல்களைத் தணிக்க), இது பதிலாள் என்றும் அழைக்கப்படுகிறது.

source: Caching with pip
eo: Kaŝmemoroj kaj pip
ja: pipによるキャッシュ
pt_br: Fazendo cache com pip
ru: Кэширование с помощью pip
ta: பிப் உடன் தேக்ககிருத்தல்

source: pip provides a number of facilities for speeding up installation by using local cached copies of :term:`packages <Distribution Package>`:
eo: pip provizas servojn por rapidigi instaladon uzante loke memoritajn kopiojn de :term:`pakoj <Distribution Package>`:
ja: pip は、 :term:`パッケージ <Distribution Package>` のローカルキャッシュを使って素早くインストールするためのいくつもの機能を提供します。
pt_br: pip fornece uma série de facilidades para acelerar a instalação usando cópias locais em cache de :term:`pacotes <Pacote de Distribuição>`:
ru: pip предоставляет ряд возможностей для ускорения установки за счет использования локальных кэшированных копий :term:`packages <Distribution Package>`:
ta: உள்ளக தற்காலிக சேமிப்பு நகல்களைப் பயன்படுத்துவதன் மூலம் நிறுவலை விரைவுபடுத்துவதற்கு பிஐபி பல வசதிகளை வழங்குகிறது: கால: `தொகுப்புகள் <விநியோக தொகுப்பு>`:

source: :ref:`Fast & local installs <pip:installing from local packages>` by downloading all the requirements for a project and then pointing pip at those downloaded files instead of going to PyPI.
eo: :ref:`Rapida kaj loka instalado <pip:installing from local packages>` elŝutante ĉiujn postulojn de projekto kaj montrante tiujn al pip anstataŭ vizitadi PyPI.
ja: あるプロジェクトの依存先パッケージをすべてダウンロードし、 pip を PyPI の代わりにそれらダウンロード済みファイルに向けることによる :ref:`速くてローカルなインストール <pip:installing from local packages>` 。
pt_br: :ref:`Instalações rápidas e locais <pip:installing from local packages>` baixando todos os requisitos para um projeto e apontando pip para esses arquivos baixados em vez de ir para PyPI.
ru: :ref:`Быстрая и локальная установка <pip:installing from local packages>` за счет загрузки всех требований для проекта и последующего указания pip на эти загруженные файлы вместо обращения к PyPI.
ta: :ref:`Fast & local installs <pip:installing இருந்து local packages>` by downloading அனைத்தும் the requirements க்கு a திட்டம் and then pointing pip at those downloaded கோப்புகள் instead of going பெறுநர் PyPI.

source: A variation on the above which pre-builds the installation files for the requirements using :ref:`python3 -m pip wheel <pip:pip wheel>`:
eo: Variaĵo de la ĉi-supro, kiu antaŭkonstruas la instalajn dosierojn por la postuloj per :ref:`python3 -m pip wheel <pip:pip wheel>`:
ja: :ref:`python -m pip wheel <pip:pip wheel>` を用いて依存先パッケージのインストール用ファイルをあらかじめビルドしておくという上記のバリエーション:
pt_br: Uma variação da acima, que pré-constrói os arquivos de instalação para os requisitos usando :ref:`python3 -m pip wheel <pip:pip wheel>`:
ru: Вариант вышеописанного, который предварительно собирает установочные файлы в соответствии с требованиями, используя :ref:`python3 -m pip wheel <pip:pip wheel>`:
ta: பயன்படுத்தும் தேவைகளுக்காக நிறுவல் கோப்புகளை முன்பே கட்டியெழுப்பும் மேலே உள்ள மாறுபாடு: குறிப்பு: `பைதான் 3 -எம் பிப் வீல் <பிப்: பிப் வீல்>`:

source: Cache
eo: Kaŝmemoro
ja: キャッシュ
ru: Кэш
ta: கேச்

source: Mirror
eo: Spegulo
ja: ミラー
pt_br: Espelho
ru: Зеркало
ta: கண்ணாடி

source: Proxy
eo: Perilo
ja: プロクシ
ru: Прокси
ta: பதிலாள்

source: multiple indexes with inheritance; syncing, replication, fail-over; package upload
eo: pluraj indeksoj kun heredado, kun sinkronigo, replikado, rezervosistemo; alŝutado de pakoj
ja: 継承・同期・複製・フェイルオーバ・パッケージアップロードの機能を持つ複数のインデックス群
pt_br: múltiplos índices com herança; sincronização, replicação, tolerância a falhas; envio de pacote
ru: множественные индексы с наследованием; синхронизация, репликация, обход отказа; загрузка пакетов
ta: பரம்பரை கொண்ட பல குறியீடுகள்; ஒத்திசைவு, பிரதி, தோல்வி; தொகுப்பு பதிவேற்றம்

source: custom plugin enables caching; re-routing to other package indexes
eo: propra kromprogramo ebligas kaŝmemoron; alidirektado al aliaj pakindeksoj
ja: カスタムプラグインによってキャッシングや他のパッケージインデックスへのリルーティングが可能になります
pt_br: plugin personalizado permite fazer cache; redirecionamento para outros índices de pacotes
ru: Пользовательский плагин включает кэширование; перенаправление к другим индексам пакетов
ta: தனிப்பயன் சொருகி தற்காலிக சேமிப்பை செயல்படுத்துகிறது; பிற தொகுப்பு குறியீடுகளுக்கு மீண்டும் திசை திருப்புதல்

source: unmaintained; authentication, authorisation
eo: nemastrumata; aŭtentikigo, rajtigo
ja: 保守されていない; 認証・認可
pt_br: sem manutenção; autenticação, autorização
ru: не поддерживается; аутентификация, авторизация
ta: மதிப்பிடப்படாதது; ஏற்பு, ஏற்பு

source: plugin for Pulp; multiple proxied indexes; package upload
eo: kromaĵo por Pulp; pluraj peritaj indeksoj; alŝuto de pako
ja: Pulp 用のプラグイン; 複数のプロクシされたインデックス; パッケージアップロード
pt_br: plugin para Pulp; vários índices proxy; envio de pacote
ru: плагин для Pulp; несколько проксированных индексов; загрузка пакетов
ta: கூழ் சொருகி; பல ப்ராக்சிட் குறியீடுகள்; தொகுப்பு பதிவேற்றம்

source: :ref:`proxpi`
ru: :ссылка:`proxpi`
ta: : குறிப்பு: `ப்ராக்ச்பி`

source: multiple proxied indexes
eo: pluraj peritaj indeksoj
ja: 複数のプロクシされたインデックス群
pt_br: múltiplos índices sob proxy
ru: несколько проксированных индексов
ta: பல ப்ராக்சிட் குறியீடுகள்

source: :ref:`nginx_pypi_cache`
ru: : ссылка:`nginx_pypi_cache`
ta: : குறிப்பு: `nginx_pypi_cache`

source: :ref:`flaskpypiproxy`
ru: :ссылка:`flaskpypiproxy`
ta: : குறிப்பு: `பிளாச்க்பிபிப்ராக்சி`

source: unmaintained
eo: nemastrumata
ja: 保守されていない
pt_br: sem manutenção
ru: не обслуживается
ta: வழங்கப்படாதது

source: Installing scientific packages
eo: Instali sciencajn pakojn
ja: 科学分野のパッケージをインストールする
pt_br: Instalando pacotes científicos
ru: Установка научных пакетов
ta: அறிவியல் தொகுப்புகளை நிறுவுதல்

source: Scientific software tends to have more complex dependencies than most, and it will often have multiple build options to take advantage of different kinds of hardware, or to interoperate with different pieces of external software.
eo: Scienca programo ofte havas pli komplikajn dependecojn ol aliaj programoj, kaj ofte havas plurajn konstruajn opciojn por diversaj aparatoj aŭ por kunfunkcii kun diversaj eksteraj programoj.
ja: 科学分野のソフトウェアは、他のほとんどのものよりも複雑な依存関係を持つことが多く、異なる種類のハードウェアの利点を引き出すためや外部のソフトウェアのさまざまな部分と協調動作するためのオプションが複数存在することもしばしばです。
pt_br: O software científico tende a ter dependências mais complexas do que a maioria e, frequentemente, terá várias opções de construção para tirar proveito de diferentes tipos de hardware ou para interoperar com diferentes partes de software externo.
ru: Научное программное обеспечение, как правило, имеет более сложные зависимости, чем большинство других, и часто имеет несколько вариантов сборки, чтобы использовать преимущества различных видов оборудования или взаимодействовать с различными частями внешнего программного обеспечения.
ta: விஞ்ஞான மென்பொருள் பெரும்பாலானவற்றை விட மிகவும் சிக்கலான சார்புகளைக் கொண்டிருக்கிறது, மேலும் இது பல்வேறு வகையான வன்பொருள்களைப் பயன்படுத்த பல கட்டுமான விருப்பங்களைக் கொண்டிருக்கும், அல்லது வெளிப்புற மென்பொருளின் வெவ்வேறு துண்டுகளுடன் செயல்படுகிறது.

source: In particular, `NumPy <https://numpy.org/>`__, which provides the basis for most of the software in the `scientific Python stack <https://scientific-python.org>`_ can be configured to interoperate with different FORTRAN libraries, and can take advantage of different levels of vectorized instructions available in modern CPUs.
eo: Aparte, `NumPy <https://numpy.org/> `__, kiu estas la bazo de la plejparto de la programaro en la `scienca Python-stako <https://scientific-python.org>`_, povas kunfunkcii kun diversaj Fortranaj bibliotekoj kaj povas ekspluati diversajn nivelojn de vektoraj instrukcioj en modernaj ĉefprocesoroj.
ja: とりわけ `科学分野のPythonソフトウェア群 <https://scientific-python.org>`_ のほとんどのソフトウェアに基盤を提供する`NumPy <https://numpy.org/>`__ は、他の FORTRAN ライブラリと協調動作したり現代的なCPUで利用可能なさまざまなレベルのベクター演算命令を活用できるように構成可能です。
ru: В частности, `NumPy <https://numpy.org/>`__, который является основой для большинства программ в научном стеке Python <https://scientific-python.org>`_, может быть настроен на взаимодействие с различными библиотеками FORTRAN и может использовать преимущества различных уровней векторизованных инструкций, доступных в современных процессорах.
ta: குறிப்பாக, `numpy <https://numpy.org/>` __, இது `அறிவியல் பைதான் அடுக்கில் <https://scientific-python.org> _ _ _ வெவ்வேறு ஃபோர்டிரான் நூலகங்களுடன் ஒன்றிணைந்து, நவீன சிபியு களில் கிடைக்கும் வெவ்வேறு நிலைகளில் திசையன் வழிமுறைகளைப் பயன்படுத்திக் கொள்ளலாம்.

source: Starting with version 1.10.4 of NumPy and version 1.0.0 of SciPy, pre-built 32-bit and 64-bit binaries in the ``wheel`` format are available for all major operating systems (Windows, macOS, and Linux) on PyPI. Note, however, that on Windows, NumPy binaries are linked against the `ATLAS <https://math-atlas.sourceforge.net/>`__ BLAS/LAPACK library, restricted to SSE2 instructions, so they may not provide optimal linear algebra performance.
eo: Ekde versio 1.10.4 de NumPy kaj versio 1.0.0 de SciPy, antaŭkonstruitaj 32-bitaj kaj 64-bitaj duumaĵoj de la formo ``wheel`` estas disponeblaj por ĉiuj ĉefaj mastrumaj sistemoj (Windows, macOS kaj Linux) ĉe PyPI. Notu, tamen, ke je Windows, duumaĵoj de NumPy estas binditaj al la biblioteko`ATLAS <https://math-atlas.sourceforge.net/>`__ por BLAS/LAPACK, kiu nur uzas la instrukciojn SSE2 kaj tial povas esti neoptimuma pri lineara algebro.
ja: Numpy のバージョン 1.10.4 および SciPy のバージョン 1.0.0 以降は、主要なオペレーティングシステム (WindowsとmacOSとLinux)向けに32 ビットと 64 ビットのビルド済みバイナリが ``wheel`` 形式でPyPIに準備されています。ただ、Windowsでは、SSE2命令セットに限定された `ATLAS <https://math-atlas.sourceforge.net/>`__ BLAS/LAPACK ライブラリに NumPy がリンクされているので、線形代数のパフォーマンスが最適化されていない可能性があります。
ru: Начиная с версии 1.10.4 NumPy и версии 1.0.0 SciPy, на PyPI доступны предварительно собранные 32- и 64-битные двоичные файлы в формате ``колеса'' для всех основных операционных систем (Windows, macOS и Linux). Обратите внимание, однако, что в Windows двоичные файлы NumPy скомпонованы с библиотекой BLAS/LAPACK `ATLAS <https://math-atlas.sourceforge.net/>`__, ограниченной инструкциями SSE2, поэтому они могут не обеспечивать оптимальную производительность линейной алгебры.
ta: `` வீல்`` வடிவத்தில் முன்பே கட்டப்பட்ட 32-பிட் மற்றும் 64-பிட் பைனரிகள் அனைத்து முக்கிய இயக்க முறைமைகளுக்கும் (விண்டோச், மேகோச் மற்றும் லினக்ச்) கிடைக்கின்றன பைபியில். இருப்பினும், சாளரங்களில், நம்பி பைனரிகள் `அட்லச் <https://math-atlas.sourceforge.net/> __ __ பிளாச்/லேபாக் நூலகம், எச்எச்இ 2 வழிமுறைகளுக்கு கட்டுப்படுத்தப்பட்டுள்ளன, எனவே அவை உகந்த நேரியல் இயற்கணிதத்தை வழங்காது செயல்திறன்.
