Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If this key is missing then the metadata file may or may not exist. If the key value is truthy, then the metadata file is present, and if it is falsey then it is not.
eo: Se tiu ŝlosilo mankas, la metadateno-dosiero povas ekzisti aŭ ne. Se la ŝlosila valoro estas vereca, la metadateno-dosiero ekzistas; se la ŝlosila valoro estas malvereca, la metadateno-dosiero mankas.
ja: このキーがない場合には、メタデータファイルが存在するかもしれませんし、存在しないかもしれません。このキーの値が真である場合はメタデータファイルが存在し、値が偽の場合には存在しません。
ru: Если этот ключ отсутствует, то файл метаданных может существовать, а может и не существовать. Если значение ключа истинно, то файл метаданных присутствует, а если ложно, то нет.
ta: இந்த விசை காணவில்லை என்றால், மேனிலை தரவு கோப்பு இருக்கலாம் அல்லது இல்லாமல் இருக்கலாம். முக்கிய மதிப்பு உண்மையாக இருந்தால், மேனிலை தரவு கோப்பு உள்ளது, அது பொய்யானது என்றால் அது இல்லை.

source: It is recommended that servers make the hashes of the metadata file available if possible.
eo: Estas rekomendate, ke serviloj disponigu la haketaĵojn de la metadateno-dosiero, se tio eblas.
ja: サーバ群は、可能であれば、メタデータファイルのハッシュを利用可能とすることが推奨されています。
ru: Рекомендуется, чтобы серверы по возможности предоставляли хэши файлов метаданных.
ta: சேவையகங்கள் மேனிலை தரவு கோப்பின் ஆச்களை முடிந்தால் கிடைக்கச் செய்ய பரிந்துரைக்கப்படுகிறது.

source: ``gpg-sig``: An **optional** key that acts a boolean to indicate if the file has an associated GPG signature or not. The URL for the signature file follows what is specified in :ref:`the base HTML API specification <simple-repository-api-base>` (``{file_url}.asc``). If this key does not exist, then the signature may or may not exist.
ja: ``gig-sig``: **オプション** のキーで、当該ファイルに GPG 署名が付属しているか否かを示すブーリアン。署名ファイルへの URL は、 :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` で指定されたもの (``{file_url}.asc``) に従います。このキーが存在しない場合は、署名はあるかもしれませんし、ないかもしれません。
ru: ``gpg-sig``: **опциональный** ключ, который представляет собой булево значение, указывающее, есть ли у файла связанная с ним подпись GPG или нет. URL для файла подписи соответствует тому, что указано в : ссылка:``базовой спецификации HTML API <простой репозиторий-апи-база>`` (``{файл_url}.asc``). Если этот ключ не существует, то подпись может существовать, а может и не существовать.
ta: `` gpg-sig``: கோப்பில் தொடர்புடைய சிபிசி கையொப்பம் உள்ளதா இல்லையா என்பதைக் குறிக்க ஒரு பூலியன் செயல்படும் ஒரு ** விருப்ப ** விசை. கையொப்பக் கோப்பிற்கான முகவரி இதில் குறிப்பிடப்பட்டுள்ளதைப் பின்பற்றுகிறது: ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <Simmer-repository-api-base>` (`{file_url} .asc``). இந்த விசை இல்லை என்றால், கையொப்பம் இருக்கலாம் அல்லது இல்லாமல் இருக்கலாம்.

source: ``provenance``: An **optional** key which, if present **MUST** be either a JSON string or ``null``. If not ``null``, it **MUST** be a URL to the file's associated provenance, with the same rules as ``data-provenance`` in the :ref:`base HTML API specification <simple-repository-api-base>`.
eo: ``provenance``: **Nedeviga** ŝlosilo, kiu (se ĝi ekzistas) **DEVAS** esti aŭ JSON-signoĉeno aŭ ``null``. Se ĝi ne estas ``null``, ĝi **DEVAS** esti retadreso de la originpruvo asociita al la dosiero, kun la samaj reguloj kiel ``data-provenance`` en la :ref:`normo pri la baza HTML API <simple-repository-api-base>`.
ru: ``provenance``: **опциональный** ключ, который, если присутствует, **ДОЛЖЕН** быть либо строкой JSON, либо ``null``. Если не ``null``, то **ДОЛЖЕН** быть URL-адресом связанного с файлом провенанса, по тем же правилам, что и ``data-provenance`` в спецификации HTML API <simple-repository-api-base>` в :ref:`base HTML API`.
ta: `` ஆதாரம்``: ஒரு ** விருப்ப ** விசை, இது இருந்தால் ** ** ** ஒரு சாதொபொகு சரம் அல்லது `` null``. `` Null`` இல்லையென்றால், அது ** ** கோப்பின் தொடர்புடைய ஆதாரத்திற்கு ஒரு முகவரி ஆக இருக்க வேண்டும், இதில் `` தரவு-முன்னேற்றம்`` போன்ற விதிமுறைகள்: rew: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <Simme-repository-api-base>`.

source: While the ``files`` key is an array, and thus is required to be in some kind of an order, neither :ref:`the base HTML API specification <simple-repository-api-base>` nor this spec requires any specific ordering nor that the ordering is consistent from one request to the next. Mentally this is best thought of as a set, but both JSON and HTML lack the functionality to have sets.
eo: Kvankam la ŝlosilo ``files`` estas listo kaj tial devas esti ordita, nek :ref:`la baza normo de HTML API <simple-repository-api-base>` nek ĉi tiu normo postulas ian specifan ordon aŭ postulas, ke la ordo restu sama inter petoj. Oni rigardu tion kiel aron, sed nek JSON nek HTML kapablas prezenti aron.
ja: ``files`` キーは配列なのである種の順序があることが要求される一方で、 :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` にもこの仕様にも、特定の順序付けも要求されていませんし、あるリクエストと次のそれの間で順序が保たれるということも要求されていません。心情としては、これは集合であると考えるのが最適ですが、JSON にも HTML にも集合を扱う機能は欠落しています。
ru: Хотя ключ ``файлы`` является массивом и, следовательно, должен быть расположен в определенном порядке, ни : ссылка:``базовая спецификация HTML API <простой репозиторий-апи-база>``, ни эта спецификация не требуют какого-либо определенного порядка, а также того, чтобы порядок был последовательным от одного запроса к другому. Мысленно это лучше всего воспринимать как набор, но и JSON, и HTML не имеют функциональности для создания наборов.
ta: `` கோப்புகள்` `விசை ஒரு வரிசை, இதனால் ஒருவித வரிசையில் இருக்க வேண்டும், எதுவும் இல்லை: ref:` அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <எளிய-ரோபோசிட்டரி-API-BASE> `அல்லது இந்த விவரக்குறிப்புக்கு ஏதேனும் குறிப்பிட்ட வரிசைப்படுத்தல் தேவைப்படுகிறது அல்லது வரிசைப்படுத்துதல் ஒரு கோரிக்கையிலிருந்து அடுத்ததாக ஒத்துப்போகிறது. மனரீதியாக இது ஒரு தொகுப்பாக சிறந்ததாக கருதப்படுகிறது, ஆனால் சாதொபொகு மற்றும் உஉகுமொ இரண்டுமே தொகுப்புகளைக் கொண்டிருப்பதற்கான செயல்பாட்டைக் கொண்டிருக்கவில்லை.

source: Content-Types
ru: Контент-Типы
ta: உள்ளடக்க வகைகள்

source: This spec proposes that all responses from the Simple API will have a standard content type that describes what the response is (a Simple API response), what version of the API it represents, and what serialization format has been used.
eo: Ĉi tiu normo proponas, ke ĉiuj respondoj de la Simpla API havos norman enhavtipon priskribantan kio la respondo estas (respondo de Simpla API), kiun version de la API ĝi uzas, kaj kiun seriigan formon ĝi uzas.
ja: この仕様では、シンプル API からの応答はすべて、その応答が何であるか (シンプル API からの応答である) 、どのバージョンの API を表現しているか、また、使われているシリアル化フォーマットは何であるかを記述する標準のコンテント型を持ちます。
ru: В этой спецификации предлагается, чтобы все ответы от простого API имели стандартный тип содержимого, который описывает, что представляет собой ответ (ответ простого API), какую версию API он представляет и какой формат сериализации был использован.
ta: எளிய பநிஇ இன் அனைத்து பதில்களுக்கும் ஒரு நிலையான உள்ளடக்க வகை இருக்கும் என்று இந்த விவரக்குறிப்பு முன்மொழிகிறது, இது பதில் என்ன என்பதை விவரிக்கும் (ஒரு எளிய பநிஇ பதில்), இது பநிஇ இன் எந்த பதிப்பைக் குறிக்கிறது, மற்றும் சீரியலைசேசன் வடிவம் என்ன பயன்படுத்தப்பட்டுள்ளது.

source: The structure of this content type will be:
eo: La strukturo de ĉi tiu enhavtipo estos:
ja: このコンテント型の構造はこのようになっていることでしょう:
ru: Структура этого типа содержимого будет следующей:
ta: இந்த உள்ளடக்க வகையின் கட்டமைப்பு:

source: Since only major versions should be disruptive to clients attempting to understand one of these API responses, only the major version will be included in the content type, and will be prefixed with a ``v`` to clarify that it is a version number.
ja: これらの API からの応答のうちのひとつをクライアントが理解しようと試みる際には、メジャーバージョンだけが継続不可能にするものであるべきなので、メジャーバージョンだけがコンテント型に含まれるでしょうし、それがバージョン番号であることを明確にするために前に ``v`` をつけられることになるでしょう。
ru: Поскольку только основные версии должны быть опасны для клиентов, пытающихся понять один из этих ответов API, только основная версия будет включена в тип содержимого и будет снабжена префиксом ``v``, чтобы пояснить, что это номер версии.
ta: இந்த பநிஇ பதில்களில் ஒன்றைப் புரிந்துகொள்ள முயற்சிக்கும் வாடிக்கையாளர்களுக்கு பெரிய பதிப்புகள் மட்டுமே சீர்குலைக்கப்பட வேண்டும் என்பதால், முக்கிய பதிப்பு மட்டுமே உள்ளடக்க வகையில் சேர்க்கப்படும், மேலும் இது ஒரு பதிப்பு எண் என்பதை தெளிவுபடுத்துவதற்கு `` வி`` உடன் முன்னொட்டு இருக்கும்.

source: Which means that for the existing 1.0 API, the content types would be:
eo: Tio signifas, ke por la ekzistanta API 1.0, la enhavtipoj estus:
ja: ということは、既存の 1.0 API においては、コンテント型はこのようになるでしょう:
ru: Это означает, что для существующего API 1.0 типы содержимого будут такими:
ta: இதன் பொருள் தற்போதுள்ள 1.0 பநிஇ க்கு, உள்ளடக்க வகைகள் இருக்கும்:

source: **HTML:** ``application/vnd.pypi.simple.v1+html``
ru: **HTML:** ``приложение/vnd.pypi. простой.v1+html``
ta: ** html: ** `` பயன்பாடு/vnd.pypi.simple.v1+html``

source: In addition to the above, a special "meta" version is supported named ``latest``, whose purpose is to allow clients to request the absolute latest version, without having to know ahead of time what that version is. It is recommended however, that clients be explicit about what versions they support.
ja: 上記に加えて、特別な "meta" バージョンが ``latest`` という名前でサポートされており、その目的はクライアントが完全に最新のバージョンをリクエストすることを許すためであり、そのバージョンが何であるかを前もって知ることを不要にするためです。しかしながら、クライアントは自身がどのバージョンをサポートしているのかを明示的に示すことが推奨されています。
ru: В дополнение к вышесказанному поддерживается специальная "мета" версия под названием ``последний``, цель которой - позволить клиентам запрашивать абсолютно последнюю версию, без необходимости заранее знать, что это за версия. Рекомендуется, однако, чтобы клиенты четко указывали, какие версии они поддерживают.
ta: மேற்கூறியவற்றைத் தவிர, ஒரு சிறப்பு "மேவு" பதிப்பு `` சமீபத்திய`` என்று பெயரிடப்பட்டது, இதன் நோக்கம் வாடிக்கையாளர்களுக்கு முழுமையான அண்மைக் கால பதிப்பைக் கோர அனுமதிப்பதாகும், அந்த பதிப்பு என்ன என்பதை நேரத்திற்கு முன்பே தெரிந்து கொள்ளாமல். எவ்வாறாயினும், வாடிக்கையாளர்கள் அவர்கள் எந்த பதிப்புகளை ஆதரிக்கிறார்கள் என்பது குறித்து வெளிப்படையாக இருக்க பரிந்துரைக்கப்படுகிறது.

source: To support existing clients which expect the existing :ref:`the base HTML API specification <simple-repository-api-base>` API responses to use the ``text/html`` content type, this spec further defines ``text/html`` as an alias for the ``application/vnd.pypi.simple.v1+html`` content type.
eo: Por ekzistanta kliento atendanta la ekzistantan API-respondon de :ref:`la normo pri baza HTML API <simple-repository-api-base>` uzantan la enhavtipon ``text/html``, ĉi tiu normo difinas ``text/html`` kiel sinonimon de la enhavtipo ``application/vnd.pypi.simple.v1+html`` .
ja: 既存の :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` の API 応答が ``text/html`` コンテント型を使うことを期待している既存のクライアント群をサポートするために、この仕様では、さらに、 ``text/html`` を ``application/vnd.pypi.simple.v1+html`` コンテント型へのエイリアスであると定義しています。
ru: Для поддержки существующих клиентов, которые ожидают, что существующие : ссылка:`базовая спецификация HTML API <простой репозиторий-апи-база>` ответы API будут использовать тип содержимого ``текст/html``, эта спецификация далее определяет ``текст/html`` как псевдоним для типа содержимого ``приложение/vnd.pypi. простой.v1+html``.
ta: தற்போதுள்ள வாடிக்கையாளர்களை ஆதரிக்க: Ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <Simple-reposition-api-base>` `உரை/HTML`` உள்ளடக்க வகையைப் பயன்படுத்த பநிஇ பதில்கள், இந்த விவரக்குறிப்பு` `` உரை/html`` `` `` `` `conternt.

source: Version + Format Selection
eo: Elektado de Versio kaj Dosierformo
ja: バージョン + フォーマットの選択
ru: Выбор версии + формата
ta: பதிப்பு + வடிவமைப்பு தேர்வு

source: Now that there is multiple possible serializations, we need a mechanism to allow clients to indicate what serialization formats they're able to understand. In addition, it would be beneficial if any possible new major version to the API can be added without disrupting existing clients expecting the previous API version.
ja: 今や複数の可能なシリアル化が存在するので、クライアント群がどのシリアル化フォーマットであれば理解できるのかを示すことができるようにする必要があります。加えて、以前の API バージョンを期待している既存のクライアント群の妨げとなることなしに、どんな API の可能な新しいメジャーバージョンでも追加することができれば利益があることでしょう。
ru: Теперь, когда существует множество возможных сериализаций, нам нужен механизм, позволяющий клиентам указывать, какие форматы сериализации они способны понимать. Кроме того, было бы полезно, если бы любая возможная новая основная версия API могла быть добавлена без нарушения работы существующих клиентов, ожидающих предыдущую версию API.
ta: இப்போது பல சாத்தியமான சீரியலைசேசன்கள் இருப்பதால், வாடிக்கையாளர்களுக்கு அவர்கள் புரிந்து கொள்ளக்கூடிய சீரியலைசேசன் வடிவங்களைக் குறிக்க அனுமதிக்க எங்களுக்கு ஒரு வழிமுறை தேவை. கூடுதலாக, முந்தைய பநிஇ பதிப்பை எதிர்பார்க்கும் வாடிக்கையாளர்களுக்கு இடையூறு விளைவிக்காமல் பநிஇ க்கு சாத்தியமான புதிய முக்கிய பதிப்பைச் சேர்க்க முடிந்தால் அது நன்மை பயக்கும்.

source: To enable this, this spec standardizes on the use of HTTP's `Server-Driven Content Negotiation <https://developer.mozilla.org/en-US/docs/Web/HTTP/Content_negotiation>`_.
eo: Por ebligi tion, ĉi tiu specifo normigas la uzadon de la `Servila Enhavo-Marĉandado de HTTP <https://developer.mozilla.org/en-US/docs/Web/HTTP/Content_negotiation>`_.
ja: これを可能にするために、この仕様では、 HTTP の `サーバ主導のコンテントネゴシエーション <https://developer.mozilla.org/en-US/docs/Web/HTTP/Content_negotiation>`_ の使用を標準化します。
ru: Чтобы сделать это, данная спецификация стандартизирует использование HTTP `Серверного согласования содержимого` (Server-Driven Content Negotiation) <https://developer.mozilla.org/en-US/docs/Web/HTTP/Content_negotiation>`_.
ta: இதை இயக்க, இந்த விவரக்குறிப்பு HTTP இன் `சேவையகத்தால் இயக்கப்படும் உள்ளடக்க பேச்சுவார்த்தை <https://developer.mozilla.org/en-us/docs/web/http/content_negotiation> _ _.

source: While this spec won't fully describe the entirety of server-driven content negotiation, the flow is roughly:
eo: Dum ĉi tiu specifo ne plene priskribas servilan enhavo-marĉandadon, la fluo estas proksimume jena:
ja: この仕様では、サーバ主導のコンテントネゴシエーションについて完全にすべてを記述することはありませんが、流れは大まかに次のようになります:
ru: Хотя эта спецификация не может полностью описать всю процедуру согласования содержимого на сервере, ее суть примерно такова:
ta: இந்த விவரக்குறிப்பு சேவையகத்தால் இயக்கப்படும் உள்ளடக்க பேச்சுவார்த்தை முழுவதையும் முழுமையாக விவரிக்காது என்றாலும், ஓட்டம் தோராயமாக:

source: The client makes an HTTP request containing an ``Accept`` header listing all of the version+format content types that they are able to understand.
eo: La kliento sendas HTTP-peton enhavantan ĉapon ``Accept`` listigantan ĉiujn enhavtipojn de la formo versio+formo komprenatajn de la kliento.
ja: 理解できるコンテント型を全て``Accept`` ヘッダに列挙した HTTP リクエストをクライアントが作成します。
ru: Клиент отправляет HTTP-запрос, содержащий заголовок ``Принять``, в котором перечислены все типы содержимого версии+формата, которые он способен понять.
ta: கிளையன்ட் ஒரு `` ஏற்றுக்கொள்` தலைப்பு கொண்ட ஒரு HTTP கோரிக்கையை அவர்கள் புரிந்து கொள்ளக்கூடிய அனைத்து பதிப்பு+வடிவமைப்பு உள்ளடக்க வகைகளையும் பட்டியலிடுகிறது.

source: The server inspects that header, selects one of the listed content types, then returns a response using that content type (treating the absence of an ``Accept`` header as ``Accept: */*``).
eo: La servilo ekzamenas tiun ĉapon, elektas unu el la enhavtipoj en la listo, kaj liveras respondon de tiu enhavtipo (la manko de ĉapo ``Accept`` estas ekvivalenta al ``Accept: */*``).
ja: サーバはそのヘッダを検証して、列挙されたコンテント型からひとつを選択して、そのコンテント型を使って応答を返します (``Accept`` ヘッダが欠落している場合は ``Accept: */*`` であるものとして扱います) 。
ru: Сервер проверяет этот заголовок, выбирает один из перечисленных типов содержимого, затем возвращает ответ, используя этот тип содержимого (рассматривая отсутствие заголовка ``принять`` как ``принять: */*``).
ta: சேவையகம் அந்த தலைப்பை ஆய்வு செய்கிறது, பட்டியலிடப்பட்ட உள்ளடக்க வகைகளில் ஒன்றைத் தேர்ந்தெடுக்கிறது, பின்னர் அந்த உள்ளடக்க வகையைப் பயன்படுத்தி ஒரு பதிலை வழங்குகிறது (`` ஏற்றுக்கொள்` தலைப்பு `` ஏற்றுக்கொள்: */ *``).

source: If the server does not support any of the content types in the ``Accept`` header then they are able to choose between 3 different options for how to respond:
eo: Se la servilo ne subtenas iun ajn el la enhavtipoj en la ĉapo ``Accept``, ĝi povas elekti inter la jenaj tri opcioj:
ja: ``Accept`` ヘッダにあるコンテント型のいずれもサーバがサポートしていない場合には、どのように応答するかについてサーバは３個の異なるオプションから選択することができます:
ru: Если сервер не поддерживает ни один из типов содержимого в заголовке ``принять``, он может выбрать один из 3 вариантов ответа:
ta: `` ஏற்றுக்கொள்` தலைப்பில் உள்ள எந்த உள்ளடக்க வகைகளையும் சேவையகம் ஆதரிக்கவில்லை என்றால், அவர்கள் எவ்வாறு பதிலளிக்க வேண்டும் என்பதற்கான 3 வெவ்வேறு விருப்பங்களுக்கு இடையில் அவர்கள் தேர்வு செய்ய முடியும்:

source: Select a default content type other than what the client has requested and return a response with that.
eo: Elekti aprioran enhavtipon alian ol tiujn petitajn de la kliento kaj liveri tian respondon.
ja: クライアントが要求したものではないデフォルトのコンテント型を選択して、それを使って応答を返すこと。
ru: Выберите тип содержимого по умолчанию, отличный от того, что запросил клиент, и верните ответ с этим типом.
ta: கிளையன்ட் கோரியதைத் தவிர வேறு இயல்புநிலை உள்ளடக்க வகையைத் தேர்ந்தெடுத்து, அதனுடன் பதிலைத் தரவும்.

source: Return a HTTP ``406 Not Acceptable`` response to indicate that none of the requested content types were available, and the server was unable or unwilling to select a default content type to respond with.
eo: Liveri HTTP-respondon ``406 Ne Akceptebla`` por sciigi, ke neniu el la petitaj enhavtipoj estis disponeblaj, kaj la servilo ne volis aŭ ne povis elekti aprioran respondan enhavtipon.
ja: HTTP の ``406 Not Acceptable`` 応答を返すことで、要求されたコンテント型の中に利用可能なものがないことを示し、サーバとしてはデフォルトのコンテント型を選択して応答することができないかしたくないことを示すこと。
ru: Возвращает ответ HTTP ``406 Неприемлемо``, указывающий на то, что ни один из запрошенных типов содержимого не был доступен, и сервер не смог или не захотел выбрать тип содержимого по умолчанию для ответа.
ta: கோரப்பட்ட உள்ளடக்க வகைகள் எதுவும் கிடைக்கவில்லை என்பதைக் குறிக்க ஒரு HTTP `` 406 ஏற்றுக்கொள்ள முடியாதது `` பதிலைத் தரவும், மேலும் பதிலளிக்க இயல்புநிலை உள்ளடக்க வகையைத் தேர்ந்தெடுக்க சேவையகம் முடியவில்லை அல்லது விரும்பவில்லை.

source: Return a HTTP ``300 Multiple Choices`` response that contains a list of all of the possible responses that could have been chosen.
eo: Liveri HTTP-respondon ``300 Pluraj Opcioj`` enhavantan liston de ĉiuj eblaj respondoj, kiujn la kliento povas elekti.
ja: HTTP の ``300 Multiple Choices`` 応答を返して、選択できるかもしれないすべての可能な応答のリストを含めておくこと。
ru: Возвращает ответ HTTP ``300 Множество вариантов``, содержащий список всех возможных ответов, которые могли быть выбраны.
ta: ஒரு HTTP `` 300 பல தேர்வுகள்` `பதிலைத் தரவும், இது தேர்ந்தெடுக்கப்பட்ட சாத்தியமான அனைத்து பதில்களின் பட்டியலையும் கொண்டுள்ளது.

source: The client interprets the response, handling the different types of responses that the server may have responded with.
eo: La kliento interpretas la respondon, pritraktante tiujn diversajn specojn de respondoj, kiujn la servilo eble sendis.
ja: サーバが返すかもしれない異なる応答のタイプを取り扱ってクライアントは応答を解釈します。
ru: Клиент интерпретирует ответ, обрабатывая различные типы ответов, которые мог дать сервер.
ta: கிளையன்ட் பதிலை விளக்குகிறது, சேவையகம் பதிலளித்திருக்கக்கூடிய பல்வேறு வகையான பதில்களைக் கையாளுகிறது.

source: This spec does not specify which choices the server makes in regards to handling a content type that it isn't able to return, and clients **SHOULD** be prepared to handle all of the possible responses in whatever way makes the most sense for that client.
ja: この仕様は、あるコンテント型を取り扱うことについてサーバが行った選択のどれが (クライアントへ応答を) 返すことができないものであるかを指定しませんし、クライアント側がそのクライアントにとって最も意味を為す方法であればどんなものでも可能な応答の全てを取り扱う準備を **しておくべきだ** とは指定しません。
ru: В данной спецификации не указывается, какой выбор делает сервер в отношении обработки типа содержимого, который он не может вернуть, и клиенты **ДОЛЖНЫ** быть готовы обрабатывать все возможные ответы тем способом, который наиболее удобен для них.
ta: உள்ளடக்க வகையை திரும்பப் பெற முடியாத ஒரு உள்ளடக்க வகையை கையாள்வதில் சேவையகம் எந்தத் தேர்வுகளைச் செய்கிறது என்பதை இந்த விவரக்குறிப்பு குறிப்பிடவில்லை, மேலும் வாடிக்கையாளர்கள் ** சாத்தியமான எல்லா பதில்களையும் கையாளத் தயாராக இருக்க வேண்டும், அந்த கிளையண்டிற்கு எந்த வகையிலும் மிகவும் அர்த்தமுள்ளதாக இருக்கும்.

source: However, as there is no standard format for how a ``300 Multiple Choices`` response can be interpreted, this spec highly discourages servers from utilizing that option, as clients will have no way to understand and select a different content-type to request. In addition, it's unlikely that the client *could* understand a different content type anyways, so at best this response would likely just be treated the same as a ``406 Not Acceptable`` error.
ja: しかしながら、 ``300 Multiple Choices`` 応答がどのように解釈され得るかについて標準的なフォーマットは存在しないので、クライアント側が理解して要求するべき別のコンテント型を選択する手段がないので、この仕様ではサーバがこのオプションを採用することを強い非推奨にしています。加えて、クライアントが別のコンテント型を **理解できるであろう** とは思われず、したがって、この応答は ``406 Not Acceptable`` エラーと同じ扱いを受けるのが精々であろうと思われます。
ru: Однако, поскольку не существует стандартного формата для интерпретации ответа ``300 Много вариантов``, данная спецификация настоятельно не рекомендует серверам использовать эту опцию, поскольку у клиентов не будет возможности понять и выбрать другой тип содержимого для запроса. Кроме того, маловероятно, что клиент *может* понять другой тип содержимого в любом случае, так что в лучшем случае этот ответ будет рассматриваться так же, как и ошибка ``406 не принято``.
ta: எவ்வாறாயினும், ஒரு `` 300 பல தேர்வுகள்` `பதிலை எவ்வாறு விளக்க முடியும் என்பதற்கான நிலையான வடிவம் இல்லாததால், அந்த விருப்பத்தைப் பயன்படுத்துவதில் இருந்து சேவையகங்களை இந்த விவரக்குறிப்புகள் மிகவும் ஊக்கப்படுத்துகின்றன, ஏனெனில் வாடிக்கையாளர்களுக்கு கோரிக்கைக்கு வேறு உள்ளடக்க வகையைப் புரிந்துகொள்வதற்கும் தேர்ந்தெடுப்பதற்கும் வழி இருக்காது. கூடுதலாக, வாடிக்கையாளர் * எப்படியிருந்தாலும் வேறு உள்ளடக்க வகையைப் புரிந்து கொள்ள முடியும் என்பது சாத்தியமில்லை, எனவே சிறந்த முறையில் இந்த பதில் `` 406 ஏற்றுக்கொள்ள முடியாத `` பிழை போலவே கருதப்படும்.

source: This spec **does** require that if the meta version ``latest`` is being used, the server **MUST** respond with the content type for the actual version that is contained in the response (i.e. an ``Accept: application/vnd.pypi.simple.latest+json`` request that returns a ``v1.x`` response should have a ``Content-Type`` of ``application/vnd.pypi.simple.v1+json``).
ru: Эта спецификация **дополняет** требование, что если используется мета-версия ``latest``, сервер **ДОЛЖЕН** отвечать типом содержимого для фактической версии, которая содержится в ответе (т.е. запрос ``Accept: application/vnd.pypi.simple.latest+json``, который возвращает ответ ``v1.x'', должен иметь ``Content-Type`` из ``application/vnd.pypi.simple.v1+json``).
ta: இந்த ச்பெக் ** ** மேவு பதிப்பு `` சமீபத்திய`` பயன்படுத்தப்பட்டால், சேவையகம் ** பதிலில் உள்ள உண்மையான பதிப்பிற்கான உள்ளடக்க வகையுடன் ** பதிலளிக்க வேண்டும் (அதாவது ஒரு `` ஏற்றுக்கொள்ளுங்கள்: பயன்பாடு/vnd.pypi.simple.latest+json` `` `` `` `` `` `` `` ` `` பயன்பாடு/vnd.pypi.simple.v1+json```).

source: The ``Accept`` header is a comma separated list of content types that the client understands and is able to process. It supports three different formats for each content type that is being requested:
eo: La ĉapo ``Accept`` estas kome disigita listo de enhavtipoj komprenataj kaj pritrakteblaj de la kliento. Ĝu subtenas tri malsamjn formojn por ĉiu pripetata enhavtipo:
ja: ``Accept`` ヘッダは、クライアントが理解し処理することが可能なコンテント型をカンマで区切られたリストに列挙したものです。まさに要求されているところのコンテント型のそれぞれについて３個の異なるフォーマットをサポートしています:
ru: Заголовок ``Принять`` представляет собой разделенный запятыми список типов содержимого, которые клиент понимает и может обрабатывать. Он поддерживает три различных формата для каждого запрашиваемого типа содержимого:
ta: `` ஏற்றுக்கொள்` `தலைப்பு என்பது கிளையன்ட் புரிந்துகொள்ளும் மற்றும் செயலாக்கக்கூடிய உள்ளடக்க வகைகளின் கமாவைப் பிரித்த பட்டியல். கோரப்படும் ஒவ்வொரு உள்ளடக்க வகைக்கும் இது மூன்று வெவ்வேறு வடிவங்களை ஆதரிக்கிறது:
