Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Conceptually, a source distribution is an archive of the source code in raw form. Concretely, an sdist is a ``.tar.gz`` archive containing the source code plus an additional special file called ``PKG-INFO``, which holds the project metadata. The presence of this file helps packaging tools to be more efficient by not needing to compute the metadata themselves. The ``PKG-INFO`` file follows the format specified in :ref:`core-metadata` and is not intended to be written by hand [#core-metadata-format]_.
eo: Koncepte, fonta distribuo estas arĥivo de la fontkodo en kruda formo. Konkrete, fonta distribuo estas ``.tar.gz``-arĥivo enhavanta la fontkodon kun plia speciala dosiero nomita ``PKG-INFO``, kiu enhavas la projektajn metadatenojn. La ĉeesto de tiu dosiero helpas plirapidigi pakilojn, ĉar ne necesas rekomputi la metadatenojn. La dosiero ``PKG-INFO`` sekvas la formon specifitan en :ref:`core-metadata` kaj ne estas malaŭtomate verkinda [#core-metadata-format]_.
ja: 概念としては、ソースコード配布物は生の形のソースコードをアーカイブしたものです。具体的に言うと、sdist は、ソースコードに加えて、プロジェクトのメタデータを保持する ``PKG-INFO`` と言う名の特別なファイルをアーカイブした ``.tar.gz`` ファイルです。このファイルの存在によってメタデータを自分自身で計算しなくても済むようにすることでパッケージングツール群を補助しています。 ``PKG-INFO`` ファイルは、 :ref:`コアとなるメタデータ <core-metadata>` で指定されたフォーマットに従うもので、人の手で書くことが想定されていないものです [#core-metadata-format]_ 。
pt_br: Conceitualmente, uma distribuição fonte é um arquivo do código-fonte em formato bruto. Concretamente, um sdist é um arquivo ``.tar.gz`` contendo o código-fonte mais um arquivo especial adicional chamado ``PKG-INFO``, que contém os metadados do projeto. A presença desse arquivo ajuda as ferramentas de empacotamento a serem mais eficientes, pois não precisam calcular os próprios metadados. O arquivo ``PKG-INFO`` segue o formato especificado em :ref:`core-metadata` e não se destina a ser escrito à mão [#core-metadata-format]_.
ru: Концептуально, дистрибутив исходного кода - это архив с исходным кодом в сыром виде. Конкретно, sdist - это архив ``.tar.gz``, содержащий исходный код плюс дополнительный специальный файл ``PKG-INFO``, который содержит метаданные проекта. Наличие этого файла помогает инструментам упаковки быть более эффективными, поскольку им не нужно самим вычислять метаданные. Файл ``PKG-INFO`` имеет формат, указанный в :ref:`core-metadata`` и не предназначен для написания вручную [#core-metadata-format]_.
ta: கருத்தியல் ரீதியாக, ஒரு மூல வழங்கல் என்பது மூல வடிவத்தில் உள்ள மூலக் குறியீட்டின் காப்பகமாகும். இணக்கமாக, ஒரு SDIST என்பது மூலக் குறியீட்டைக் கொண்ட `` .tar.gz`` காப்பகமாகும், மேலும் திட்ட மெட்டாடேட்டாவை வைத்திருக்கும் `` pkg-info`` எனப்படும் கூடுதல் சிறப்புக் கோப்பு. இந்த கோப்பின் இருப்பு மெட்டாடேட்டாவைக் கணக்கிடத் தேவையில்லை என்பதன் மூலம் பேக்கேசிங் கருவிகளை மிகவும் திறமையாக இருக்க உதவுகிறது. `` பி.கே.சி-இன்ஃபோ`` கோப்பு குறிப்பிடப்பட்ட வடிவமைப்பைப் பின்பற்றுகிறது: குறிப்பு: `கோர்-மெட்டாடேட்டா` மற்றும் கையால் எழுதப்பட விரும்பவில்லை [#கோர்-மெட்டாடேட்டா-வடிவ] _.

source: You can thus inspect the contents of an sdist by unpacking it using standard tools to work with tar archives, such as ``tar -xvf`` on UNIX platforms (like Linux and macOS), or :ref:`the command line interface of Python's tarfile module <python:tarfile-commandline>` on any platform.
eo: Tial, vi povas inspekti la enhavon de fonta distribuo maldensigante ĝin per normaj enarĥivigiloj kiel ``tar -xvf`` ĉe Unikso (kiel Linux kaj macOS) aŭ :ref:`la komandlinia interfaco de la Python-modulo tarfile <python:tarfile-commandline>` ĉe ajna platformo.
ja: 従って、tar アーカイブを扱える標準的なツール、例えば UNIX プラットフォーム (Linux や macOS) 上の ``tar -xvf`` や任意のプラットフォーム上の :ref:`Python の tarfile モジュールのコマンドラインインターフェース <python:tarfile-commandline>` を使ってアンパックすることで、ある sdist の内容を検査することができます。
pt_br: Você pode, portanto, operar o conteúdo de um sdist descompactando-o usando ferramentas padrão para trabalhar com arquivos tar, como ``tar -xvf`` em plataformas UNIX (como Linux e macOS), ou :ref:`a interface de linha de comando do módulo tarfile do Python <python:tarfile-commandline>` em qualquer plataforma.
ru: Таким образом, вы можете проверить содержимое sdist, распаковав его с помощью стандартных инструментов для работы с tar-архивами, таких как ``tar -xvf`` на платформах UNIX (например, Linux и macOS), или :ref:``интерфейс командной строки модуля Python's tarfile <python:tarfile-commandline>` на любой платформе.
ta: யுனிக்ச் இயங்குதளங்களில் (லினக்ச் மற்றும் மேகோச் போன்றவை) `` கரிக்கீல் -xvf`` போன்ற தார் காப்பகங்களுடன் பணிபுரிய நிலையான கருவிகளைப் பயன்படுத்தி ஒரு SDIST இன் உள்ளடக்கங்களை நீங்கள் ஆய்வு செய்யலாம், OR: ref: `இன் கட்டளை வரி இடைமுகம் பைத்தானின் டார்ஃபைல் தொகுதி <பைதான்: டார்ஃபைல்-கமாண்ட்லைன்> `எந்த தளத்திலும்.

source: Sdists serve several purposes in the packaging ecosystem. When :ref:`pip`, the standard Python package installer, cannot find a wheel to install, it will fall back on downloading a source distribution, compiling a wheel from it, and installing the wheel. Furthermore, sdists are often used as the package source by downstream packagers (such as Linux distributions, Conda, Homebrew and MacPorts on macOS, ...), who, for various reasons, may prefer them over, e.g., pulling from a Git repository.
eo: Fonta distribuo servas plurajn celojn en la pakada ekosistemo. Kiam :ref:`pip`, la norma Python-pakinstalilo, ne povas trovi instaleblan wheel, ĝi elŝutos fontan distribuon, konstruos wheel de ĝi, kaj instalos la wheel. Krome, fonta distribuo ofte estas uzata kiel la paka fonto far subpakantoj (kiel ekzemple Linux-distribuoj, Conda, Homebrew kaj MacPorts sur macOS, …) , kiuj, pro diversaj kialoj, eble preferas fontan distribuon ol interalie la Git-deponejon.
ja: sdist は、パッケージングのエコシステムの中でいくつかの目的のために使用されます。Python パッケージインストーラの標準である :ref:`pip` がインストールするべき wheel を見つけられない時にソースコード配布物をダウンロードしてそこから wheel をコンパイルし、その wheel をインストールするようにフォールバックすることでしょう。さらに、さまざまな理由で例えば Git リポジトリからプルすることなどよりも (sdist を) 好むダウンストリームパッケージ (Linux ディストリビューション、 Conda 、 macOS 上の Homebrew や MacPorts など ...)にとってのパッケージソースとしてしばしば sdist が使われます。
pt_br: Os sdists servem a vários propósitos no ecossistema de embalagens. Quando :ref:`pip`, o instalador padrão do pacote Python, não consegue encontrar um wheel para instalar, ele recorrerá ao download de uma distribuição fonte, compilando um wheel a partir dela e instalando o wheel. Além disso, os sdists são frequentemente usados como fonte de pacote por empacotadores downstream (como distribuições Linux, Conda, Homebrew e MacPorts no macOS, ...), que, por vários motivos, podem preferi-los, por exemplo, extraindo de um repositório Git.
ru: Sdists служат нескольким целям в экосистеме упаковки. Когда :ref:`pip`, стандартная программа установки пакетов Python, не может найти колесо для установки, она прибегает к загрузке исходного дистрибутива, компиляции колеса из него и установке колеса. Кроме того, sdists часто используются в качестве источника пакетов последующими упаковщиками (например, дистрибутивами Linux, Conda, Homebrew и MacPorts для macOS, ...), которые по разным причинам могут предпочесть их, например, извлечению из Git-репозитория.
ta: SDISTS பேக்கேசிங் சுற்றுச்சூழல் அமைப்பில் பல நோக்கங்களுக்காக பணி செய்கிறது. எப்போது: ref: `பிப்`, நிலையான பைதான் தொகுப்பு நிறுவி, நிறுவ ஒரு சக்கரத்தைக் கண்டுபிடிக்க முடியவில்லை, அது ஒரு மூல விநியோகத்தைப் பதிவிறக்குவது, அதிலிருந்து ஒரு சக்கரத்தை தொகுத்தல் மற்றும் சக்கரத்தை நிறுவுதல் ஆகியவற்றில் மீண்டும் விழும். மேலும், SDISTS பெரும்பாலும் கீழ்நிலை பேக்கேசர்களால் (லினக்ச் விநியோகங்கள், கான்டா, ஓம் ப்ரூ மற்றும் மேக்போர்ட் போன்றவை, ...) தொகுப்பு மூலமாகப் பயன்படுத்தப்படுகின்றன, பல்வேறு காரணங்களுக்காக, அவற்றை விரும்பலாம், எ.கா., ஒரு அறிவிலி களஞ்சியத்திலிருந்து இழுக்கலாம் .

source: A source distribution is recognized by its file name, which has the form :samp:`{package_name}-{version}.tar.gz`, e.g., ``pip-23.3.1.tar.gz``.
eo: Fonta distribuo estas rekonata per ĝia dosiernomo de la formo :samp:`{paknomo}-{versio}.tar.gz`, ekz. ``pip-23.3.1.tar.gz``.
ja: ソースコード配布物は、 :samp:`{package_name}-{version}.tar.gz` の形、例えば ``pip-23.3.1.tar.gz`` のファイル名で識別されます。
pt_br: Uma distribuição fonte é reconhecida pelo seu nome de arquivo, que tem o formato :samp:`{nome_do_pacote}-{versão}.tar.gz`, por exemplo, ``pip-23.3.1.tar.gz``.
ru: Исходный дистрибутив распознается по имени файла, которое имеет вид :samp:`{имя_пакета}-{версия}.tar.gz`, например, ``pip-23.3.1.tar.gz``.
ta: ஒரு மூல வழங்கல் அதன் கோப்பு பெயரால் அங்கீகரிக்கப்பட்டுள்ளது, அதில் படிவம் உள்ளது: SAMP: `{package_name}-{version} .tar.gz`, எ.கா.

source: If you want technical details on the sdist format, read the :ref:`sdist specification <source-distribution-format>`.
eo: Se vi deziras teĥnikajn detalojn pri la fontdistribua dosierformo, legu :ref:`la specifon pri fontaj distribuoj <source-distribution-format>`.
ja: sdist 形式の技術的な詳細を知りたければ、 :ref:`sdist 仕様 <source-distribution-format>` を見てください。
pt_br: Se você quiser detalhes técnicos sobre o formato sdist, leia a :ref:`especificação de sdist <source-distribution-format>`.
ru: Если вам нужны технические подробности о формате sdist, прочитайте спецификацию :ref:`sdist <source-distribution-format>`.
ta: SDIST வடிவத்தில் தொழில்நுட்ப விவரங்களை நீங்கள் விரும்பினால், அதைப் படியுங்கள்: Ref: `SDIST விவரக்குறிப்பு <மூல-விநியோக வடிவங்கள்>`.

source: What is a wheel?
eo: Kio estas wheel?
ja: wheel とは何か？
pt_br: O que é um wheel?
ru: Что такое колесо?
ta: சக்கரம் என்றால் என்ன?

source: Conceptually, a wheel contains exactly the files that need to be copied when installing the package.
eo: Koncepte, wheel enhavas precize tiujn dosierojn, kiuj devas esti kopiitaj dum instalado de la pako.
ja: 概念としては、 wheel は、パッケージをインストールする際にコピーされる必要のあるファイル群をそのまま含んでいるものです。
pt_br: Conceitualmente, um wheel contém exatamente os arquivos que precisam ser copiados durante a instalação do pacote.
ru: Концептуально, колесо содержит именно те файлы, которые необходимо скопировать при установке пакета.
ta: கருத்தியல் ரீதியாக, ஒரு சக்கரத்தில் தொகுப்பை நிறுவும் போது நகலெடுக்க வேண்டிய கோப்புகள் சரியாக உள்ளன.

source: There is a big difference between sdists and wheels for packages with :term:`extension modules <extension module>`, written in compiled languages like C, C++ and Rust, which need to be compiled into platform-dependent machine code. With these packages, wheels do not contain source code (like C source files) but compiled, executable code (like ``.so`` files on Linux or DLLs on Windows).
eo: Ekzistas granda diferenco inter fontaj distribuoj kaj wheel-oj por pakoj kun :term:`etendaj moduloj <extension module>`, verkitaj en tradukendaj lingvoj kiel C, C++ kaj Rust, kiuj devas esti tradukitaj al platformodependaj maŝinkodoj. Je tia pako, wheel ne enhavas fontkodon (kiel C-fontdosieron), sed enhavas tradukitan, ruleblan kodon (kiel la ``.so``-dosierojn ĉe Linux aŭ DLL ĉe Windows).
ja: プラットフォームに依存した機械語にコンパイルする必要がある C や C++ や Rust のようなコンパイル言語で書かれた :term:`拡張モジュール <extension module>` を伴うパッケージにおいては、sdist と wheel の間には大きな違いがあります。このようなパッケージでは、 wheel は (C言語のソースのような) ソースコードを内包しておらず、代わりに (Linux における ``.so`` ファイルや Windows における DLL のような) コンパイル済みで実行可能なコードを含んでいます。
pt_br: Há uma grande diferença entre sdists e wheels para pacotes com :term:`módulos de extensão <módulo de extensão>`, escritos em linguagens compiladas como C, C++ e Rust, que precisam ser compilados em código de máquina dependente de plataforma. Com esses pacotes, as rodas não contêm código fonte (como arquivos fonte C), mas código executável compilado (como arquivos ``.so`` no Linux ou DLLs no Windows).
ru: Существует большая разница между sdists и wheels для пакетов с : термин:``модули расширения <модуль расширения>`, написанных на компилируемых языках, таких как C, C++ и Rust, которые должны быть скомпилированы в машинный код, зависящий от платформы. Для таких пакетов колеса содержат не исходный код (например, исходные файлы на C), а скомпилированный, исполняемый код (например, файлы ``.so`` в Linux или DLL в Windows).
ta: தொகுப்புகளுக்கான SDISTS மற்றும் சக்கரங்களுக்கு இடையே ஒரு பெரிய வேறுபாடு உள்ளது: கால: `நீட்டிப்பு தொகுதிகள் <நீட்டிப்பு தொகுதி>`, சி, சி ++ மற்றும் ரச்ட் போன்ற தொகுக்கப்பட்ட மொழிகளில் எழுதப்பட்டவை, அவை இயங்குதள சார்ந்த இயந்திரக் குறியீட்டில் தொகுக்கப்பட வேண்டும். இந்த தொகுப்புகள் மூலம், சக்கரங்களில் மூலக் குறியீடு இல்லை (சி மூல கோப்புகள் போன்றவை) ஆனால் தொகுக்கப்பட்ட, இயங்கக்கூடிய குறியீடு (`` .SO`` லினக்சில் கோப்புகள் அல்லது சாளரங்களில் டி.எல்.எல்).

source: Furthermore, while there is only one sdist per version of a project, there may be many wheels. Again, this is most relevant in the context of extension modules. The compiled code of an extension module is tied to an operating system and processor architecture, and often also to the version of the Python interpreter (unless the :ref:`Python stable ABI <cpython-stable-abi>` is used).
eo: Krome, dum ekzistas po unu fonta distribuo por ĉiu versio de projekto, povas ekzisti multaj wheel-oj. Denove, tio plej temas pri etendaĵa modulo. La tradukita kodo de etendaĵa modulo estas ligita al mastruma sistemo kaj procesora arĥitekturo kaj ofte ankaŭ la versio de la Python-interpretilo (se oni ne uzas la :ref:`stabilan ABI de Python <cpython-stable-abi>`).
ja: さらにまた、あるバージョンのプロジェクトには sdist がひとつしか存在しない一方で、wheel はたくさんあるかもしれません。繰り返しになりますが、これは拡張モジュールの文脈でもっとも有りがちなことです。拡張モジュールのコンパイル済みのコードはオペレーティングシステムとプロセッサーアーキテクチャに、また、 (:ref:`Python stable ABI <cpython-stable-abi>` を使っていなければ) しばしば Python インタープリタのバージョンに紐付いています。
pt_br: Além disso, embora exista apenas um sdist por versão de um projeto, pode haver muitos wheels. Novamente, isto é mais relevante no contexto dos módulos de extensão. O código compilado de um módulo de extensão está vinculado a um sistema operacional e arquitetura de processador, e muitas vezes também à versão do interpretador Python (a menos que a :ref:`ABI estável do Python <cpython-stable-abi>` seja usada).
ru: Более того, хотя для каждой версии проекта существует только один sdist, колес может быть много. Опять же, это наиболее актуально в контексте модулей расширения. Скомпилированный код модуля расширения привязан к операционной системе и архитектуре процессора, а зачастую и к версии интерпретатора Python (если только не используется : ссылка:`Python стабильный ABI <cpython-стабильный-abi>`).
ta: மேலும், ஒரு திட்டத்தின் பதிப்பிற்கு ஒரே ஒரு SDIST மட்டுமே இருக்கும்போது, பல சக்கரங்கள் இருக்கலாம். மீண்டும், நீட்டிப்பு தொகுதிகளின் சூழலில் இது மிகவும் பொருத்தமானது. ஒரு நீட்டிப்பு தொகுதியின் தொகுக்கப்பட்ட குறியீடு ஒரு இயக்க முறைமை மற்றும் செயலி கட்டமைப்புடன் பிணைக்கப்பட்டுள்ளது, மேலும் பெரும்பாலும் பைதான் மொழிபெயர்ப்பாளரின் பதிப்பிலும் பிணைக்கப்பட்டுள்ளது (இல்லையென்றால்: குறிப்பு: `பைதான் நிலையான அபி <cpython- நிலைத்தன்மை-ABI>` பயன்படுத்தப்படுகிறது).

source: For pure-Python packages, the difference between sdists and wheels is less marked. There is normally one single wheel, for all platforms and Python versions. Python is an interpreted language, which does not need ahead-of-time compilation, so wheels contain ``.py`` files just like sdists.
eo: Por pure-Python-a pako, la diferenco inter fonta distribuo kaj wheel estas malpli markita. Estas ordinare unu rado, por ĉiuj platformoj kaj Python-versioj. Python estas interpretata lingvo ne bezonanta antaŭan tradukadon; tial wheel enhavas nur ``.py``-dosierojn, same kiel fonta distribuo.
ja: 純 Python のパッケージでは、 sdist と wheel の差異はあまり顕著ではありません。普通は、あらゆるプラットフォームと Python のバージョン向けに wheel がたったひとつ存在します。 Python はインタープリタ言語であり、事前にコンパイルしておく必要がなく、それゆえに wheel は sdist と同様に ``.py`` ファイル群を内包しているのです。
pt_br: Para pacotes Python puro, a diferença entre sdists e wheels é menos acentuada. Normalmente existe um único wheel, para todas as plataformas e versões do Python. Python é uma linguagem interpretada, que não precisa de compilação antecipada, então wheels contêm arquivos ``.py`` assim como sdists.
ru: Для пакетов чистого Python разница между sdists и wheels менее заметна. Обычно существует одно единственное колесо для всех платформ и версий Python. Python - интерпретируемый язык, которому не нужна опережающая компиляция, поэтому колеса содержат файлы ``.py``, как и sdists.
ta: தூய-பைதான் தொகுப்புகளுக்கு, Sdists மற்றும் சக்கரங்களுக்கு இடையிலான வேறுபாடு குறைவாகக் குறிக்கப்பட்டுள்ளது. எல்லா தளங்களுக்கும் பைதான் பதிப்புகளுக்கும் பொதுவாக ஒரு ஒற்றை சக்கரம் உள்ளது. பைதான் என்பது ஒரு விளக்கமளிக்கப்பட்ட மொழியாகும், இது நேரத்திற்கு முன்னதாகத் தேவையில்லை, எனவே சக்கரங்களில் sdists போலவே `` .py`` கோப்புகள் உள்ளன.

source: If you are wondering about ``.pyc`` bytecode files: they are not included in wheels, since they are cheap to generate, and including them would unnecessarily force a huge number of packages to distribute one wheel per Python version instead of one single wheel. Instead, installers like :ref:`pip` generate them while installing the package.
eo: Se vi scivolas pri bajtkodaj ``.pyc``-dosieroj, ili ne inkluziviĝas en wheel, ĉar ili estas facile generebla, kaj inkluzivi ilin nenecese estigus po unu wheel por ĉiu Python-versio por multaj pakoj, anstataŭ ununura pako. Anstataŭe, instalilo kiel :ref:`pip` generas ilin dum instalado de la pako.
ja: ``.pyc`` バイトコードファイル群: これらは wheel には含まれていませんが、これらについて不思議に思っているなら、これらは安価に生成することができ、また、もしこれをパッケージに含めるとすれば、単一の wheel を配布する代わりに、Python のバージョン毎に巨大な数のパッケージを配布するという不必要なことを強いられることになるでしょう。代わりに、 :ref:`pip` のようなインストーラがインストール中に生成しています。
pt_br: Se você está se perguntando sobre os arquivos de bytecode ``.pyc``: eles não estão incluídos nos wheels, pois são pouco custoso para gerar, e incluí-los forçaria desnecessariamente um grande número de pacotes a distribuir um wheel por versão do Python em vez de um único wheel. Em vez disso, instaladores como :ref:`pip` os geram durante a instalação do pacote.
ru: Если вы задаетесь вопросом о файлах байткода ``.pyc``: они не включены в колеса, поскольку их генерация обходится дешево, и их включение без необходимости заставило бы огромное количество пакетов распространять по одному колесу для каждой версии Python вместо одного колеса. Вместо этого такие программы установки, как :ref:`pip`, генерируют их во время установки пакета.
ta: `` .பிசி`` பைட்கோட் கோப்புகளைப் பற்றி நீங்கள் யோசிக்கிறீர்கள் என்றால்: அவை சக்கரங்களில் சேர்க்கப்படவில்லை, ஏனெனில் அவை உருவாக்க மலிவானவை, மேலும் அவை உட்பட ஒரு ஒற்றை ஒற்றை பதிப்பிற்கு பதிலாக ஒரு சக்கரத்தை விநியோகிக்க ஏராளமான தொகுப்புகளை தேவையற்ற முறையில் கட்டாயப்படுத்தும் சக்கரம். அதற்கு பதிலாக, நிறுவிகள்: ref: `PIP` தொகுப்பை நிறுவும் போது அவற்றை உருவாக்கவும்.

source: With that being said, there are still important differences between sdists and wheels, even for pure Python projects. Wheels are meant to contain exactly what is to be installed, and nothing more. In particular, wheels should never include tests and documentation, while sdists commonly do. Also, the wheel format is more complex than sdist. For example, it includes a special file -- called ``RECORD`` -- that lists all files in the wheel along with a hash of their content, as a safety check of the download's integrity.
eo: Tamen, ekzistas gravaj diferencoj inter fontaj distribuo kaj wheel, eĉ por pure Python-a projekto. Wheel intence enhavas nur tiom, kiom estas instalota, kaj neniom pli. Specife, wheel ne inkluzivu testojn kaj dokumentaron, dum fonta distribuo ja ofte inkluzivas ilin. Ankaŭ, la dosierformo wheel estas pli komplika ol fonta distribuo. Ekzemple, ĝi inkluzivas speciala dosieron nomitan ``RECORD`` listigantan ĉiujn dosierojn en wheel kune kun haketaĵoj de la enhavoj por kontroli la integrecon de la elŝutaĵo.
ja: そうは言っても、たとえ純 Python のプロジェクトであったとしても、 sdist と wheel の間には依然として重要な違いがあります。 wheel は、インストールされるものだけを正確に含むように、それ以外のものは含まないようにと意図して作られています。とりわけ、 wheel にはテストや説明文書を決して含めるべきではありませんが、他方で sdist では普通はこれらを含みます。また、 wheel のフォーマットは sdist のものよりもより複雑です。例えば、wheel にはある特別なファイル -- ``RECORD`` と呼ばれます -- が含まれていて、このファイルには wheel 内の他のすべてのファイルのハッシュ値付きのリストが含まれており、安全性の確認やダウンロードの際の完全性の確認に使われます。
pt_br: Dito isto, ainda existem diferenças importantes entre sdists e wheels, mesmo para projetos Python puros. Os wheels devem conter exatamente o que será instalado e nada mais. Em particular, os wheels nunca devem incluir testes e documentação, ao contrário dos sdists. Além disso, o formato do wheel é mais complexo que o sdist. Por exemplo, inclui um arquivo especial -- chamado ``RECORD`` -- que lista todos os arquivos no wheel junto com um hash de seu conteúdo, como uma verificação de segurança da integridade do download.
ru: Тем не менее, между sdists и wheels все еще есть важные различия, даже для проектов на чистом Python. Колеса должны содержать именно то, что должно быть установлено, и ничего больше. В частности, колеса никогда не должны включать тесты и документацию, в то время как sdists обычно содержат их. Кроме того, формат колеса сложнее, чем sdist. Например, он включает специальный файл ``RECORD``, который перечисляет все файлы в колесе вместе с хэшем их содержимого для проверки целостности загрузки.
ta: இவ்வாறு கூறப்படுவதால், தூய பைதான் திட்டங்களுக்கு கூட, SDISTS மற்றும் சக்கரங்களுக்கு இடையில் இன்னும் முக்கியமான வேறுபாடுகள் உள்ளன. சக்கரங்கள் நிறுவப்பட வேண்டியவற்றைக் கொண்டிருக்க வேண்டும், அதற்கு மேல் எதுவும் இல்லை. குறிப்பாக, சக்கரங்கள் ஒருபோதும் சோதனைகள் மற்றும் ஆவணங்களை சேர்க்கக்கூடாது, அதே நேரத்தில் Sdists பொதுவாக செய்கின்றன. மேலும், சக்கர வடிவம் SDIST ஐ விட மிகவும் சிக்கலானது. எடுத்துக்காட்டாக, இது ஒரு சிறப்புக் கோப்பை உள்ளடக்கியது - `` பதிவு`` - இது சக்கரத்தில் உள்ள அனைத்து கோப்புகளையும் அவற்றின் உள்ளடக்கத்தின் ஆசுடன் பட்டியலிடுகிறது, இது பதிவிறக்கத்தின் ஒருமைப்பாட்டின் பாதுகாப்பு சோதனையாக.
