Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Wheel is internally organized by `sysconfig path type <https://docs.python.org/2/library/sysconfig.html#installation-paths>`_, therefore making it easier to convert to other formats.
eo: Wheel estas interne organizita laŭ `dosierlokaj tipoj de sysconfig <https://docs.python.org/2/library/sysconfig.html#installation-paths>`_, plifaciligante konverti ali aliaj formoj.
ja: wheel は、内部では、 `sysconfigパスの型 <https://docs.python.org/2/library/sysconfig.html#installation-paths>`_ に従って整理されているので、他のフォーマットに変換するのがより簡単になっています。
pt_br: Wheel é internamente organizado pelo `tipo de caminho sysconfig <https://docs.python.org/2/library/sysconfig.html#installation-paths>`_, portanto tornando mais fácil converter para outros formatos.
ru: Wheel внутренне организовано по типу `sysconfig path <https://docs.python.org/2/library/sysconfig.html#installation-paths>`_, что облегчает его преобразование в другие форматы.
ta: வீல் `சிச்கான்ஃபிக் பாதை வகை <https://docs.python.org/2/library/sysconfig.html#installation-paths> _ _ ஆல் உள்நாட்டில் ஒழுங்கமைக்கப்பட்டுள்ளது, எனவே மற்ற வடிவங்களுக்கு மாற்றுவதை எளிதாக்குகிறது.

source: This format is email-based. Although this would be unlikely to be chosen today, backwards compatibility considerations lead to it being kept as the canonical format. From the user point of view, this is mostly invisible, since the metadata is specified by the user in a way understood by the build backend, typically ``[project]`` in ``pyproject.toml``, and translated by the build backend into ``PKG-INFO``.
eo: Ĉi tiu formo estas retmesaĝo-baza. Kvankam ĝi estus neverŝajne elektita hodiaŭ, ĝi restas kiel la kanona formo pro retrokongrueco. Por la uzanto, tio estas plejparte nevidebla, ĉar la metadatenoj estas specifitaj de la uzanto en maniero komprenita de la konstrua malfasado, ofte ``[project]`` en ``pyproject.toml`,` kaj tradukitaj de la konstrua malfasado al ``PKG-INFO``.
ja: このフォーマットは、電子メールのものをベースにしています。今となってはこれが選択されるとは思えませんが、後方互換性を鑑みて正規のフォーマットとして維持されています。ユーザの観点からは、これはほとんど目に映りません。というのは、ビルドバックエンドに理解できる形、典型的には ``pyproject.toml`` の中の ``[project]`` でメタデータがユーザによって指定され、ビルドバックエンドが ``PKG-INFO`` 内へと翻訳するからです。
pt_br: Este formato é baseado em e-mail. Embora seja improvável que isso seja escolhido hoje, considerações de compatibilidade com versões anteriores levam a que ele seja mantido como formato canônico. Do ponto de vista do usuário, isso é praticamente invisível, já que os metadados são especificados pelo usuário de uma forma compreendida pelo backend de construção, normalmente ``[project]`` em ``pyproject.toml``, e traduzidos pelo backend de construção em ``PKG-INFO``.
ru: Этот формат основан на электронной почте. Хотя сегодня его вряд ли выберут, соображения обратной совместимости заставляют оставить его в качестве канонического формата. С точки зрения пользователя это практически незаметно, так как метаданные указываются пользователем в виде, понятном бэкенду сборки, обычно ``[ проект]`` в ``pyproject.toml``, и транслируются бэкендом сборки в ``PKG-INFO``.
ta: இந்த வடிவம் மின்னஞ்சல் அடிப்படையிலானது. இது இன்று தேர்வு செய்யப்பட வாய்ப்பில்லை என்றாலும், பின்னோக்கி பொருந்தக்கூடிய பரிசீலனைகள் நியமன வடிவமாக வைக்கப்படுவதற்கு வழிவகுக்கிறது. பயனர் பார்வையில், இது பெரும்பாலும் கண்ணுக்கு தெரியாதது, ஏனெனில் மேனிலை தரவு பயனரால் கட்டிய பின்தளத்தில் புரிந்து கொள்ளப்பட்ட விதத்தில் குறிப்பிடப்படுகிறது, பொதுவாக `` [திட்டம்] `` `pyproject.toml`` இல், மற்றும் மொழிபெயர்க்கப்பட்டுள்ளது பின்தளத்தில் `` pkg-info`` இல் உருவாக்குங்கள்.

source: Circumstantially, in some cases, wheels can be used as an importable runtime format, although :ref:`this is not officially supported at this time <binary-distribution-format-import-wheel>`.
eo: Kelkfoje, wheel povas esti uzata kiel importabla rultempa formo, kvankam :ref:`aktuale tio ne estas oficiale subtenata <binary-distribution-format-import-wheel>`.
ja: 状況としては、 :ref:`現時点で公式にはサポートされていません <binary-distribution-format-import-wheel>` が、 一部のケースで wheel ファイルをインポート可能な稼働時(runtime)フォーマットとして使うことが可能です。
pt_br: Circunstancialmente, em alguns casos, wheels podem ser usados como um formato de tempo de execução importável, embora :ref:`não haja suporte oficial a isso no momento <binary-distribution-format-import-wheel>`.
ru: В некоторых случаях колеса могут использоваться в качестве импортируемого формата времени выполнения, хотя :ref:`это не поддерживается официально в настоящее время <binary-distribution-format-import-wheel>`.
ta: சூழ்நிலை ரீதியாக, சில சந்தர்ப்பங்களில், சக்கரங்களை இறக்குமதி செய்யக்கூடிய இயக்க நேர வடிவமாகப் பயன்படுத்தலாம், இருப்பினும்: ref: `இது அதிகாரப்பூர்வமாக இந்த நேரத்தில் ஆதரிக்கப்படவில்லை <பைனரி-விநியோகத்தை உருவாக்கும்-இறக்குமதி-சக்கர>`.

source: pip vs easy_install
eo: pip kontraste kun easy_install
ja: pip対easy_install
ru: pip против easy_install
ta: PIP vs Ease_install

source: :ref:`easy_install <easy_install>`, now `deprecated`_, was released in 2004 as part of :ref:`setuptools`. It was notable at the time for installing :term:`packages <Distribution Package>` from :term:`PyPI <Python Package Index (PyPI)>` using requirement specifiers, and automatically installing dependencies.
eo: :ref:`easy_install <easy_install>`, nun `evitinda <deprecated>`_, estis eldonita en 2004 kiel parto de :ref:`setuptools`. Tiam, ĝi estis utila por instali :term:`pakojn <Distribution Package>` el :term:`PyPI <Python Package Index (PyPI)>` uzante postulo-specifilojn kaj aŭtomate instali dependaĵojn.
ja: :ref:`easy_install <easy_install>`は、現在では`非推奨`とされていますが、2004年に:ref:`setuptools`の一部として公開されました。requirementsファイルを利用して自動的に依存関係にあるパッケージも併せて:term:`PyPI <Python Package Index (PyPI)>`から:term:`packages <Distribution Package>`をインストールすることができるというのは当時としては画期的でした。
pt_br: :ref:`easy_install <easy_install>`, agora `descontinuado`_, foi lançado em 2004 como parte do :ref:`setuptools`. Era notável na época para instalar :term:`pacotes <Distribution Package>` do :term:`PyPI <Python Package Index (PyPI)>` usando especificadores de requisitos e instalando dependências automaticamente.
ru: :ref:`easy_install <easy_install>`, теперь `deprecated`_, был выпущен в 2004 как часть :ref:`setuptools`. Он был примечателен в то время для установки :term:`packages <Distribution Package>` из :term:`PyPI <Python Package Index (PyPI)>`Python Индекса пакетов (PyPI)>` с использованием спецификаторов требований и автоматической установки зависимостей.
ta: . நிறுவும் நேரத்தில் இது குறிப்பிடத்தக்கதாக இருந்தது: கால: `தொகுப்புகள் <விநியோக தொகுப்பு>` இருந்து: கால: `பைபி <பைதான் தொகுப்பு குறியீட்டு (PYPI)>` தேவை குறிப்பான்களைப் பயன்படுத்துதல் மற்றும் தானாகவே சார்புகளை நிறுவுதல்.

source: Here's a breakdown of the important differences between pip and the deprecated easy_install:
eo: Jen la gravaj diferencoj inter pip kaj la evitinda easy_install:
ja: pipと非推奨となったeasy_installの重要な違いをおさらいしておきましょう：
pt_br: Aqui está uma análise das diferenças importantes entre o pip e o descontinuado easy_install:
ru: Вот разбивка важных различий между pip и обесцененным easy_install:
ta: பிஐபி மற்றும் நீக்கப்பட்ட ஈசி_இன்ச்டால் ஆகியவற்றுக்கு இடையிலான முக்கியமான வேறுபாடுகளின் முறிவு இங்கே:

source: Installs from :term:`Wheels <Wheel>`
eo: Instali el :term:`Wheel <Wheel>`
ja: :term:`Wheels <Wheel>`からのインストール
pt_br: Instala de :term:`Wheels <Wheel>`
ru: Установка из :term:`колёс <Wheel>`
ta: இதிலிருந்து நிறுவுகிறது: கால: `சக்கரங்கள் <shewel>`

source: Yes
eo: Jes
ja: はい
pt_br: Sim
ru: Да
ta: ஆம்

source: No
eo: Ne
ja: いいえ
pt_br: Não
ru: Нет
ta: இல்லை

source: Uninstall Packages
eo: Malinstali Pakojn
ja: パッケージのアンインストール
pt_br: Desinstala pacotes
ru: Удаление пакетов
ta: தொகுப்புகளை நிறுவல் நீக்குதல்

source: Yes (``python -m pip uninstall``)
eo: Jes (``python -m pip uninstall``)
ja: はい (``python -m pip uninstall``)
pt_br: Sim (``python -m pip uninstall``)
ru: Да (``python -m pip uninstall``)
ta: ஆம் (`` பைதான் -எம் பிப் நிறுவல் நீக்குதல்``)

source: Dependency Overrides
eo: Anstataŭigo de Dependeco
ja: 依存関係を上書きする
pt_br: Substitui dependências
ru: Переопределение зависимостей
ta: சார்பு மீறுகிறது

source: Yes (:ref:`Requirements Files <pip:Requirements Files>`)
eo: Jes (:ref:`Postulo-Dosieroj <pip:Requirements Files>`)
ja: はい (:ref:`Requirementsファイル <pip:Requirements Files>`
pt_br: Sim (:ref:`Arquivo de Requisitos <pip:Requirements Files>`)
ru: Да (:ref:`Файлы требований <pip:Requirements Files>`)
ta: ஆம் (: குறிப்பு: `தேவைகள் கோப்பு <பிப்: தேவைகள் கோப்பு>`)

source: List Installed Packages
eo: Listigi instalitajn pakojn
ja: インストールされたパッケージのリスト
pt_br: Lista pacotes instalados
ru: Перечисление установленных пакетов
ta: நிறுவப்பட்ட தொகுப்புகளை பட்டியலிடுங்கள்

source: Yes (``python -m pip list`` and ``python -m pip freeze``)
eo: Jes (``python -m pip list`` kaj ``python -m pip freeze``)
ja: はい (``python -m pip list`` and ``python -m pip freeze``)
pt_br: Sim (``python -m pip list`` e ``python -m pip freeze``)
ru: Да (``python -m pip list`` и ``python -m pip freeze``)
ta: ஆம் (`` பைதான் -எம் பிப் பட்டியல்`` மற்றும் `` பைதான் -எம் பிப் ஃப்ரீச்``)

source: :pep:`438` Support
eo: Subteno de :pep:`438`
ja: :pep:`438` サポート
pt_br: Suporte a :pep:`438`
ru: Поддержка :pep:`438`
ta: : PEP: `438` உதவி

source: Installation format
eo: Instala dosierformo
ja: インストールフォーマット
pt_br: Formato de instalação
ru: Формат установки
ta: நிறுவல் வடிவம்

source: 'Flat' packages with :file:`egg-info` metadata.
eo: Plata pako kun metadatenoj en :file:`egg-info`.
ja: :file:`egg-info`のメタデータを伴った「フラット」なパッケージ。
pt_br: Pacotes "planos" com metadados de :file:`egg-info`.
ru: 'Плоские' пакеты с метаданными :file:`egg-info`.
ta: 'பிளாட்' தொகுப்புகள்: கோப்பு: `முட்டை-இன்ஃபோ` மேனிலை தரவு.

source: Encapsulated Egg format
eo: Enkapsuligita Egg-formo
ja: カプセル化されたEggフォーマット
pt_br: Formato Egg encapsulado
ru: Формат инкапсулированного яйца
ta: இணைக்கப்பட்ட முட்டை வடிவம்

source: sys.path modification
eo: modifado de sys.path
ja: sys.pathの変更
pt_br: Modificação de sys.path
ru: Изменение ``sys.path``
ta: sys.path மாற்றம்

source: Installs from :term:`Eggs <Egg>`
eo: Instalas de :term:`Egg <Egg>`
ja: :term:`Eggs <Egg>`からのインストール
pt_br: Instala de :term:`Eggs <Egg>`
ru: Установка из :term:`Eggs <Egg>`
ta: இதிலிருந்து நிறுவுகிறது: கால: `முட்டை <முட்டை>`

source: `pylauncher support`_
eo: `subteno de pylauncher <pylauncher support>`_
ja: `pylauncherサポート <pylauncher support>`_
pt_br: `suporte a pylauncher`_
ru: `Поддержка pylauncher`_
ta: `பைலாஞ்சர் ஆதரவு`_

source: Yes [1]_
eo: Jes [1]_
ja: はい [1]_
pt_br: Sim [1]_
ru: Да [1]_
ta: ஆம் [1] _

source: :ref:`Multi-version Installs`
eo: :ref:`Plurversiaj Instaloj <Multi-version Installs>`
ja: :ref:`複数バージョンのインストール <Multi-version Installs>`
pt_br: :ref:`Instalações multiversões <Multi-version Installs>`
ru: :ref:`Многоверсионные установки <Multi-version Installs>`
ta: : குறிப்பு: `மல்டி-பதிப்பு நிறுவல்கள்`

source: Exclude scripts during install
eo: Ekskluzivi programetojn dum instalado
ja: インストール中にスクリプトを除外する
pt_br: Exclui scripts durante a instalação
ru: Исключение скриптов во время установки
ta: நிறுவலின் போது ச்கிரிப்ட்களை விலக்கு

source: per project index
eo: unu-projekta indekso
ja: プロジェクトごとの索引
pt_br: índice por projeto
ru: Индекс по проектам
ta: திட்டக் குறியீட்டிற்கு

source: Only in virtualenv
eo: Nur en virtualenv
ja: virtualenvの中のみ
pt_br: Apenas em virtualenv
ru: Только в ``virtualenv``
ta: மெய்நிகர்இன்வியில் மட்டுமே

source: Yes, via setup.cfg
eo: Jes, per setup.cfg
ja: はい、setup.cfgを通じて
pt_br: Sim, via setup.cfg
ru: Да, через :file:`setup.cfg`
ta: ஆம், setup.cfg வழியாக

source: Is ``setup.py`` deprecated?
eo: Ĉu ``setup.py`` estas evitinda?
ja: ``setup.py`` は非推奨になりましたか？
pt_br: ``setup.py`` foi descontinuado?
ru: Является ли ``setup.py`` обесцененным?
ta: `` Setup.py`` நீக்கப்பட்டதா?

source: No, :term:`setup.py` and :ref:`setuptools` are not deprecated.
eo: Ne, :term:`setup.py` kaj :ref:`setuptools` ne estas evitindaj.
ja: いいえ、 :term:`setup.py` および :ref:`setuptools` は非推奨にはなっていません。
pt_br: Não, :term:`setup.py` e :ref:`setuptools` não foram descontinuados.
ru: Нет, :термин:`setup.py` и :ref:`setuptools' не амортизируются.
ta: இல்லை,: கால: `setup.py` மற்றும்: ref:` setuptools` நீக்கப்படவில்லை.

source: Setuptools is perfectly usable as a :term:`build backend` for packaging Python projects. And :file:`setup.py` is a valid configuration file for :ref:`setuptools` that happens to be written in Python, instead of in *TOML* for example (a similar practice is used by other tools like *nox* and its :file:`noxfile.py` configuration file, or *pytest* and :file:`conftest.py`).
eo: Setuptools estas bone uzebla kiel :term:`konstrua malfasado <build backend>` por paki Python-projektojn. Kaj :file:`setup.py` estas valida agorda dosiero por :ref:`setuptools`, kiu estas verkita en Python anstataŭ *TOML* ekzemple (ion similan faras aliaj iloj kiel *nox* per sia agorda dosiero :file:`noxfile.py` kaj *pytest* per sia :file:`conftest.py`).
ja: Setuptools は、 :term:`ビルドバックエンド <build backend>` として Python のプロジェクトをパッケージングすることに完璧に使用可能です。そして、 :file:`setup.py` は、例えば *TOML* の代わりにたまたま Python で書かれている :ref:`setuptools` 向けの正当な設定ファイルです (*nox* とその設定ファイルである :file:`nox.filepy` や *pytest* と :file:`conftest.py` のような他のツール類でも、よく似たパターンが使われています)。
pt_br: Setuptools é perfeitamente utilizável como um :term:`backend de construção` para empacotar projetos Python. E :file:`setup.py` é um arquivo de configuração válido para :ref:`setuptools` que é escrito em Python, em vez de em *TOML* por exemplo (uma prática semelhante é usada por outras ferramentas como *nox* e seu arquivo de configuração :file:`noxfile.py`, ou *pytest* e :file:`conftest.py`).
ru: Setuptools вполне можно использовать в качестве :term:`build backend` для упаковки Python-проектов. А :file:`setup.py` - это правильный конфигурационный файл для :ref:`setuptools`, который, к примеру, написан на Python, а не на *TOML* (подобная практика используется и в других инструментах, таких как *nox* и его конфигурационный файл :file:`noxfile.py`, или *pytest* и :file:`conftest.py`).
ta: Setuptools ஒரு: கால: `பின்தளத்தில் உருவாக்கு` பைதான் திட்டங்களை பேக்கேசிங் செய்வதற்கு முற்றிலும் பயன்படுத்தக்கூடியது. மேலும்: கோப்பு: `setup.py` என்பது இதற்கான சரியான உள்ளமைவு கோப்பு: குறிப்பு:` செட்டப்டூல்ச்` இது பைத்தானில் எழுதப்படுகிறது, எடுத்துக்காட்டாக *டாம்ல் *க்கு பதிலாக (இதேபோன்ற நடைமுறை *Nox *போன்ற பிற கருவிகளால் பயன்படுத்தப்படுகிறது மற்றும் அதன்: கோப்பு: `noxfile.py` உள்ளமைவு கோப்பு, அல்லது * பைட்டெச்ட் * மற்றும்: கோப்பு:` conftest.py`).

source: However, ``python setup.py`` and the use of :file:`setup.py` as a command line tool are deprecated.
eo: Tamen, ``python setup.py`` kaj la uzado de :file:`setup.py` kiel komandlinia ilo estas evitindaj.
ja: しかしながら、 ``python setup.py`` および :file:`setup.py` をコマンドラインツールとして使うことは非推奨になりました。
pt_br: No entanto, ``python setup.py`` e o uso de :file:`setup.py` como uma ferramenta de linha de comando foram descontinuados.
ru: Однако ``python setup.py`` и использование :file:`setup.py' в качестве инструмента командной строки обесцениваются.
ta: இருப்பினும், `` பைதான் setup.py`` மற்றும் பயன்பாடு: கோப்பு: `setup.py` ஒரு கட்டளை வரி கருவியாக நீக்கப்படும்.

source: This means that commands such as the following **MUST NOT** be run anymore:
eo: Tio signifas, ke oni **NE UZU** la ĉi-subajn komandojn:
ja: その意味するところは、次のようなコマンドを実行することはもはや **許されない** ということです:
pt_br: Isso significa que comandos como os seguintes **NÃO DEVEM** ser mais executados:
ru: Это означает, что команды, такие как следующий **MUST NO**, будут выполняться больше:
ta: இதன் பொருள் பின்வரும் ** போன்ற கட்டளைகள் ** இனி இயக்கப்படக்கூடாது:

source: ``python setup.py install``
ta: `` பைதான் setup.py install``

source: ``python setup.py develop``
ta: `` பைதான் setup.py உருவாக்கு``

source: ``python setup.py sdist``
ta: `` பைதான் setup.py sdist``

source: ``python setup.py bdist_wheel``
ta: `` பைதான் setup.py bdist_wheel``

source: What commands should be used instead?
eo: Kiuj komandoj mi uzu anstataŭe?
ja: 代わりにどのようなコマンドを使うべきでしょうか？
pt_br: Quais comandos devem ser usados?
ru: Какие команды следует использовать вместо этого?
ta: அதற்கு பதிலாக என்ன கட்டளைகளைப் பயன்படுத்த வேண்டும்?

source: Deprecated
eo: Evitindaj
ja: 非推奨
pt_br: Descontinuado
ru: Устаревшее
ta: மதிப்பிடப்பட்டது

source: Recommendation
eo: Rekomendo
ja: 推奨事項
pt_br: Recomendação
ru: Рекомендации
ta: பரிந்துரை

source: ``python -m pip install .``
ta: `` பைதான் -எம் பிஐபி நிறுவல் .``

source: ``python -m pip install --editable .``
ta: `` பைதான் -எம் பிஐபி நிறுவல் -அடைக்கக்கூடியது .``

source: ``python -m build`` [#needs-build]_
ta: `` பைதான் -எம் பில்ட்`` [#தேவைகள் -கட்டுதல்] _

source: This requires the :ref:`build` dependency. It is recommended to always build and publish both the source distribution and wheel of a project, which is what ``python -m build`` does. If necessary the ``--sdist`` and ``--wheel`` options can be used to generate only one or the other.
eo: Tio postulas la dependaĵon :ref:`build`. Estas rekomendate ĉiam konstrui kaj eldoni kaj la fontan distribuon kaj la wheel de projekto; tion faras la komando ``python -m build``. Laŭbezone oni povas uzi la flagojn ``--sdist`` kaj ``--wheel`` por generi nur unu aŭ la alia.
ja: これは、:ref:`build` の依存関係を要求します。 ``python -m build`` を実行すればそうなりますが、プロジェクトにおいては常にソースコード配布物とwheelの両方を公開することを推奨します。もし必要であれば、いずれか片方を生成するのに ``--sdist`` や ``--wheel`` のオプションを使うことができます。
pt_br: Isto requer a dependência de :ref:`build`. É recomendado sempre construir e publicar tanto a distribuição fonte quanto a wheel de um projeto, que é o que ``python -m build`` faz. Se necessário as opções ``--sdist`` e ``--wheel`` podem ser usadas para gerar apenas uma ou outra.
ru: Это требует :ref:`build' зависимости. Рекомендуется всегда строить и публиковать как распределение источника, так и колесо проекта, что и делает ``python -m build``. При необходимости опции ``-sdist`` и ``--wheel`` могут быть использованы для создания только одного или другого.
ta: இதற்கு: ref: `உருவாக்கு` சார்பு தேவை. ஒரு திட்டத்தின் மூல வழங்கல் மற்றும் சக்கரம் இரண்டையும் எப்போதும் உருவாக்கி வெளியிட பரிந்துரைக்கப்படுகிறது, இதுதான் `` பைதான் -எம் பில்ட்`` செய்கிறது. தேவைப்பட்டால் ``--ச்டிச்ட்`` மற்றும் ``-வீல்`` விருப்பங்கள் ஒன்று அல்லது மற்றொன்றை மட்டுமே உருவாக்க பயன்படுத்தப்படலாம்.

source: In order to install a setuptools based project, it was common to run :file:`setup.py`'s ``install`` command such as: ``python setup.py install``. Nowadays, the recommended method is to use :ref:`pip` directly with a command like this one: ``python -m pip install .``. Where the dot ``.`` is actually a file system path, it is the path notation for the current directory. Indeed, *pip* accepts a path to a project's source tree directory on the local filesystem as argument to its ``install`` sub-command. So this would also be a valid command: ``python -m pip install path/to/project``.
eo: Por instali setuptools-bazan projekton, oni ofte rulis la komandon ``install`` de :file:`setup.py``, kiel ekzemple ``python setup.py install``. Nuntempe, la rekomendata metodo estas uzi :ref:`pip` rekte per la jena komando: ``python - m pip install .`` en kiu la punkto ``.`` estas dosiersistema loko, la aktuala dosierujo. Fakte, *pip* akceptas la lokan dosiersisteman lokon de la projekta fontarba dosierujo kiel argumenton al sia subkomando ``install``. Tiel, jen alia valida komando: ``python - m pip install loko/de/projekto``.
ja: setuptools ベースのプロジェクトをインストールするためには、``python setup.py install`` のように :file:`setup.py` の ``install`` コマンドを使うことが普通でした。今日では、``python -m pip install .`` のように :ref:`pip` を直接に使う方法が推奨されています。ここでドット ``.`` は、実際にはファイルシステム上のパスなので、これはカレントディレクトリを示すパス表現です。なんと、 *pip* は ``install`` サブコマンドへの引数の形で、ローカルのファイルシステム上のパスをプロジェクトのソースコードツリーを置くべき場所として受け付けるのです。そういうことですから、これもまた正当なコマンドということになります: ``python -m pip install path/to/project``。
pt_br: Para instalar um projeto baseado no setuptools, era comum executar o comando ``install`` do arquivo :file:`setup.py`, como, por exemplo, ``python setup.py install``. Atualmente, o método recomendado é utilizar o :ref:`pip` diretamente com um comando como este: ``python -m pip install .``. O ponto ``.`` representa o caminho do sistema de arquivos, sendo a notação para o diretório atual. De fato, o *pip* aceita um caminho para o diretório da árvore de fontes do projeto no sistema de arquivos local como argumento para o seu subcomando ``install``. Portanto, este também seria um comando válido: ``python -m pip install caminho/para/projeto``.
ru: Для установки проекта, основанного на setuptools, обычно выполнялась команда ``install`` от :file:``setup.py``, например: ``python setup.py install``. В настоящее время рекомендуется использовать :ref:`pip` напрямую с командой, подобной этой: ``python -m pip install .``. Где точка ``.`` на самом деле является путем к файловой системе, это обозначение пути к текущему каталогу. Действительно, *pip* принимает путь к каталогу дерева исходников проекта в локальной файловой системе в качестве аргумента своей подкоманды ``install``. Таким образом, это также будет правильной командой: ``python -m pip install path/to/project``.
ta: செட்ப்டூல்ச் அடிப்படையிலான திட்டத்தை நிறுவுவதற்கு, இயங்குவது பொதுவானது: கோப்பு: `setup.py` இன்` `நிறுவு` கட்டளை போன்றவை:` `பைதான் அமைவு. இப்போதெல்லாம், பரிந்துரைக்கப்பட்ட முறை பயன்படுத்த வேண்டும்: குறிப்பு: `பிஐபி` இது போன்ற ஒரு கட்டளையுடன் நேரடியாக:` `பைதான் -எம் பிஐபி நிறுவல் .``. புள்ளி `` .`` உண்மையில் ஒரு கோப்பு முறைமை பாதை, இது தற்போதைய கோப்பகத்திற்கான பாதை குறியீடாகும். உண்மையில், * பிப் * உள்ளக கோப்பு முறைமையில் ஒரு திட்டத்தின் மூல மர கோப்பகத்திற்கான பாதையை அதன் `` நிறுவல்` துணை கட்டளைக்கு வாதமாக ஏற்றுக்கொள்கிறது. எனவே இது செல்லுபடியாகும் கட்டளையாகவும் இருக்கும்: `` பைதான் -எம் பிஐபி நிறுவல் பாதை/முதல்/திட்டம்``.

source: As for the installation in *develop* mode aka *editable* mode, instead of ``python setup.py develop`` one can use the ``--editable`` option of pip's *install* sub-command: ``python -m pip install --editable .``.
eo: Por instalo en *evoluada* (aŭ *modifebla*) reĝimo, anstataŭ ``python setup.py develop`` oni uzu la flagon ``--editable`` de la subkomando *install* de pip: ``python -m pip install --editable .``.
ja: *編集可能 <editable>* モードとしても知られる *開発 <develop>* モードでのインストールのためには、 ``python setup.py develop`` の代わりに pip の *install* サブコマンドの ``--editable`` オプションを使うことができます: ``python -m pip install --editable .``。
pt_br: Quanto à instalação no modo *develop*, também conhecido como modo *editable*, em vez de ``python setup.py develop``, é possível utilizar a opção ``--editable`` do subcomando *install* do *pip* da seguinte forma: ``python -m pip install --editable .``.
ru: Что касается установки в режиме *develop* aka *editable*, то вместо ``python setup.py develop`` можно использовать опцию ``--editable`` в подкоманде pip *install*: ``python -m pip install --editable .``.
ta: * `` பைதான் அமைவு. -M PIP நிறுவல் --diable .``.
