Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Python scripts must appear in ``scripts`` and begin with exactly ``b'#!python'`` in order to enjoy script wrapper generation and ``#!python`` rewriting at install time. They may have any or no extension.
pt_br: Scripts Python devem aparecer em ``scripts`` e começar exatamente com ``b'#!python'`` para desfrutar da geração do wrapper de script e reescrever ``#!python`` no momento da instalação. Eles podem ter qualquer ou nenhuma extensão.

source: A string containing the URL from which this version of the distribution can be downloaded. (This means that the URL can't be something like ".../BeagleVote-latest.tgz", but instead must be ".../BeagleVote-0.45.tgz".)
pt_br: Uma string contendo a URL a partir da qual esta versão da distribuição pode ser baixada. (Isso significa que a URL não pode ser algo como ".../BeagleVote-latest.tgz", mas deve ser ".../BeagleVote-0.45.tgz".)

source: Comparisons in marker expressions are typed by the comparison operator. The <marker_op> operators that are not in <version_cmp> perform the same as they do for strings in Python. The <version_cmp> operators use the version comparison rules of the :ref:`Version specifier specification <version-specifiers>` when those are defined (that is when both sides have a valid version specifier). If there is no defined behaviour of this specification and the operator exists in Python, then the operator falls back to the Python behaviour. Otherwise an error should be raised. e.g. the following will result in errors::
pt_br: As comparações em expressões de marcador são tipadas pelo operador de comparação. Os operadores <marker_op> que não estão em <version_cmp> fazem o mesmo que para strings no Python. Os operadores <version_cmp> usam as regras de comparação de versão da :ref:`especificação de especificadores de versão <version-specifiers>` quando são definidas (ou seja, quando ambos os lados têm um especificador de versão válido). Se não houver comportamento definido desta especificação e o operador existir no Python, o operador voltará ao comportamento do Python. Caso contrário, um erro deve ser levantado. Por exemplo, o seguinte resultará em erros ::

source: The table may have one of two keys. The ``file`` key has a string value that is a file path relative to ``pyproject.toml`` to the file which contains the license for the project. Tools MUST assume the file's encoding is UTF-8. The ``text`` key has a string value which is the license of the project. These keys are mutually exclusive, so a tool MUST raise an error if the metadata specifies both keys.
pt_br: A tabela pode ter uma de duas chaves. A chave ``file`` tem um valor de string que é um caminho de arquivo relativo a ``pyproject.toml`` para o arquivo que contém a licença do projeto. As ferramentas DEVEM presumir que a codificação do arquivo é UTF-8. A chave ``text`` tem um valor de string que é a licença do projeto. Essas chaves são mutuamente exclusivas, portanto, uma ferramenta DEVE levantar um erro se os metadados especificarem ambas as chaves.

source: A table of URLs where the key is the URL label and the value is the URL itself.
pt_br: Uma tabela de URLs onde a chave é o rótulo da URL e o valor é a URL em si.

source: The current standard format of source distribution format is identified by the presence of a :file:`pyproject.toml` file in the distribution archive. The layout of such a distribution was originally specified in :pep:`517` and is formally documented here.
pt_br: O formato padrão atual do formato de distribuição fonte é identificado pela presença de um arquivo :file:`pyproject.toml` no arquivo de distribuição. O layout de tal distribuição foi originalmente especificado na :pep:`517` e está formalmente documentado aqui.

source: A *source tree* is a collection of files and directories -- like a version control system checkout -- which contains a :file:`pyproject.toml` file that can be use to build a source distribution from the contained files and directories. :pep:`517` and :pep:`518` specify what is required to meet the definition of what :file:`pyproject.toml` must contain for something to be deemed a source tree.
pt_br: Uma *árvore fonte* é uma coleção de arquivos e diretórios -- como um checkout local do sistema de controle de versão -- que contém um arquivo :file:`pyproject.toml` que pode ser usado para construir uma distribuição fonte a partir dos arquivos e diretórios contidos. :pep:`517` e :pep:`518` especificam o que é necessário para atender à definição do que :file:`pyproject.toml` deve conter para que algo seja considerado uma árvore fonte.

source: :ref:`virtualenv` needs to be installed separately, but supports Python 2.7+ and Python 3.3+, and :ref:`pip`, :ref:`setuptools` and :ref:`wheel` are always installed into created virtual environments by default (regardless of Python version).
pt_br: :ref:`virtualenv` precisa ser instalado separadamente, mas oferece suporte a Python 2.7+ e Python 3.3+, e :ref:`pip`, :ref:`setuptools` e :ref:`wheel` são sempre instalados em ambientes virtuais criados por padrão (independentemente da versão Python).

source: ``classifiers`` gives the index and :ref:`pip` some additional metadata about your package. In this case, the package is only compatible with Python 3, is licensed under the MIT license, and is OS-independent. You should always include at least which version(s) of Python your package works on, which license your package is available under, and which operating systems your package will work on. For a complete list of classifiers, see https://pypi.org/classifiers/.
pt_br: ``classifiers`` fornece o índice e :ref:`pip` alguns metadados adicionais sobre seu pacote. Nesse caso, o pacote é compatível apenas com Python 3, está licenciado sob a licença MIT e é independente do sistema operacional. Você deve sempre incluir pelo menos a(s) versão(ões) do Python em que seu pacote funciona, em que licença seu pacote está disponível e em quais sistemas operacionais seu pacote funcionará. Para obter uma lista completa de classificadores, consulte https://pypi.org/classifiers/.

source: Most build backends automatically include license files in packages. See your backend's documentation for more details.
pt_br: A maioria dos backends de construção inclui automaticamente arquivos de licença em pacotes. Consulte a documentação do seu backend para obter mais detalhes.

source: You will be prompted for a username and password. For the username, use ``__token__``. For the password, use the token value, including the ``pypi-`` prefix.
pt_br: Você será solicitado a fornecer um nome de usuário e uma senha. Para o nome de usuário, use ``__token__``. Para a senha, use o valor do token, incluindo o prefixo ``pypi-``.
