Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: There are currently two different approaches to creating namespace packages, from which the latter is discouraged:
eo: Ekzistas nuntempe du malsamaj manieroj krei nomspacan pakon, el kiu la dua estas evitinda:
ja: 現在、名前空間パッケージを作るには２個の異なる手法がありますが、後者は使わない方が良いとされています:
pt_br: Atualmente, existem duas abordagens diferentes para a criação de pacotes de espaço de nomes, das quais a última é desencorajado:
ru: В настоящее время существует два различных подхода к созданию пакетов пространства имен, из которых последний не рекомендуется:
ta: பெயர்வெளி தொகுப்புகளை உருவாக்குவதற்கு தற்போது இரண்டு வெவ்வேறு அணுகுமுறைகள் உள்ளன, அவற்றில் இருந்து பிந்தையது ஊக்கமளிக்கிறது:

source: Use `native namespace packages`_. This type of namespace package is defined in :pep:`420` and is available in Python 3.3 and later. This is recommended if packages in your namespace only ever need to support Python 3 and installation via ``pip``.
eo: Uzi `indiĝenan nomspacan pakon <native namespace packages>`_. Tiu speco de nomspaca pako estas difinita en :pep:`420` kaj havebla ekde Python 3.3. Tio estas rekomendata, se pakoj en via nomspaco subtenas Python 3 aŭ instaladon per ``pip``.
ja: `組み込みの名前空間パッケージ`_ を用いる方法。この種の名前空間パッケージは :pep:`420` で定義されていて、 Python 3.3 およびそれ以降で利用することができます。パッケージ中の名前空間が Python 3 だけをサポートすればよくて ``pip`` でインストールするのであれば、これが推奨される方法です。
pt_br: Usar `pacotes de espaço de nomes nativos`_. Este tipo de pacote de espaço de nomes é definido na :pep:`420` e está disponível em Python 3.3 e posterior. Isso é recomendado se os pacotes em seu espaço de nomes precisarem apenas oferecer suporte ao Python 3 e à instalação via ``pip``.
ru: Используйте `нативные пакеты пространства имен`_. Этот тип пакетов пространства имен определен в :pep:`420` и доступен в Python 3.3 и более поздних версиях. Это рекомендуется, если пакеты в вашем пространстве имен должны поддерживать только Python 3 и устанавливаться через ``pip``.
ta: `சொந்த பெயர்வெளி தொகுப்புகள்`_ ஐப் பயன்படுத்தவும். இந்த வகை பெயர்வெளி தொகுப்பு இதில் வரையறுக்கப்பட்டுள்ளது: PEP: `420` மற்றும் பைதான் 3.3 மற்றும் அதற்குப் பிறகு கிடைக்கிறது. உங்கள் பெயர்வெளியில் உள்ள தொகுப்புகள் எப்போதாவது பைதான் 3 மற்றும் நிறுவலை `` பிப்`` வழியாக மட்டுமே ஆதரிக்க வேண்டும் என்றால் இது பரிந்துரைக்கப்படுகிறது.

source: Use `legacy namespace packages`_. This comprises `pkgutil-style namespace packages`_ and `pkg_resources-style namespace packages`_.
eo: Uzi `malnovan nomspacan pakon <legacy namespace packages>`_, kiu estas aŭ `pkgutil-stila nomspaca pako <pkgutil-style namespace packages>`_ aŭ `pkg_resources-stila nomspaca pako <pkg_resources-style namespace packages>`_.
ja: `レガシー名前空間パッケージ群`_ を使ってください。これは`pkgutil 型の名前空間パッケージ`_ および `pkg_resources 型の名前空間パッケージ`_ から構成されています。
pt_br: Use `pacotes de espaço de nomes legados`_. Isso compreende `pacotes de espaço de nomes no estilo pkgutil`_ e `pacotes de espaço de nomes no estilo pkg_resources`_.
ru: Используйте пакеты `legacy namespace`_. Это включает в себя пакеты пространства имен в стиле `pkgutil`_ и пакеты пространства имен в стиле `pkg_resources`_.
ta: `மரபு பெயர்வெளி தொகுப்புகள்`_ ஐப் பயன்படுத்தவும். இது `pkgutil- பாணி பெயர்வெளி தொகுப்புகள்`_ மற்றும்` pkg_resources- பாணி பெயர்வெளி தொகுப்புகள்`_ ஆகியவற்றைக் கொண்டுள்ளது.

source: Native namespace packages
eo: Indiĝenaj nomspacaj pakoj
ja: 組み込みの名前空間パッケージ
pt_br: Pacotes se espaço de nomes nativos
ru: Родные пакеты пространства имён
ta: சொந்த பெயர்வெளி தொகுப்புகள்

source: Python 3.3 added **implicit** namespace packages from :pep:`420`. All that is required to create a native namespace package is that you just omit :file:`__init__.py` from the namespace package directory. An example file structure (following :ref:`src-layout <setuptools:src-layout>`):
eo: Python 3.3 aldonis **implicitan** nomspacan pakon per :pep:`420`. Por krei indiĝenan nomspacan pakon, necesas nur preterlasi :file:`__init__.py` en la nomspaca paka dosierujo. Jen ekzempla dosierstrukturo (laŭ :ref:`src-layout <setuptools:src-layout>`):
ja: Python 3.3 では :pep:`420` から **暗黙の** 名前空間パッケージを追加しました。ネイティブな名前空間パッケージを作成するのに必要なことは、名前空間パッケージのディレクトリから :file:`__init__.py` を取り除くことだけです。ファイル構造の例はこちら (:ref:`ソースコードレイアウト <setuptools.src-layout>` に従います):
pt_br: Python 3.3 adicionou pacotes de espaço de nomes **implícitos** a partir da :pep:`420`. Tudo o que é necessário para criar um pacote de espaço de nomes nativo é omitir :file:`__init__.py` do diretório do pacote de espaço de nomes. Um exemplo de estrutura de arquivo (seguindo :ref:`src-layout <setuptools:src-layout>`):
ru: В Python 3.3 добавлены **имплицитные** пакеты пространства имен из :pep:`420`. Все, что требуется для создания нативного пакета пространства имен, это просто опустить :file:`__init__.py` из каталога пакета пространства имен. Пример файловой структуры (в соответствии с :ref:`src-layout <setuptools:src-layout>`):
ta: பைதான் 3.3 சேர்க்கப்பட்டது ** மறைமுக ** பெயர்வெளி தொகுப்புகள்: பெப்: `420`. ஒரு சொந்த பெயர்வெளி தொகுப்பை உருவாக்க தேவையானது என்னவென்றால், நீங்கள் தவிர்க்கவும்: கோப்பு: `__init __. பெயர்வெளி தொகுப்பு கோப்பகத்திலிருந்து. ஒரு எடுத்துக்காட்டு கோப்பு அமைப்பு (பின்வருமாறு: குறிப்பு: `எச்.ஆர்.சி-லேஅவுட் <செட்டப்டூல்ச்: எச்.ஆர்.சி-லேஅவுட்>`):

source: It is extremely important that every distribution that uses the namespace package omits the :file:`__init__.py` or uses a pkgutil-style :file:`__init__.py`. If any distribution does not, it will cause the namespace logic to fail and the other sub-packages will not be importable.
eo: Gravegas, ke ĉiu distribuo uzanta la nomspacan pakon aŭ ne havas :file:`__init__.py` aŭ havas pkgutil-stilan :file:`__init__.py`. Se iu distribuo ne faras tion, tio malsukcesigos la nomspacan logikon, kaj tial la aliaj subpakoj ne estos importeblaj.
ja: 名前空間パッケージを用いる各配布物で :file:`__init__.py` を省くこと、または、 pkgutil 型の :file:`__init__.py` を使用することが極めて重要です。もしいずれかの配布物でこれを忘れると、名前空間の論理が破綻して、他のサブパッケージをインポートすることができなくなります。
pt_br: É extremamente importante que toda distribuição que usa o pacote de espaço de nomes omita o :file:`__init__.py` ou use um :file:`__init__.py` no estilo pkgutil. Se alguma distribuição não o fizer, isso fará com que a lógica do espaço de nomes falhe e os outros subpacotes não serão importáveis.
ru: Очень важно, чтобы каждый дистрибутив, использующий пакет namespace, опускал :file:`__init__.py` или использовал :file:`__init__.py` в стиле pkgutil. Если какой-либо дистрибутив этого не сделает, это приведет к сбою логики пространства имен, и другие подпакеты не будут импортированы.
ta: பெயர்வெளி தொகுப்பைப் பயன்படுத்தும் ஒவ்வொரு விநியோகமும் பின்வாங்குவது மிகவும் முக்கியம்: கோப்பு: `__init __. Py` அல்லது pkgutil- பாணியைப் பயன்படுத்துகிறது: கோப்பு:` __init __. Py`. எந்தவொரு விநியோகமும் இல்லையென்றால், அது பெயர்வெளி வழக்கு தோல்வியடையும், மற்ற துணை தொகுப்புகள் இறக்குமதி செய்யப்படாது.

source: The ``src-layout`` directory structure allows automatic discovery of packages by most :term:`build backends <Build Backend>`. See :ref:`src-layout-vs-flat-layout` for more information. If however you want to manage exclusions or inclusions of packages yourself, this is possible to be configured in the top-level :file:`pyproject.toml`:
ja: ``src-layout`` ディレクトリ構造によって、ほとんどの :term:`ビルドバックエンド <Build Backend>` が自動的にパッケージ群を発見できるようになります。もっと情報が欲しい場合は :ref:`src-layout-vs-flat-layout` を見てください。しかしながら、パッケージの包含・除外を自分自身で管理したいのであれば、トップレベルの :file:`pyproject.toml` を設定することで可能です:
pt_br: A estrutura de diretórios ``src-layout`` permite a descoberta automática de pacotes pela maioria dos :term:`backends de construção <Build Backend>`. Veja :ref:`src-layout-vs-flat-layout` para mais informações. Se, no entanto, você mesmo deseja gerenciar exclusões ou inclusões de pacotes, isso é possível de ser configurado no :file:`pyproject.toml` de nível superior:
ru: Структура каталогов ``rc-layout`` позволяет автоматически находить пакеты большинством :term:`build backends <Build Backend>`. Более подробную информацию смотрите в :ref:`src-layout-vs-flat-layout. Если же вы хотите самостоятельно управлять исключениями или включениями пакетов, это можно настроить в верхнем уровне :file:`pyproject.toml`:
ta: `` எச்.ஆர்.சி-லேஅவுட்`` அடைவு அமைப்பு பெரும்பாலானவற்றால் தொகுப்புகளை தானாக கண்டுபிடிப்பதை அனுமதிக்கிறது: கால: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>`. காண்க: குறிப்பு: மேலும் தகவலுக்கு `எச்.ஆர்.சி-லேஅவுட்-வி.எச்-பிளாட்-லேஅவுட்`. எவ்வாறாயினும், தொகுப்புகளின் விலக்குகள் அல்லது சேர்த்தல்களை நீங்களே நிர்வகிக்க விரும்பினால், இது உயர் மட்டத்தில் கட்டமைக்க முடியும்: கோப்பு: `pyproject.toml`:

source: The same can be accomplished with a :file:`setup.cfg`:
eo: Oni povas fari la samon per :file:`setup.cfg`:
ja: 同じことが :file:`setup.cfg` で達成できます:
pt_br: O mesmo pode ser feito com um :file:`setup.cfg`:
ru: То же самое можно сделать с помощью :file:`setup.cfg`:
ta: ஒரு: கோப்பு: `setup.cfg`:

source: Or :file:`setup.py`:
eo: Aŭ :file:`setup.py`:
ja: または :file:`setup.py` ファイル:
pt_br: Ou :file:`setup.py`:
ru: Или :файл:`setup.py`:
ta: அல்லது: கோப்பு: `setup.py`:

source: :ref:`setuptools` will search the directory structure for implicit namespace packages by default.
eo: :ref:`setuptools` aŭtomate serĉos implicitajn nomspacajn pakojn en la dosieruja strukturo.
ja: :ref:`setuptools` は、デフォルトでは暗黙の名前空間パッケージを探してディレクトリ構造を探索します。
pt_br: :ref:`setuptools` irá pesquisar na estrutura de diretórios por pacotes de espaço de nomes implícitos por padrão.
ru: :ref:`setuptools` по умолчанию будет искать в структуре каталогов пакеты неявного пространства имен.
ta: :ref:`setuptools` will தேடல் the directory structure க்கு implicit பெயர்வெளி தொகுப்பு by default.

source: A complete working example of two native namespace packages can be found in the `native namespace package example project`_.
eo: Plena funkcianta ekzemplo de du indiĝenaj nomspacaj pakoj troviĝas en la `indiĝen-nomspaca ekzempla projekto <native namespace package example project>`_.
ja: ふたつの名前空間パッケージの完全な動作例は、 `組み込みの名前空間パッケージの使用例プロジェクト`_ にあります。
pt_br: Um exemplo de trabalho completo de dois pacotes de espaço de nomes nativos pode ser encontrado no `projeto exemplo de pacote de espaço de nomes nativo`_.
ru: Полный рабочий пример двух пакетов нативного пространства имен можно найти в проекте `Пример пакета нативного пространства имен`_.
ta: இரண்டு சொந்த பெயர்வெளி தொகுப்புகளின் முழுமையான வேலை உதாரணத்தை `சொந்த பெயர்வெளி தொகுப்பு எடுத்துக்காட்டு திட்டம்`_ இல் காணலாம்.

source: Because native and pkgutil-style namespace packages are largely compatible, you can use native namespace packages in the distributions that only support Python 3 and pkgutil-style namespace packages in the distributions that need to support Python 2 and 3.
eo: Ĉar indiĝenaj kaj pkgutil-stilaj nomspacaj pakoj estas plejparte kongruaj, oni povas uzi indiĝenan nomspacan pakon en distribuo nur por Python 3 kaj pkgutil-stilan nomspacan pakon en distribuo por kaj Python 2 kaj Python 3.
ja: 組み込み名前空間パッケージと pkgutil 型の名前空間パッケージは、多くの部分で互換性があるので、 Python 3 しかサポートしない配布物では組み込み名前空間パッケージを使用し、 Python 2 と Python 3 の両方をサポートしなければならない配布物では pkgutil型名前空間パッケージを使うことが可能です。
pt_br: Como os pacotes de espaço de nomes nativos e no estilo pkgutil são amplamente compatíveis, você pode usar pacotes de espaço de nomes nativos nas distribuições que oferecem suporte apenas a Python 3 e pacotes de espaço de nomes no estilo pkgutil nas distribuições que precisam oferecer suporte a Python 2 e 3.
ru: Поскольку пакеты пространства имен native и pkgutil-style в значительной степени совместимы, вы можете использовать пакеты пространства имен native в дистрибутивах, поддерживающих только Python 3, и пакеты пространства имен pkgutil-style в дистрибутивах, которые должны поддерживать Python 2 и 3.
ta: பூர்வீக மற்றும் PKGUTIL- பாணி பெயர்வெளி தொகுப்புகள் பெரும்பாலும் இணக்கமானவை என்பதால், பைத்தான் 2 மற்றும் 3 ஐ ஆதரிக்க வேண்டிய விநியோகங்களில் பைதான் 3 மற்றும் PKGUTIL- பாணி பெயர்வெளி தொகுப்புகளை மட்டுமே ஆதரிக்கும் விநியோகங்களில் நீங்கள் சொந்த பெயர்வெளி தொகுப்புகளைப் பயன்படுத்தலாம்.

source: Legacy namespace packages
eo: Malnovaj nomspacaj pakoj
ja: 伝統的な名前空間パッケージ群
pt_br: Pacotes de espaço de nomes legados
ru: Унаследованные пакеты пространства имен
ta: மரபு பெயர்வெளி தொகுப்புகள்

source: These two methods, that were used to create namespace packages prior to :pep:`420`, are now considered to be obsolete and should not be used unless you need compatibility with packages already using this method. Also, :doc:`pkg_resources <setuptools:pkg_resources>` has been deprecated.
eo: Tiuj du metodoj por krei nomspacopakojn antaŭ :pep:`420`, nun estas malnoviĝintaj kaj evitindaj krom se oni bezonas kongruecon kun pako jam uzanta tiun metodon. Ankaŭ, :doc:`pkg_resources <setuptools:pkg_resources>` estas evitinda.
ja: これらのふたつの方法は、 :pep:`420` 以前に名前空間を作成するのに使われましたが、今では過去のやり方であると考えられていて、すでにこの方法を使っているパッケージとの互換性を必要とする場合を除いては使われるべきではないと考えられています。また、 :doc:`pkg_resources <setuptools:pkg_resources>` は非推奨になりました。
pt_br: Esses dois métodos, que eram usados para criar pacotes de espaço de nomes antes de :pep:`420`, agora são considerados descontinuados e não devem ser usados a menos que você precise de compatibilidade com pacotes que já usam esse método. Além disso, :doc:`pkg_resources <setuptools:pkg_resources>` foi descontinuado.
ru: Эти два метода, которые использовались для создания пакетов пространства имен до появления :pep:`420`, теперь считаются устаревшими и не должны использоваться, если вам не нужна совместимость с пакетами, уже использующими этот метод. Кроме того, :doc:`pkg_resources <setuptools:pkg_resources>` был устаревшим.
ta: இதற்கு முன்னர் பெயர்வெளி தொகுப்புகளை உருவாக்கப் பயன்படுத்தப்பட்ட இந்த இரண்டு முறைகள்: PEP: `420`, இப்போது வழக்கற்றுப் போய்விட்டதாகக் கருதப்படுகின்றன, மேலும் இந்த முறையைப் பயன்படுத்தும் தொகுப்புகளுடன் உங்களுக்கு பொருந்தக்கூடிய தன்மை தேவைப்பட்டால் பயன்படுத்தப்படக்கூடாது. மேலும், டிஓசி: `பி.கே.

source: To migrate an existing package, all packages sharing the namespace must be migrated simultaneously.
eo: Por migri ekzistantan pakon, ĉiuj pakoj en la nomspaco devas esti migritaj samtempe.
ja: 既存のパッケージを移植するためには、名前空間を共有するすべてのパッケージが同時に移植されなければなりません。
pt_br: Para migrar um pacote existente, todos os pacotes que compartilham o espaço de nomes devem ser migrados simultaneamente.
ru: Чтобы перенести существующий пакет, необходимо одновременно перенести все пакеты, разделяющие это пространство имен.
ta: ஏற்கனவே உள்ள தொகுப்பை இடம்பெயர, பெயர்வெளியைப் பகிரும் அனைத்து தொகுப்புகளும் ஒரே நேரத்தில் இடம்பெயர வேண்டும்.

source: While native namespace packages and pkgutil-style namespace packages are largely compatible, pkg_resources-style namespace packages are not compatible with the other methods. It's inadvisable to use different methods in different distributions that provide packages to the same namespace.
eo: Dum indiĝena nomspaca pako kaj pkgutil-stila nomspaca pako kongruas inter si, pkg_resources-stila nomspaca pako ne kongruas kun la aliaj metodoj. Estas malrekomendate miksi plurajn metodojn en malsamaj distribuoj provizantaj pakojn en la saman nomspacon.
ja: 組み込みの名前空間パッケージや pkgutil 型の名前空間パッケージは多くの点で互換性がありますが、 pkg_resources 型の名前空間パッケージは他の手法とは互換性がありません。同じ名前空間向けにパッケージを提供するような複数の配布物で、異なる手法を用いることは推奨されません。
pt_br: Embora os pacotes de espaço de nomes nativos e pacotes de espaço de nomes no estilo pkgutil sejam amplamente compatíveis, os pacotes de espaço de nomes no estilo pkg_resources não são compatíveis com os outros métodos. Não é aconselhável usar métodos diferentes em distribuições diferentes que fornecem pacotes para o mesmo espaço de nomes.
ru: В то время как пакеты родного пространства имен и пакеты пространства имен в стиле pkgutil в основном совместимы, пакеты пространства имен в стиле pkg_resources не совместимы с другими методами. Нежелательно использовать разные методы в разных дистрибутивах, предоставляющих пакеты для одного и того же пространства имен.
ta: சொந்த பெயர்வெளி தொகுப்புகள் மற்றும் PKGUTIL- பாணி பெயர்வெளி தொகுப்புகள் பெரும்பாலும் இணக்கமானவை என்றாலும், PKG_RESOURCES- பாணி பெயர்வெளி தொகுப்புகள் மற்ற முறைகளுடன் பொருந்தாது. ஒரே பெயர்வெளிக்கு தொகுப்புகளை வழங்கும் வெவ்வேறு விநியோகங்களில் வெவ்வேறு முறைகளைப் பயன்படுத்துவது தவிர்க்க முடியாதது.

source: pkgutil-style namespace packages
eo: pkgutil-stilaj nomspacaj pakoj
ja: pkgutil 型名前空間パッケージ
pt_br: Pacotes de espaço de nomes no estilo pkgutil
ru: Пакеты пространства имён в стиле pkgutil
ta: Pkgutil- பாணி பெயர்வெளி தொகுப்புகள்

source: Python 2.3 introduced the :doc:`pkgutil <python:library/pkgutil>` module and the :py:func:`python:pkgutil.extend_path` function. This can be used to declare namespace packages that need to be compatible with both Python 2.3+ and Python 3. This is the recommended approach for the highest level of compatibility.
eo: Python 2.3 enkondukis la modulon :doc:`pkgutil <python:library/pkgutil>` kaj la funkcion :py:func:`python:pkgutil.extend_path`. Oni povas uzi tiujn por deklari nomspacopakon kongruan kun kaj Python 2.3+ kaj Python 3. Tio estas la rekomendata metodo por la plej alta nivelo de kongrueco.
ja: Python 2.3 で :doc:`pkgutil <python:library/pkgutil>` モジュールと :py:func:`python:pkgutil.extend_path` 関数が導入されました。Python 2.3+ と Python 3 の両方に互換性を持つ必要がある名前空間パッケージを宣言するのにこれが使えるかもしれません。これは、互換性のレベルが最も高くなるアプローチとして推奨されています。
pt_br: Python 2.3 introduziu o módulo :doc:`pkgutil <python:library/pkgutil>` e a função :py:func:`python:pkgutil.extend_path`. Isso pode ser usado para declarar pacotes de espaço de nomes que precisam ser compatíveis com Python 2.3+ e Python 3. Esta é a abordagem recomendada para o nível mais alto de compatibilidade.
ru: В Python 2.3 появился модуль :doc:`pkgutil <python:library/pkgutil>` и функция :py:func:`python:pkgutil.extend_path`. Это можно использовать для объявления пакетов пространства имен, которые должны быть совместимы как с Python 2.3+, так и с Python 3. Это рекомендуемый подход для достижения максимального уровня совместимости.
ta: பைதான் 2.3 அறிமுகப்படுத்தியது: டாக்: `pkgutil <python: நூலகம்/pkgutil>` தொகுதி மற்றும்: py: func: `python: pkgutil.extend_path` செயல்பாடு. பைதான் 2.3+ மற்றும் பைதான் 3 ஆகிய இரண்டிற்கும் இணக்கமாக இருக்க வேண்டிய பெயர்வெளி தொகுப்புகளை அறிவிக்க இதைப் பயன்படுத்தலாம். இது மிக உயர்ந்த பொருந்தக்கூடிய அளவிற்கு பரிந்துரைக்கப்பட்ட அணுகுமுறையாகும்.

source: To create a pkgutil-style namespace package, you need to provide an :file:`__init__.py` file for the namespace package:
eo: Por krei pkgutil-stilan nomspacan pakon, oni devas provizi dosieron :file:`__init__.py` por la nomspaca pako:
ja: pkgutil 型の名前空間パッケージを作成するには、その名前空間パッケージ用に :file:`__init__.py` ファイルを準備する必要があります:
pt_br: Para criar um pacote de espaço de nomes no estilo pkgutil, você precisa fornecer um arquivo :file:`__init__.py` para o pacote de espaço de nomes:
ru: Чтобы создать пакет пространства имен в стиле pkgutil, вам нужно предоставить файл :file:`__init__.py` для пакета пространства имен:
ta: ஒரு pkgutil- பாணி பெயர்வெளி தொகுப்பை உருவாக்க, நீங்கள் ஒரு: கோப்பு: `__init __. பெயர்வெளி தொகுப்புக்கான கோப்பு:

source: The :file:`__init__.py` file for the namespace package needs to contain the following:
eo: La dosiero :file:`__init__.py` por la nomspaca pako devas enhavi la jenon:
ja: 名前空間パッケージ用の :file:`__init__.py` ファイルは、次に示すものを含んでいる必要があります:
pt_br: O arquivo :file:`__init__.py` para o pacote de espaço de nomes precisa conter o seguinte:
ru: Файл :file:`__init__.py` для пакета namespace должен содержать следующее:
ta: தி: கோப்பு: `__init __. பெயர்வெளி தொகுப்புக்கான கோப்பு பின்வருவனவற்றைக் கொண்டிருக்க வேண்டும்:

source: **Every** distribution that uses the namespace package must include such an :file:`__init__.py`. If any distribution does not, it will cause the namespace logic to fail and the other sub-packages will not be importable. Any additional code in :file:`__init__.py` will be inaccessible.
eo: **Ĉiu** distribuo uzanta la nomspacan pakon devas inkluzivi tian :file:`__init__.py`. Se distribuo ne inkluzivus tian, la namspaca logiko malsukcesus, kaj aliaj subpakoj ne estus importeblaj. Ajna kroma kodo en :file:`__init__.py` ne estus uzebla.
ja: ある名前空間パッケージを用いる **すべての** 配布物は、 :file:`__init__.py` を持っていなければなりません。もしいずれかの配布物でそうなっていなければ、名前空間の論理破綻を招き、他のサブパッケージをインポートすることができなくなるでしょう。 :file:`__init__.py` に他のコードを追加しても、それはアクセスできないものとなるでしょう。
pt_br: **Cada** distribuição que usa o pacote de espaço de nomes deve incluir um :file:`__init__.py`. Se alguma distribuição não o fizer, isso fará com que a lógica do espaço de nomes falhe e os outros subpacotes não serão importáveis. Qualquer código adicional no :file:`__init__.py` ficará inacessível.
ru: **Каждый** дистрибутив, использующий пакет namespace, должен включать такой :файл:`__init__.py`. Если дистрибутив не включит его, это приведет к сбою логики пространства имен, и другие подпакеты будут недоступны для импорта. Любой дополнительный код в :file:`__init__.py` будет недоступен.
ta: ** பெயர்வெளி தொகுப்பைப் பயன்படுத்தும் ஒவ்வொரு ** விநியோகமும் அத்தகைய: கோப்பு: __init __. Py`. எந்தவொரு விநியோகமும் இல்லையென்றால், அது பெயர்வெளி வழக்கு தோல்வியடையும், மற்ற துணை தொகுப்புகள் இறக்குமதி செய்யப்படாது. ஏதேனும் கூடுதல் குறியீடு: கோப்பு: `__init __. Py` அணுக முடியாததாக இருக்கும்.

source: A complete working example of two pkgutil-style namespace packages can be found in the `pkgutil namespace example project`_.
eo: Plena funkcianta ekzemplo de du pkgutil-stilaj nomspacaj pakoj troviĝas en la `pkgutil-nomspaca ekzempla projekto <pkgutil namespace example project>`_.
ja: pkgutil 型の名前空間パッケージのふたつの動作例が `pkgutil 型名前空間を例示するプロジェクト`_ にあります。
pt_br: Um exemplo completamente funcional de dois pacotes de espaço de nomes no estilo pkgutil pode ser encontrado no `projeto exemplo de espaço de nomes de pkgutil`_.
ru: Полный рабочий пример двух пакетов пространства имен в стиле pkgutil можно найти в проекте `pkgutil namespace example`_.
ta: இரண்டு Pkgutil- பாணி பெயர்வெளி தொகுப்புகளின் முழுமையான வேலை உதாரணத்தை `pkgutil பெயர்வெளி எடுத்துக்காட்டு திட்டம்`_ இல் காணலாம்.

source: pkg_resources-style namespace packages
eo: pkg_resources-stilaj nomspacaj pakoj
ja: pkg_resources 型名前空間パッケージ
pt_br: Pacotes de espaço de nomes no estilo pkg_resources
ru: Пакеты пространства имён в стиле pkg_resources
ta: PKG_RESOURCES-பாணி பெயர்வெளி தொகுப்புகள்
