Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If the specified version identifier is a local version identifier, then the local version labels of candidate versions MUST be considered when matching versions, with the public version identifier being matched as described above, and the local version label being checked for equivalence using a strict string equality comparison.
ja: 指定されたバージョン識別子がローカルバージョン識別子であるなら、バージョン間のマッチングでは、候補バージョンのローカルバージョンラベルは上記の通り公開バージョン識別子と合致するか確かめられ、ローカルバージョンラベルは厳密な文字列の同一性比較を使って同一であるかどうか確認されます。
ru: Если указанный идентификатор версии является локальным идентификатором версии, то локальные метки версий-кандидатов ДОЛЖНЫ учитываться при сопоставлении версий, при этом публичный идентификатор версии сопоставляется, как описано выше, а метка локальной версии проверяется на эквивалентность с помощью строгого сравнения равенства строк.
ta: குறிப்பிட்ட பதிப்பு அடையாளங்காட்டி ஒரு உள்ளக பதிப்பு அடையாளங்காட்டியாக இருந்தால், பதிப்புகளுடன் பொருந்தும்போது வேட்பாளர் பதிப்புகளின் உள்ளக பதிப்பு லேபிள்கள் கருத்தில் கொள்ளப்பட வேண்டும், மேலே விவரிக்கப்பட்டபடி பொது பதிப்பு அடையாளங்காட்டி பொருந்தும், மேலும் உள்ளக பதிப்பு சிட்டை ஒரு கடுமையான சரம் சமத்துவ ஒப்பீட்டைப் பயன்படுத்தி சமநிலைக்கு சரிபார்க்கப்படுகிறது.

source: Version exclusion
eo: Ekskluzivo de versio
ja: バージョンの除外 <Version exclusion>
ru: Исключение версии
ta: பதிப்பு விலக்கு

source: A version exclusion clause includes the version exclusion operator ``!=`` and a version identifier.
eo: Versi-ekskluzivada kondiĉo konsistas el la versio-ekskluzivada operatoro ``!=`` kaj versia identigilo.
ja: バージョンの除外節は、バージョン除外演算子 ``!=`` とバージョン識別子を含みます。
ru: Предложение об исключении версии включает оператор исключения версии ``!=`` и идентификатор версии.
ta: பதிப்பு விலக்கு பிரிவில் பதிப்பு விலக்கு ஆபரேட்டர் ``! = `` மற்றும் பதிப்பு அடையாளங்காட்டி ஆகியவை அடங்கும்.

source: The allowed version identifiers and comparison semantics are the same as those of the `Version matching`_ operator, except that the sense of any match is inverted.
eo: La permesataj versio-identigiloj kaj la semantiko de komparado estas sama kiel tiuj de la operatoro de `Versia egaleco <Version matching>`_, krom ke la senco de kongrueco estas mala.
ja: 許されるバージョン識別子と比較のセマンティックスは、マッチの意味が反転している点を除けば `バージョン番号のマッチング <Version matching>`_ 演算子のそれと同一です。
ru: Допустимые идентификаторы версий и семантика сравнения те же, что и у оператора `Version matching`_, за исключением того, что смысл любого совпадения инвертируется.
ta: அனுமதிக்கப்பட்ட பதிப்பு அடையாளங்காட்டிகள் மற்றும் ஒப்பீட்டு சொற்பொருள்கள் `பதிப்பு பொருத்துதல்`_ ஆபரேட்டருக்கு சமமானவை, தவிர எந்தவொரு போட்டியின் உணர்வும் தலைகீழாக உள்ளது.

source: Inclusive ordered comparison
eo: Inkluziva ordita komparo
ja: 境界を含む順序比較 <Inclusive ordered comparison>
pt_br: Comparação ordenada inclusiva
ru: Всеобъемлющее упорядоченное сравнение
ta: உள்ளடக்கிய உத்தரவிட்ட ஒப்பீடு

source: An inclusive ordered comparison clause includes a comparison operator and a version identifier, and will match any version where the comparison is correct based on the relative position of the candidate version and the specified version given the consistent ordering defined by the standard `Version scheme`_.
ja: 境界を含む順序比較節は比較演算子とバージョン識別子を含み、候補バージョンの相対的な位置と指定されたバージョンに対して与えられる標準の `バージョン番号枠組み <Version scheme>`_ によって定義される首尾一貫した順序付けに基づいてその比較が正しいかどうかを任意のバージョン番号に対して行います。
ru: Предложение инклюзивного упорядоченного сравнения включает оператор сравнения и идентификатор версии, и будет соответствовать любой версии, где сравнение корректно на основе относительного положения версии-кандидата и указанной версии с учетом последовательного упорядочивания, определенного стандартной `Version scheme`_.
ta: உள்ளடக்கிய ஆர்டர் செய்யப்பட்ட ஒப்பீட்டு பிரிவில் ஒரு ஒப்பீட்டு ஆபரேட்டர் மற்றும் பதிப்பு அடையாளங்காட்டி ஆகியவை அடங்கும், மேலும் வேட்பாளர் பதிப்பின் ஒப்பீட்டு நிலை மற்றும் நிலையான `பதிப்பு திட்டம்`_ ஆல் வரையறுக்கப்பட்ட நிலையான வரிசைப்படுத்தல் கொடுக்கப்பட்ட குறிப்பிட்ட பதிப்பின் அடிப்படையில் ஒப்பீடு சரியானதாக இருக்கும் எந்த பதிப்பையும் பொருத்துகிறது.

source: The inclusive ordered comparison operators are ``<=`` and ``>=``.
eo: La operatoroj de inkluziva orda komparo estas ``<=`` kaj ``>=``.
ja: 境界を含む順序比較の演算子は ``<=`` と ``>=`` です。
ru: Инклюзивные операторы упорядоченного сравнения - ``<=`` и ``>=``.
ta: உள்ளடக்கிய உத்தரவிடப்பட்ட ஒப்பீட்டு ஆபரேட்டர்கள் `` <= `` மற்றும் ``> = ``.

source: As with version matching, the release segment is zero padded as necessary to ensure the release segments are compared with the same length.
eo: Same kiel kongrueco de versioj, la eldonsegmento estas antaŭita de tiom da nuloj, kiom necesas por certigi, ke la eldonsegmentoj kompariĝas je la sama longo.
ja: バージョン番号のマッチングと同様に、リリース番号構成部分が同じ長さで比較されることを担保するために、リリース番号構成部分は必要に応じてゼロでパディングされます。
ru: Как и при сопоставлении версий, сегмент выпуска обнуляется по мере необходимости, чтобы сегменты выпуска сравнивались с одинаковой длиной.
ta: பதிப்பு பொருத்தத்தைப் போலவே, வெளியீட்டு பிரிவுகள் ஒரே நீளத்துடன் ஒப்பிடப்படுவதை உறுதிசெய்ய தேவையான அளவு பூச்சியத் துடுப்பு ஆகும்.

source: Local version identifiers are NOT permitted in this version specifier.
eo: Loka versia identigilo NE estas permesata en ĉi tiu versispecifilo.
ja: ローカルバージョン識別子は、このバージョン識別子の中では許されません。
ru: Локальные идентификаторы версий в этом спецификаторе версий НЕ допускаются.
ta: இந்த பதிப்பு விவரக்குறிப்பில் உள்ளக பதிப்பு அடையாளங்காட்டிகள் அனுமதிக்கப்படவில்லை.

source: Exclusive ordered comparison
eo: Ekskluziva ordita komparo
ja: 境界を含まない順序比較 <Exclusive ordered comparison>
pt_br: Comparação ordenada exclusiva
ru: Исключительное упорядоченное сравнение
ta: பிரத்தியேக உத்தரவிடப்பட்ட ஒப்பீடு

source: The exclusive ordered comparisons ``>`` and ``<`` are similar to the inclusive ordered comparisons in that they rely on the relative position of the candidate version and the specified version given the consistent ordering defined by the standard `Version scheme`_. However, they specifically exclude pre-releases, post-releases, and local versions of the specified version.
ja: 境界を含まない順序比較である ``>`` と ``<`` は、標準の `バージョン番号枠組み <Version scheme>`_ によって定義される首尾一貫した順序付けが与える候補バージョンと指定されたバージョン番号の相対的な位置に依存する点で、境界を含む順序比較と似ています。しかしながら、指定されたバージョン番号のプレリリース・ポストリリース・ローカルバージョンの部分を除外します。
ru: Исключительные упорядоченные сравнения ``>`` и ``<``` похожи на инклюзивные упорядоченные сравнения в том, что они полагаются на относительное положение версии-кандидата и указанной версии с учетом последовательного упорядочивания, определенного стандартной `Version scheme`_. Однако они специально исключают пре-релизы, пост-релизы и локальные версии указанной версии.
ta: பிரத்தியேக ஆர்டர் செய்யப்பட்ட ஒப்பீடுகள் ``> `` மற்றும் `` <`` ஆகியவை உள்ளடக்கிய உத்தரவிடப்பட்ட ஒப்பீடுகளுக்கு ஒத்தவை, அவை வேட்பாளர் பதிப்பின் ஒப்பீட்டு நிலையை நம்பியுள்ளன, மேலும் நிலையான `பதிப்பு திட்டம்`_ ஆல் வரையறுக்கப்பட்ட நிலையான வரிசைப்படுத்தல் கொடுக்கப்பட்ட குறிப்பிட்ட பதிப்பாகும். இருப்பினும், அவை குறிப்பிட்ட பதிப்பின் முன் வெளியீடுகள், பிந்தைய வெளியீடுகள் மற்றும் உள்ளக பதிப்புகளை குறிப்பாக விலக்குகின்றன.

source: The exclusive ordered comparison ``>V`` **MUST NOT** allow a post-release of the given version unless ``V`` itself is a post release. You may mandate that releases are later than a particular post release, including additional post releases, by using ``>V.postN``. For example, ``>1.7`` will allow ``1.7.1`` but not ``1.7.0.post1`` and ``>1.7.post2`` will allow ``1.7.1`` and ``1.7.0.post3`` but not ``1.7.0``.
eo: La eksluzive ordita komparo ``>V`` **DEVAS NE** permesi posteldonon de la donito krom se ``V`` mem estas posteldono. Oni povas devigi, ke eldono estu pli nova ol iu posteldono (inkluzive de pliaj posteldonoj), uzante ``>V.postN``. Ekzemple, ``>1.7`` permesas ``1.7.1`` sed ne ``1.7.0.post1``; ``>1.7.post2`` permesas ``1.7.1`` kaj ``1.7.0.post3`` sed ne ``1.7.0``.
ja: 境界を含まない順序比較である ``>V`` は、``V`` それ自身がポストリリース番号である場合を除いて、与えられたバージョン番号のポストリリース部分を **許してはなりません** 。 ``>V.postN`` を使うことで、特定のポストリリースバージョンよりも新しいリリースを要求しても構いません。例えば、 ``>1.7`` は ``1.7.1`` を許容しますが ``1.7.0.post1`` を許容せず、 ``>1.7.post2`` は ``1.7.1`` や ``1.7.0.post3`` を許容しますが ``1.7.0`` を許容しません。
ru: Исключительное упорядоченное сравнение ``>V`` **НЕ ДОЛЖНО** допускать пост-релиз данной версии, если только ``V`` сам не является пост-релизом. Вы можете запретить релизы более поздние, чем определенный пост-релиз, включая дополнительные пост-релизы, используя ``>V.postN``. Например, ``>1.7`` разрешит ``1.7.1``, но не ``1.7.0.post1``, а ``>1.7.post2`` разрешит ``1.7.1`` и ``1.7.0.post3``, но не ``1.7.0``.
ta: பிரத்யேக உத்தரவிடப்பட்ட ஒப்பீடு ``> v`` ** ** கொடுக்கப்பட்ட பதிப்பின் பிந்தைய வெளியீட்டை அனுமதிக்கக்கூடாது `` v`` ஒரு இடுகை வெளியீடு. ``> V.postn`` ஐப் பயன்படுத்துவதன் மூலம் கூடுதல் இடுகை வெளியீடுகள் உட்பட ஒரு குறிப்பிட்ட இடுகை வெளியீட்டை விட வெளியீடுகள் பின்னர் இருக்க வேண்டும் என்று நீங்கள் கட்டளையிடலாம். எடுத்துக்காட்டாக, ``> 1.7`` `` 1.7.1`` ஆனால் `` 1.7.0.post1`` மற்றும் `> 1.7.post2`` ஐ அனுமதிக்கும்` `1.7.1``` மற்றும்` `1.7.0.post3`` அல்ல, ஆனால்` `1.7.0``.

source: The exclusive ordered comparison ``>V`` **MUST NOT** match a local version of the specified version.
eo: La ekskluziva orda komparo ``>V`` **DEVAS NE** kongrui kun loka versio de la specifita versio.
ja: 境界を含まない順序比較 ``>V`` は、指定されたバージョン番号のローカルバージョン部分と **比較してはなりません**。
ru: Исключительное упорядоченное сравнение ``>V`` **НЕ ДОЛЖНО** соответствовать локальной версии указанной версии.
ta: பிரத்யேக ஆர்டர் செய்யப்பட்ட ஒப்பீடு ``> v`` ** குறிப்பிட்ட பதிப்பின் உள்ளக பதிப்போடு பொருந்தக்கூடாது.

source: The exclusive ordered comparison ``<V`` **MUST NOT** allow a pre-release of the specified version unless the specified version is itself a pre-release. Allowing pre-releases that are earlier than, but not equal to a specific pre-release may be accomplished by using ``<V.rc1`` or similar.
ja: 境界を含まない順序比較の ``<V`` では、指定されたバージョン番号それ自身がプレリリース番号でない限り、指定されたバージョン番号にプレリリース部分が **あってはなりません** 。 ``<V.rc1`` や同様のものを使えば、指定されたプレリリース番号を含まずにそれより前であるプレリリース番号を許容することができるでしょう。
ru: Исключительное упорядоченное сравнение ``<V`` **НЕ ДОЛЖНО** разрешать предварительный выпуск указанной версии, если только указанная версия сама не является предварительным выпуском. Разрешение предварительных версий, которые являются более ранними, но не равными определенной предварительной версии, может быть достигнуто с помощью ``<V.rc1`` или аналогичных.
ta: குறிப்பிட்ட பதிப்பு தானே ஒரு முன் வெளியீடாக இல்லாவிட்டால், குறிப்பிட்ட பதிப்பின் முன் வெளியிட அனுமதிக்கக்கூடாது ** பிரத்யேக உத்தரவிடப்பட்ட ஒப்பீடு `` <v`` **. முந்தையதை விட முந்தைய வெளியீடுகளை அனுமதிப்பது, ஆனால் ஒரு குறிப்பிட்ட முன் வெளியீட்டிற்கு சமமாக இல்லாதது `` <v.rc1`` அல்லது அதற்கு ஒத்ததாகப் பயன்படுத்துவதன் மூலம் நிறைவேற்றப்படலாம்.

source: Arbitrary equality
eo: Arbitra egaleco
ja: あらゆる意味での同一性 <Arbitrary equality>
pt_br: Igualdade arbitrária
ru: Произвольное равенство
ta: தன்னிச்சையான ஒரு நிகர்

source: Arbitrary equality comparisons are simple string equality operations which do not take into account any of the semantic information such as zero padding or local versions. This operator also does not support prefix matching as the ``==`` operator does.
ja: あらゆる意味での同一性比較は、ゼロパディングやローカルバージョンのような意味論的な情報を全く考慮しない単純な文字列の同一性演算です。この演算子は、また、 ``==`` 演算子なら実行するようなプレフィクスのマッチングもサポートしていません。
ru: Произвольные сравнения равенства - это простые операции равенства строк, которые не учитывают никакой семантической информации, такой как нулевая подстановка или локальные версии. Этот оператор также не поддерживает сопоставление префиксов, как это делает оператор ``==``.
ta: தன்னிச்சையான சமத்துவ ஒப்பீடுகள் எளிய சரம் சமத்துவ செயல்பாடுகள் ஆகும், அவை சுழிய திணிப்பு அல்லது உள்ளக பதிப்புகள் போன்ற சொற்பொருள் தகவல்களை கணக்கில் எடுத்துக்கொள்ளாது. `` == `` ஆபரேட்டர் செய்வதால் இந்த ஆபரேட்டர் முன்னொட்டு பொருத்தத்தை ஆதரிக்காது.

source: The primary use case for arbitrary equality is to allow for specifying a version which cannot otherwise be represented by this specification. This operator is special and acts as an escape hatch to allow someone using a tool which implements this specification to still install a legacy version which is otherwise incompatible with this specification.
ja: あらゆる意味での同一性比較の一義的なユースケースは、これを使わなければこの仕様によって表現され得ないようなバージョン番号を指定することを許容するということです。この演算子は特別で、誰かがこの仕様を実装したツールを使って、さもなければこの仕様とは非互換になってしまうようなレガシーなバージョンを、それでもインストールすることができる脱出ハッチとして振舞います。
ru: Основное использование произвольного равенства - это возможность указать версию, которая иначе не может быть представлена в данной спецификации. Этот оператор является специальным и действует как аварийный люк, позволяющий человеку, использующему инструмент, реализующий эту спецификацию, установить устаревшую версию, которая иначе несовместима с этой спецификацией.
ta: தன்னிச்சையான சமத்துவத்திற்கான முதன்மை பயன்பாட்டு வழக்கு இந்த விவரக்குறிப்பால் குறிப்பிட முடியாத ஒரு பதிப்பைக் குறிப்பிட அனுமதிப்பதாகும். இந்த ஆபரேட்டர் சிறப்பு வாய்ந்தது மற்றும் இந்த விவரக்குறிப்பைப் பயன்படுத்தும் ஒரு கருவியைப் பயன்படுத்தும் ஒருவரை அனுமதிக்க எச்கேப் அட்ச் ஆக செயல்படுகிறது, இது ஒரு மரபு பதிப்பை நிறுவுவதற்கு இன்னும் இந்த விவரக்குறிப்புடன் பொருந்தாது.

source: An example would be ``===foobar`` which would match a version of ``foobar``.
eo: Ekzemplo estas ``===foobar``, kiu kongruas kun la versio ``foobar``.
ja: 一つの例としては、``foobar`` というバージョン番号に合致するであろう ``==foobar`` ということになるでしょう。
ru: Примером может служить ``===foobar``, который будет соответствовать версии ``foobar``.
ta: ஒரு எடுத்துக்காட்டு `` === FOOBAR`` இது `` Foobar`` இன் பதிப்போடு பொருந்தும்.

source: This operator may also be used to explicitly require an unpatched version of a project such as ``===1.0`` which would not match for a version ``1.0+downstream1``.
eo: Tiu operator ankaŭ povas esti uzata por eksplicite postuli senflikan version de projekto, kiel ``===1.0```, kiu ne kongruus kun versio ``1.0+downstream1``.
ja: この演算子は、また、 ``1.0+downstream1`` のようなバージョンに合致しないであろうと思われる、 ``===1.0`` のようなプロジェクトのパッチ適用のないバージョンを明示的に要求するためにも使われます。
ru: Этот оператор также может быть использован для явного требования непропатченной версии проекта, например, ``===1.0``, которая не будет соответствовать версии ``1.0+downstream1``.
ta: `` === 1.0`` போன்ற திட்டத்தின் இணைக்கப்படாத பதிப்பு வெளிப்படையாக தேவைப்படலாம், இது ஒரு பதிப்பு `` 1.0+கீழ்நிலை 1`` உடன் பொருந்தாது.

source: Use of this operator is heavily discouraged and tooling MAY display a warning when it is used.
eo: Uzado de tiu operatoro estas evitindega, kaj ilo POVAS averti, kiam ĝi estas uzita.
ja: この演算子の使用は強い非推奨の状態にあり、使用に際してはツール類は警告を表示しても構いません。
ru: Использовать этот оператор крайне не рекомендуется, и оснастка ДОЛЖНА содержать предупреждение о его использовании.
ta: இந்த ஆபரேட்டரின் பயன்பாடு பெரிதும் ஊக்கமளிக்கிறது மற்றும் கருவி பயன்படுத்தப்படும்போது ஒரு எச்சரிக்கையைக் காட்டக்கூடும்.

source: Handling of pre-releases
eo: Pritraktado de antaŭeldonoj
ja: プレリリースの取り扱い <Handling of pre-releases>
ru: Работа с предварительными выпусками
ta: முன் வெளியீடுகளைக் கையாளுதல்

source: Pre-releases of any kind, including developmental releases, are implicitly excluded from all version specifiers, *unless* they are already present on the system, explicitly requested by the user, or if the only available version that satisfies the version specifier is a pre-release.
ja: すでにシステム上に存在しているか、ユーザによって明示的に要求されるか、または、バージョン指定子を満足する唯一の利用可能なバージョンがプレリリースであるか、の *いずれかでない限り* 、開発リリースを含むプレリリースは、どんな種類でも、あらゆるバージョン指定子から暗黙裡に除外されます。
ru: Предварительные версии любого рода, включая версии разработки, неявно исключаются из всех спецификаторов версий, *если* они уже присутствуют в системе, явно запрошены пользователем, или если единственная доступная версия, удовлетворяющая спецификатору версии, является предварительной версией.
ta: வளர்ச்சி வெளியீடுகள் உட்பட எந்தவொரு வகையிலும் முன் வெளியீடுகள் அனைத்து பதிப்பு குறிப்பான்களிலிருந்தும் மறைமுகமாக விலக்கப்படுகின்றன, * அவை ஏற்கனவே கணினியில் இருக்காவிட்டால், பயனரால் வெளிப்படையாகக் கோரப்பட்டவை, அல்லது பதிப்பு விவரக்குறிப்பை நிறைவு செய்யும் ஒரே பதிப்பு முன் வெளியீட்டிற்கு முன்பே.

source: By default, dependency resolution tools SHOULD:
eo: Implicite, dependecsolviloj FARU la jenon:
ja: デフォルトでは、依存関係を解決しようとするツール類は以下のことを行うべきです:
pt_br: Por padrão, ferramentas de resolução de dependências DEVEM:
ru: По умолчанию инструменты разрешения зависимостей ДОЛЖНЫ:
ta: இயல்பாக, சார்பு தீர்மானக் கருவிகள் வேண்டும்:

source: accept already installed pre-releases for all version specifiers
eo: akcepti jam instalitajn antaŭeldonojn por ĉiuj versispecifiloj
ja: 全てのバージョン指定子向けにすでにインストールされているプレリリースを受け入れる
ru: принимать уже установленные предварительные версии для всех спецификаторов версии
ta: அனைத்து பதிப்பு குறிப்பான்களுக்கும் ஏற்கனவே நிறுவப்பட்ட முன் வெளியீடுகளை ஏற்றுக்கொள்

source: accept remotely available pre-releases for version specifiers where there is no final or post release that satisfies the version specifier
eo: akcepti fore disponeblajn antaŭeldonojn por versispecifiloj, kiam mankas finan eldonon aŭ posteldonon plenumantan la versispecifilon
ja: バージョン指定子を満足するような最終リリースやポストリリースが存在しないリモートサイトにあって利用可能なプレリリースを、バージョン指定子として受け入れる
ru: принимать удаленно доступные предварительные выпуски для спецификаторов версий, если не существует финального или пост-выпуска, удовлетворяющего спецификатору версии
ta: பதிப்பு விவரக்குறிப்புகளை நிறைவு செய்யும் இறுதி அல்லது இடுகை வெளியீடு இல்லாத பதிப்பு குறிப்பான்களுக்கான தொலைதூரத்தில் கிடைக்கக்கூடிய முன் வெளியீடுகளை ஏற்றுக்கொள்ளுங்கள்

source: exclude all other pre-releases from consideration
eo: malakcepti ĉiujn aliajn antaŭeldonojn
ja: 他のすべてのプレリリースを考慮の対象から除外する
pt_br: excluir todos os outros pré-lançamentos da consideração
ru: исключить из рассмотрения все прочие предварительные продажи
ta: மற்ற எல்லா முன் வெளியீடுகளையும் பரிசீலிப்பதில் இருந்து விலக்குங்கள்

source: Dependency resolution tools MAY issue a warning if a pre-release is needed to satisfy a version specifier.
eo: Dependeco-solvilo POVAS averti, se antaŭeldono necesas por plenumi versio-specifilon.
ja: 依存関係解決ツール群は、バージョン指定子を満足させるためにあるプレリリースが必要である場合には、警告を発しても構いません。
ru: Средства разрешения зависимостей МОГУТ выдавать предупреждение, если для удовлетворения спецификатора версии требуется предварительный выпуск.
ta: பதிப்பு விவரக்குறிப்பை நிறைவு செய்ய முன் வெளியீடு தேவைப்பட்டால் சார்பு தீர்க்கும் கருவிகள் எச்சரிக்கையை வெளியிடக்கூடும்.

source: Dependency resolution tools SHOULD also allow users to request the following alternative behaviours:
eo: Dependeco-solviloj ankaŭ PERMESU uzantojn peti la jenajn alternativajn kondutojn:
ja: 依存関係解決ツール群は、また、以下のような代替的な振る舞いをユーザが要求することを許容するべきです:
ru: Средства разрешения зависимостей ДОЛЖНЫ также позволять пользователям запрашивать следующие альтернативные варианты поведения:
ta: சார்பு தீர்க்கும் கருவிகள் பயனர்களை பின்வரும் மாற்று நடத்தைகளைக் கோர அனுமதிக்க வேண்டும்:

source: accepting pre-releases for all version specifiers
eo: akcepti antaŭeldonojn por ĉiuj versispecifiloj
ja: 全てのバージョン指定子にプレリリースを受け入れること
pt_br: aceitando pré-lançamentos para todos os especificadores de versão
ru: прием предварительных версий для всех спецификаторов версий
ta: அனைத்து பதிப்பு குறிப்பான்களுக்கும் முன் வெளியீடுகளை ஏற்றுக்கொள்வது

source: excluding pre-releases for all version specifiers (reporting an error or warning if a pre-release is already installed locally, or if a pre-release is the only way to satisfy a particular specifier)
eo: ekskluzivante antaŭeldonojn por ĉiuj versio-specifiloj (raportante eraron aŭ averton, se antaŭeldono jam estas instalita loke, aŭ se antaŭeldono estas la nura maniero plenumi iun specifilon)
ja: 全てのバージョン指定子からプレリリースを除外すること (プレリリースがすでにローカルにインストールされている場合や特定の指定子を満たすためにはプレリリースが唯一の選択肢である場合には、エラーないし警告を報告すること)
ru: исключение предварительных версий для всех спецификаторов версии (сообщение об ошибке или предупреждение, если предварительная версия уже установлена локально, или если предварительная версия является единственным способом удовлетворить определенный спецификатор)
ta: அனைத்து பதிப்பு குறிப்பான்களுக்கும் முன் வெளியீடுகளைத் தவிர்த்து (ஒரு முன் வெளியீடு ஏற்கனவே உள்நாட்டில் நிறுவப்பட்டிருந்தால், அல்லது ஒரு குறிப்பிட்ட விவரக்குறிப்பை நிறைவு செய்வதற்கான ஒரே வழி ஒரு முன் வெளியீடு என்றால் பிழை அல்லது எச்சரிக்கையைப் புகாரளித்தல்)

source: Dependency resolution tools MAY also allow the above behaviour to be controlled on a per-distribution basis.
eo: Dependeco-solvilo ankaŭ POVAS permesi regadon de la ĉi-supra konduto por specifaj distribuoj.
ja: 依存関係解決ツール群は、配布物の単位ごとに上記の振る舞いを許容しても構いません。
ru: Средства разрешения зависимостей MAY также позволяют управлять вышеуказанным поведением на основе каждого дистрибутива.
ta: சார்பு தீர்க்கும் கருவிகள் மேற்கண்ட நடத்தை ஒரு விநியோக அடிப்படையில் கட்டுப்படுத்த அனுமதிக்கலாம்.

source: Post-releases and final releases receive no special treatment in version specifiers - they are always included unless explicitly excluded.
eo: Posteldonoj kaj fina eldonoj ne estas speciale pritraktataj en versio-specifilo – ili estas ĉiam inkluzivitaj, se ili ne estas eksplicite ekskluzivitaj.
ja: ポストリリースと最終リリースは、バージョン識別子の中で何ら特別な取り扱いを受けません - 明示的に除外されていない限り、これらは常に受け入れられます。
ru: Пост-релизы и финальные релизы не получают особого обращения в спецификаторах версий - они всегда включаются, если только не исключены явным образом.
ta: பிந்தைய உறவுகள் மற்றும் இறுதி வெளியீடுகள் பதிப்பு விவரக்குறிப்பாளர்களில் சிறப்பு சிகிச்சையைப் பெறவில்லை - வெளிப்படையாக விலக்கப்படாவிட்டால் அவை எப்போதும் சேர்க்கப்படும்.

source: ``~=3.1``: version 3.1 or later, but not version 4.0 or later.
eo: ``~=3.1``: versio 3.1 aŭ pli nova, sed ne versio 4.0 nek pli nova.
ja: ``~=3.1``: バージョン 3.1 またはそれ以降、しかし、バージョン 4.0 またはそれ以降ではない。
ru: ``~=3.1``: версия 3.1 или более поздняя, но не версия 4.0 или более поздняя.
ta: `` ~ = 3.1``: பதிப்பு 3.1 அல்லது அதற்குப் பிறகு, ஆனால் பதிப்பு 4.0 அல்லது அதற்குப் பிறகு அல்ல.

source: ``~=3.1.2``: version 3.1.2 or later, but not version 3.2.0 or later.
eo: ``~=3.1.2``: versio 3.1.2 aŭ pli nova, sed ne versio 3.2.0 nek pli nova.
ja: ``~=3.1.2``: バージョン 3.1.2 またはそれ以降、しかし、バージョン 3.2.0 またはそれ以降ではない。
ru: ``~=3.1.2``: версия 3.1.2 или более поздняя, но не версия 3.2.0 или более поздняя.
ta: `` ~ = 3.1.2``: பதிப்பு 3.1.2 அல்லது அதற்குப் பிறகு, ஆனால் பதிப்பு 3.2.0 அல்லது அதற்குப் பிறகு அல்ல.

source: ``~=3.1a1``: version 3.1a1 or later, but not version 4.0 or later.
eo: ``~=3.1a1``: versio 3.1a1 aŭ pli nova, sed ne versio 4.0 nek pli nova.
ja: ``~=3.1a1``: バージョン 3.1a1 またはそれ以降、しかし、バージョン 4.0 またはそれ以降ではない。
ru: ``~=3.1a1``: версия 3.1a1 или более поздняя, но не версия 4.0 или более поздняя.
ta: `` ~ = 3.1a1``: பதிப்பு 3.1a1 அல்லது அதற்குப் பிறகு, ஆனால் பதிப்பு 4.0 அல்லது அதற்குப் பிறகு அல்ல.

source: ``== 3.1``: specifically version 3.1 (or 3.1.0), excludes all pre-releases, post releases, developmental releases and any 3.1.x maintenance releases.
eo: ``== 3.1``: specife la versio 3.1 (aŭ 3.1.0), ekskluzivante ĉiajn antaŭeldonojn, posteldonojn, evoluajn eldonojn kaj ajnajn riparajn eldonojn 3.1.x.
ja: ``== 3.1``: 正確にバージョン 3.1 (または 3.1.0)、プレリリース・ポストリリース・開発リリースや 3.1.x のメンテナンスリリースは全て除外する。
ru: ``== 3.1``: конкретно версия 3.1 (или 3.1.0), исключает все пре-релизы, пост-релизы, релизы разработки и любые поддерживающие релизы 3.1.x.
ta: `` == 3.1``: குறிப்பாக பதிப்பு 3.1 (அல்லது 3.1.0), அனைத்து முன் வெளியீடுகள், பிந்தைய வெளியீடுகள், மேம்பாட்டு வெளியீடுகள் மற்றும் எந்த 3.1.x பராமரிப்பு வெளியீடுகளையும் விலக்குகிறது.

source: ``== 3.1.*``: any version that starts with 3.1. Equivalent to the ``~=3.1.0`` compatible release clause.
eo: ``== 3.1.*``: ajna versio komenciĝanta per 3.1. Ekvivalenta al la kongrua-versia kondiĉo ``~=3.1.0``.
ja: ``== 3.1.*``: 3.1 で始まるすべてのバージョン。 ``~=3.1.0`` 互換リリース節に同じ。
ru: ``== 3.1.*``: любая версия, начинающаяся с 3.1. Эквивалентно положению о совместимом выпуске ``~=3.1.0``.
ta: `` == 3.1.*``: 3.1 உடன் தொடங்கும் எந்த பதிப்பும். `` ~ = 3.1.0`` இணக்கமான வெளியீட்டு விதிமுறைக்கு சமம்.
