Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Alternatively, it would be possible to add a ``twine upload`` step to the build. The supplied :file:`appveyor.yml` does not do this, as it is not clear that uploading new wheels after every commit is desirable (although some projects may wish to do this).
eo: Alternative, oni povas aldoni paŝon ``twine upload`` al la konstruo. La donita dosiero :file:`appveyor.yml` ne faras tion, ĉar ne certas, ĉu oni deziras alŝuti novan wheel post ĉiu enmeto (kvankam kelkaj projektoj fakte deziras tion).
ja: 別のやり方としては、ビルドの際に ``twine upload`` 段階を追加することができるでしょう。 (プロジェクトによってはそうしたいかもしれませんが) コミットのたびに新しい wheel ファイルをアップロードすることが望ましいかどうかがはっきりしないので、先ほどの :file:`appveyor.yml` ファイルはこれをやりません。
pt_br: Alternativamente, seria possível adicionar um passo ``twine upload`` à construção. O :file:`appveyor.yml` fornecido não faz isso, pois não está claro se é desejável enviar novos wheels após cada commit (embora alguns projetos possam desejar fazer isso).
ru: В качестве альтернативы можно было бы добавить в сборку шаг ``twine upload``. Поставляемый :file:`appveyor.yml` этого не делает, поскольку неясно, насколько желательна загрузка новых колес после каждого коммита (хотя некоторые проекты могут захотеть это сделать).
ta: மாற்றாக, கட்டமைப்பிற்கு `` கயிறு பதிவேற்றம்` படி சேர்க்க முடியும். வழங்கப்பட்ட: கோப்பு: `appveyor.yml` இதைச் செய்யாது, ஏனெனில் ஒவ்வொரு உறுதிப்பாட்டிற்கும் பிறகு புதிய சக்கரங்களை பதிவேற்றுவது விரும்பத்தக்கது என்பது தெளிவாகத் தெரியவில்லை (சில திட்டங்கள் இதைச் செய்ய விரும்பினாலும்).

source: External dependencies
eo: Eksteraj dependecoj
ja: 外部への依存関係
pt_br: Dependências externas
ru: Внешние зависимости
ta: வெளிப்புற சார்புநிலைகள்

source: The supplied scripts will successfully build any distribution that does not rely on 3rd party external libraries for the build.
eo: La donitaj programetoj sukcese konstruos ĉian ajn distribuon ne dependantan de triapartia ekstera biblioteko por la konstruado.
ja: 提供されたスクリプトを使えば、ビルド時にサードパーティの外部ライブラリに依存しない配布物ならどれでもビルドに成功するでしょう。
pt_br: Os scripts fornecidos construirão com sucesso qualquer distribuição que não dependa de bibliotecas externas de terceiros para a construção.
ru: Прилагаемые скрипты успешно соберут любой дистрибутив, который не зависит от сторонних внешних библиотек для сборки.
ta: வழங்கப்பட்ட ச்கிரிப்ட்கள் 3 வது தரப்பு வெளிப்புற நூலகங்களை நம்பாத எந்தவொரு விநியோகத்தையும் வெற்றிகரமாக உருவாக்கும்.

source: It is possible to add steps to the :file:`appveyor.yml` configuration (typically in the "install" section) to download and/or build external libraries needed by the distribution. And if needed, it is possible to add extra configuration for the build to supply the location of these libraries to the compiler. However, this level of configuration is beyond the scope of this document.
ja: :file:`appveyor.yml` ファイルでの設定 (典型的には "install" 段階) を加えて、配布物に必要な外部ライブラリをダウンロードないしビルドすることは可能です。そして、もし必要なら、このようなライブラリの位置ををコンパイラに伝えるための余分の設定を追加することもできます。しかしながら、このレベルの設定はこの文書の範囲を超えます。
pt_br: É possível adicionar etapas à configuração :file:`appveyor.yml` (normalmente na seção "install") para baixar e/ou construir bibliotecas externas necessárias para a distribuição. E se necessário, é possível adicionar configuração extra para a construção para fornecer a localização dessas bibliotecas para o compilador. No entanto, esse nível de configuração está além do escopo deste documento.
ru: В конфигурацию :file:`appveyor.yml` можно добавить шаги (обычно в разделе "install") для загрузки и/или сборки внешних библиотек, необходимых дистрибутиву. При необходимости можно добавить дополнительную конфигурацию для сборки, чтобы указать компилятору местоположение этих библиотек. Однако такой уровень конфигурации выходит за рамки данного документа.
ta: விநியோகத்திற்குத் தேவையான வெளிப்புற நூலகங்களை பதிவிறக்கம் மற்றும்/அல்லது உருவாக்குவதற்கு: கோப்பு: `appveyor.yml` உள்ளமைவு (பொதுவாக" நிறுவு "பிரிவில்) படிகளைச் சேர்க்க முடியும். தேவைப்பட்டால், இந்த நூலகங்களின் இருப்பிடத்தை கம்பைலருக்கு வழங்குவதற்கு கூடுதல் உள்ளமைவைச் சேர்க்க முடியும். இருப்பினும், இந்த நிலை உள்ளமைவு இந்த ஆவணத்தின் எல்லைக்கு அப்பாற்பட்டது.

source: Support scripts
eo: Helpaj programetoj
ja: サポートスクリプト
pt_br: Scripts de suporte
ru: Скрипты поддержки
ta: ச்கிரிப்ட்களை ஆதரிக்கவும்

source: For reference, the SDK setup support script is listed here:
eo: Por referenco, jen la SDK-stariga helpa programeto:
ja: 参照用に SDK を構築するサポートスクリプトをここに挙げておきます:
pt_br: Para referência, o script de suporte de configuração do SDK está listado aqui:
ru: Для справки, сценарий поддержки установки SDK приведен здесь:
ta: குறிப்புக்கு, SDK அமைவு உதவி ச்கிரிப்ட் இங்கே பட்டியலிடப்பட்டுள்ளது:

source: ``appveyor-sample/build.cmd``
ta: `` appweyor-sample/build.cmd``

source: Tool recommendations
eo: Rekomendoj pri iloj
ja: オススメのツール
pt_br: Recomendações de ferramentas
ru: Рекомендации по инструментам
ta: கருவி பரிந்துரைகள்

source: The Python packaging landscape consists of many different tools. For many tasks, the :term:`Python Packaging Authority <Python Packaging Authority (PyPA)>` (PyPA, the working group which encompasses many packaging tools and maintains this guide) purposefully does not make a blanket recommendation; for example, the reason there are many build backends is that the landscape was opened up in order to enable the development of new backends serving certain users' needs better than the previously unique backend, setuptools. This guide does point to some tools that are widely recognized, and also makes some recommendations of tools that you should *not* use because they are deprecated or insecure.
eo: La Python-pakada pejzaĝo konsistas el multaj diversaj iloj. Por multaj taskoj, la :term:`Python-Pakada Aŭtoritato <Python Packaging Authority (PyPA)>` (PyPA, la laborgrupo administranta multajn pakadajn ilojn kaj mastrumas ĉi tiun gvidilon) intence ne faras ununuran rekomendon; ekzemple, la kialo por pluraj konstruaj malfasadoj estas por malfermi la pejzaĝon, ebligante la evoluadon de novaj malfasadoj por servi la bezonoj de kelkaj uzantoj pli bone ol la unikinta malfasado setuptools. Ĉi tiu gvidilo ja montras kelkajn ilojn vaste uzatajn kaj ankaŭ *mal*rekomendas kelkajn ilojn evitindajn aŭ malsekurajn.
ja: Python パッケージングのランドスケープは、多くの異なったツール群からできています。多くのタスクについて、 :term:`Python パッケージングオーソリティ <Python Packaging Authority (PyPA) >` (PyPA とは多数のパッケージングツール群を包含するとともにこのガイド文書を維持管理しているワーキンググループ) は、一律に適用するような推奨ををしません; 例えば、数多くのビルドバックエンドが存在する理由は、既存のユニークなバックエンドである setuptools よりもうまく特定のユーザのニーズに応える新しいバックエンドの開発を可能とするためにランドスケープを開放しているということなのです。このガイド文書では、広く認知されている幾つかのツールを指し示していますが、また、非推奨であったり安全でなかったりするために *使うべきでない* ものについても非推奨事項を記しています。
pt_br: O cenário de empacotamento do Python consiste em muitas ferramentas diferentes. Para muitas tarefas, o :term:`Python Packaging Authority <Python Packaging Authority (PyPA)>` (PyPA, o grupo de trabalho que engloba muitas ferramentas de empacotamento e mantém este guia) propositalmente não faz uma recomendação geral; por exemplo, a razão pela qual existem muitos backends de construção é que o cenário foi aberto para permitir o desenvolvimento de novos backends que atendam melhor às necessidades de determinados usuários do que o backend anteriormente exclusivo, setuptools. Este guia aponta algumas ferramentas que são amplamente reconhecidas e também faz algumas recomendações de ferramentas que você *não* deve usar porque estão descontinuadas ou são inseguras.
ru: Сфера упаковки Python состоит из множества различных инструментов. Для многих задач : термин:` Python Packaging Authority <Python Packaging Authority (PyPA)>` (PyPA, рабочая группа, объединяющая многие инструменты упаковки и поддерживающая это руководство) намеренно не дает общих рекомендаций; например, причина существования множества бэкендов сборки в том, что ландшафт был открыт, чтобы позволить разработку новых бэкендов, обслуживающих потребности определенных пользователей лучше, чем ранее уникальный бэкенд, setuptools. В этом руководстве указаны некоторые инструменты, которые широко известны, а также даны рекомендации по инструментам, которые не следует использовать, поскольку они устарели или небезопасны.
ta: பைதான் பேக்கேசிங் நிலப்பரப்பு பல வேறுபட்ட கருவிகளைக் கொண்டுள்ளது. பல பணிகளுக்கு, தி: கால: `பைதான் பேக்கேசிங் ஆணையம் <பைதான் பேக்கேசிங் ஆணையம் (பைபா)>` (பைபா, பல பேக்கேசிங் கருவிகளை உள்ளடக்கிய மற்றும் இந்த வழிகாட்டியை பராமரிக்கும் பணிக்குழு) வேண்டுமென்றே ஒரு போர்வை பரிந்துரை செய்யாது; எடுத்துக்காட்டாக, பல கட்டமைப்புகளை உருவாக்குவதற்கான காரணம் என்னவென்றால், முன்னர் தனித்துவமான பின்தளத்தில், செடுப்டூல்சை விட சில பயனர்களின் தேவைகளுக்கு சிறப்பாக பணி செய்யும் புதிய பின்தளத்தில் வளர்ச்சியை செயல்படுத்துவதற்காக நிலப்பரப்பு திறக்கப்பட்டது. இந்த வழிகாட்டி பரவலாக அங்கீகரிக்கப்பட்ட சில கருவிகளை சுட்டிக்காட்டுகிறது, மேலும் நீங்கள் பயன்படுத்த வேண்டிய கருவிகளின் சில பரிந்துரைகளையும் உருவாக்குகிறது, ஏனெனில் அவை நீக்கப்பட்டவை அல்லது பாதுகாப்பற்றவை.

source: Virtual environments
eo: Virtualaj medioj
ja: 仮想環境
pt_br: Ambientes virtuais
ru: Виртуальная среда
ta: மெய்நிகர் சூழல்கள்

source: The standard tools to create and use virtual environments manually are :ref:`virtualenv` (PyPA project) and :doc:`venv <python:library/venv>` (part of the Python standard library, though missing some features of virtualenv).
eo: La normaj iloj por krei kaj uzi virtualan medion malaŭtomate estas :ref:`virtualenv` (projekto de PyPA) kaj :doc:`venv <python:library/venv>` (parto de la norma biblioteko de Python, sed sen kelkaj funkcioj de virtualenv).
ja: 仮想環境を手動で作成して使用するための標準的なツールは、 :ref:`virtualenv` (PyPA project) と :doc:`venv <python:library/venv>` (virtualenv には備わっている幾つかの機能が欠けてはいるものの、Pythonの標準ライブラリの一部) です。
pt_br: As ferramentas padrão para criar e usar ambientes virtuais manualmente são :ref:`virtualenv` (projeto PyPA) e :doc:`venv <python:library/venv>` (parte da biblioteca padrão Python, embora falte alguns recursos do virtualenv) .
ru: Стандартными инструментами для создания и использования виртуальных сред вручную являются : ссылка:`virtualenv` (проект PyPA) и : документация:`venv <питон:библиотека/venv>` (часть стандартной библиотеки Python, хотя и лишенная некоторых возможностей virtualenv).
ta: மெய்நிகர் சூழல்களை கைமுறையாக உருவாக்குவதற்கும் பயன்படுத்துவதற்கும் நிலையான கருவிகள்: ref: `மெய்நிகர்என்வ்` (பைபா திட்டம்) மற்றும்: டாக்:` வெவி <பைதான்: நூலகம்/வெவி> `(பைதான் நிலையான நூலகத்தின் ஒரு பகுதி, மெய்நிகர்என்வின் சில அம்சங்களைக் காணவில்லை என்றாலும்) .

source: Installing packages
eo: Instali pakojn
ja: パッケージをインストールする
pt_br: Instalando pacotes
ru: Установка пакетов
ta: தொகுப்புகளை நிறுவுதல்

source: :ref:`Pip` is the standard tool to install packages from :term:`PyPI <Python Package Index (PyPI)>`. You may want to read pip's recommendations for :doc:`secure installs <pip:topics/secure-installs>`. Pip is available by default in most Python installations through the standard library package :doc:`ensurepip <python:library/ensurepip>`.
eo: :ref:`Pip` estas la norma ilo por instali pakojn el :term:`PyPI <Python Package Index (PyPI)>`. Vi eble volas legi la rekomendojn de pip pri :doc:`sekura instalado <pip:topics/secure-installs>`. Pip estas havebla apriore en multaj instaloj de Python per la norma biblioteka pako :doc:`ensurepip <python:library/ensurepip>`.
ja: :ref:`Pip` は :term:`PyPI <Python Package Index (PyPI)>` からパッケージをインストールするための標準的なツールです。 pip の推奨事項については、 :doc:`セキュアなインストール <pip:topics/secure-installs>` を読むと良いでしょう。 pip は、標準ライブラリのパッケージ :doc:`ensurepip <python:library/ensurepip>` を通じて、ほとんどの Python 環境でデフォルトで利用可能です。
pt_br: :ref:`Pip` é a ferramenta padrão para instalar pacotes do :term:`PyPI <Python Package Index (PyPI)>`. Você pode querer ler as recomendações do pip para obter :doc:`instalações seguras <pip:topics/secure-installs>`. Pip está disponível por padrão na maioria das instalações do Python através do pacote de biblioteca padrão :doc:`ensurepip <python:library/ensurepip>`.
ru: : ссылка:`Pip` - это стандартный инструмент для установки пакетов из : термин:`PyPI <Python Package Index (PyPI)>`. Вы можете ознакомиться с рекомендациями pip по : документу:`безопасная установка <pip:topics/безопасная установка>`. Pip доступен по умолчанию в большинстве инсталляций Python через стандартный библиотечный пакет : документ:`ensurepip <python: библиотека/ensurepip>`.
ta: . இதற்கான பைப்பின் பரிந்துரைகளை நீங்கள் படிக்க விரும்பலாம்: DOC: `பாதுகாப்பான நிறுவல்கள் <PIP: தலைப்புகள்/பாதுகாப்பான-நிறுவல்கள்>`. நிலையான நூலக தொகுப்பு மூலம் பெரும்பாலான பைதான் நிறுவல்களில் பிஐபி இயல்பாகவே கிடைக்கிறது: டிஓசி: `உறுதிப்படுத்தல் <பைதான்: நூலகம்/உறுதி>`.

source: Alternatively, consider :ref:`pipx` for the specific use case of installing Python applications that are distributed through PyPI and run from the command line. Pipx is a wrapper around pip and venv that installs each application into a dedicated virtual environment. This avoids conflicts between the dependencies of different applications, and also with system-wide applications making use of the same Python interpreter (especially on Linux).
eo: Alternative, konsideru :ref:`pipx` por la specifa uzkado de instalado de Python-programo distribuata per PyPI kaj rulebla ĉe la komandlinio. Pipx estas volvaĵo ĉirkaŭ pip kaj venv, kiu instalas programon en ĝian propran virtualan medion. Tio avertas konfliktojn inter la dependecoj de diversaj programoj kaj kun sistemaj programoj uzantaj la saman Python-interpretilon (speciale sur Linux).
ja: 別のやり方としては、 PyPI を通じて配布されてコマンドラインから実行される Python アプリケーションをインストールする特定のユースケースにおいては :ref:`pipx` を検討してください。 pipx は pip と、専用の仮想環境の中にそれぞれのアプリケーションをインストールする venv のラッパーとして動作します。これによって、異なるアプリケーションの間の依存関係上の衝突を避け、システムワイドのアプリケーションとの間で同じ Python インタープリタを使う際の衝突を避けることができます (特に Linux 環境で)。
pt_br: Alternativamente, considere :ref:`pipx` para o caso de uso específico de instalação de aplicativos Python que são distribuídos por meio de PyPI e executados a partir da linha de comando. Pipx é um wrapper em torno de pip e venv que instala cada aplicativo em um ambiente virtual dedicado. Isso evita conflitos entre as dependências de diferentes aplicações, e também com aplicações de todo o sistema que utilizam o mesmo interpretador Python (especialmente no Linux).
ru: В качестве альтернативы можно рассмотреть : ссылка:`pipx` для конкретного случая установки Python-приложений, распространяемых через PyPI и запускаемых из командной строки. Pipx - это обертка вокруг pip и venv, которая устанавливает каждое приложение в отдельное виртуальное окружение. Это позволяет избежать конфликтов между зависимостями различных приложений, а также общесистемных приложений, использующих один и тот же интерпретатор Python (особенно в Linux).
ta: மாற்றாக. PIPX என்பது PIP மற்றும் WVV ஐச் சுற்றியுள்ள ஒரு ரேப்பர் ஆகும், இது ஒவ்வொரு பயன்பாட்டையும் ஒரு பிரத்யேக மெய்நிகர் சூழலில் நிறுவுகிறது. இது வெவ்வேறு பயன்பாடுகளின் சார்புகளுக்கிடையேயான மோதல்களைத் தவிர்க்கிறது, மேலும் கணினி அளவிலான பயன்பாடுகளுடன் அதே பைதான் மொழிபெயர்ப்பாளரை (குறிப்பாக லினக்சில்) பயன்படுத்துகிறது.

source: For scientific software specifically, consider :ref:`Conda` or :ref:`Spack`.
eo: Por sciencaj programoj specife, konsideru :ref:`Conda` aŭ :ref:`Spack`.
ja: 特に科学計算ソフトウェア向けには :ref:`Conda` や :ref:`Spack` を検討してください。
pt_br: Especificamente para software científico, considere :ref:`Conda` ou :ref:`Spack`.
ru: Для научного программного обеспечения, в частности, рассмотрите : ссылка:`Conda` или :ссылка:`Spack`.
ta: குறிப்பாக விஞ்ஞான மென்பொருளுக்கு, கவனியுங்கள்: ref: `conda` அல்லது: ref:` spack`.

source: Write a "pip vs. Conda" comparison, here or in a new discussion.
eo: Verki komparon inter pip kaj Conda, ĉi tie aŭ en nova diskuto.
ja: ここか、新しい議論として、"pip vs. Conda" の比較を書くべし。
pt_br: Escreva uma comparação "pip vs. Conda", aqui ou em uma nova discussão.
ru: Напишите отзыв о сравнении "pip против Conda" здесь или в новом обсуждении.
ta: இங்கே அல்லது ஒரு புதிய விவாதத்தில் ஒரு "பிப் வெர்சச் காண்டா" ஒப்பீட்டை எழுதுங்கள்.

source: Do **not** use ``easy_install`` (part of :ref:`setuptools`), which is deprecated in favor of pip (see :ref:`pip vs easy_install` for details). Likewise, do **not** use ``python setup.py install`` or ``python setup.py develop``, which are also deprecated (see :ref:`setup-py-deprecated` for background and :ref:`modernize-setup-py-project` for migration advice).
eo: **Ne** uzu ``easy_install`` (parton de :ref:`setuptools`), kiun oni evitu, preferante pip (vidu :ref:`pip kontraste al easy_install <pip vs easy_install>` por detaloj). Simile, **ne** uzu ``python setup.py install`` aŭ ``python setup.py develop``, kiuj estas ankaŭ evidintaj (vidu :ref:`setup-py-deprecated` por fonaj informoj kaj :ref:`modernize-setup-py-project` por konsiloj pri migrado).
ja: ``easy_install`` (:ref:`setuptools` の一部) は、 pip の登場によって非推奨になっていますので、 **使わない** でください (詳しくは :ref:`pip vs easy_install` を見てください)。同様に、 ``python setup.py install`` や ``python setup.py develop`` も非推奨になっていますので **使わない** でください (背景については :ref:`setup-py-deprecated` を、移行するためのアドバイスについては :ref:`setup.py 近代化プロジェクト <modernize-setup-py-project>` を見てください)。
pt_br: **Não** use ``easy_install`` (parte de :ref:`setuptools`), que foi descontinuado em favor do pip (veja :ref:`pip vs easy_install` para detalhes). Da mesma forma, **não** use ``python setup.py install`` ou ``python setup.py development``, que também foram descontinuados (veja :ref:`setup-py-deprecated` para aprofundamento e :ref :`modernize-setup-py-project` para aconselhamento sobre migração).
ru: Не **не** используйте ``easy_install`` (часть : ссылка:`setuptools``), который устарел в пользу pip (подробности см. в :ссылка:`pip против easy_install``). Аналогично, **не** используйте ``питон setup.py install`` или ``питон setup.py develop``, которые также устарели (смотрите : ссылка:`setup-py-отказ от использования`` и :ссылка:`модернизация-setup-py-проекта`` для рекомендаций по переходу).
ta: ** அல்ல ** `` ஈசி_இன்ச்டால்`` ஐப் பயன்படுத்தவும் (இதன் பகுதி: குறிப்பு: `செடிப்டூல்ச்`), இது பிஐக்கு ஆதரவாக நீக்கப்பட்டது (விவரங்களுக்கு பார்க்க: குறிப்பு:` பிப் vs ஈசி_இன்ச்டால்` விவரங்களுக்கு). அதேபோல், ** செய்ய வேண்டாம் ** `` பைதான் அமைவு. .

source: Lock files
eo: Serurdosieroj
ja: ロックファイル
pt_br: Arquivos de bloqueio
ru: Блокировка файлов
ta: கோப்புகளைப் பூட்டவும்

source: :ref:`pip-tools` and :ref:`Pipenv` are two recognized tools to create lock files, which contain the exact versions of all packages installed into an environment, for reproducibility purposes.
eo: :ref:`pip-tools` kaj :ref:`Pipenv` estas du konataj iloj por krei serurdosierojn, enhavantajn la ekzaktajn versiojn de ĉiuj pakoj instalitaj en medion por reproduktebleco.
ja: :ref:`pip-tools` と :ref:`Pipenv` は、再現性を高める目的でロックファイル、そこにはその環境にインストールされたパッケージの正確なバージョンを含みますが、そのようなロックファイルを作成するためのツールとしてよく知られています。
pt_br: :ref:`pip-tools` e :ref:`Pipenv` são duas ferramentas reconhecidas para criar arquivos de bloqueio, que contêm as versões exatas de todos os pacotes instalados em um ambiente, para fins de reprodutibilidade.
ru: : ссылка:`pip-tools` и :ссылка:`Pipenv` - два признанных инструмента для создания файлов блокировки, которые содержат точные версии всех пакетов, установленных в окружении, для целей воспроизводимости.
ta: :ref:`pip-tools` and :ref:`Pipenv` அரே two recognized கருவிகள் பெறுநர் create lock files, which contain the exact versions of அனைத்தும் தொகுப்பு installed into an environment, க்கு reproducibility purposes.

source: Build backends
eo: Konstruaj malfasadoj
ja: ビルドバックエンド
pt_br: Backends de construção
ru: Создание бэкендов
ta: பின்தளத்தில் உருவாக்குங்கள்

source: Please, remember: this document does not seek to steer the reader towards a particular tool, only to enumerate common tools. Different use cases often need specialized workflows.
eo: Bonvolu konscii, ke ĉi tiu dokumento ne celas direkti la leganton al iu ilo; ĝi nur celas listigi oftajn ilojn. Diversaj uzkazoj ofte bezonas specialajn laborfluojn.
ja: どうか覚えておいてください: このドキュメントは、読者に特定のツールへ向かって舵を切らせることを追求しているわけではなく、一般的なツール群を列挙しているだけです。異なるユースケースでは、しばしば、そのケースに特化したワークフローが必要になります。
pt_br: Por favor, lembre-se: este documento não procura orientar o leitor para uma ferramenta específica, apenas enumerar ferramentas comuns. Diferentes casos de uso geralmente precisam de fluxos de trabalho especializados.
ru: Пожалуйста, помните: этот документ не направлен на то, чтобы склонить читателя к выбору конкретного инструмента, а лишь перечисляет общие инструменты. Для различных случаев использования часто требуются специализированные рабочие процессы.
ta: தயவுசெய்து, நினைவில் கொள்ளுங்கள்: இந்த ஆவணம் வாசகரை ஒரு குறிப்பிட்ட கருவியை நோக்கி நகர்த்த முற்படுவதில்லை, பொதுவான கருவிகளைக் கணக்கிட மட்டுமே. வெவ்வேறு பயன்பாட்டு வழக்குகளுக்கு பெரும்பாலும் சிறப்பு பணிப்பாய்வு தேவைப்படுகிறது.

source: Popular :term:`build backends <build backend>` for pure-Python packages include, in alphabetical order:
eo: Jen popularaj :term:`konstruaj malfasadoj <build backend>` por pure Python-aj pakoj, en alfabeta ordo:
ja: 純 Python のパッケージを取り扱う :term:`ビルドバックエンド <build backend>` で人気のあるものは、アルファベット順に:
ru: Популярные : термин:`сборка бэкендов <сборка бэкенда>` для пакетов pure-Python включают в себя, в алфавитном порядке:
ta: பிரபலமானது: கால: `பின்தளத்தில் உருவாக்குங்கள் <பின்தளத்தில் உருவாக்கு>` தூய-பைதான் தொகுப்புகளுக்கு அகர வரிசைப்படி அடங்கும்:

source: :doc:`Flit-core <flit:pyproject_toml>` -- developed with but separate from :ref:`Flit`. A minimal and opinionated build backend. It does not support plugins.
eo: :doc:`Flit-core <flit:pyproject_toml>` – evoluigata kun sed aparte de :ref:`Flit`. Minimuma kaj opinihava konstrua malfasado. Ĝi ne subtenas kromprogramon.
ja: :doc:`Flit-core <flit:pyproject_toml>` -- :ref:`Flit` とともに開発されたが別のもの。最小限で自己主張の強いビルドバックエンド。プラグインをサポートしない。
ru: : документ:`Flit-core <flit:pyproject_toml>` -- разрабатывается совместно с : ссылка:`Flit`, но отдельно от :ссылка:`Flit`. Минимальный бэкенд для сборки с собственным мнением. Не поддерживает плагины.
ta: . ஒரு குறைந்தபட்ச மற்றும் கருத்துள்ள கட்டமைப்பை பின்தளத்தில் உருவாக்குதல். இது செருகுநிரல்களை ஆதரிக்காது.

source: Hatchling_ -- developed with but separate from :ref:`Hatch`. Supports plugins.
eo: Hatchling_ – evoluigata kun sed aparte de :ref:`Hatch`. Subtenas kromprogramojn.
ja: Hatchling_ -- :ref:`Hatch` とともに開発されたが別のもの。プラグインをサポートする。
ru: Hatchling_ -- разработан вместе с : ссылка:`Hatch`, но отдельно от него. Поддерживает плагины.
ta: அட்ச்லிங்_ - உருவாக்கப்பட்டது ஆனால் தனித்தனியாக: ref: `அட்ச்`. செருகுநிரல்களை ஆதரிக்கிறது.

source: PDM-backend_ -- developed with but separate from :ref:`PDM`. Supports plugins.
eo: PDM-backend_ – evoluigata kun sed aparte de :ref:`PDM`. Subtenas kromprogramojn.
ja: PDM-backend_ -- :ref:`PDM` とともに開発されたが別のもの。プラグインをサポート。
ru: PDM-бэкенд_ -- разработан совместно с : ссылка:`PDM`, но отдельно от него. Поддерживает плагины.
ta: PDM-Backend_-உருவாக்கப்பட்டது ஆனால் தனித்தனியாக: ref: `PDM`. செருகுநிரல்களை ஆதரிக்கிறது.

source: Poetry-core_ -- developed with but separate from :ref:`Poetry`. Supports plugins.
eo: Poetry-core – evoluigata kun sed aparte de :ref:`Poetry`. Subtenas kromprogramojn.
ja: Poetry-core_ -- :ref:`Poetry` とともに開発されたが別のもの。プラグインをサポート。
ru: Poetry-core_ -- разрабатывается вместе с : ссылка:`Poetry`, но отдельно от него. Поддерживает плагины.
ta: கவிதை-கோர்_-உருவாக்கப்பட்டது ஆனால் தனித்தனியாக: ref: `கவிதை`. செருகுநிரல்களை ஆதரிக்கிறது.
