Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Deprecated fields should be avoided, but they are valid metadata fields. They may be removed in future versions of the core metadata standard (at which point they will only be valid in files that specify a metadata version prior to the removal). Tools SHOULD warn users when deprecated fields are used.
eo: Oni evitu evitindajn kampojn, sed ili restas validaj metadateno-kampoj. Ili povas esti forigitaj en estontaj versioj de la normo de kernaj metadatenoj (post kiam ili nur estos validaj en dosieroj uzantaj metadateno-version antaŭ la forigo). Ilo AVERTU uzanton, se troviĝas evitinda kampo.
ru: Устаревших полей следует избегать, но они являются действительными полями метаданных. Они могут быть удалены в будущих версиях основного стандарта метаданных (в этом случае они будут действительны только в файлах, в которых указана версия метаданных, предшествующая удалению). Инструменты ДОЛЖНЫ предупреждать пользователей об использовании устаревших полей.
ta: நீக்கப்பட்ட புலங்கள் தவிர்க்கப்பட வேண்டும், ஆனால் அவை செல்லுபடியாகும் மேனிலை தரவு புலங்கள். கோர் மேனிலை தரவு தரநிலையின் எதிர்கால பதிப்புகளில் அவை அகற்றப்படலாம் (அந்த நேரத்தில் அவை அகற்றப்படுவதற்கு முன்னர் மேனிலை தரவு பதிப்பைக் குறிப்பிடும் கோப்புகளில் மட்டுமே செல்லுபடியாகும்). நீக்கப்பட்ட புலங்கள் பயன்படுத்தப்படும்போது கருவிகள் பயனர்களை எச்சரிக்க வேண்டும்.

source: Home-page
ta: முகப்பு பக்கம்

source: Per :pep:`753`, use :ref:`core-metadata-project-url` instead.
eo: Laŭ :pep:`753`, uzu :ref:`core-metadata-project-url` anstataŭe.
ru: Согласно :pep:`753`, вместо этого используйте :ref:`core-metadata-project-url`.
ta: ஒன்றுக்கு: PEP: `753`, பயன்படுத்தவும்: Ref:` கோர்-மெட்டாடேட்டா-திட்ட-உர்எல்` அதற்கு பதிலாக.

source: A string containing the URL for the distribution's home page.
eo: Signoĉeno de la retadreso de la ĉefpaĝo de la distribuo.
ja: 配布物のホームページを示す URL を含んだ文字列。
pt_br: Uma string contendo a URL para a página da distribuição.
ru: Строка, содержащая URL-адрес главной страницы дистрибутива.
ta: விநியோகத்தின் முகப்பு பக்கத்திற்கான முகவரி ஐக் கொண்ட ஒரு சரம்.

source: Download-URL
ta: பதிவிறக்க-உல்ல்

source: A string containing the URL from which this version of the distribution can be downloaded. (This means that the URL can't be something like "``.../BeagleVote-latest.tgz``", but instead must be "``.../BeagleVote-0.45.tgz``".)
eo: Signoĉeno de tiu retadreso, el kiu la versio de la distribuo estas elŝutebla. (Tio signifas, ke la retadreso ne povas esti «``.../BeagleVote-latest.tgz``», sed devas esti «``.../BeagleVote-0.45.tgz``».)
ru: Строка, содержащая URL, с которого можно загрузить данную версию дистрибутива. (Это означает, что URL не может быть чем-то вроде «``.../BeagleVote-latest.tgz``», а вместо этого должен быть «``.../BeagleVote-0.45.tgz``».)
ta: விநியோகத்தின் இந்த பதிப்பை பதிவிறக்கம் செய்யக்கூடிய முகவரி ஐக் கொண்ட ஒரு சரம். .

source: Requires
ja: 要求事項
ru: Требуется
ta: தேவை

source: in favour of ``Requires-Dist``
eo: anstataŭe uzu ``Requires-Dist``
ja: ``Requires-Dist`` に従って
pt_br: em favor de ``Requires-Dist``
ru: в пользу ``Requires-Dist``
ta: `` தேவை-டிச்ட்`` க்கு ஆதரவாக

source: Each entry contains a string describing some other module or package required by this package.
eo: Ĉiu ero enhavas signiĉenon priskribantan alian modulon aŭ pakon postulatan de tiu pako.
ja: それぞれのエントリは、このパッケージが必要とする他のモジュールやパッケージを記述した文字列を含みます。
pt_br: Cada entrada contém uma string descrevendo algum outro módulo ou pacote requerido por este pacote.
ru: Каждая запись содержит строку, описывающую другой модуль или пакет, необходимый для данного пакета.
ta: ஒவ்வொரு நுழைவுக்கும் இந்த தொகுப்பால் தேவைப்படும் வேறு சில தொகுதி அல்லது தொகுப்பை விவரிக்கும் ஒரு சரம் உள்ளது.

source: The format of a requirement string is identical to that of a module or package name usable with the ``import`` statement, optionally followed by a version declaration within parentheses.
eo: La formo de postulo-signoĉeno estas identa al tiu de modulo aŭ paknomo uzebla kun la ``import``-aserto, laŭvole sekvita de versio-deklaro en rondaj krampoj.
ja: 要求事項の文字列のフォーマットは、 ``import`` ステートメントで使うことができるモジュールやパッケージの名前のフォーマットと同一のもので、オプションとしてカッコ内に入れたバージョン宣言を伴うことがあります。
pt_br: O formato de uma string de requisito é idêntico ao de um nome de módulo ou pacote utilizável com a instrução ``import``, opcionalmente seguida por uma declaração de versão dentro de parênteses.
ru: Формат строки требований идентичен формату имени модуля или пакета, используемого с помощью оператора ``импорта``, за которым в круглых скобках по желанию следует объявление версии.
ta: ஒரு தேவை சரத்தின் வடிவம் `` இறக்குமதி`` அறிக்கையுடன் பயன்படுத்தக்கூடிய ஒரு தொகுதி அல்லது தொகுப்பு பெயருக்கு ஒத்ததாகும், இது விருப்பப்படி அடைப்புக்குறிக்குள் ஒரு பதிப்பு அறிவிப்பைப் பின்பற்றுகிறது.

source: A version declaration is a series of conditional operators and version numbers, separated by commas. Conditional operators must be one of "<", ">"', "<=", ">=", "==", and "!=". Version numbers must be in the format accepted by the ``distutils.version.StrictVersion`` class: two or three dot-separated numeric components, with an optional "pre-release" tag on the end consisting of the letter 'a' or 'b' followed by a number. Example version numbers are "1.0", "2.3a2", "1.3.99",
ja: バージョン宣言は、一連の比較演算子とバージョン番号をカンマで区切ったものです。比較演算子は、"<", ">", "<=", ">=", "==", "!=" のいずれかひとつでなければなりません。バージョン番号は、オプションとして 'a' か 'b' の後ろに数字が続く形の "pre-release" タグを末尾につけた、二つか三つの数字部分をドットで区切ったものです。バージョン番号の例としては、 "1.0" や "2.3a2" や "1.3.99" 、
pt_br: Uma declaração de versão é uma série de operadores condicionais e números de versão, separados por vírgulas. Os operadores condicionais devem ser um dos "<", ">"', "<=", ">=", "=", e "!=". Os números da versão devem estar no formato aceito pela classe ``distutils.version.StrictVersion``: dois ou três componentes numéricos separados por ponto, com uma tag "pre-release" opcional no final que consiste na letra 'a' ou 'b' seguida de um número. Os números da versão do exemplo são "1.0", "2.3a2", "1.3.99".
ru: Объявление версии представляет собой ряд условных операторов и номеров версий, разделенных запятыми. Условные операторы должны быть одним из "<", ">"', "<=", ">=", "==" и "!=". Номера версий должны иметь формат, принятый классом ``distutils.version.StrictVersion``: два или три числовых компонента, разделенных точками, с необязательным тегом "pre-release" на конце, состоящим из буквы 'a' или 'b', за которой следует число. Примеры номеров версий: "1.0", "2.3a2", "1.3.99",
ta: ஒரு பதிப்பு அறிவிப்பு என்பது நிபந்தனை ஆபரேட்டர்கள் மற்றும் பதிப்பு எண்களின் தொடர் ஆகும், இது காற்புள்ளிகளால் பிரிக்கப்பட்டுள்ளது. நிபந்தனை ஆபரேட்டர்கள் "<", ">" ', "<=", "> =", "==", மற்றும் "! =" ஆகியவற்றில் ஒன்றாக இருக்க வேண்டும். பதிப்பு எண்கள் `` distutils.version.strictversion` வகுப்பு: இரண்டு அல்லது மூன்று புள்ளி-பிரிக்கப்பட்ட எண் கூறுகள், 'A' அல்லது என்ற எழுத்தை உள்ளடக்கிய ஒரு விருப்பமான "முன் வெளியீட்டு" குறிச்சொல்லுடன் ஏற்றுக்கொள்ளப்பட்ட வடிவத்தில் இருக்க வேண்டும் 'பி' அதைத் தொடர்ந்து ஒரு எண். எடுத்துக்காட்டு பதிப்பு எண்கள் "1.0", "2.3A2", "1.3.99",

source: Any number of conditional operators can be specified, e.g. the string ">1.0, !=1.3.4, <2.0" is a legal version declaration.
eo: Iom ajn da kondiĉaj operatoroj validas. Ekzemple, ``>1.0, !=1.3.4, <2.0`` estas valida versio-deklaro.
ja: 例えば ">1.0, !=1.3.4, <2.0" という文字列が正当なバージョン宣言であるように、比較演算子はいくつでも指定することができます。
pt_br: Qualquer número de operadores condicionais pode ser especificado, por exemplo, a string ">1.0, !=1.3.4, <2.0" é uma declaração de versão válida.
ru: Можно указать любое количество условных операторов, например, строка ">1.0, !=1.3.4, <2.0" является законным объявлением версии.
ta: எந்தவொரு நிபந்தனை ஆபரேட்டர்களும் குறிப்பிடப்படலாம், எ.கா. "> 1.0,! = 1.3.4, <2.0" என்ற சரம் ஒரு சட்ட பதிப்பு அறிவிப்பாகும்.

source: All of the following are possible requirement strings: "rfc822", "zlib (>=1.1.4)", "zope".
eo: Jen kelkaj eblaj postulo-signoĉenoj: «rfc822», «zlib (>=1.1.4)», «zope».
ja: 次に示すすべての要求仕様文字列 <requirement strings> は実際に可能なものです: "rfc822", "zlib (>=1.1.4)", "zope"。
pt_br: Todos os seguintes são possíveis strings de requisito: "rfc822", "zlib (>=1.1.4)", "zope".
ru: Возможными строками требований являются все следующие: "rfc822", "zlib (>=1.1.4)", "zope".
ta: பின்வரும் அனைத்தும் சாத்தியமான தேவை சரங்கள்: "RFC822", "Zlib (> = 1.1.4)", "ZOPE".

source: There’s no canonical list of what strings should be used; the Python community is left to choose its own standards.
eo: Ne ekzistas listo de uzendaj signoĉenoj; la komunumo de Python elektu siajn proprajn normojn.
ja: どのような文字列が用いられるべきであるかについては、公式に認められたリストはありません; 独自の標準を選択することが Python コミュニティに委ねられています。
pt_br: Não há nenhuma lista canônica de quais strings devem ser usadas; a comunidade Python é livre para escolher seus próprios padrões.
ru: Не существует канонического списка того, какие строки должны использоваться; сообщество Python оставляет за собой право выбирать собственные стандарты.
ta: என்ன சரங்களை பயன்படுத்த வேண்டும் என்பதற்கான நியமன பட்டியல் எதுவும் இல்லை; பைதான் சமூகம் அதன் சொந்த தரங்களைத் தேர்வுசெய்ய உள்ளது.

source: Provides
ja: 提供する
ru: Предоставляет
ta: வழங்குகிறது

source: in favour of ``Provides-Dist``
eo: anstataŭe uzu ``Provides-Dist``
ja: ``Provides-Dist`` を支持して <in favour of>
pt_br: em favor de ``Provides-Dist``
ru: в пользу ``Provides-Dist``
ta: `` வழங்கும்-டிச்ட்`` க்கு ஆதரவாக

source: Each entry contains a string describing a package or module that will be provided by this package once it is installed. These strings should match the ones used in Requirements fields. A version declaration may be supplied (without a comparison operator); the package’s version number will be implied if none is specified.
ja: それぞれのエントリには、そのパッケージをインストールすると提供されるであろうパッケージなりモジュールなりについて記述した文字列を含みます。このような文字列は、Requirements フィールドで使われるものに合致しているべきです。 (比較演算子なしなら) バージョン宣言もあっても構いません; もしバージョン宣言がなければ、そのパッケージのバージョン番号を援用します。
pt_br: Cada entrada contém uma string descrevendo um pacote ou módulo que será fornecido por este pacote uma vez instalado. Essas strings devem corresponder às usadas nos campos Requirements. Uma declaração de versão pode ser fornecida (sem um operador de comparação); o número de versão do pacote será implícito se nenhum for especificado.
ru: Каждая запись содержит строку, описывающую пакет или модуль, который будет предоставлен этим пакетом после его установки. Эти строки должны совпадать с теми, что используются в полях Requirements. Может быть указано объявление версии (без оператора сравнения); номер версии пакета будет подразумеваться, если он не указан.
ta: ஒவ்வொரு உள்ளீட்டிலும் ஒரு தொகுப்பு அல்லது தொகுதியை விவரிக்கும் ஒரு சரம் உள்ளது, அது நிறுவப்பட்டவுடன் இந்த தொகுப்பு வழங்கப்படும். இந்த சரங்கள் தேவைகள் புலங்களில் பயன்படுத்தப்படும்வற்றுடன் பொருந்த வேண்டும். ஒரு பதிப்பு அறிவிப்பு வழங்கப்படலாம் (ஒப்பீட்டு ஆபரேட்டர் இல்லாமல்); எதுவும் குறிப்பிடப்படவில்லை என்றால் தொகுப்பின் பதிப்பு எண் குறிக்கப்படும்.

source: Obsoletes
ja: 古くなった <Obsoletes>
ru: Обзоры
ta: வழக்கற்றுப்போன

source: in favour of ``Obsoletes-Dist``
eo: anstataŭe uzu ``Obsoletes-Dist``
ja: ``Obsoletes-Dist`` に従って
pt_br: em favor de ``Obsoletes-Dist``
ru: в пользу ``Obsoletes-Dist``
ta: `` வழக்கற்றுப் போய்விடும்-டிச்ட்`` க்கு ஆதரவாக

source: Each entry contains a string describing a package or module that this package renders obsolete, meaning that the two packages should not be installed at the same time. Version declarations can be supplied.
eo: Ĉiu ero enhavas tekston priskribantan pakon aŭ modulon, kiun tiu pako malnoviĝintigas, tiel ke la du pakaĵoj ne estu instalitaj kune. Oni povas provizi versio-deklarojn.
ja: それぞれのエントリには、あるパッケージなりモジュールなりがあることで、このパッケージが使われなくなっている <obsolete> ということを記述する、すなわち、これら二つのパッケージは同時にはインストールされるべきではないことを示す、そのような文字列が含まれます。バージョン宣言を書いておくことができます。
pt_br: Cada entrada contém uma string descrevendo um pacote ou módulo que este pacote torna obsoleta, o que significa que os dois projetos não devem ser instalados ao mesmo tempo. Declarações de versão pode ser fornecidas.
ru: Каждая запись содержит строку, описывающую пакет или модуль, который этот пакет делает устаревшим, что означает, что эти два пакета не должны быть установлены одновременно. Могут быть предоставлены объявления версий.
ta: ஒவ்வொரு உள்ளீட்டிலும் இந்த தொகுப்பு வழக்கற்றுப் போன ஒரு தொகுப்பு அல்லது தொகுதியை விவரிக்கும் ஒரு சரம் உள்ளது, அதாவது இரண்டு தொகுப்புகளும் ஒரே நேரத்தில் நிறுவப்படக்கூடாது. பதிப்பு அறிவிப்புகள் வழங்கப்படலாம்.

source: The most common use of this field will be in case a package name changes, e.g. Gorgon 2.3 gets subsumed into Torqued Python 1.0. When you install Torqued Python, the Gorgon package should be removed.
eo: La plej ofta uzo de tiu kampo estas por ŝanĝo de nomo de pako. Ekzemple, Gorgon 2.3 fariĝis Torqued Python 1.0. Kiam oni instalas Torqued Python, do oni malinstalu la pakon Gorgon.
ja: このフィールドの最もよくある使い方は、例えば Gorgon 2.3 が Torqued Python 1.0 の一部として組み込まれた時のように、プロジェクトの名前が変更された場合でしょう。 Torqued Python をインストールするなら、 Gorgon パッケージは削除されるべきです。
pt_br: O uso mais comum deste campo será no caso de alteração do nome de um projeto, por exemplo, Gorgon 2.3 é incluído no Torqued Python 1.0. Quando você instala o Torqued Python, o pacote Gorgon deve ser removido.
ru: Чаще всего это поле используется в случае изменения названия пакета, например, Gorgon 2.3 переходит в Torqued Python 1.0. При установке Torqued Python пакет Gorgon должен быть удален.
ta: இந்த புலத்தின் மிகவும் பொதுவான பயன்பாடு ஒரு தொகுப்பு பெயர் மாற்றங்கள் இருந்தால், எ.கா. கோர்கன் 2.3 முறுக்கு பைதான் 1.0 க்குள் நுழைகிறது. நீங்கள் முறுக்கு பைதானை நிறுவும்போது, கோர்கன் தொகுப்பு அகற்றப்பட வேண்டும்.

source: August 2024: Core metadata 2.4 was approved through :pep:`639`.
eo: Aŭgusto 2024: Kernaj metadatenoj 2.4 estis aprobitaj per :pep:`639`.
ru: Август 2024 года: Core metadata 2.4 был одобрен через :pep:`639`.
ta: ஆகச்ட் 2024: கோர் மேனிலை தரவு 2.4 மூலம் அங்கீகரிக்கப்பட்டது: PEP: `639`.

source: Added the ``License-Expression`` field.
eo: Aldonis la kampon ``License-Expression``.
ru: Добавлено поле ``Лицензия-выражение``.
ta: `` உரிம-வெளிப்பாடு`` புலத்தை சேர்த்தது.

source: Added the ``License-File`` field.
eo: Aldonis la kampon ``License-File``.
ru: Добавлено поле ``Лицензионный файл``.
ta: `` உரிம-கோப்பு`` புலத்தை சேர்த்தது.

source: March 2022: Core metadata 2.3 was approved through :pep:`685`.
eo: Marto 2022: Kernaj metadatenoj 2.3 estis aprobitaj per :pep:`685`.
ja: 2022年3月: :pep:`685` を通じてコアとなるメタデータ 2.3 が承認されました。
ru: Март 2022: Core metadata 2.3 был одобрен через :pep:`685`.
ta: மார்ச் 2022: கோர் மேனிலை தரவு 2.3 மூலம் அங்கீகரிக்கப்பட்டது: PEP: `685`.

source: Restricted extra names to be normalized.
eo: Devigis normigon de nomoj de ekstraĵoj.
ja: その他の名称 <extra names> の標準化に制限を加えました。
ru: Ограниченные дополнительные имена, подлежащие нормализации.
ta: கூடுதல் பெயர்கள் இயல்பாக்கப்பட வேண்டும்.

source: October 2020: Core metadata 2.2 was approved through :pep:`643`.
eo: Oktobro 2020: Kernaj metadatenoj 2.2 estis aprobitaj per :pep:`643`.
ja: 2020年10月: :pep:`643` を通じてコアとなるメタデータ 2.2 が承認されました。
ru: Октябрь 2020 года: Core metadata 2.2 был одобрен через :pep:`643`.
ta: அக்டோபர் 2020: கோர் மேனிலை தரவு 2.2 மூலம் அங்கீகரிக்கப்பட்டது: PEP: `643`.

source: Added the ``Dynamic`` field.
eo: Aldonis la kampon ``Dynamic``.
ja: ``Dynamic`` フィールドを追加しました。
pt_br: Adicionado o campo ``Dinâmico``.
ru: Добавлено поле ``Динамика``.
ta: `` டைனமிக்`` புலம் சேர்க்கப்பட்டது.

source: February 2018: Core metadata 2.1 was approved through :pep:`566`.
eo: Februaro 2018: Kernaj metadatenoj 2.1 estis aprobitaj per :pep:`566`.
ja: 2018年2月: :pep:`566` を通じてコアとなるメタデータ 2.1 が承認されました。
ru: Февраль 2018 г: Core metadata 2.1 был одобрен через :pep:`566`.
ta: பிப்ரவரி 2018: கோர் மேனிலை தரவு 2.1 மூலம் அங்கீகரிக்கப்பட்டது: PEP: `566`.

source: Added ``Description-Content-Type`` and ``Provides-Extra``.
eo: Aldonis ``Description-Content-Type`` kaj ``Provides-Extra``.
ja: ``Description-Content-Type`` と ``Provides-Extra`` を追加しました。
ru: Добавлены ``Description-Content-Type`` и ``Provides-Extra``.
ta: `` விளக்கம்-உள்ளடக்க-வகை`` மற்றும் `` வழங்குகிறது-எக்ச்ட்ரா``.

source: Added canonical method for transforming metadata to JSON.
eo: Aldonis kanonan metodon por transformi metadatenojn al JSON.
ja: メタデータを JSON に変換する正規化された方法を追加しました。
ru: Добавлен метод canonical для преобразования метаданных в JSON.
ta: மெட்டாடேட்டாவை சாதொபொகு ஆக மாற்றுவதற்கான நியமன முறை சேர்க்கப்பட்டது.

source: Restricted the grammar of the ``Name`` field.
eo: Restriktis la gramatikon de la kampo ``Name``.
ja: ``Name`` フィールドの文法に制限を加えました。
ru: Ограничение грамматики поля ``Имя``.
ta: `` பெயர்` `புலத்தின் இலக்கணத்தை கட்டுப்படுத்தியது.

source: February 2010: Core metadata 1.2 was approved through :pep:`345`.
eo: Februaro 2010: Kernaj metadatenoj 1.2 estis aprobitaj per :pep:`345`.
ja: 2010年2月: :pep:`345` を通じてコアとなるメタデータ 1.2 が承認されました。
ru: Февраль 2010 г: Core metadata 1.2 был одобрен через :pep:`345`.
ta: பிப்ரவரி 2010: கோர் மேனிலை தரவு 1.2 மூலம் அங்கீகரிக்கப்பட்டது: PEP: `345`.

source: April 2003: Core metadata 1.1 was approved through :pep:`314`:
eo: Aprilo 2003: Kernaj metadatenoj 1.1 estis aprobitaj per :pep:`314`:
ja: 2003年4月: :pep:`314` を通じてコアとなるメタデータ 1.1 が承認されました:
ta: ஏப்ரல் 2003: கோர் மேனிலை தரவு 1.1 மூலம் அங்கீகரிக்கப்பட்டது: PEP: `314`:

source: March 2001: Core metadata 1.0 was approved through :pep:`241`.
eo: Marto 2001: Kernaj metadatenoj 1.0 estis aprobitaj per :pep:`241`.
ja: 2001年3月: :pep:`241` を通じてコアとなるメタデータ 1.0 が承認されました。
ru: Март 2001: Core metadata 1.0 был одобрен через :pep:`241`.
ta: மார்ச் 2001: கோர் மேனிலை தரவு 1.0 மூலம் அங்கீகரிக்கப்பட்டது: PEP: `241`.

source: reStructuredText markup: https://docutils.sourceforge.io/
eo: Marklingvo reStructuredText: https://docutils.sourceforge.io/
ja: reStructuredText マークアップ言語: https://docutils.sourceforge.io/
pt_br: Marcação reStructuredText: https://docutils.sourceforge.io/
ru: Разметка reStructuredText: https://docutils.sourceforge.io/
ta: மறுசீரமைக்கப்பட்ட டெக்ச்ட் மார்க்அப்: https://docutils.sourceforge.io/

source: RFC 822 Long Header Fields: :rfc:`822#section-3.1.1`
eo: RFC 822 Long-Ĉapaj Kampoj: :rfc:`822#section-3.1.1`
ja: RFC 822 長形式ヘッダフィールド: :rfc:`822#section-3.1.1`
ru: Длинные поля заголовка RFC 822: :rfc:`822#section-3.1.1`
ta: RFC 822 நீண்ட தலைப்பு புலங்கள் :: RFC: `822#பிரிவு -3.1.1`

source: Dependency Groups
eo: Dependecaj Grupoj
ru: Группы зависимости
ta: சார்பு குழுக்கள்

source: This specification defines Dependency Groups, a mechanism for storing package requirements in ``pyproject.toml`` files such that they are not included in project metadata when it is built.
eo: Ĉi tiu specifo difinas Dependecan Grupon, kiu estas meĥanismo por konservi pako-postulojn en ``pyproject.toml`` tiel, ke ili ne inkluziviĝas en projektaj metadatenoj post konstruado.
ta: இந்த விவரக்குறிப்பு சார்பு குழுக்களை வரையறுக்கிறது, இது தொகுப்பு தேவைகளை `` pyproject.toml`` கோப்புகளில் சேமிப்பதற்கான ஒரு வழிமுறையாகும், அவை கட்டமைக்கப்பட்டால் திட்ட மெட்டாடேட்டாவில் சேர்க்கப்படாதவை.

source: Dependency Groups are suitable for internal development use-cases like linting and testing, as well as for projects which are not built for distribution, like collections of related scripts.
eo: Dependenca Grupo taŭgas por interna evoluada uzokazo kiel sintaksanalizado kaj testado kaj ankaŭ por projekto ne konstruita por distribuado, kiel kolekto de rilataj programetoj.
ta: சார்பு குழுக்கள் லின்டிங் மற்றும் சோதனை போன்ற உள் மேம்பாட்டு பயன்பாட்டு-வழக்குகளுக்கு ஏற்றவை, அத்துடன் தொடர்புடைய ச்கிரிப்ட்களின் சேகரிப்புகள் போன்ற விநியோகத்திற்காக கட்டப்படாத திட்டங்களுக்கும் பொருத்தமானவை.

source: Fundamentally, Dependency Groups should be thought of as being a standardized subset of the capabilities of ``requirements.txt`` files (which are ``pip``-specific).
eo: Fundamente, Dependeca Grupo estas normigita subaro de la kapabloj de dosiero ``requirements.txt`` (specifa al ``pip``).
ta: அடிப்படையில், சார்பு குழுக்கள் `` தேவைகள். Txt`` கோப்புகளின் திறன்களின் தரப்படுத்தப்பட்ட துணைக்குழு என்று கருதப்பட வேண்டும் (அவை `` பிப்`-குறிப்பிட்டவை).

source: The ``[dependency-groups]`` Table
eo: La Tabelo ``[dependency-groups]``
ru: Таблица ``[dependency-groups]``
ta: `` [சார்பு-குழுக்கள்] `` அட்டவணை

source: Dependency Groups are defined as a table in ``pyproject.toml`` named ``dependency-groups``. The ``dependency-groups`` table contains an arbitrary number of user-defined keys, each of which has, as its value, a list of requirements.
eo: Dependeca Grupo estas difinita kiel tabelo en ``pyproject.toml`` nomita ``dependency-groups``. La tabelo ``dependency-groups`` enhavas nelimigitan nombron de uzanto-dfinititaj ŝlosiloj, ĉiu el kiuj havas liston de postuloj kiel valoron.
ta: சார்பு குழுக்கள் `` pyproject.toml`` இல் `` சார்பு-குழுக்கள்`` என்ற அட்டவணையாக வரையறுக்கப்படுகின்றன. `` சார்பு-குழுக்கள்` அட்டவணையில் தன்னிச்சையான எண்ணிக்கையிலான பயனர் வரையறுக்கப்பட்ட விசைகள் உள்ளன, அவை ஒவ்வொன்றும் அதன் மதிப்பாக, தேவைகளின் பட்டியலைக் கொண்டுள்ளன.

source: ``[dependency-groups]`` keys, sometimes also called "group names", must be :ref:`valid non-normalized names <name-format>`. Tools which handle Dependency Groups MUST :ref:`normalize <name-normalization>` these names before comparisons.
eo: Ŝlosilo de ``[dependency-groups]``, ankaŭ nomita «grupo-nomo», devas esti :ref:`valida nenormigita nomo <name-format>`. Ilo pritraktanta Dependecan Grupon DEVAS :ref:`normigi <name-normalization>` la nomon antaŭ komparado.
ru: Ключи ``[dependency-groups]``, иногда также называемые «именами групп», должны быть :ref:`valid non-normalized names <name-format>`. Инструменты, работающие с группами зависимостей, ДОЛЖНЫ :ref:`normalize <name-normalization>` эти имена перед сравнением.
ta: `` [சார்பு-குழுக்கள்] `` விசைகள், சில சமயங்களில் "குழு பெயர்கள்" என்றும் அழைக்கப்பட வேண்டும்: குறிப்பு: `செல்லுபடியாகும் இயல்பாக்கப்படாத பெயர்கள் <பெயர்-வடிவ>`. சார்பு குழுக்களைக் கையாளும் கருவிகள் கட்டாயம்: குறிப்பு: `இயல்பாக்குதல் <பெயர்-இயல்பாக்கம்>` ஒப்பீடுகளுக்கு முன் இந்த பெயர்கள்.

source: Tools SHOULD prefer to present the original, non-normalized name to users, and if duplicate names are detected after normalization, tools SHOULD emit an error.
eo: Ilo PREFERU prezenti la originalan, nenormigitan nomon al uzanto. Se duplikata nomo troviĝas post normigo, ilo MONTRU eraron.
ru: Инструменты ДОЛЖНЫ предпочитать представлять пользователям оригинальное, ненормализованное имя, а если после нормализации обнаруживаются дубликаты имен, инструменты ДОЛЖНЫ выдавать ошибку.
ta: அசல், இயல்பாக்கப்படாத பெயரை பயனர்களுக்கு வழங்க கருவிகள் விரும்ப வேண்டும், மேலும் இயல்பாக்கத்திற்குப் பிறகு நகல் பெயர்கள் கண்டறியப்பட்டால், கருவிகள் பிழையை வெளியிட வேண்டும்.

source: Requirement lists, the values in ``[dependency-groups]``, may contain strings, tables (``dict`` in Python), or a mix of strings and tables. Strings must be valid :ref:`dependency specifiers <dependency-specifiers>`, and tables must be valid Dependency Group Includes.
eo: Postulo-listoj, t.e. la valoroj en ``[dependency-groups]``, povas enhavi signoĉenojn, tabelojn (``dict`` de Python), aŭ miksaĵo de signoĉenoj kaj tabeloj. La signoĉenoj devas esti validaj :ref:`dependeco-specifiloj <dependency-specifiers>`, kaj tabeloj devas esti validaj Dependeco-Grupo-Inkluzivoj.
ru: Списки требований, значения в ``[dependency-groups]``, могут содержать строки, таблицы (``dict`` в Python) или смесь строк и таблиц. Строки должны быть валидными :ref:`dependency specifiers <dependency-specifiers>`, а таблицы должны быть валидными Dependency Group Includes.
ta: தேவை பட்டியல்கள், `` [சார்பு-குழுக்கள்] `` இல் உள்ள மதிப்புகள் சரங்கள், அட்டவணைகள் (பைத்தானில் `டிக்ட்``) அல்லது சரங்கள் மற்றும் அட்டவணைகளின் கலவையைக் கொண்டிருக்கலாம். சரங்கள் செல்லுபடியாகும்: ref: `சார்பு குறிப்பான்கள் <சார்பு-விவரக்குறிப்புகள்>`, மற்றும் அட்டவணைகள் சரியான சார்பு குழு அடங்கும்.

source: Dependency Group Include
eo: Inkluzivo de Dependeca Grupo
ru: Группа зависимости Включает
ta: சார்பு குழு அடங்கும்
