Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Examples of invalid glob patterns:
eo: Ekzemploj de nevalidaj ``glob``-patroneoj:

source: Reference implementation in Python
eo: Referenca realigo en Python

source: It is possible to defer the majority of the pattern matching against the file system to the :mod:`glob` module in Python's standard library. It is necessary however to perform additional validations.
eo: Oni povas uzi la modulon :mod:`glob` en la norma biblioteko de Python por la plejparto de kontrolado de kongrueco de patroneo kun ero en dosiersistemo. Tamen, necesas plu kontroli validecon.

source: The code below is as a simple reference implementation:
eo: Jen simpla referenca realigo:

source: :pep:`639` defined a new :ref:`pyproject.toml's license <pyproject-toml-license>` value and added a corresponding :ref:`core metadata License-Expression field <core-metadata-license-expression>`. This specification defines which license expressions are acceptable.
eo: :pep:`639` difinis novan valoron al :ref:`la ŝlosilo license en pyproject.toml <pyproject-toml-license>`, kaj aldonis respondantan :ref:`kampon License-Expression en kernaj metadatenoj <core-metadata-license-expression>`. Ĉi tiu normo difinas la validajn licencesprimojn.

source: License can be defined as a text string that is a valid SPDX :term:`license expression <License Expression>`, as documented in the `SPDX specification <spdxpression_>`__, either Version 2.2 or a later compatible version.
eo: Licenco povas esti difinita kiel teksto, kiu estas valida SPDX-:term:`licencesprimo <License Expression>`, laŭ la `normo SPDX <spdxpression_>`__, aŭ Versio 2.2 aŭ pli nova kongrua versio.

source: A license expression can use the following license identifiers:
eo: Licencesprimo povas uzi la jenajn licenco-identigilojn:

source: Any SPDX-listed license short-form identifiers that are published in the `SPDX License List <spdxlist_>`__, version 3.17 or any later compatible version.
eo: Ajna mallongforma licenca identigilo en la `SPDX License List <spdxlist_>`__, versio 3.17 aŭ ajna pli nova kongrua versio.

source: The custom ``LicenseRef-[idstring]`` string(s), where ``[idstring]`` is a unique string containing letters, numbers, ``.`` and/or ``-``, to identify licenses that are not included in the SPDX license list. The custom identifiers must follow the SPDX specification, `clause 10.1 <spdxcustom_>`__ of the given specification version.
eo: La propra(j) signoĉeno(j) ``LicenseRef-[identigilo]``en kiu ``[identigilo]`` estas unika signoĉeno konsistanta el literoj, ciferoj, ``.`` kaj/aŭ ``-``, identiganta(j) licencojn ne inkluzivitajn en la licencolisto de SPDX. La propraj identigiloj devas observi `paragrafon 10.1 <spdxcustom_>`__ de la normo SPDX de la donita versio de la normo.

source: Examples of valid license expressions:
eo: Ekzemploj de validaj licenco-esprimoj:

source: Examples of invalid license expressions:
eo: Ekzemploj de nevalidaj licenco-esprimoj:

source: ``pylock.toml`` Specification
eo: La normo pri ``pyproject.toml``

source: File Name
eo: Dosiernomo

source: The format of the file is TOML_.
eo: La dosierformo de la dosiero estas TOML_.

source: **Required?**: yes
eo: **Postulata?**: jes

source: **Required?**: no
eo: **Postulata?**: ne

source: **Required?**: no; defaults to ``[]``
eo: **Postulata?** ne, apriore ``[]``

source: The version of the package.
eo: La versio de la pako.

source: **Required?**: no; defaults to ``false``
eo: **Postulata?** ne, apriore ``false``

source: See :ref:`pylock-packages-vcs-url`.
eo: Vidu :ref:`pylock-packages-vcs-url`.

source: See :ref:`pylock-packages-vcs-path`.
eo: Vidu :ref:`pylock-packages-vcs-path`.

source: See :ref:`pylock-packages-archive-upload-time`.
eo: Vidu :ref:`pylock-packages-archive-upload-time`.

source: See :ref:`pylock-packages-archive-url`.
eo: Vidu :ref:`pylock-packages-archive-url`.

source: See :ref:`pylock-packages-archive-path`.
eo: Vidu :ref:`pylock-packages-archive-path`.

source: See :ref:`pylock-packages-archive-size`.
eo: Vidu :ref:`pylock-packages-archive-size`.

source: See :ref:`pylock-packages-archive-hashes`.
eo: Vidu :ref:`pylock-packages-archive-hashes`.

source: See :ref:`pylock-packages-tool`.
eo: Vidu :ref:`pylock-packages-tool`.

source: April 2025: Initial version, approved via :pep:`751`.
eo: Aprilo 2025: unua versio, aprobita per :pep:`751`.

source: Text string that is a valid SPDX :term:`license expression <License Expression>`, as specified in :doc:`/specifications/license-expression`. Tools SHOULD validate and perform case normalization of the expression.
eo: Signoĉeno, kiu estas valida :term:`SPDX-licencesprimo <License Expression>` laŭ :doc:`/specifications/license-expression`. Ilo KONTROLU la validecon de la esprimo kaj NORMIGU la usklecon.

source: Legacy specification
eo: Malnova normo

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`License <core-metadata-license>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`License <core-metadata-license>`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`License <core-metadata-license>`

source: The table may have one of two keys. The ``file`` key has a string value that is a file path relative to :file:`pyproject.toml` to the file which contains the license for the project. Tools MUST assume the file's encoding is UTF-8. The ``text`` key has a string value which is the license of the project. These keys are mutually exclusive, so a tool MUST raise an error if the metadata specifies both keys.
eo: La tabelo povas havi unu el du ŝlosiloj. La ŝlosilo ``file`` havas signoĉenan valoron, kiu estas dosierloko (relativa al :file:`pyproject.toml`) de la dosiero, kiu enhavas la licencon de la projekto. Ilo DEVAS supozi, ke la dosiero estas kodita laŭ UTF-8. La ŝlosilo ``text`` havas signoĉenan valoro, kiu estas la licenco de la projekto. Tiuj ŝlosiloj estas disaŭaj: ilo DEVAS sciigi pri eraro, se la metadatenoj enhavas ambaŭ ŝlosilojn.

source: The table subkeys were deprecated by :pep:`639` in favor of the string value.
eo: La tabelajn subŝlosilojn malrekomendis :pep:`639`, rekomendante anstaŭe la signoĉenan valoron.

source: The strings MUST contain valid glob patterns, as specified in :doc:`/specifications/glob-patterns`.
eo: La signoĉeno DEVAS enhavi validan patroneon laŭ la normo :doc:`/specifications/glob-patterns`.

source: Patterns are relative to the directory containing :file:`pyproject.toml`,
eo: Patroneo estas relativa al la dosierujo enhavanta :file:`pyproject.toml`,

source: This :file:`.dist-info/` directory may contain the following directories, described in detail below:
eo: Tiu dosierujo :file:`.dist-info/` povas enhavi la jenajn subdosierujojn, priskribitajn ĉi-sube:

source: The :file:`sboms/` subdirectory
eo: La subdosierujo :file:`sboms/`

source: Python Description Formats
eo: Python-Priskribaj Formoj

source: :ref:`virtualenv` needs to be installed separately, but supports Python 2.7+ and Python 3.3+, and :ref:`pip`, :ref:`setuptools` and :ref:`wheel` are installed into created virtual environments by default. Note that ``setuptools`` is no longer included by default starting with Python 3.12 (and ``virtualenv`` follows this behavior).
eo: :ref:`virtualenv` devas esti aparte instalita sed subtenas Python 2.7+ kaj Python 3.3+. :ref:`pip`, :ref:`setuptools` kaj :ref:`wheel` estas instalitaj en la kreitan virtualan medion apriore. Notu, ke ``setuptools`` ne plu estas inkluzivita apriore ekde Python 3.12 (kaj ``virtualenv`` sekvas tion).

source: The ``requires`` key is a list of packages that are needed to build your package. The :term:`frontend <Build Frontend>` should install them automatically when building your package. Frontends usually run builds in isolated environments, so omitting dependencies here may cause build-time errors. This should always include your backend's package, and might have other build-time dependencies. The minimum version specified in the above code block is the one that introduced support for :ref:`the new license metadata <license-and-license-files>`.
eo: La ŝlosilo ``requires`` estas listo de pakoj necesaj por konstrui la pakon. La :term:`malfasado <Build Frontend>` instalos ilin aŭtomate dum konstruado de la pako. Malfasado ordinare konstruas en izolita medio, tiel ke forlaso de dependaĵo povas kaŭzi eraron dum konstruado. Tio ĉiam inkluzivu la pakon de la malfasado kaj eble aliajn konstrutempajn dependaĵojn. La minimuma versio specifita en la ĉi-supra kodbloko estas tiu, kiu eksubtenis la :ref:`novan licencan metadatenon <license-and-license-files>`.

source: ``license`` is the :term:`SPDX license expression <License Expression>` of your package.
eo: ``license`` estas la :term:`SPDX-esprimo <License Expression>` de via pako.

source: ``license-files`` is the list of glob paths to the license files, relative to the directory where :file:`pyproject.toml` is located.
eo: ``license-files`` estas la listo de dosierloko-patroneoj al la licenco-dosieroj, relativa al la dosierujo en kiu ĉeestas :file:`pyproject.toml`.

source: This point applies only to the files belonging to the package itself. The downstream packaging process, much like Python package managers, will provision the necessary Python dependencies, system tools and external libraries that are needed by your package and its build scripts. However, the files listing these dependencies (for example, ``requirements*.txt`` files) should also be included, to help downstreams determine the needed dependencies, and check for changes in them.
ja: この点は、パッケージそれ自体に属するファイル群にだけ適用します。Python のパッケージ管理機構に極めてよく似ていますが、ダウンストリームパッケージの処理では、必要な Python の依存関係や、そのパッケージとそのビルドスクリプトが必要とするシステムツールや外部のライブラリの依存関係を提供します。しかしながら、ダウンストリーム側が必要な依存関係を決定し、それらの変更をチェックするために、これらの依存関係を列挙するファイル (例えば ``requirements*.txt`` ファイル) もまた同梱されるべきです。

source: If the package is implementing any custom build *backend* actions that use the Internet, for example by automatically downloading vendored dependencies or fetching Git submodules, its source distribution should either include all of these files or allow provisioning them externally, and the Internet must not be used if the files are already present.
ja: パッケージが、例えば売り物の依存関係を自動的にダウンロードしたり、Git のサブモジュールをフェッチしたりするような、そのようなインターネットを使用する何らかのカスタムビルド *バックエンド* 動作を実装しているなら、そのソースコード配布物は、これらのファイル群をすべて同梱するか、別途準備することができるようにするかのいずれかをするべきで、ファイル群がすでに存在する場合にはインターネットを使用しないようにしなければなりません。

source: Note that this point does not apply to Python dependencies that are specified in the package metadata, and are fetched during the build and installation process by *frontends* (such as :ref:`build` or :ref:`pip`). Downstreams use frontends that use local provisioning for Python dependencies.
ja: この点は、パッケージのメタデータの中で指定された Python の依存関係には当てはまらないということ、また、それらは (:ref:`build` や :ref:`pip` のような) *フロントエンド* によるビルドやインストールのプロセスの最中にフェッチされるということに注意してください。ダウンストリーム側では、Python の依存関係をローカルに準備するようなフロントエンドを使います。

source: The published wheels require a binary-compatible version of the used library to be present on the user's system. If the library is missing or an incompatible version is installed, the Python package may fail with errors that are not clear to inexperienced users, or even misbehave at runtime.
ja: 公開された wheel は、使っているライブラリのバイナリ互換のバージョンがユーザのシステム上に存在することを要求します。もし、ライブラリが不足していたり非互換のバージョンがインストールされていたりすると、 Python パッケージは、経験豊かとは言えないユーザにとっては明晰でないエラーを伴って失敗するかもしれませんし、動作時に誤動作することさえあるかもしれません。

source: For these reasons, you may reasonably decide to either statically link your dependencies, or to provide local copies in the installed package. You may also vendor the dependency in your source distribution. Sometimes these dependencies are also repackaged on PyPI, and can be declared as project dependencies like any other Python package.
ja: これらの理由は、依存関係先を静的にリンクするか、インストールされるパッケージの中にローカルコピーを用意するかのいずれかに決める合理的な理由になります。ソースコード配布物の中にも依存関係先を含めることもあるかもしれません。時に、これらの依存関係先もまた PyPI でパッケージされていて、他のすべての Python パッケージのように、プロジェクトの依存関係先として宣言され得ることもあります。

source: Using system dependencies makes the package benefit from downstream customization that can improve the user experience on a particular platform, without the downstream maintainers having to consistently patch the dependencies vendored in different packages. This can include compatibility improvements and security hardening.
ja: システムの依存関係を使うことで、ダウンストリーム保守者が様々なパッケージ内で提供される依存関係に統一的にパッチしなければならないということがない形で、特定のプラットフォーム上でユーザ経験を改善し得るところのダウンストリームでのカスタマイゼーションからの利益をパッケージにもたらします。これは、互換性の向上やセキュリティハードニングを含み得ます。

source: Static linking and vendoring can result in multiple different versions of the same library being loaded in the same process (for example, attempting to import two Python packages that link to different versions of the same library). This sometimes works without incident, but it can also lead to anything from library loading errors, to subtle runtime bugs, to catastrophic failures (like suddenly crashing and losing data).
ja: 静的なリンキングとベンダーリングによって、同一ライブラリの複数の異なるバージョンが同じプロセスの中でロードされ得ます (例えば、同じライブラリの別バージョンにリンクしたふたつの Python パッケージを import しようと試みた場合) 。ある時には、事件にならずに動作しますが、ライブラリのローディングエラーに起因する問題や、微妙な動作中のバグや、 (突然クラッシュしてデータを失うといった) 壊滅的な失敗へと至ることもあり得ます。

source: A good compromise between the needs of both parties is to provide a switch between using vendored and system dependencies. Ideally, if the package has multiple vendored dependencies, it should provide both individual switches for each dependency, and a general switch to control the default for them, e.g. via a ``USE_SYSTEM_DEPS`` environment variable.
ja: 双方のニーズの間の良い妥協点は、ベンダード (訳註：パッケージ側が準備したものの意か) のものを使うかシステムの依存関係を使うかを切り替えるスイッチを提供することです。理想的には、パッケージ側が複数の独自の依存関係を持つならば、それぞれの依存関係について独立したスイッチを提供するべきで、かつ、例えば ``USE_SYSTEM_DEPS`` 環境変数のようにデフォルト設定を制御する一般的なスイッチをも持つべきです。

source: If the user requests using system dependencies, and a particular dependency is either missing or incompatible, the build should fail with an explanatory message rather than fall back to a vendored version. This gives the packager the opportunity to notice their mistake and a chance to consciously decide how to solve it.
ja: ユーザがシステム側の依存関係を使うことを要求していて、特定の依存関係が存在しないか非互換である場合には、ビルドは、ベンダードのバージョンにフォールバックするよりも説明的なメッセージと共に失敗するべきです。これによって、パッケージ製作者が誤りに気付き、どのように解決するかを意識して解決する機会を得ることができます。

source: It is reasonable for upstream projects to leave *testing* of building with system dependencies to their downstream repackagers. The goal of these guidelines is to facilitate more effective collaboration between upstream projects and downstream repackagers, not to suggest upstream projects take on tasks that downstream repackagers are better equipped to handle.
ja: アップストリーム側プロジェクトが、システム側の依存関係を使ってビルドする *テスト* をダウンストリーム側の再パッケージ作業者に残しておくことは合理的です。これらのガイドラインのゴールは、アップストリーム側プロジェクトとダウンストリーム側再パッケージ作業者の間の協調作業がより効率的になるようにお膳立てすることであって、ダウンストリーム側再パッケージ作業者がよりよく取り扱えるように装備を整えるというタスクをアップストリーム側プロジェクトが分担するようにと示唆するものではありません。

source: A variety of downstream projects run some degree of testing on the packaged Python projects. Depending on the particular case, this can range from minimal smoke testing to comprehensive runs of the complete test suite. There can be various reasons for doing this, for example:
ja: さまざまなダウンストリームプロジェクトが、何らかの形でパッケージ済みの Python プロジェクトのテストを走らせています。これは、それぞれのケースに依って、最低限のスモークテストからテストスイートを隅から隅まで網羅的に行うところまでの幅を持ちます。こうしたことを行うにはさまざまな理由があり得ます:

source: Admittedly, sometimes downstream testing may yield false positives or bug reports about scenarios the upstream project is not interested in supporting. However, perhaps even more often it does provide early notice of problems, or find non-trivial bugs that would otherwise cause issues for the upstream project's users. While mistakes do happen, the majority of downstream packagers are doing their best to double-check their results, and help upstream maintainers triage and fix the bugs that they reported.
ja: 確かに、ダウンストリーム側でテストを行うと、偽陽性や、アップストリーム側プロジェクトがサポートする上で興味を持たないようなシナリオについてのバグ報告を生み出すかもしれません。しかしながら、おそらく、もっとよくあるのは、問題に関する早期の気付きを得たり、発見できなければアップストリーム側プロジェクトのユーザにとっての問題を引き起こしたであろう非自明のバグを発見したりということでしょう。過誤は起きるものですが、ダウンストリーム側パッケージ作業者の大半は、結果をダブルチェックすることに最善の努力を行っていますし、自分たちが報告したバグをアップストリーム側の保守者が優先順位を付けて修正することを助けます。

source: There are a number of things that upstream projects can do to help downstream repackagers test their packages efficiently and effectively, including some of the suggestions already mentioned above. These are typically improvements that make the test suite more reliable and easier to use for everyone, not just downstream packagers. Some specific suggestions are:
ja: ダウンストリーム側の再パッケージ作業者がそのパッケージを効率よく効果的にテストするのを助けるために、アップストリーム側プロジェクトができることは、すでに上述した示唆のいくつかを含めて沢山あります。これらは、典型的には、テストスイートが誰にとってもより信頼できて簡単に使えるようにするような改善です。いくつかの特定の示唆は:

source: Make the test suite work offline. Mock network interactions, using packages such as responses_ or vcrpy_. If that is not possible, make it possible to easily disable the tests using Internet access, e.g. via a pytest_ marker. Use pytest-socket_ to verify that your tests work offline. This often makes your own test workflows faster and more reliable as well.
ja: テストスイートがオフラインで動作するように作ってください。 responses_ や vcrpy_ のようなパッケージを使って、ネットワークとの相互作用を疑似的に行ってください。もし可能であれば、たとえば pytest_ マーカを経由するなどして、インターネットアクセスを伴うテストを簡単に無効にできるようにしてください。テストがオフラインで動作可能であることを検証するには、 pytest-socket_ を使ってください。このようにすることで、テストワークフローがより素早く、かつ、より信頼できる形で実行できるようになります。

source: Split tests by their purpose, and make it easy to skip categories that are irrelevant or problematic. Since the primary purpose of downstream testing is to ensure that the package itself works, downstreams are not generally interested in tasks such as checking code coverage, code formatting, typechecking or running benchmarks. These tests can fail as dependencies are upgraded or the system is under load, without actually affecting the package itself.
ja: その目的に従ってテストを分割し、重要でないカテゴリや問題含みのカテゴリを簡単にスキップできるようにしましょう。ダウンストリーム側でのテストの一義的な目的は、そのパッケージ自体が動作することを保証することであって、一般的に、ダウンストリーム側ではコードカバー率・コードフォーマット・型チェックやベンチマークするというようなタスクには興味がありません。パッケージ自体に実際に影響を与えることはなくとも、依存関係先がアップグレードされたりシステムが高負荷下にあったりするとこれらのテストが失敗する可能性があります。

source: Many downstreams provide stable release channels in addition to the main package streams. The goal of these channels is to provide more conservative upgrades to users with higher stability needs. These users often prefer to trade having the newest features available for lower risk of issues.
ja: 多くのダウンストリームは、メインのパッケージストリームに加えて、ステーブルリリースチャンネルを提供しています。このようなチャンネルのゴールは、より高い安定性を必要とするユーザ向けに、より保守的なアップグレードを提供することです。このようなユーザは、しばしば、最新の機能を得ることよりも、問題発生のリスクがより低いことを選択することを好みます。

source: While the exact policies differ, an important criterion for including a new package version in a stable release channel is for it to be available in testing for some time already, and have no known major regressions. For example, in Gentoo Linux a package is usually marked stable after being available in testing for a month, and being tested against the versions of its dependencies that are marked stable at the time.
ja: 正確にはポリシーはそれぞれに異なりますが、新しいバージョンのパッケージをステーブルリリースチャンネルに取り込む際の重要な評価基準は、すでに幾らかの時間をかけてテストが行われているものを利用可能にする、既知の大きな手戻りがない、ということです。例えば、 Gentoo Linux では、あるパッケージがステーブルであると印をつけられるのは一ヶ月間のテストが行われた後であり、その時点で依存関係先のパッケージ群がステーブルであるバージョンを使ってテストされていることです。

source: However, there are circumstances which demand more prompt action. For example, if a security vulnerability or a major bug is found in the version that is currently available in the stable channel, the downstream is facing a need to resolve it. In this case, they need to consider various options, such as:
ja: しかしながら、もっと素早い行動が要求される状況もあります。例えば、ステーブルチャンネルで現に利用可能になっているバージョンにセキュリティ上の脆弱性や大きなバグが発見された場合、ダウンストリーム側はそれを解決する必要に直面します。このような場合には、以下のようなさまざまな選択肢を考慮の対象とする必要があります:

source: :ref:`pip` came later in 2008, as an alternative to :ref:`easy_install <easy_install>`, although still largely built on top of :ref:`setuptools` components. It was notable at the time for *not* installing packages as :term:`Eggs <Egg>` or from :term:`Eggs <Egg>` (but rather simply as 'flat' packages from :term:`sdists <Source Distribution (or "sdist")>`), and introducing the idea of :ref:`Requirements Files <pip:Requirements Files>`, which gave users the power to easily replicate environments.
ja: 依然として:ref:`setuptools`を部品に使ってビルドされてはいますが、:ref:`easy_install <easy_install>`を置き換えるものとして:ref:`pip`が2008年に後からやってきました。当時はパッケージを(かなり単純に:term:`sdists <Source Distribution (or "sdist")>`から「フラット」なパッケージとしてインストールするものであって):term:`Eggs <Egg>`の形でインストールするものでも、:term:`Eggs <Egg>`からインストールするものでも*なかった*こと、そして、簡単に環境を再現する力をユーザに与える:ref:`Requirements Files <pip:Requirements Files>`の考え方を導入したことは注目に値します。

source: There are known exceptions for selecting the next version number. The maintainers may consciously choose to break the assumption that the last version segment only contains backwards-compatible changes. One such case is when a security vulnerability needs to be addressed. Security releases often come in patch versions but contain breaking changes inevitably.
ja: 次のバージョン番号を選定する上で既知の例外があります。保守者は、最後のバージョン断片の変更では後方互換性を保つ変更だけを含むという想定を破るような選択を意識的に行っても構いません。そのような場合の一つは、セキュリティ上の脆弱性を修正する必要がある時です。セキュリティリリースは、しばしば、パッチバージョンとして提供されますが、そうすると必然的にここで述べているような変更をもたらします。

source: Semantic versioning is not a suitable choice for all projects, such as those with a regular time-based release cadence and a deprecation process that provides warnings for a number of releases prior to removal of a feature.
ja: セマンティックバージョニングはすべてのプロジェクト向きと言うわけではなく、例えば定期的なリリースサイクルに従う場合や、ある機能を削除する前に何世代にもわたるリリースで非推奨(deprecation)の警告を出すような場合には適していないかもしれません。

source: Combinations of the above schemes are possible. For example, a project may combine date-based versioning with serial versioning to create a *year.serial* numbering scheme that readily conveys the approximate age of a release, but doesn't otherwise commit to a particular release cadence within the year.
ja: 上に述べた方式を組み合わせて用いることもできます。例えば、日付ベースのバージョン付与と一連番号によるバージョン付与を組み合わせて *year.month* 型のバージョン番号付与方式を作り出して、それがあるリリースのおよその年数が自動的にわかるようにしているが、あるリリースのその年の中での歩調についてはあまり気にしていないこともあります。

source: This guide will walk you through creating and packaging a standalone command-line application that can be installed with :ref:`pipx`, a tool for creating and managing :term:`Python Virtual Environments <Virtual Environment>` and exposing the executable scripts of packages (and available manual pages) for use on the command-line.
ja: このガイド文書では、:term:`Python 仮想環境 <Virtual Environment>` を作成し管理するツールである :ref:`pipx` でインストールできるような、スタンドアローンのコマンドラインアプリケーションを作成しパッケージングすること、そして、パッケージの実行可能なスクリプト (及び利用可能な man ページ) を外部からコマンドラインで使えるようにすることについて、一通り案内します。

source: The file :file:`__main__.py` marks the main entry point for the application when running it via :mod:`runpy` (i.e. ``python -m greetings``, which works immediately with flat layout, but requires installation of the package with src layout), so initialize the command-line interface here:
ja: :file:`__main__.py` ファイルは、 :mod:`runpy` から走らせた (すなわち ``python -m greetings`` 、これはフラットレイアウトならすぐに動作しますが、 src レイアウトではパッケージのインストールを要求します) 時、アプリケーションのメインのエントリポイントを提示するものですので、コマンドラインインタフェースをここで初期化しましょう:

source: This syntax is a bit impractical, however; as the name of the entry point we defined above does not match the package name, we need to state explicitly which executable script to run (even though there is only on in existence).
ja: しかしながら、このシンタックスはちょっと実際的ではありません; 上で定義したエントリポイントの名称がパッケージ名称と一致しないので、 (たとえひとつしか実行スクリプトがないとしても) 明示的にどの実行スクリプトを走らせるのかを述べる必要があります。
