Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If there is a GPG signature for a particular distribution file it **MUST** live alongside that file with the same name with a ``.asc`` appended to it. So if the file ``/packages/HolyGrail-1.0.tar.gz`` existed and had an associated signature, the signature would be located at ``/packages/HolyGrail-1.0.tar.gz.asc``.
eo: Se ekzistas GPG-subskribo por iu distruo-dosiero, ĝi **DEVAS** ĉeesti apud tiu dosiero kun la sama dosiernomo krom sufikso ``.asc``. Ekzemple, se la dosiero ``/packages/SanktaGralo-1.0.tar.gz`` ekzistus kaj havus asociitan subskribon, la subskribo troviĝus ĉe ``/packages/SanktaGralo-1.0.tar.gz.asc``.
ja: 特定の配布物ファイルに GPG 署名があれば、その配布物ファイルの名前に ``.asc`` を追加したファイル名で **共存させなければなりません** 。だから、 ``/packages/HolyGrail-1.0.tar.gz`` が存在していて署名が結びついていれば、そのsと名は ``/packages/HolyGrail-1.0.tar.gz.asc`` という名前であるはずです。
ru: Если существует GPG-подпись для определенного файла дистрибутива, она **МОЖЕТ** находиться рядом с одноименным файлом с приставкой ``.asc``. Таким образом, если файл ``/пакеты/HolyGrail-1.0.tar.gz`` существует и имеет соответствующую подпись, подпись будет находиться по адресу ``/пакеты/HolyGrail-1.0.tar.gz.asc``.
ta: ஒரு குறிப்பிட்ட விநியோக கோப்பிற்கான சிபிசி கையொப்பம் இருந்தால், அது ** அதே கோப்புடன் அந்தக் கோப்போடு இணைந்து வாழ வேண்டும் `` .ஆச்`` அதில் சேர்க்கப்பட்டுள்ளது. ஆகவே, ``/தொகுப்புகள்/ஓலி கிரெயில் -1.0.tar.gz`` கோப்பு இருந்திருந்தால், அதனுடன் தொடர்புடைய கையொப்பம் இருந்தால், கையொப்பம் ``/தொகுப்புகள்/ஓலி கிரெயில் -1.0.tar.gz.asc`` இல் அமைந்திருக்கும்.

source: A repository **MAY** include a ``data-gpg-sig`` attribute on a file link with a value of either ``true`` or ``false`` to indicate whether or not there is a GPG signature. Repositories that do this **SHOULD** include it on every link.
eo: Deponejo **POVAS** inkluzivi atributon `data-gpg-sig`` sur dosiera hiperligo kun valoro de aŭ ``true`` aŭ ``false`` por indiki, ĉu ekzistas GPG-subskribo. Deponejo faranta tion **INKLUZIVU** ĝin sur ĉiu hiperligo.
ja: リポジトリは、 GPG 署名が存在するか否かを示す ``true`` か ``false`` を値にとる ``data-gpg-sig`` アトリビュートをファイルリンクの中に含んでいても **構いません** 。これを行うリポジトリは、全てのリンクについて **行うべきです** 。
ru: Хранилище **МОЖЕТ** включать атрибут ``data-gpg-sig`` в ссылку на файл со значением ``true`` или ``false`` для указания наличия или отсутствия GPG-подписи. Репозитории, которые делают это, **ДОЛЖНЫ** включать его в каждую ссылку.
ta: ஒரு களஞ்சியம் ** ஒரு சிபிசி கையொப்பம் உள்ளதா இல்லையா என்பதைக் குறிக்க `` உண்மை`` அல்லது `` தவறு` ஆகியவற்றின் மதிப்புடன் ஒரு கோப்பு இணைப்பில் `` தரவு-சிபிசி-சிக்`` பண்புக்கூறு இருக்கலாம். இதைச் செய்யும் களஞ்சியங்கள் ** ** ஒவ்வொரு இணைப்பிலும் இதை சேர்க்க வேண்டும்.

source: In the attribute value, < and > have to be HTML encoded as ``&lt;`` and ``&gt;``, respectively.
eo: En la atributa valoro, < kaj > devas esti HTML-kodita kiel ``&lt;`` and ``&gt;`` respektive.
ja: アトリビュートの値においては、 < や > は順に ``&lt;`` や ``&gt;`` へと HTML エンコードされなければなりません。
ru: В значении атрибута < и > должны быть закодированы в HTML как ``&lt;`` и ``&gt;``, соответственно.
ta: பண்புக்கூறு மதிப்பில், <மற்றும்> உஉகுமொ முறையே `` & lt; `` மற்றும் `` & gt; `` என குறியிடப்பட வேண்டும்.

source: A repository **MAY** include a ``data-provenance`` attribute on a file link. The value of this attribute **MUST** be a fully qualified URL, signaling that the file's provenance can be found at that URL. This URL **MUST** represent a `secure origin <https://www.chromium.org/Home/chromium-security/prefer-secure-origins-for-powerful-new-features/>`_.
eo: Deponejo **POVAS** inkluzivi atributon ``data-provenance`` sur dosiera hiperligo. La valoro de tiu atributo **DEVAS** esti plene kvalifikita URL, asertante ke la originpruvo de la dosiero ĉeestas ĉe tiu URL. La URL **DEVAS** prezenti `sekuran originon <https://www.chromium.org/Home/chromium-security/prefer-secure-origins-for-powerful-new-features/>`_.
ru: Хранилище **МОЖЕТ** включать атрибут ``data-provenance`` в ссылку на файл. Значение этого атрибута **ДОЛЖНО** представлять собой полностью определенный URL, сигнализирующий о том, что информацию о происхождении файла можно найти по этому URL. Этот URL **ДОЛЖЕН** представлять собой `secure origin <https://www.chromium.org/Home/chromium-security/prefer-secure-origins-for-powerful-new-features/>`_.
ta: ஒரு களஞ்சியம் ** ஒரு கோப்பு இணைப்பில் ஒரு `` தரவு-ஆதாரம்`` பண்புக்கூறு சேர்க்கப்படலாம். இந்த பண்புக்கூறு ** ** ஒரு முழுமையான தகுதி வாய்ந்த முகவரி ஆக இருக்க வேண்டும், இது கோப்பின் ஆதாரத்தை அந்த முகவரி இல் காணலாம் என்பதைக் குறிக்கிறது. இந்த முகவரி ** ** ஒரு `பாதுகாப்பான தோற்றத்தை <https://www.chromium.org/home/chromium-security/prefer-secure-origins-forforful-newfutures/>` _ ஆகியவற்றைக் குறிக்க வேண்டும்.

source: The format of the linked provenance is defined in :ref:`index-hosted-attestations`.
eo: La formo de la ligita originpruvo estas difinita en :ref:`index-hosted-attestations`.
ru: Формат связанного провенанса определен в :ref:`index-hosted-attestations`.
ta: இணைக்கப்பட்ட ஆதாரத்தின் வடிவம் இதில் வரையறுக்கப்பட்டுள்ளது: குறிப்பு: `குறியீட்டு-ஓச்ட்-அட்டெச்டெச்டேசன்ச்`.

source: Serve Distribution Metadata in the Simple Repository API
eo: Servi Distribuajn Metadatenojn per la Simpla Deponeja API
ja: シンプルな API で配布物のメタデータを提供する
ru: Предоставление метаданных распространения в API простого репозитория
ta: எளிய களஞ்சிய பநிஇ இல் விநியோக மெட்டாடேட்டாவை பரிமாறவும்

source: In a simple repository's project page, each anchor tag pointing to a distribution **MAY** have a ``data-dist-info-metadata`` attribute. The presence of the attribute indicates the distribution represented by the anchor tag **MUST** contain a Core Metadata file that will not be modified when the distribution is processed and/or installed.
ja: 簡明なリポジトリのプロジェクトページでは、配布物を指し示すアンカータグは、それぞれ、 ``data-dist-info-metadata`` アトリビュートを **持っていても構いません** 。このアトリビュートが存在していることで、そのアンカータグが提示する配布物が、その配布物が処理されたりインストールされたりしても変更されないであろうコアとなるメタデータのファイルを **持っていなければならない** ことを示します。
ru: На странице проекта простого хранилища каждый якорный тег, указывающий на дистрибутив, **МОЖЕТ** содержать атрибут ``данные-дистрибутива-инфо-метаданные``. Наличие этого атрибута указывает на то, что дистрибутив, представленный тегом якоря, **МОЖЕТ** содержать файл метаданных Core, который не будет изменен при обработке и/или установке дистрибутива.
ta: ஒரு எளிய களஞ்சியத்தின் திட்டப் பக்கத்தில், ஒவ்வொரு நங்கூரக் குறிச்சொல்லையும் ஒரு விநியோகத்தை சுட்டிக்காட்டும் ** ** ** ஒரு `` தரவு-டிச்ட்-இன்ஃபோ-மெட்டாடேட்டா`` பண்புக்கூறு இருக்கலாம். பண்புக்கூறின் இருப்பு நங்கூரம் குறிச்சொல்லால் குறிப்பிடப்படும் விநியோகத்தைக் குறிக்கிறது ** ** ஒரு முக்கிய மேனிலை தரவு கோப்பைக் கொண்டிருக்க வேண்டும், இது வழங்கல் செயலாக்கப்படும்போது மற்றும்/அல்லது நிறுவப்படும்போது மாற்றப்படாது.

source: If a ``data-dist-info-metadata`` attribute is present, the repository **MUST** serve the distribution's Core Metadata file alongside the distribution with a ``.metadata`` appended to the distribution's file name. For example, the Core Metadata of a distribution served at ``/files/distribution-1.0-py3.none.any.whl`` would be located at ``/files/distribution-1.0-py3.none.any.whl.metadata``. This is similar to how :ref:`the base HTML API specification <simple-repository-api-base>` specifies the GPG signature file's location.
eo: Se ekzistas atributo ``data-dist-info-metadata``, la deponejo **DEVAS** provizi la Kernan Metadatenan dosieron de la distribuo apud la distribuo, kun la sufikso ``.metadata`` post la dosiernomo de la distribuo. Ekzemple, la Kernaj Metadatenoj de distribuo ĉe ``/dosieroj/distribuo-1.0-py3.none.any.whl`` troviĝus ĉe ``/dosieroj/distribuo-1.0-py3.none.any.whl.metadata``. Tio similas al la loko de la GPG-subskribo en la :ref:`baza specifo de HTML API <simple-repository-api-base>`.
ja: もし ``data-dist-info-metadata`` アトリビュートが存在するなら、リポジトリは、配布物の名称に ``.metadata`` を追加したファイル名で配布物のコアとなるメタデータのファイルを配布物と共に **提供しなければなりません** 。例えば、 ``/files/distribution-1.0-py3.none.any.whl`` が提供されている場所で提供される配布物のコアとなるメタデータは、 ``/files/distribution-1.0-py3.none.any.whl.metadata`` という場所に置かれることになるでしょう。これは、 :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` で GPG 署名のファイルの場所の指定するやり方と似ています。
ru: Если атрибут ``данные-дистрибутива-инфо-метаданные`` присутствует, репозиторий **ДОЛЖЕН** предоставлять файл основных метаданных дистрибутива вместе с дистрибутивом с добавлением ``. метаданные`` к имени файла дистрибутива. Например, Core Metadata дистрибутива, обслуживаемого по адресу ``/файлы/дистрибутив-1.0-py3.none.any.whl``, будет находиться по адресу ``/файлы/дистрибутив-1.0-py3.none.any.whl. метаданные``. Это похоже на то, как :ref:`в базовой спецификации HTML API <простой репозиторий-апи-база>` указывается местоположение файла подписи GPG.
ta: ஒரு `` தரவு-டிச்ட்-இன்ஃபோ-மெட்டாடேட்டா`` பண்புக்கூறு இருந்தால், களஞ்சியம் ** விநியோகத்தின் கோர் மேனிலை தரவு கோப்பை விநியோகிப்பதன் மூலம் விநியோகத்தின் கோப்பு பெயருடன் சேர்க்கப்பட்ட விநியோகத்தின் முக்கிய மேனிலை தரவு கோப்பை வழங்க வேண்டும். எடுத்துக்காட்டாக, ``/கோப்புகள்/விநியோகம் -1.0-py3.none.non.whl`` இல் வழங்கப்படும் ஒரு விநியோகத்தின் முக்கிய மேனிலை தரவு ``/கோப்புகள்/விநியோகம் -1.0-py3.none.non.whl.metadata`` இல் அமைந்திருக்கும். இது எப்படி: ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <எளிய-ரெபோசிட்டரி-API-BASE>` சிபிசி கையொப்பக் கோப்பின் இருப்பிடத்தைக் குறிப்பிடுகிறது.

source: The repository **SHOULD** provide the hash of the Core Metadata file as the ``data-dist-info-metadata`` attribute's value using the syntax ``<hashname>=<hashvalue>``, where ``<hashname>`` is the lower cased name of the hash function used, and ``<hashvalue>`` is the hex encoded digest. The repository **MAY** use ``true`` as the attribute's value if a hash is unavailable.
ja: リポジトリは、 ``<hashname>`` がハッシュ関数の小文字で書いた名称で ``hashvalue`` が16進数に符号化されたハッシュ値であるとして ``<hashname>=<hashvalue>`` という書式を使って、 ``data-dist-info-metadata`` アトリビュートの値としてコアとなるメタデータのファイルのハッシュ値を **提供するべきです** 。ハッシュ値を利用できない場合には、リポジトリはアトリビュートの値として ``true`` を **使っても構いません** 。
ru: Хранилище **ДОЛЖНО** предоставить хэш файла основных метаданных в качестве значения атрибута ``данные-дист-инфо-метаданные``, используя синтаксис ``<hashname>=<hashvalue>``, где ``<hashname>`` - это имя используемой хэш-функции, а ``<hashvalue>`` - дайджест в шестнадцатеричном коде. Хранилище **МОЖЕТ** использовать ``true`` в качестве значения атрибута, если хэш недоступен.
ta: களஞ்சியமான ** ** கோர் மேனிலை தரவு கோப்பின் ஆசை `` <sanshname> = <shushvalue> `` என்ற தொடரியல் பயன்படுத்தி `` <seashname> = <shshvalue>, அங்கு `` `` `` `` `<sental` `` `` `is ks` `. ஒரு ஆச் கிடைக்காவிட்டால், பண்புக்கூறு மதிப்பாக `` உண்மை` `களஞ்சியம் ** பயன்படுத்தலாம்.

source: Backwards Compatibility
eo: Retrokongrueco
ja: 後方互換性
ru: Обратная совместимость
ta: பின்னோக்கி பொருந்தக்கூடிய தன்மை

source: If an anchor tag lacks the ``data-dist-info-metadata`` attribute, tools are expected to revert to their current behaviour of downloading the distribution to inspect the metadata.
eo: Se je ankra etikedo mankas la atributo ``data-dist-info-metadata``, ilo uzu la aktualan konduton, elŝutante la distribuon kaj inspektante la metadatenojn.
ja: アンカータグに ``data-sidt-info-metadata`` アトリビュートがない場合、ツール群は、配布物をダウンロードするというその時点の動作を反転して、メタデータを調べるという動作に変更することが期待されています。
ru: Если в теге якоря отсутствует атрибут ``данные-дистрибутива-инфо-метаданные``, ожидается, что инструменты вернутся к своему текущему поведению загрузки дистрибутива для проверки метаданных.
ta: ஒரு நங்கூரம் குறிச்சொல்லில் `` தரவு-டிச்ட்-இன்ஃபோ-மெட்டாடேட்டா`` பண்புக்கூறு இல்லை என்றால், மெட்டாடேட்டாவை ஆய்வு செய்ய விநியோகத்தைப் பதிவிறக்கும் அவற்றின் தற்போதைய நடத்தைக்கு கருவிகள் மாறும் என்று எதிர்பார்க்கப்படுகிறது.

source: Older tools not supporting the new ``data-dist-info-metadata`` attribute are expected to ignore the attribute and maintain their current behaviour of downloading the distribution to inspect the metadata. This is similar to how prior ``data-`` attribute additions expect existing tools to operate.
ja: 新しい ``data-dist-info-metadata`` アトリビュートをサポートしてない古めのツール群は、このアトリビュートを無視することを期待されており、メタデータを検査するために配布物をダウンロードするという現在の動作を維持することを期待されています。これは、先の ``data-`` アトリビュート追加の際に、既存のツール群が期待された動作と似ています。
ru: Предполагается, что старые инструменты, не поддерживающие новый атрибут ``данные-дистрибутив-инфо-метаданные``, будут игнорировать этот атрибут и сохранят свое текущее поведение, загружая дистрибутив для проверки метаданных. Это похоже на то, как предыдущие добавления атрибута ``данные-`` предполагают работу существующих инструментов.
ta: புதிய `` தரவு-டிச்ட்-இன்ஃபோ-மெட்டாடேட்டா`` பண்புக்கூறு ஆகியவற்றை ஆதரிக்காத பழைய கருவிகள் பண்புக்கூறுகளை புறக்கணித்து, மெட்டாடேட்டாவை ஆய்வு செய்ய விநியோகத்தைப் பதிவிறக்குவதற்கான அவற்றின் தற்போதைய நடத்தையை பராமரிக்கும் என்று எதிர்பார்க்கப்படுகிறது. முந்தைய `` தரவு -`` பண்புக்கூறு சேர்த்தல்கள் இருக்கும் கருவிகள் எவ்வாறு செயல்படும் என்று எதிர்பார்க்கிறது என்பதற்கு இது ஒத்ததாகும்.

source: JSON-based Simple API for Python Package Indexes
eo: JSON-baza Simpla API por Python-Pakindeksoj
ja: Python パッケージインデックス向けのJSON ベースのシンプルな API
ru: Простой API на основе JSON для индексов пакетов Python
ta: பைதான் தொகுப்பு குறியீடுகளுக்கான JSON- அடிப்படையிலான எளிய பநிஇ

source: To enable response parsing with only the standard library, this spec specifies that all responses (besides the files themselves, and the HTML responses from :ref:`the base HTML API specification <simple-repository-api-base>`) should be serialized using `JSON <https://www.json.org/>`_.
eo: Por ebligi analizi la sintakson de la respondo nur per la norma biblioteko, ĉi tiu normo specifas, ke ĉiaj respondoj (krom la dosieroj mem kaj la HTML-respondoj el :ref:`la baza normo pri HTML API <simple-repository-api-base>` estu seriigitaj laŭ `JSON <https://www.json.org/>`_.
ja: 標準ライブラリのみを使うレスポンス解析を有効にするためには、この仕様では、 (ファイル群それ自体と :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` を別にして) すべてのレスポンスが `JSON <https://www.json.org/>`_ を用いてシリアライズされているべきであると指定しています。
ru: Чтобы обеспечить возможность разбора ответов с помощью только стандартной библиотеки, в этом документе указано, что все ответы (кроме самих файлов и HTML-ответов из : ссылка:`базовой спецификации HTML API <простая репозитория-api-базовая>`) должны быть сериализованы с помощью `JSON <https://www.json.org/>`_.
ta: நிலையான நூலகத்துடன் மட்டுமே பாகுபடுத்தலை இயக்க, இந்த விவரக்குறிப்பு அனைத்து பதில்களையும் (கோப்புகளும் தவிர, மற்றும் உஉகுமொ பதில்கள் இதிலிருந்து: ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <Simple-repository-api-base>`) `json <https://www.json.json.json.json.json ஐப் பயன்படுத்தி வரிசைப்படுத்தப்பட வேண்டும் என்று குறிப்பிடுகிறது.

source: To enable zero configuration discovery and to minimize the amount of additional HTTP requests, this spec extends :ref:`the base HTML API specification <simple-repository-api-base>` such that all of the API endpoints (other than the files themselves) will utilize HTTP content negotiation to allow client and server to select the correct serialization format to serve, i.e. either HTML or JSON.
ja: ゼロコンフィグレーションディスカバリを有効にして追加的な HTTP リクエストの量を最小化するために、この仕様では HTML:ref:`基本となる HTML API の仕様 <simple-repository-api-base>` を拡張して、 (ファイル群それ自体を除く) すべての API エンドポイントが HTTP コンテンツネゴシエーションを使ってクライアントおよびサーバが提供するべき正しいシリアライズのフォーマット、即ち HTML もしくは JSON を選択できるようにしています。
ru: Чтобы обеспечить нулевое обнаружение конфигурации и минимизировать количество дополнительных HTTP-запросов, эта спецификация расширяет : ссылка:`базовую спецификацию HTML API <симпл-репозиторий-апи-база>` таким образом, что все конечные точки API (кроме самих файлов) будут использовать HTTP согласование содержимого, чтобы позволить клиенту и серверу выбрать правильный формат сериализации для обслуживания, т.е. либо HTML, либо JSON.
ta: சுழிய உள்ளமைவு கண்டுபிடிப்பை செயல்படுத்தவும், கூடுதல் HTTP கோரிக்கைகளின் அளவைக் குறைக்கவும், இந்த விவரக்குறிப்பு நீட்டிக்கப்படுகிறது: ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <எளிய-ரெபோசிட்டரி-API-BASE>` அதாவது அனைத்து பநிஇ முடிவுப்புள்ளிகளும் (கோப்புகளைத் தவிர) HTTP உள்ளடக்க பேச்சுவார்த்தை மற்றும் சேவையகத்தை அனுமதிக்க மற்றும் சேவையகத்தை அனுமதிக்கும்.

source: Versioning will adhere to :ref:`the API versioning specification <simple-repository-api-versioning>` format (``Major.Minor``), which has defined the existing HTML responses to be ``1.0``. Since this spec does not introduce new features into the API, rather it describes a different serialization format for the existing features, this spec does not change the existing ``1.0`` version, and instead just describes how to serialize that into JSON.
ja: バージョン付与については、 :ref:`API のバージョン付与に関する仕様 <simple-repository-api-versioning>` のフォーマット (``Major.Minor``) を固守していて、既存の HTML レスポンスについては ``1.0`` と定義されています。この仕様では API に新しい機能を持ち込むことはせず、むしろ、既存の機能のための異なるシリアル化フォーマットを記述しようとしているので、この仕様が既存の ``1.0`` バージョンに変更を加えることはなく、代わりにどのようにして JSON にシリアライズするのかを述べるに留めています。
ru: Версионирование будет соответствовать : ссылка:`спецификации версий API <симпл-репозиторий-апи-версионирование>` формата (``Major.Minor``), которая определила существующие HTML-ответы как ``1.0``. Поскольку эта спецификация не вводит новых возможностей в API, а описывает другой формат сериализации для существующих возможностей, эта спецификация не изменяет существующую версию ``1.0``, а вместо этого просто описывает, как сериализовать ее в JSON.
ta: பதிப்பு இதைக் கடைப்பிடிக்கும்: குறிப்பு: `ஏபிஐ பதிப்பு விவரக்குறிப்பு <எளிய-ரோபோசிட்டரி-ஆப்-ப்ரிசர்னிங்>` வடிவமைப்பு (`` மேசர்.மினோர்``), இது தற்போதுள்ள உஉகுமொ பதில்களை `` 1.0`` என்று வரையறுத்துள்ளது. இந்த விவரக்குறிப்பு பநிஇ இல் புதிய அம்சங்களை அறிமுகப்படுத்தவில்லை என்பதால், இது தற்போதுள்ள அம்சங்களுக்கான வேறுபட்ட சீரியலைசேசன் வடிவமைப்பை விவரிக்கிறது, இந்த விவரக்குறிப்பு தற்போதுள்ள `` 1.0`` பதிப்பை மாற்றாது, அதற்கு பதிலாக அதை சாதொபொகு இல் எவ்வாறு வரிசைப்படுத்துவது என்பதை விவரிக்கிறது.

source: Similar to :ref:`the API versioning specification <simple-repository-api-versioning>`, the major version number **MUST** be incremented if any changes to the new format would result in no longer being able to expect existing clients to meaningfully understand the format.
eo: Simile al :ref:`la normo pri API-versioj <simple-repository-api-versioning>`, oni DEVAS alkrementi la maĵoran versio-numeron, se ŝanĝoj al la nova normo kaŭzus, ke ekzistanta kliento ne plu povos signife kompreni la protokolon.
ja: :ref:`API のバージョン付与に関する仕様 <simple-repository-api-versioning>` と同様に、既存のクライアントが意味のある形でそのフォーマットを理解することをもはや期待できないようになる新しいフォーマットをもたらすような変更があった場合には、メジャーバージョン番号を **増加させなければなりません** 。
ru: Подобно : ссылка:спецификация версионности API <симпл-репозиторий-апи-версионность>`, номер основной версии **МОЖНО** увеличивать, если любые изменения в новом формате приведут к тому, что существующие клиенты больше не смогут понять этот формат.
ta: ஒத்தது: குறிப்பு: `ஏபிஐ பதிப்பு விவரக்குறிப்பு <எளிய-ரோபோசிட்டரி-ஆப்-ப்ரிசர்னிங்>`, புதிய வடிவத்தில் ஏதேனும் மாற்றங்கள் இருந்தால், தற்போதுள்ள வாடிக்கையாளர்கள் வடிவமைப்பை அர்த்தமுள்ளதாக புரிந்துகொள்வார்கள் என்று எதிர்பார்க்க முடியாது என்றால் முக்கிய பதிப்பு எண் ** ** அதிகரிக்கப்பட வேண்டும்.

source: Likewise, the minor version **MUST** be incremented if features are added or removed from the format, but existing clients would be expected to continue to meaningfully understand the format.
eo: Simile, la minora versio **DEVAS** alkrementiĝi, se funkcioj estas aldonitaj al aŭ malaldonitaj el la formo, sed ekzistanta kliento supozeble daŭre komprenos la formon.
ja: 同様に、マイナーバージョンは、そのフォーマットで機能の追加・削除はあっても既存のクライアントが意味ある形でそのフォーマットを理解できる状態が継続すると期待されるであろうという時に限って **増加されなければなりません** 。
ru: Аналогично, минорная версия **МОЖЕТ** быть увеличена, если в формат добавляются или удаляются функции, но ожидается, что существующие клиенты будут продолжать понимать формат.
ta: அதேபோல், நற்பொருத்தங்கள் சேர்க்கப்பட்டால் அல்லது வடிவமைப்பிலிருந்து அகற்றப்பட்டால் சிறிய பதிப்பு ** ** அதிகரிக்கப்பட வேண்டும், ஆனால் தற்போதுள்ள வாடிக்கையாளர்கள் தொடர்ந்து வடிவமைப்பை அர்த்தமுள்ளதாக புரிந்துகொள்வார்கள் என்று எதிர்பார்க்கப்படுகிறது.

source: Changes that would not result in existing clients being unable to meaningfully understand the format and which do not represent features being added or removed may occur without changing the version number.
eo: Ŝanĝoj, kiuj ne igus ekzistantajn klientojn ne plu kompreni la formon, kaj kiuj ne aldonas aŭ forigas funkciojn, povas okazi sen ŝanĝado de la versia numero.
ja: 既存のクライアントがそのフォーマットを意味ある形で理解することができないという結果に陥らないような、かつ、機能の追加や削除に相当しないような変更は、バージョン番号の変更を伴わずに行っても構いません。
ru: Изменения, которые не приведут к тому, что существующие клиенты не смогут понять формат, и которые не представляют собой добавления или удаления функций, могут происходить без изменения номера версии.
ta: தற்போதுள்ள வாடிக்கையாளர்கள் வடிவமைப்பை அர்த்தமுள்ளதாக புரிந்து கொள்ள முடியாமல் போகாத மாற்றங்கள் மற்றும் சேர்க்கப்படும் அல்லது அகற்றப்படும் அம்சங்களைக் குறிக்காத மாற்றங்கள் பதிப்பு எண்ணை மாற்றாமல் ஏற்படலாம்.

source: This is intentionally vague, as this spec believes it is best left up to future specs that make any changes to the API to investigate and decide whether or not that change should increment the major or minor version.
eo: Tio estas intencite malklara, ĉar la aŭtoroj de ĉi tiu normo kredas, la aŭtoroj de verkotaj normoj ŝanĝantaj la API-on konsideru kaj decidu, ĉu alkrementi la maĵoran aŭ minoran version.
ja: これは意図的に曖昧にされています、というのは、この仕様では、メジャーバージョンなりマイナーバージョンなりを増加するべきか否かを考究し決定するべき API での変更をもたらすような将来の仕様に、余地を残すことが最善であると信じられているからです。
ru: Это намеренно расплывчатая формулировка, так как в данной спецификации считается, что лучше оставить это на усмотрение будущих спецификаций, вносящих какие-либо изменения в API, чтобы исследовать и решить, должно ли это изменение увеличивать мажорную или минорную версию.
ta: இது வேண்டுமென்றே தெளிவற்றது, ஏனெனில் இந்த விவரக்குறிப்பு எதிர்கால விவரக்குறிப்புகளுக்கு சிறந்தது என்று நம்புகிறது, இது ஏபிஐக்கு ஏதேனும் மாற்றங்களைச் செய்து, அந்த மாற்றம் பெரிய அல்லது சிறிய பதிப்பை அதிகரிக்க வேண்டுமா இல்லையா என்பதை தீர்மானிக்க வேண்டும்.

source: Future versions of the API may add things that can only be represented in a subset of the available serializations of that version. All serializations version numbers, within a major version, **SHOULD** be kept in sync, but the specifics of how a feature serializes into each format may differ, including whether or not that feature is present at all.
ja: API の将来のバージョンでは、そのバージョンで利用可能なシリアル化のサブセットでのみ実現させることができるような何かを追加しても構いません。あらゆるシリアル化のバージョン番号は、メジャーバージョンにおいては、 **同期を保つべき** ですが、ある機能がそれぞれのフォーマットにシリアル化されるやり方の詳細は、その機能が存在するかしないかを含めて、異なっていても構いません。
ru: В будущих версиях API могут быть добавлены функции, которые могут быть представлены только в подмножестве доступных сериализаций данной версии. Номера версий всех сериализаций в рамках одной основной версии **ДОЛЖНЫ** быть синхронизированы, но специфика того, как функция сериализуется в каждом формате, может отличаться, включая то, присутствует ли эта функция вообще.
ta: பநிஇ இன் எதிர்கால பதிப்புகள் அந்த பதிப்பின் கிடைக்கக்கூடிய சீரியலைசேசன்களின் துணைக்குழுவில் மட்டுமே குறிப்பிடக்கூடிய விசயங்களைச் சேர்க்கலாம். அனைத்து சீரியலைசேசன்ச் பதிப்பு எண்களும், ஒரு பெரிய பதிப்பிற்குள், ** ** ஒத்திசைவில் இருக்க வேண்டும், ஆனால் ஒவ்வொரு வடிவமைப்பிலும் ஒரு நற்பொருத்தம் எவ்வாறு வரிசைப்படுத்துகிறது என்பதற்கான விவரங்கள், அந்த நற்பொருத்தம் உள்ளதா இல்லையா என்பது உட்பட.
