Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Updated Sphinx and Nox. (:pr:`591`)
eo: Ĝisdatigis Sphinx kaj Nox. (:pr:`591`)
ja: Sphinx と Nox について更新した。 (:pr:`591`)
pt_br: Atualizado Sphinx e Nox. (:pr:`591`)
ru: Обновлены Сфинкс и Нокс. (:pr:`591`)
ta: புதுப்பிக்கப்பட்ட சூரரிமாச்சிலை மற்றும் நோக்ச். (: பி.ஆர்: `591`)

source: Referenced Twine from Python3. (:pr:`581`)
eo: Menciis Twine el Python3. (:pr:`581`)
ja: Python 3 の項に Twine への言及を追加した。 (:pr:`581`)
pt_br: Referenciado o Twine do Python3. (:pr:`581`)
ru: Ссылка на Twine из Python3. (:pr:`581`)
ta: பைதான் 3 இலிருந்து குறிப்பிடப்பட்ட கயிறு. (: பி.ஆர்: `581`)

source: December 2018
eo: Decembro 2018
ja: 2018年12月
pt_br: Dezembro de 2018
ru: Декабрь 2018
ta: டிசம்பர் 2018

source: No programmers in the office!
eo: Neniu programisto en la oficejo!
ja: 事務所にプログラマが居ません！
pt_br: Sem programadores no escritório!
ru: Никаких программистов в офисе!
ta: அலுவலகத்தில் புரோகிராமர்கள் இல்லை!

source: November 2018
eo: Novembro 2018
ja: 2018年11月
pt_br: Novembro de 2018
ru: Ноябрь 2018
ta: நவம்பர் 2018

source: Removed landing page link to PyPI migration guide. (:pr:`575`)
eo: Forigis ĉefpaĝan hiperligon al migrada gvidilo por PyPI. (:pr:`575`)
ja: PyPI 移行ガイドへのランディングページリンクを削除した。 (:pr:`575`)
pt_br: Removido o link da página de destino para o guia de migração do PyPI. (:pr:`575`)
ru: Удалена ссылка на целевую страницу с руководством по миграции PyPI. (:pr:`575`)
ta: அகற்றப்பட்ட இறங்கும் பக்க பைபி இடம்பெயர்வு வழிகாட்டிக்கு இணைப்பு. (: பி.ஆர்: `575`)

source: Changed bumpversion to bump2version. (:pr:`572`)
eo: Ŝanĝis bumpversion al bump2version. (:pr:`572`)
ja: bumpversion を bump2version に変更した。 (:pr:`572`)
pt_br: Alterado bumpversion para bump2version. (:pr:`572`)
ru: Заменена bumpversion на bump2version. (:pr:`572`)
ta: பம்ப் 2 பவர்சனுக்கு மாற்றப்பட்டது. (: பி.ஆர்: `572`)

source: Added single-sourcing package version example. (:pr:`573`)
eo: Aldonis ekzemplon pri unufontigo de la paka versio. (:pr:`573`)
ja: パッケージバージョンの一元管理の例を追加した。 (:pr:`573`)
pt_br: Adicionado exemplo de versão de pacote de única fonte. (:pr:`573`)
ru: Добавлен пример версии пакета с одним источником. (:pr:`573`)
ta: ஒற்றை-சோர்சிங் தொகுப்பு பதிப்பு எடுத்துக்காட்டு சேர்க்கப்பட்டது. (: பி.ஆர்: `573`)

source: Added a guide for creating documentation. (:pr:`568`)
eo: Aldonis gvidilon por verki dokumentaron. (:pr:`568`)
ja: ドキュメント作成のためのガイドを追加した。 (:pr:`568`)
pt_br: Adicionado um guia para a criação de documentação. (:pr:`568`)
ru: Добавлено руководство по созданию документации. (:pr:`568`)
ta: ஆவணங்களை உருவாக்குவதற்கான வழிகாட்டியைச் சேர்த்தது. (: பி.ஆர்: `568`)

source: October 2018
eo: Oktobro 2018
ja: 2018年10月
pt_br: Outubro de 2018
ru: Октябрь 2018
ta: அக்டோபர் 2018

source: Updated Nox package name. (:pr:`566`)
eo: Ĝisdatigis paknomon de Nox. (:pr:`566`)
ja: Nox パッケージの名称を更新した。 (:pr:`566`)
pt_br: Atualizado o nome do pacote Nox. (:pr:`566`)
ru: Обновлено имя пакета Nox. (:pr:`566`)
ta: புதுப்பிக்கப்பட்ட NOX தொகுப்பு பெயர். (: பி.ஆர்: `566`)

source: Mentioned Sphinx extensions in guides. (:pr:`562`)
eo: Menciis Sphinx-etendaĵojn en gvidiloj. (:pr:`562`)
ja: ガイドの中で Sphinx 拡張について言及した。 (:pr:`562`)
pt_br: Mencionadas extensões Sphinx nos guias. (:pr:`562`)
ru: Упоминание расширений Sphinx в руководствах. (:pr:`562`)
ta: வழிகாட்டிகளில் சூரரிமாச்சிலை நீட்டிப்புகள் குறிப்பிடப்பட்டுள்ளன. (: பி.ஆர்: `562`)

source: September 2018
eo: Septembro 2018
ja: 2018年9月
pt_br: Setembro de 2018
ru: Сентябрь 2018
ta: செப்டம்பர் 2018

source: Added a section on checking RST markup. (:pr:`554`)
eo: Aldonis paragrafon pri kontrolado de reStructuredText-sintakso (:pr:`554`)
ja: RST マークアップの検査に関する節を追加した。 (:pr:`554`)
pt_br: Adicionada uma seção sobre como verificar a marcação RST. (:pr:`554`)
ru: Добавлен раздел о проверке разметки RST. (:pr:`554`)
ta: RST மார்க்அப்பைச் சரிபார்க்க ஒரு பகுதியைச் சேர்த்தது. (: பி.ஆர்: `554`)

source: Updated user installs page. (:pr:`558`)
eo: Ĝisdatigis paĝon pri instalado al la loko de la uzanto. (:pr:`558`)
ja: ユーザによるインストールのページを更新した。 (:pr:`558`)
pt_br: Atualizada página de instalações do usuário. (:pr:`558`)
ru: Обновлена страница установки пользователей. (:pr:`558`)
ta: புதுப்பிக்கப்பட்ட பயனர் பக்கத்தை நிறுவுகிறது. (: பி.ஆர்: `558`)

source: Updated Google BigQuery urls. (:pr:`556`)
eo: Ĝisdatigis retadresojn de Google BigQuery. (:pr:`556`)
ja: Google BigQuery の url を更新した。 (:pr:`556`)
pt_br: Atualizadas as URLs do Google BigQuery. (:pr:`556`)
ru: Обновленные урлы Google BigQuery. (:pr:`556`)
ta: Google Bigquery முகவரி கள் புதுப்பிக்கப்பட்டது. (: பி.ஆர்: `556`)

source: Replaced tar command with working command. (:pr:`552`)
eo: Anstataŭigis komandon tar per funkcianta komando. (:pr:`552`)
ja: tar コマンドについて動作するコマンドに置換した。 (:pr:`552`)
pt_br: Substituído o comando tar pelo comando de trabalho. (:pr:`552`)
ru: Замененная команда tar с рабочей командой. (:pr:`552')
ta: தார் கட்டளையை வேலை கட்டளையுடன் மாற்றியது. (: பி.ஆர்: `552`)

source: Changed to double quotes in the pip install SomeProject==1.4. (:pr:`550`)
eo: Ŝanĝis al duoblaj citiloj en pip install SomeProject==1.4. (:pr:`550`)
ja: pip インストールで SomeProject==1.4 と書くところをダブルクォーテーションマークに変更した。 (:pr:`550`)
pt_br: Alterado para aspas duplas no pip install SomeProject==1.4. (:pr:`550`)
ru: Заменены на двойные кавычки в pip install SomeProject==1.4. (:pr:`550`)
ta: PIP இல் இரட்டை மேற்கோள்களாக மாற்றப்பட்டது சில திட்டங்கள் == 1.4. (: பி.ஆர்: `550`)

source: August 2018
eo: Aŭgusto 2018
ja: 2018年8月
pt_br: Agosto de 2018
ru: Август 2018
ta: ஆகச்ட் 2018

source: Removed the recommendation to store passwords in cleartext. (:pr:`546`)
eo: Forigis la rekomendon konservi pasvortojn senĉifre. (:pr:`546`)
ja: パスワードを平文で保存することを推奨していたのを削除した。 (:pr:`546`)
pt_br: Removida a recomendação de armazenar senhas em texto não criptografado. (:pr:`546`)
ru: Удалена рекомендация хранить пароли в открытом виде. (:pr:`546`)
ta: கடவுச்சொற்களை ClearText இல் சேமிப்பதற்கான பரிந்துரையை நீக்கியது. (: பி.ஆர்: `546`)

source: Moved the Overview to a task based lead in along with the others. (:pr:`540`)
eo: Provizis la Superrigardon kun taskobaza enkonduko simile al aliaj dokumentoj. (:pr:`540`)
ja: 他のものに加えて、概要をタスク別の見出しに移した。 (:pr:`540`)
pt_br: Movida a Visão geral para um ponto baseado em tarefas junto com os outros. (:pr:`540`)
ru: Перемещение "Обзор" в раздел "Задачи" вместе с остальными. (:pr:`540`)
ta: கண்ணோட்டத்தை மற்றவர்களுடன் சேர்ந்து ஒரு பணி அடிப்படையிலான முன்னணிக்கு நகர்த்தியது. (: பி.ஆர்: `540`)

source: Updated Python version supported by virtualenv. (:pr:`538`)
eo: Ĝisdatigis Python-version subtenatan de virtualenv. (:pr:`538`)
ja: virtualenv がサポートする Python のバージョンを更新した。 (:pr:`538`)
pt_br: Atualizada a versão do Python compatível com virtualenv. (:pr:`538`)
ru: Обновлена версия Python, поддерживаемая virtualenv. (:pr:`538`)
ta: மெய்நிகர்இன்வி ஆதரிக்கும் பைதான் பதிப்பு புதுப்பிக்கப்பட்டது. (: பி.ஆர்: `538`)

source: Added outline/rough draft of new Overview page. (:pr:`519`)
eo: Aldonis malneton de nova Superrigarda paĝo. (:pr:`519`)
ja: 新しい概要のページのあらまし/ラフな下書きを追加した。 (:pr:`519`)
pt_br: Adicionado esboço/rascunho da nova página de Visão geral. (:pr:`519`)
ru: Добавлен набросок/черновик новой страницы "Обзор". (:pr:`519`)
ta: புதிய கண்ணோட்டம் பக்கத்தின் அவுட்லைன்/தோராயமான வரைவு சேர்க்கப்பட்டது. (: பி.ஆர்: `519`)

source: July 2018
eo: Julio 2018
ja: 2018年7月
pt_br: Julho de 2018
ru: Июль 2018
ta: சூலை 2018

source: Improved binary extension docs. (:pr:`531`)
eo: Plibonigis dokumentaron pri duumaj etendaĵoj. (:pr:`531`)
ja: バイナリ拡張に関する説明文書を改善した。 (:pr:`531`)
pt_br: Melhorada a documentação de extensão binária. (:pr:`531`)
ru: Улучшена документация по бинарным расширениям. (:pr:`531`)
ta: மேம்படுத்தப்பட்ட பைனரி நீட்டிப்பு ஆவணங்கள். (: பி.ஆர்: `531`)

source: Added scikit-build to key projects. (:pr:`530`)
eo: Aldonis scikit-build al ĉefprojektoj. (:pr:`530`)
ja: scikit-build を主要プロジェクトに追加した。 (:pr:`530`)
pt_br: Adicionado o scikit-build aos principais projetos. (:pr:`530`)
ru: Добавлена scikit-build в ключевые проекты. (:pr:`530`)
ta: முக்கிய திட்டங்களுக்கு சிக்கிட்-கட்டிடம் சேர்க்கப்பட்டது. (: பி.ஆர்: `530`)

source: June 2018
eo: Junio 2018
ja: 2018年6月
pt_br: Junho de 2018
ru: Июнь 2018
ta: சூன் 2018

source: Fixed categories of interop PEP for pypa.io. (:pr:`527`)
eo: Riparis kategoriojn pri kunfunkcipova PEP por pypa.io. (:pr:`527`)
ja: pypa.io に関する相互運用性 PEP のカテゴリ分けを修正した。 (:pr:`527`)
pt_br: Corrigidas as categorias de interoperabilidade de PEP para pypa.io. (:pr:`527`)
ru: Исправлены категории interop PEP для pypa.io. (:pr:`527`)
ta: Pypa.io க்கான இன்டர்பிராப் PEP இன் நிலையான வகைகள். (: பி.ஆர்: `527`)

source: Updated Markdown descriptions explanation. (:pr:`522`)
eo: Ĝisdatigis klarigon pri priskriboj en Markdown. (:pr:`522`)
ja: descriptions をマークダウンで書く場合の説明を更新した。 (:pr:`522`)
pt_br: Atualizada a explicação das descrições de Markdown. (:pr:`522`)
ru: Обновлены пояснения к описаниям в формате Markdown. (:pr:`522`)
ta: புதுப்பிக்கப்பட்ட மார்க் பேரூர் விளக்கங்கள் விளக்கம். (: பி.ஆர்: `522`)

source: May 2018
eo: Majo 2018
ja: 2018年5月
pt_br: Maio de 2018
ru: Май 2018
ta: மே 2018

source: Noted issues with Provides-Dist and Obsoletes-Dist. (:pr:`513`)
eo: Menciis problemojn pri Provides-Dist kaj Obsoletes-Dist. (:pr:`513`)
ja: Provides-Diet と Obsolete-Diet の課題を注記した。 (:pr:`513`)
pt_br: Adicionadas notas sobre problemas com Provides-Dist e Obsoletes-Dist. (:pr:`513`)
ru: Замечены проблемы с Provides-Dist и Obsoletes-Dist. (:pr:`513`)
ta: வழங்கும்-தூர மற்றும் வழக்கற்றுப் போகும்-டிச்ட்டுடன் குறிப்பிடத்தக்க சிக்கல்கள். (: பி.ஆர்: `513`)

source: Removed outdated warning about Python version mixing with Pipenv. (:pr:`501`)
eo: Forigis ne plu validan averton pri miksado de Python-versioj kun Pipenv. (:pr:`501`)
ja: Pipenv で異なるバージョンの Python を使う場合の警告が古くなっていたので削除した。 (:pr:`501`)
pt_br: Removido o aviso de desatualizado sobre a mistura da versão Python com o Pipenv. (:pr:`501`)
ru: Убрано устаревшее предупреждение о смешивании версий Python с Pipenv. (:pr:`501`)
ta: பைதான் பதிப்பு பைபென்வியுடன் கலப்பதைப் பற்றிய காலாவதியான எச்சரிக்கையை அகற்றியது. (: பி.ஆர்: `501`)

source: Simplified packaging tutorial. (:pr:`498`)
eo: Simpligis lernilon pri pakado. (:pr:`498`)
ja: パッケージングのチュートリアルを簡素にした。 (:pr:`498`)
pt_br: Simplificado o tutorial de empacotamento. (:pr:`498`)
ru: Упрощенный учебник по упаковке. (:pr:`498`)
ta: எளிமைப்படுத்தப்பட்ட பேக்கேசிங் பயிற்சி. (: பி.ஆர்: `498`)

source: Updated Windows users instructions for clarity. (:pr:`493`)
eo: Pliklarigis instrukciojn por uzantoj de Windows. (:pr:`493`)
ja: 明確性のため、 Windows ユーザ向けの指示を更新した。 (:pr:`493`)
pt_br: Atualizadas as instruções do usuário Windows para maior clareza. (:pr:`493`)
ru: Обновлены инструкции для пользователей Windows для большей ясности. (:pr:`493`)
ta: தெளிவுக்கான சாளரங்கள் பயனர்களின் வழிமுறைகளைப் புதுப்பித்தது. (: பி.ஆர்: `493`)

source: Updated the license section description for completeness. (:pr:`492`)
eo: Ĝisdatigis la priskribon de la licenca sekcio por pleneco. (:pr:`492`)
ja: 完全性のためにライセンスの節の記述を更新した。 (:pr:`492`)
pt_br: Atualizada a descrição da seção da licença para integridade. (:pr:`492`)
ru: Обновлено описание раздела лицензии для полноты. (:pr:`492`)
ta: உரிமத்திற்கு உரிமப் பிரிவு விளக்கத்தை புதுப்பித்தது. (: பி.ஆர்: `492`)

source: Added specification-style document to contributing section. (:pr:`489`)
eo: Aldonis specifo-stilan dokumenton al la paragrafo pri kontribuado. (:pr:`489`)
ja: 「貢献するには」の節に仕様のスタイルの記述を追加した。 (:pr:`489`)
pt_br: Adicionado documento de estilo de especificação à seção de contribuição. (:pr:`489`)
ru: В раздел вкладов добавлен документ в стиле спецификации. (:pr:`489`)
ta: பங்களிப்பு பிரிவில் விவரக்குறிப்பு-பாணி ஆவணத்தை சேர்த்தது. (: பி.ஆர்: `489`)

source: Added documentation types to contributing guide. (:pr:`485`)
eo: Aldonis specojn de dokumentoj al gvidilo por kontribuantoj. (:pr:`485`)
ja: 「貢献するには」ガイドにドキュメントのタイプを追記した。 (:pr:`485`)
pt_br: Adicionados tipos de documentação ao guia de contribuição. (:pr:`485`)
ru: Добавлены типы документации в руководство по внесению вкладов. (:pr:`485`)
ta: பங்களிப்பு வழிகாட்டிக்கு ஆவணப்படுத்தல் வகைகள் சேர்க்கப்பட்டன. (: பி.ஆர்: `485`)

source: April 2018
eo: Aprilo 2018
ja: 2018年4月
pt_br: Abril de 2018
ru: Апрель 2018
ta: ஏப்ரல் 2018

source: Added README guide. (:pr:`461`)
eo: Aldonis gvidilon pri README. (:pr:`461`)
ja: README ガイドを追加した。 (:pr:`461`)
pt_br: Adicionado guia de README. (:pr:`461`)
ru: Добавлено руководство README. (:pr:`461`)
ta: README வழிகாட்டி சேர்க்கப்பட்டது. (: பி.ஆர்: `461`)

source: Updated instructions and status for PyPI launch. (:pr:`475`)
eo: Ĝisdatigis instrukciojn kaj staton por la lanĉo de PyPI. (:pr:`475`)
ja: PyPI の供用開始についてやり方と状態を更新した。 (:pr:`475`)
pt_br: Atualizadas as instruções e status para o lançamento do PyPI. (:pr:`475`)
ru: Обновлены инструкции и статус для запуска PyPI. (:pr:`475`)
ta: புதுப்பிக்கப்பட்ட வழிமுறைகள் மற்றும் PYPI துவக்கத்திற்கான நிலை. (: பி.ஆர்: `475`)

source: Added instructions for Warehouse. (:pr:`471`)
eo: Aldonis instrukciojn pri Warehouse. (:pr:`471`)
ja: Warehouse についての指示を追加した。 (:pr:`471`)
pt_br: Adicionadas instruções para o Warehouse. (:pr:`471`)
ru: Добавлены инструкции для Хранилища. (:pr:`471`)
ta: கிடங்கிற்கான வழிமுறைகள் சேர்க்கப்பட்டன. (: பி.ஆர்: `471`)

source: Removed GPG references from publishing tutorial. (:pr:`466`)
eo: Forigis referencojn al GPG el la lernilo pri eldonado. (:pr:`466`)
ja: (パッケージを?) 公開するチュートリアルから GPG の参照情報を削除した。 (:pr:`466`)
pt_br: Removidas referências de GPG do tutorial de publicação. (:pr:`466`)
ru: Удалены ссылки на GPG из руководства по публикации. (:pr:`466`)
ta: வெளியீட்டு டுடோரியலில் இருந்து சிபிசி குறிப்புகள் அகற்றப்பட்டன. (: பி.ஆர்: `466`)

source: Added 'What’s in which Python 3.4–3.6?'. (:pr:`468`)
eo: Aldonis «Kio estas en kiu Python 3.4–3.6?». (:pr:`468`)
ja: 「Python 3.4-3.6 では何がどれに入ってる？」を追加した。 (:pr:`468`)
pt_br: Adicionado 'O que há em cada Python 3.4–3.6?'. (:pr:`468`)
ru: Добавлен раздел "Что в каком Python 3.4-3.6?" (:pr:`468`)
ta: 'எந்த பைதான் 3.4–3.6?' (: பி.ஆர்: `468`)

source: Added a guide for phasing out Python versions. (:pr:`459`)
eo: Aldonis gvidilon pri ekmalsubtenado de versioj de Python. (:pr:`459`)
ja: あるバージョンの Python を徐々に使わなくするガイドを追加した。 (:pr:`459`)
pt_br: Adicionado um guia para descontinuar as versões do Python. (:pr:`459`)
ru: Добавлено руководство по постепенному отказу от версий Python. (:pr:`459`)
ta: பைதான் பதிப்புகளை கட்டியெழுப்ப ஒரு வழிகாட்டியைச் சேர்த்தது. (: பி.ஆர்: `459`)

source: Made default Description-Content-Type variant GFM. (:pr:`462`)
eo: Implicitigi la varianton GFM por Description-Content-Type. (:pr:`462`)
ja: 変種の GFM をデフォルトの Description-Content-Type とした。 (:pr:`462`)
pt_br: Tornada padrão a variante GFM do Description-Content-Type. (:pr:`462`)
ru: Сделан вариант Description-Content-Type по умолчанию GFM. (:pr:`462`)
ta: இயல்புநிலை விளக்கம்-உள்ளடக்க வகை மாறுபாடு சி.எஃப்.எம். (: பி.ஆர்: `462`)

source: March 2018
eo: Marto 2018
ja: 2018年3月
pt_br: Março de 2018
ru: Март 2018
ta: மார்ச் 2018

source: Updated "installing scientific packages". (:pr:`455`)
eo: Ĝisdatigis «Instali sciencajn pakojn». (:pr:`455`)
ja: 「科学計算分野のパッケージ群」を更新した。 (:pr:`455`)
pt_br: Atualizado "instalando pacotes científicos". (:pr:`455`)
ru: Обновлена "Установка научных пакетов". (:pr:`455`)
ta: புதுப்பிக்கப்பட்டது "அறிவியல் தொகுப்புகளை நிறுவுதல்". (: பி.ஆர்: `455`)

source: Added :file:`long_description_content_type` to follow PEP 556. (:pr:`457`)
eo: Aldonis :file:`long_description_content_type` sekvante PEP 556. (:pr:`457`)
ja: PEP 556 に従う :file:`long_description_content_type` を追加した。 (:pr:`457`)
pt_br: Adicionado :file:`long_description_content_type` para seguir a PEP 556. (:pr:`457`)
ru: Добавлен :file:`long_description_content_type`, чтобы следовать PEP 556. (:pr:`457`)
ta: சேர்க்கப்பட்டது: கோப்பு: பெப் 556 ஐப் பின்பற்ற `long_description_content_type`. (: Pr:` 457`)

source: Clarified a long description classifier on pypi.org. (:pr:`456`)
eo: Klarigis longan priskriban klasigilon ĉe pypi.org. (:pr:`456`)
ja: pypi.org における long description 分類子について明確化した。 (:pr:`456`)
pt_br: Esclarecido um classificador de descrição longa em pypi.org. (:pr:`456`)
ru: Уточнен классификатор длинных описаний на pypi.org. (:pr:`456`)
ta: Pypi.org இல் ஒரு நீண்ட விளக்க வகைப்படுத்தியை தெளிவுபடுத்தியது. (: பி.ஆர்: `456`)

source: Updated Core Metadata spec to follow PEP 556. (:pr:`412`)
eo: Ĝisdatigis la specifon de Kernaj Metadatenoj sekvante PEP 556. (:pr:`412`)
ja: コアとなるメタデータ仕様が PEP 556 に従うように更新した。 (:pr:`412`)
pt_br: Atualizada a especificação dos metadados principais para seguir a PEP 556. (:pr:`412`)
ru: Обновление спецификации Core Metadata в соответствии с PEP 556. (:pr:`412`)
ta: PEP 556 ஐப் பின்தொடர கோர் மேனிலை தரவு ச்பெக் புதுப்பிக்கப்பட்டது. (: PR: `412`)

source: February 2018
eo: Februaro 2018
ja: 2018年2月
pt_br: Fevereiro de 2018
ru: Февраль 2018
ta: பிப்ரவரி 2018

source: Added python3-venv and python3-pip to Debian installation instructions. (:pr:`445`)
eo: Aldonis python3-venv kaj python3-pip al instrukcioj pri instalado sur Debian. (:pr:`445`)
ja: Debian でのインストール指示に python3-venv と python3-pip を追記した。 (:pr:`445`)
pt_br: Adicionados python3-venv e python3-pip às instruções de instalação do Debian. (:pr:`445`)
ru: Добавлены python3-venv и python3-pip в инструкции по установке Debian. (:pr:`445`)
ta: டெபியன் நிறுவல் வழிமுறைகளில் பைதான் 3-வென்வ் மற்றும் பைதான் 3-பிஐபி சேர்க்கப்பட்டது. (: பி.ஆர்: `445`)

source: Updated PyPI migration info. (:pr:`439`)
eo: Ĝisdatigis informojn pri migrado al PyPI. (:pr:`439`)
ja: PyPI 移行情報を更新した。 (:pr:`439`)
pt_br: Informações de migração do PyPI atualizadas. (:pr:`439`)
ru: Обновлена информация о миграции PyPI. (:pr:`439`)
ta: புதுப்பிக்கப்பட்ட PYPI இடம்பெயர்வு செய்தி. (: பி.ஆர்: `439`)

source: Added a warning about managing multiple versions with pipenv. (:pr:`430`)
eo: Aldonis averton pri administrado de pluraj versioj per pipenv. (:pr:`430`)
ja: 複数のバージョンの pipenv を取り扱う際の注意事項を追記した。 (:pr:`430`)
pt_br: Adicionado um aviso sobre o gerenciamento de várias versões com pipenv. (:pr:`430`)
ru: Добавлено предупреждение об управлении несколькими версиями с помощью pipenv. (:pr:`430`)
ta: பைபன்வி உடன் பல பதிப்புகளை நிர்வகிப்பது பற்றிய எச்சரிக்கையைச் சேர்த்தது. (: பி.ஆர்: `430`)

source: Added example of multiple emails to Core Metadata. (:pr:`429`)
eo: Aldonis ekzemplon de pluraj retpoŝtaj adresoj al Kernaj Metadatenoj. (:pr:`429`)
ja: コアとなるメタデータの項に複数の電子メールアドレスの例を追加した。 (:pr:`429`)
pt_br: Adicionado exemplo de vários e-mails aos metadados principais. (:pr:`429`)
ru: Добавлен пример нескольких писем в Core Metadata. (:pr:`429`)
ta: கோர் மெட்டாடேட்டாவுக்கு பல மின்னஞ்சல்களின் எடுத்துக்காட்டு சேர்க்கப்பட்டது. (: பி.ஆர்: `429`)

source: Added explanation of "legacy" in test.pypi.org/legacy. (:pr:`426`)
eo: Klarigis «legacy» en test.pypi.org/legacy. (:pr:`426`)
ja: test.pypi.org/legacy に "legacy" の説明を加えた。 (:pr:`426`)
pt_br: Adicionada explicação de "legado" em test.pypi.org/legacy. (:pr:`426`)
ru: Добавлено объяснение "legacy" в test.pypi.org/legacy. (:pr:`426`)
ta: Test.pypi.org/legacy இல் "மரபு" பற்றிய விளக்கம் சேர்க்கப்பட்டது. (: பி.ஆர்: `426`)

source: January 2018
eo: Januaro 2018
ja: 2018年1月
pt_br: Janeiro de 2018
ru: Январь 2018
ta: சனவரி 2018

source: Added a link to PyPI's list of classifiers. (:pr:`425`)
eo: Aldonis hiperligon al la listo de klasigiloj ĉe PyPI. (:pr:`425`)
ja: PyPI にある分類子のリストへのリンクを追加した。 (:pr:`425`)
pt_br: Adicionado um link para a lista de classificadores do PyPI. (:pr:`425`)
ru: Добавлена ссылка на список классификаторов PyPI. (:pr:`425`)
ta: பைபியின் வகைப்படுத்திகளின் பட்டியலுக்கு இணைப்பைச் சேர்த்தது. (: பி.ஆர்: `425`)

source: Updated README.rst explanation. (:pr:`419`)
eo: Plibonigis klarigon pri README.rst. (:pr:`419`)
ja: README.rst についての説明を更新した。 (:pr:`419`)
pt_br: Atualizada uma explicação sobre README.rst. (:pr:`419`)
ru: Обновлено пояснение в README.rst. (:pr:`419`)
ta: புதுப்பிக்கப்பட்ட README.RST விளக்கம். (: பி.ஆர்: `419`)

source: December 2017
eo: Decembro 2017
ja: 2017年12月
pt_br: Dezembro de 2017
ru: Декабрь 2017
ta: டிசம்பர் 2017

source: Replaced :file:`~` with :file:`$HOME` in guides and tutorials. (:pr:`418`)
eo: Anstataŭigis :file:`~` per :file:`$HOME` en gvidiloj kaj lerniloj. (:pr:`418`)
ja: ガイドやチュートリアルで :file:`~` を :file:`$HOME` に置き換えた。 (:pr:`418`)
pt_br: Substituído :file:`~` por :file:`$HOME` nos guias e tutoriais. (:pr:`418`)
ru: Заменено :file:`~` на :file:`$HOME` в руководствах и учебниках. (:pr:`418`)
ta: மாற்றப்பட்டது: கோப்பு: `~` உடன்: கோப்பு: `$ வீடு` வழிகாட்டிகள் மற்றும் பயிற்சிகளில். (: பி.ஆர்: `418`)

source: Noted which fields can be used with environment markers. (:pr:`416`)
eo: Notis tiujn kampojn, kiuj povas esti uzataj kun mediaj markoj. (:pr:`416`)
ja: 環境マーカとともにどのフィールドを使うことができるのかについて注記した。 (:pr:`416`)
pt_br: Adicionada nota sobre quais campos podem ser usados com marcadores de ambiente. (:pr:`416`)
ru: Уточнено, какие поля могут использоваться с маркерами окружения. (:pr:`416`)
ta: சுற்றுச்சூழல் குறிப்பான்களுடன் எந்த புலங்களைப் பயன்படுத்தலாம் என்பதைக் குறிப்பிட்டார். (: பி.ஆர்: `416`)

source: Updated Requires-Python section. (:pr:`414`)
eo: Plibonigis paragrafon pri Requres-Python. (:pr:`414`)
ja: Requires-Python の節を更新した。 (:pr:`414`)
pt_br: Atualizada a seção Requires-Python. (:pr:`414`)
ru: Обновлен раздел Requires-Python. (:pr:`414`)
ta: புதுப்பிக்கப்பட்ட பைதான் பிரிவு தேவை. (: பி.ஆர்: `414`)

source: Added news page. (:pr:`404`)
eo: Aldonis paĝon pri novaĵoj. (:pr:`404`)
ja: ニュースのページを追加した。 (:pr:`404`)
pt_br: Adicionada página de notícias. (:pr:`404`)
ru: Добавлена страница новостей (:pr:`404`)
ta: செய்தி பக்கம் சேர்க்கப்பட்டது. (: பி.ஆர்: `404`)

source: November 2017
eo: Novembro 2017
ja: 2017年11月
pt_br: Novembro de 2017
ru: Ноябрь 2017
ta: நவம்பர் 2017

source: Introduced a new dependency management tutorial based on Pipenv. (:pr:`402`)
eo: Enkondukis novan lernilon pri mastrumado de dependeco per Pipenv. (:pr:`402`)
ja: Pipenv を基盤とした依存関係の管理に関するチュートリアルを新たに追加した。 (:pr:`402`)
pt_br: Introduzido um novo tutorial de gerenciamento de dependências baseado no Pipenv. (:pr:`402`)
ru: Представлен новый учебник по управлению зависимостями на основе Pipenv. (:pr:`402`)
ta: பைபென்வியை அடிப்படையாகக் கொண்ட புதிய சார்பு மேலாண்மை டுடோரியலை அறிமுகப்படுத்தியது. (: பி.ஆர்: `402`)

source: Updated the *Single Sourcing Package Version* tutorial to reflect pip's current strategy. (:pr:`400`)
eo: Ĝisdatigis la lernilon *Unu-Fontigi la Pakan Version* laŭ la aktuala strategio de pip. (:pr:`400`)
ja: *パッケージバージョンの一元管理* のチュートリアルが pip の現在の戦略を反映するように更新した。 (:pr:`400`)
pt_br: Atualizado o tutorial *Versão de pacote de fonte única* para refletir a estratégia atual do pip. (:pr:`400`)
ru: Обновлен учебник *Версия пакета единого источника*.чтобы отразить текущую стратегию pip. (:pr:`400`)
ta: பைப்பின் தற்போதைய மூலோபாயத்தை பிரதிபலிக்க * ஒற்றை மூல தொகுப்பு பதிப்பு * டுடோரியலைப் புதுப்பித்தது. (: பி.ஆர்: `400`)

source: Added documentation about the ``py_modules`` argument to ``setup``. (:pr:`398`)
eo: Aldonis klarigon pri la argumento ``py_modules`` al ``setup``. (:pr:`398`)
ja: ``setup`` に対する ``py_modules`` 引数について説明を追加した。 (:pr:`398`)
pt_br: Adicionada documentação sobre o argumento ``py_modules`` ao ``setup``. (:pr:`398`)
ru: Добавлена документация об аргументе ``py_modules`` в ``setup``. (:pr:`398`)
ta: `` Py_modules`` உரையாடல் பற்றிய ஆவணங்களை `` அமைவு`` சேர்த்தது. (: பி.ஆர்: `398`)

source: Simplified the wording for the :file:`manifest.in` section. (:pr:`395`)
eo: Simpligis la paragrafon pri :file:`manifest.in`. (:pr:`395`)
ja: :file:`manifest.in` 節での用語を簡素化した。 (:pr:`395`)
pt_br: Simplificadas as palavras da seção :file:`manifest.in`. (:pr:`395`)
ru: Упрощена формулировка раздела :file:`manifest.in`. (:pr:`395`)
ta: : கோப்பு: `manifest.in` பிரிவுக்கான சொற்களை எளிமைப்படுத்தியது. (: பி.ஆர்: `395`)

source: October 2017
eo: Oktobro 2017
ja: 2017年10月
pt_br: Outubro de 2017
ru: Октябрь 2017
ta: அக்டோபர் 2017
