Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Binary compatibility on macOS is determined by the target minimum deployment system, e.g. *10.9*, which is often specified with the ``MACOSX_DEPLOYMENT_TARGET`` environmental variable when building binaries on macOS. When building with setuptools / distutils, the deployment target is specified with the flag ``--plat-name``, e.g. ``macosx-10.9-x86_64``. For common deployment targets for macOS Python distributions, see the `MacPython Spinning Wheels wiki <https://github.com/MacPython/wiki/wiki/Spinning-wheels>`_.
eo: Binara kongrueco sur macOS dependas de la celata minimuma disponiga sistemo, ekz. *10.9*, kio estas ordinare specifita per la media variablo ``MACOSX_DEPLOYMENT_TARGET`` dum konstruaĵo de duumaĵoj sur macOS. Dum konstruado kun setuptools / distutils, oni specifas la disponiga celo per la flago ``--plat-name``, ekz. kun la valoro ``macosx-10.9-x86_64``. Por oftaj disponigaj celoj por Python-distribuoj por macOS, vidu `MacPython Spinning Wheels Wiki <https://github.com/MacPython/wiki/wiki/Spinning-wheels>`_.
ja: macOS におけるバイナリ互換性は、 macOS のバイナリをビルドする際にしばしば ``MACOSX_DEPLOYMENT_TARGET`` 環境変数で指定される例えば *10.9* のようなターゲットの最小デプロイメントシステムで決まります。 setuptools や distutils でビルドする時には、デプロイメントターゲットは ``--plat-name`` フラグを使って、例えば ``macosx-10.9-x86_64`` のように指定されます。 macOS 上の Python 配布物向けのよくあるデプロイメントターゲットについては、 `MacPython スピンニングホイール wiki <https://github.com/MacPython/wiki/wiki/Spinning-wheels>`_ を見てください。
pt_br: A compatibilidade binária no macOS é determinada pelo sistema mínimo alvo de implantação, por exemplo, *10.9*, que geralmente é especificado com a variável de ambiente ``MACOSX_DEPLOYMENT_TARGET`` ao construir binários no macOS. Ao construir com setuptools / distutils, o alvo de implantação é especificado com o sinalizador ``--plat-name``, por exemplo, ``macosx-10.9-x86_64``. Para alvos de implantação comuns para distribuições do Python para macOS, consulte a `Spinning Wheels na wiki do MacPython <https://github.com/MacPython/wiki/wiki/Spinning-wheels>`_.
ru: Совместимость бинарных файлов на macOS определяется целевой минимальной системой развертывания, например *10.9*, которая часто указывается с помощью переменной окружения ``MACOSX_DEPLOYMENT_TARGET`` при сборке бинарных файлов на macOS. При сборке с помощью setuptools / distutils цель развертывания указывается с помощью флага ``--plat-name``, например ``macosx-10.9-x86_64``. Об общих целях развертывания для дистрибутивов macOS Python см. в `MacPython Spinning Wheels wiki <https://github.com/MacPython/wiki/wiki/Spinning-wheels>`_.
ta: மாகோ களில் பைனரி பொருந்தக்கூடிய தன்மை இலக்கு குறைந்தபட்ச வரிசைப்படுத்தல் முறையால் தீர்மானிக்கப்படுகிறது, எ.கா. *10. செட்டுப்டூல்கள் / தொலைதூரங்களுடன் கட்டும் போது, வரிசைப்படுத்தல் இலக்கு ``-பிளாட்-பெயர்``, எ.கா. `` MACOSX-10.9-X86_64``. மேகோச் பைதான் விநியோகங்களுக்கான பொதுவான வரிசைப்படுத்தல் இலக்குகளுக்கு, `மேக்பிதான் ச்பின்னிங் சக்கரங்கள் விக்கி <https://github.com/macpython/wiki/wiki/spinning-wheels>` _.

source: Publishing binary extensions
eo: Eldoni duumajn etendaĵojn
ja: バイナリ拡張を公開する
pt_br: Publicando extensões binárias
ru: Публикация двоичных расширений
ta: பைனரி நீட்டிப்புகளை வெளியிடுகிறது

source: Publishing binary extensions through PyPI uses the same upload mechanisms as publishing pure Python packages. You build a wheel file for your extension using the build-backend and upload it to PyPI using :doc:`twine <twine:index>`.
eo: Eldonado de duuma etendaĵo al PyPI uzas la saman alŝutan meĥanismon kiel eldonado de pure Python-a pako. Oni konstruas wheel-dosieron por la etendaĵo per la konstrua malfasado kaj alŝutas ĝin al PyPI per :doc:`twine <twine:index>`.
ja: PyPI を通じてバイナリ拡張を公開する時にも、純 Python のパッケージを公開するときと同じアップロードのメカニズムを使います。その拡張の wheel をビルドバックエンドを使ってビルドし、 :doc:`twine <twine:index>` を使って PyPI にアップロードするということです。
pt_br: A publicação de extensões binárias por meio do PyPI usa os mesmos mecanismos de upload que a publicação de pacotes Python puros. Você constrói um arquivo wheel para sua extensão usando o backend de construção e carrega-o no PyPI usando :doc:`twine <twine:index>`.
ru: Публикация бинарных расширений через PyPI использует те же механизмы загрузки, что и публикация пакетов чистого Python. Вы создаете wheel-файл для своего расширения с помощью build-бэкенда и загружаете его в PyPI с помощью :doc:`twine <twine:index>`.
ta: PYPI மூலம் பைனரி நீட்டிப்புகளை வெளியிடுவது தூய பைதான் தொகுப்புகளை வெளியிடுவது போன்ற அதே பதிவேற்ற வழிமுறைகளைப் பயன்படுத்துகிறது. பில்ட்-பேக்கெண்டைப் பயன்படுத்தி உங்கள் நீட்டிப்புக்கு ஒரு சக்கரக் கோப்பை உருவாக்கி, அதை பைபியில் பதிவேற்றவும்: டாக்: `ட்வைன் <கயிறு: குறியீட்டு>`.

source: Avoid binary-only releases
eo: Evitu nur-duumajn eldonojn
ja: バイナリだけのリリースを避ける
pt_br: Evite lançamentos somente binários
ru: Избегайте выпуска только бинарных релизов
ta: பைனரி மட்டும் வெளியீடுகளைத் தவிர்க்கவும்

source: It is strongly recommended that you publish your binary extensions as well as the source code that was used to build them. This allows users to build the extension from source if they need to. Notably, this is required for certain Linux distributions that build from source within their own build systems for the distro package repositories.
eo: Estas forte rekomendate, ke vi eldonu kaj la duumajn etendaĵojn kaj la fontkodon por konstrui ilin. Tio permesas al uzantoj laŭbezone konstrui la etendaĵon de fonto. Speciale, tio necesas por tiuj Linux-distribuoj, kiuj konstruas de fonto per siaj propraj konstrusistemoj por siaj pakdeponejoj.
ja: バイナリ拡張を公開する時にはそれをビルドする際に用いたソースコードも公開することが強く推奨されています。こうすることで、必要であればユーザがその拡張をソースコードからビルドすることができます。特筆すべきことに、 Linux ディストリビューションの中には、そのディストロ向けのパッケージリポジトリの独自のビルドシステム内でソースコードからビルドすることを要求するものがあるのです。
pt_br: É altamente recomendável que você publique suas extensões binárias, bem como o código-fonte usado para construí-las. Isso permite que os usuários criem a extensão a partir do código-fonte, se necessário. Notavelmente, isso é necessário para certas distribuições Linux que compilam a partir do código-fonte em seus próprios sistemas de compilação para os repositórios de pacotes de distribuição.
ru: Настоятельно рекомендуется публиковать бинарные расширения, а также исходный код, который был использован для их создания. Это позволит пользователям при необходимости собрать расширение из исходного кода. В частности, это требуется для некоторых дистрибутивов Linux, которые собирают расширения из исходного кода в своих собственных системах сборки для репозиториев пакетов дистрибутива.
ta: உங்கள் பைனரி நீட்டிப்புகளையும் அவற்றை உருவாக்கப் பயன்படுத்தப்பட்ட மூலக் குறியீடும் வெளியிட வேண்டும் என்று கடுமையாக பரிந்துரைக்கப்படுகிறது. பயனர்கள் தேவைப்பட்டால் மூலத்திலிருந்து நீட்டிப்பை உருவாக்க இது அனுமதிக்கிறது. குறிப்பிடத்தக்க வகையில், டிச்ட்ரோ தொகுப்பு களஞ்சியங்களுக்கான சொந்த உருவாக்க அமைப்புகளுக்குள் மூலத்திலிருந்து உருவாக்கும் சில லினக்ச் விநியோகங்களுக்கு இது தேவைப்படுகிறது.

source: Weak linking
eo: Malforta bindado
ja: 弱いリンキング <Weak linking>
pt_br: Ligação fraca
ru: Слабая связь
ta: பலவீனமான இணைப்பு

source: Additional resources
eo: Pliaj rimedoj
ja: 追加のリソース
pt_br: Recursos adicionais
ru: Дополнительные ресурсы
ta: கூடுதல் ஆதாரங்கள்

source: Cross-platform development and distribution of extension modules is a complex topic, so this guide focuses primarily on providing pointers to various tools that automate dealing with the underlying technical challenges. The additional resources in this section are instead intended for developers looking to understand more about the underlying binary interfaces that those systems rely on at runtime.
ja: 拡張モジュールのプラットフォームを跨ぐ開発・配布は込み入った話題なので、このガイドでは主として背景にある技術的な課題の取り扱いを自動化するさまざまなツールへのポインタを提供することに重点を置くことにします。代わりに、この節のその他の部分では、そのようなシステムが実行時に依存するような下層のバイナリインタフェースについて開発者が理解を深めるために見ることを意図しています。
pt_br: O desenvolvimento e distribuição multiplataforma de módulos de extensão é um tópico complexo, portanto, este guia se concentra principalmente em fornecer indicadores para várias ferramentas que automatizam o tratamento dos desafios técnicos subjacentes. Os recursos adicionais nesta seção são destinados a desenvolvedores que procuram entender mais sobre as interfaces binárias subjacentes das quais esses sistemas dependem em tempo de execução.
ru: Кросс-платформенная разработка и распространение модулей расширения - сложная тема, поэтому в данном руководстве основное внимание уделено указателям на различные инструменты, автоматизирующие решение основных технических проблем. Дополнительные ресурсы в этом разделе предназначены для разработчиков, желающих больше узнать о базовых бинарных интерфейсах, на которые опираются эти системы во время выполнения.
ta: குறுக்கு-தளம் மேம்பாடு மற்றும் நீட்டிப்பு தொகுதிகளின் வழங்கல் ஒரு சிக்கலான தலைப்பு, எனவே இந்த வழிகாட்டி முதன்மையாக அடிப்படை தொழில்நுட்ப சவால்களைக் கையாள்வதை தானியக்கமாக்கும் பல்வேறு கருவிகளுக்கு சுட்டிகள் வழங்குவதில் கவனம் செலுத்துகிறது. இந்த பிரிவில் உள்ள கூடுதல் ஆதாரங்கள் அதற்கு பதிலாக அந்த அமைப்புகள் இயக்க நேரத்தில் நம்பியிருக்கும் அடிப்படை பைனரி இடைமுகங்களைப் பற்றி மேலும் புரிந்து கொள்ள விரும்பும் டெவலப்பர்களுக்காக வடிவமைக்கப்பட்டுள்ளன.

source: Cross-platform wheel generation with scikit-build
eo: Interplatforma generado de wheel per scikit-build
ja: sckit-build を用いたクロスプラットフォームな wheel の生成
pt_br: Geração de wheel multiplataforma com scikit-build
ru: Кросс-платформенная генерация колёс при помощи scikit-build
ta: ச்கிகிட்-கட்டமைப்போடு குறுக்கு-தளம் சக்கர விளைவாக்கம்

source: The `scikit-build <https://scikit-build.readthedocs.io/en/latest/>`_ package helps abstract cross-platform build operations and provides additional capabilities when creating binary extension packages. Additional documentation is also available on the `C runtime, compiler, and build system generator <https://scikit-build.readthedocs.io/en/latest/generators.html>`_ for Python binary extension modules.
eo: La pako `scikit-build <https://scikit-build.readthedocs.io/en/latest/>`_ helpas abstraktigi interplatforman konstruadon kaj provizas pliajn kapablojn pri kreado de duumaj etendaĵaj pakoj. Pliaj informoj disponeblas ĉe la paragrafo pri `la C-rultempo, tradukilo, kaj konstrusistema generilo <https://scikit-build.readthedocs.io/en/latest/generators.html>`_ por duumaj etendaĵmoduloj de Python.
ja: `scikit-build <https://scikit-build.readthedocs.io/en/latest/>`_ は、抽象的なビルド作業を補助し、バイナリ拡張のパッケージを作成する時に必要な追加的な能力を提供します。 Python のバイナリ拡張モジュールに関するさらなる説明文書は、 `C 言語におけるランタイム・コンパイラ・ビルドシステム生成器 <https://scikit-build.readthedocs.io/en/latest/generators.html>`_ にあります。
pt_br: O pacote `scikit-build <https://scikit-build.readthedocs.io/en/latest/>`_ ajuda a abstrair as operações de construção multiplataforma e fornece recursos adicionais ao criar pacotes de extensões binárias. Documentação adicional também está disponível no `tempo de execução C, compilador e gerador de sistema de construção <https://scikit-build.readthedocs.io/en/latest/generators.html>`_ para módulos Python de extensão binária.
ru: Пакет `scikit-build <https://scikit-build.readthedocs.io/en/latest/>`_ помогает абстрагироваться от кроссплатформенных операций сборки и предоставляет дополнительные возможности при создании пакетов бинарных расширений. Также доступна дополнительная документация по `C runtime, компилятору и генератору системы сборки <https://scikit-build.readthedocs.io/en/latest/generators.html>`_ для бинарных модулей расширения Python.
ta: `Scikit-build <https://scikit-build.readthedocs.io/en/latest/> _ _ தொகுப்பு சுருக்க குறுக்கு-தளம் உருவாக்கும் செயல்பாடுகளுக்கு உதவுகிறது மற்றும் பைனரி நீட்டிப்பு தொகுப்புகளை உருவாக்கும்போது கூடுதல் திறன்களை வழங்குகிறது. கூடுதல் ஆவணங்கள் `சி இயக்க நேரம், கம்பைலர் மற்றும் உருவாக்க கணினி செனரேட்டர் <https://scikit-build.readthedocs.io/en/latest/generators.html>` _ பைதான் பைனரி விரிவாக்க தொகுதிகளிலும் கிடைக்கிறது.

source: Introduction to C/C++ extension modules
eo: Enkonduko al C/C++-aj etendaĵaj moduloj
ja: C/C++ による拡張モジュールの紹介
pt_br: Introdução a módulos de extensão C/C++
ru: Введение в модули расширения на C/C++
ta: சி/சி ++ நீட்டிப்பு தொகுதிகள் அறிமுகம்

source: For a more in depth explanation of how extension modules are used by CPython on a Debian system, see the following articles:
eo: Por plia klarigo pri kiel CPython uzas etendaĵan modulon sur Debian-sistemo, vidu la jenajn artikolojn:
ja: Debian システム上で CPython がどのようにして拡張モジュールを使うのかについて、もっと深掘りした説明が次の記事に出ています:
pt_br: Para uma explicação mais detalhada de como os módulos de extensão são usados pelo CPython em um sistema Debian, consulte os seguintes artigos (todos em inglês):
ru: Для более подробного объяснения того, как модули расширения используются в CPython на системе Debian, смотрите следующие статьи:
ta: டெபியன் அமைப்பில் CPython ஆல் நீட்டிப்பு தொகுதிகள் எவ்வாறு பயன்படுத்தப்படுகின்றன என்பதற்கான ஆழமான விளக்கத்திற்கு, பின்வரும் கட்டுரைகளைப் பார்க்கவும்:

source: `What are (c)python extension modules? <https://thomasnyberg.com/what_are_extension_modules.html>`_
eo: `Kio estas etendaĵ-moduloj de (C)Python? <https://thomasnyberg.com/what_are_extension_modules.html>`_
ja: `(c)python の拡張モジュールとはどんなものか？ <https://thomasnyberg.com/what_are_extension_modules.html>`_
pt_br: `O que são módulos de extensão (c)python? <https://thomasnyberg.com/what_are_extension_modules.html>`_
ru: Что такое модули расширения (c)python? <https://thomasnyberg.com/what_are_extension_modules.html>`_
ta: `(சி) பைதான் நீட்டிப்பு தொகுதிகள் என்றால் என்ன? இப்போது

source: `Releasing the gil <https://thomasnyberg.com/releasing_the_gil.html>`_
eo: `Malakiri la mallokan interpretilan seruron <https://thomasnyberg.com/releasing_the_gil.html>`_
ja: `gil をリリースする <https://thomasnyberg.com/releasing_the_gil.html>`_
pt_br: `Liberando o gil <https://thomasnyberg.com/releasing_the_gil.html>`_
ru: `Освобождение gil <https://thomasnyberg.com/releasing_the_gil.html>`_
ta: `கில் <https://thomasnyberg.com/reliakiss_the_gil.html>` _

source: `Writing cpython extension modules using C++ <https://thomasnyberg.com/cpp_extension_modules.html>`_
eo: `Verki cpython-etendaĵaj moduloj per C++ <https://thomasnyberg.com/cpp_extension_modules.html>`_
ja: `C++ で cpython の拡張モジュールを書く <https://thomasnyberg.com/cpp_extension_modules.html>`_
pt_br: `Escrevendo módulos de extensão cpython usando C++ <https://thomasnyberg.com/cpp_extension_modules.html>`_
ru: `Написание модулей расширения cpython с использованием C++ <https://thomasnyberg.com/cpp_extension_modules.html>`_
ta: C ++ <https://thomasnyberg.com/cpp_extension_modules.html> `_

source: Additional considerations for binary wheels
eo: Pliaj konsideroj por duuma wheel
ja: バイナリの wheel に関する追加的な考慮
ru: Дополнительные соображения для бинарных колес
ta: பைனரி சக்கரங்களுக்கான கூடுதல் பரிசீலனைகள்

source: The `pypackaging-native <https://pypackaging-native.github.io/>`_ website has additional coverage of packaging Python packages with native code. It aims to provide an overview of the most important packaging issues for such projects, with in-depth explanations and references.
eo: La retejo `pypackaging-native <https://pypackaging-native.github.io/>`_ havas pliajn detalojn pri pakado de Python-pako kun indiĝena kodo. Ĝi estas resumo de la plej gravaj problemoj pri pakado de tia projekto kune kun detalaj klarigoj kaj referencoj.
ja: `pypackaging-native <https://pypackaging-native.github.io/>`_ ウェブサイトには、ネイティブのソースコード付きで Python パッケージをパッケージングすることの追加のカバレッジがあります。最重要のパッケージング上の課題について、そのような (課題に直面した) プロジェクト向けに詳細な説明とリファレンスを提供することを目的としています。
ru: Сайт `pypackaging-native <https://pypackaging-native.github.io/>`_ содержит дополнительные сведения об упаковке пакетов Python с нативным кодом. Его цель - предоставить обзор наиболее важных вопросов упаковки для таких проектов, а также подробные объяснения и ссылки.
ta: `Pypackaging-native <https://pypackaging-ative.github.io/>` _ வலைத்தளமானது பைதான் தொகுப்புகளை சொந்தக் குறியீட்டைக் கொண்டு பேக்கேசிங் செய்வதில் கூடுதல் பாதுகாப்பு உள்ளது. ஆழ்ந்த விளக்கங்கள் மற்றும் குறிப்புகளுடன், இதுபோன்ற திட்டங்களுக்கு மிக முக்கியமான பேக்கேசிங் சிக்கல்களின் கண்ணோட்டத்தை வழங்குவதை இது நோக்கமாகக் கொண்டுள்ளது.

source: Examples of topics covered are non-Python compiled dependencies ("native dependencies"), the importance of the ABI (Application Binary Interface) of native code, dependency on SIMD code and cross compilation.
eo: Jen ekzemploj de diskutotaj temoj: ne-Python-a tradukita dependeco («indiĝena dependeco»), la graveco de la ABI (aplika binara interfaco) de indiĝena kodo, dependeco sur SIMD-kodo, intertradukado.
ja: 話題の例としては、非 Python の要コンパイルな依存関係 ("ネイティブ依存関係") や、ネイティブソースコードの ABI (Application Binary Interface) の重要性や、 SIMD ソースコードへの依存とクロスコンパイルなどをカバーしています。
ru: Например, рассматриваются такие темы, как зависимости, не компилируемые в Python ("нативные зависимости"), важность ABI (Application Binary Interface) нативного кода, зависимости от SIMD-кода и кросс-компиляция.
ta: பைதான் அல்லாத தொகுக்கப்பட்ட சார்புநிலைகள் ("சொந்த சார்புநிலைகள்"), சொந்தக் குறியீட்டின் பநிஇ (பயன்பாட்டு பைனரி இடைமுகம்), சிம்ட் குறியீட்டின் சார்பு மற்றும் குறுக்கு தொகுப்பு ஆகியவற்றின் முக்கியத்துவம்.

source: Packaging namespace packages
eo: Paki nomspacajn pakojn
ja: 名前空間パッケージをパッケージする
pt_br: Empacotando pacotes de espaço de nomes
ru: Упаковка пакетов пространства имён
ta: பேக்கேசிங் பெயர்வெளி தொகுப்புகள்

source: Namespace packages allow you to split the sub-packages and modules within a single :term:`package <Import Package>` across multiple, separate :term:`distribution packages <Distribution Package>` (referred to as **distributions** in this document to avoid ambiguity). For example, if you have the following package structure:
eo: Nomspaca pako permesas al vi disfendi la subpakojn kaj modulojn en unu :term:`pako <Import Package>` al pluraj, apartaj :term:`distribuaj pakoj <Distribution Package>` (nomitaj **distribuoj** en ĉi tiu dokumento por eviti ambiguecon). Ekzemple, se oni havas la jenan pako-strukturon:
ja: 名前空間 (Namespace) パッケージは、複数かつ個別の :term:`パッケージ <Import Package>` (曖昧にならないようにこの文書では **配布物** と呼ぶことにする) を越えて、単一の :term:`パッケージ <Import Package>` の中のサブパッケージやモジュールを分離できるようにすることができます。例えば、下に示すようなパッケージ構造であれば:
pt_br: Os pacotes de espaço de nomes permitem que você divida os subpacotes e módulos dentro de um único :term:`pacote <Pacote de Importação>` em vários :term:`pacotes de distribuição <Pacote de Distribuição>` (referidos como **distribuições** em este documento para evitar ambiguidade). Por exemplo, se você tiver a seguinte estrutura de pacote:
ru: Пакеты пространства имен позволяют разделить подпакеты и модули одного :term:`пакета <Импортный пакет>` на несколько отдельных :term:`дистрибутивных пакетов <Дистрибутивный пакет>` (во избежание двусмысленности в этом документе они называются **дистрибутивами**). Например, если у вас есть следующая структура пакета:
ta: பெயரளவிலான தொகுப்புகள் துணை பேக்குகள் மற்றும் தொகுதிகளை ஒரு ஒற்றை: காலத்திற்குள் பிரிக்க உங்களை அனுமதிக்கின்றன: `தொகுப்பு <இறக்குமதி தொகுப்பு>` பல, தனி: கால: `விநியோக தொகுப்புகள் <விநியோக தொகுப்பு>` (** விநியோகங்கள் ** என குறிப்பிடப்படுகின்றன தெளிவற்ற தன்மையைத் தவிர்க்க இந்த ஆவணம்). எடுத்துக்காட்டாக, உங்களிடம் பின்வரும் தொகுப்பு அமைப்பு இருந்தால்:

source: And you use this package in your code like so::
eo: Kaj vi uzas ĉi tiun pakon en via kodo jene::
ja: そして、このパッケージを自分のソースコード中で使うにはこのようにする::
pt_br: E você usa este pacote em seu código assim::
ru: И вы используете этот пакет в своем коде следующим образом::
ta: இந்த தொகுப்பை உங்கள் குறியீட்டில் பயன்படுத்துகிறீர்கள் ::

source: Then you can break these sub-packages into two separate distributions:
eo: Do vi povas disrompi tiujn subpakojn en du apartajn distribuojn:
ja: そうすることで、これらのサブパッケージ群を別々のふたつの配布物に分割することができます:
pt_br: Então você pode quebrar esses subpacotes em duas distribuições separadas:
ru: Затем вы можете разбить эти подпакеты на два отдельных дистрибутива:
ta: இந்த துணை தொகுப்புகளை நீங்கள் இரண்டு தனித்தனி விநியோகங்களாக உடைக்கலாம்:

source: Each sub-package can now be separately installed, used, and versioned.
eo: Ĉiu subpako estas nun aparte instalebla, uzebla kaj versihava.
ja: それぞれのサブパッケージは、今や、個別にインストール・使用・バージョン管理することができます。
pt_br: Cada subpacote pode agora ser instalado, usado e versionado separadamente.
ru: Теперь каждый подпакет может быть установлен, использован и версионирован отдельно.
ta: ஒவ்வொரு துணைத் தொகுப்பையும் இப்போது தனித்தனியாக நிறுவலாம், பயன்படுத்தலாம் மற்றும் பதிப்பு செய்யலாம்.

source: Namespace packages can be useful for a large collection of loosely-related packages (such as a large corpus of client libraries for multiple products from a single company). However, namespace packages come with several caveats and are not appropriate in all cases. A simple alternative is to use a prefix on all of your distributions such as ``import mynamespace_subpackage_a`` (you could even use ``import mynamespace_subpackage_a as subpackage_a`` to keep the import object short).
eo: Nomspaca pako povas utili por granda kolekto de loze rilataj pakoj (kiel ekzemple granda aro da klientobibliotekoj por pluraj servoj de unu firmao). Tamen, nomspaca pako havas kelkajn problemojn kaj ne taŭgas por ĉiaj celoj. Simpla alternativo estas uzi prefikson en la nomojn de distribuoj kiel ekzemple ``import mianomspaco_subpako_a`` (oni povas eĉ uzi ``import mianomspaco_subpako_a as subpako_a`` por mallongigi).
ja: 名前空間パッケージは、 (単独の会社から出ている複数の製品向けのクライアントライブラリの巨大な集積のような) 緩やかに関連したパッケージが多数含まれるコレクションに役立つでしょう。しかしながら、名前空間パッケージにはいくつかの注意書きがあって、全ての場合に適切と言うわけではありません。単純明快な代替策は、あなたの配布物のすべてについて ``import mynamespace_subpackage_a`` のような接頭語を使うことです (インポートするオブジェクトの名前を短く保つために ``import mynamespace_subpackage_a as subpackage_a`` のようにインポートすることさえできます) 。
pt_br: Os pacotes de espaço de nomes podem ser úteis para uma grande coleção de pacotes vagamente relacionados (como um grande corpo de bibliotecas de cliente para vários produtos de uma única empresa). No entanto, os pacotes de espaço de nomes vêm com várias ressalvas e não são apropriados em todos os casos. Uma alternativa simples é usar um prefixo em todas as suas distribuições, como ``import mynamespace_subpackage_a`` (você pode até usar ``import mynamespace_subpackage_a as subpackage_a`` para manter o objeto de importação curto).
ru: Пакеты пространства имен могут быть полезны для большой коллекции слабо связанных между собой пакетов (например, большой корпус клиентских библиотек для нескольких продуктов одной компании). Однако пакеты пространства имен имеют несколько оговорок и подходят не во всех случаях. Простая альтернатива - использовать во всех дистрибутивах префикс, например ``import mynamespace_subpackage_a`` (можно даже использовать ``import mynamespace_subpackage_a as subpackage_a``, чтобы сохранить краткость объекта импорта).
ta: தளர்வான தொடர்புடைய தொகுப்புகளின் பெரிய சேகரிப்புக்கு பெயர்வெளி தொகுப்புகள் பயனுள்ளதாக இருக்கும் (ஒரு நிறுவனத்திடமிருந்து பல தயாரிப்புகளுக்கான கிளையன்ட் நூலகங்களின் பெரிய கார்பச் போன்றவை). இருப்பினும், பெயர்வெளி தொகுப்புகள் பல எச்சரிக்கைகளுடன் வருகின்றன, அவை எல்லா நிகழ்வுகளிலும் பொருத்தமானவை அல்ல. ஒரு எளிய மாற்று என்னவென்றால், `` mynamespace_subpackage_a`` போன்ற உங்கள் விநியோகங்கள் அனைத்திலும் ஒரு முன்னொட்டைப் பயன்படுத்துவது (நீங்கள் `` mynamespace_subpackage_a ஐ subpackage_a ஆக இறக்குமதி செய்யலாம்) இறக்குமதி பொருளை குறுகியதாக வைத்திருக்க).

source: Creating a namespace package
eo: Krei nomspacan pakon
ja: 名前空間パッケージを作成する
pt_br: Criando um pacote de espaço de nomes
ru: Создание пакета пространства имён
ta: பெயர்வெளி தொகுப்பை உருவாக்குதல்
