Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: For example, here is a table for using :ref:`hatch`:
eo: Ekzemple, jen tabelo pri uzado de :ref:`hatch`:
ja: 例えば、 :ref:`hatch` を使う場合のテーブルは次のようになります:
pt_br: Por exemplo, aqui está uma tabela para usar :ref:`hatch`:
ru: Например, вот таблица для использования:ref:`hatch`:
ta: எடுத்துக்காட்டாக, பயன்படுத்த ஒரு அட்டவணை இங்கே: ref: `அட்ச்`:

source: With such a table in the :file:`pyproject.toml` file, a ":term:`frontend <Build Frontend>`" tool like :ref:`build` can run your chosen build tool's ":term:`backend <Build Backend>`" to create the build artifacts. Your build tool may also provide its own frontend. An install tool like :ref:`pip` also acts as a frontend when it runs your build tool's backend to install from a source distribution.
eo: Kun tia tabelo en la dosiero :file:`pyproject.toml`, :term:`konstrua fasado <Build Frontend>` kiel :ref:`build` povas ruli la elektitan :term:`konstruan malfasadon <Build Backend>` por krei la konstruitajn artefaktojn. La konstrua malfasado povas ankaŭ provizi sian propran fasadon. Instalilo kiel :ref:`pip` ankaŭ funkcias kiel fasado, kiam ĝi rulas la konstruan malfasadon por instali el fonta distribuo.
ja: :file:`pyproject.toml` ファイルの中のそのようなテーブルを用いることで、 :ref:`build` のような ":term:`フロントエンド <Build Frontend>`" のツールが、ビルド成果物を作成するためにあなたが選んだビルドツールの ":term:`バックエンド <Build Backend>`" を実行することができます。あなたが選んだビルドツールが独自のフロントエンドを提供しても構いません。 :ref:`pip` のようなインストールツールもまた、ソースコード配布物からインストールする時にあなたのビルドツールバックエンドを走らせることで、フロントエンドとして振る舞うことができます。
pt_br: Com tal tabela no arquivo :file:`pyproject.toml`, uma ferramenta ":term:`frontend <Build Frontend>`" como :ref:`build` pode executar o ":term:`backend <Build Backend>`" da ferramenta de compilação escolhida para criar os artefatos de compilação. Sua ferramenta de compilação também pode fornecer seu próprio frontend. Uma ferramenta de instalação como :ref:`pip` também atua como frontend quando executa o backend da sua ferramenta de construção para instalar a partir de uma distribuição fonte.
ru: С такой таблицей в файле :file:`pyproject.toml', ":term:`frontend <Build Frontend>`" tool like :ref:`build` может запускать выбранный вами инструмент построения ":term:`backend <Build Backend>`" для создания артефактов сборки. Ваш инструмент сборки также может предоставить свой собственный фронтенд. Инструмент установки, такой как :ref:`pip'', также действует в качестве фронтенда, когда он запускает предысторию вашего инструмента для установки из распределения источника.
ta: அத்தகைய அட்டவணையுடன்: கோப்பு: `pyproject.toml` கோப்பு, ஒரு": கால: `ஃபிரான்டென்ட் <பில்ட் ஃபிரான்டென்ட்>` "கருவி போன்ற: ref:` பில்ட்` நீங்கள் தேர்ந்தெடுத்த பில்ட் கருவியை இயக்க முடியும் ": கால:` பின்தளத்தில் < உருவாக்க கலைப்பொருட்களை உருவாக்க பின்தளத்தில்> `" உருவாக்குங்கள். உங்கள் உருவாக்க கருவி அதன் சொந்த முன்பக்கத்தையும் வழங்கக்கூடும். ஒரு நிறுவும் கருவி: ref: `பிப்` ஒரு மூல விநியோகத்திலிருந்து நிறுவ உங்கள் உருவாக்க கருவியின் பின்தளத்தில் இயக்கும்போது ஒரு முன்பக்கமாகவும் செயல்படுகிறது.

source: The particular build tool you choose dictates what additional information is required in the :file:`pyproject.toml` file. For example, you might specify:
eo: Tiu konstruilo, kiun vi elektas, determinas la postulatajn pliajn informojn en la dosiero :file:`pyproject.toml`. Ekzemple, oni povas uzi la jenon:
ja: あなたが選択した特定のビルドツールに応じてどんな追加の情報を :file:`pyproject.toml` ファイルに記述しなければならないかがきまります。例えば、以下のように指定することができます:
pt_br: A ferramenta de construção específica que você escolhe determina quais informações adicionais são necessárias no arquivo :file:`pyproject.toml`. Por exemplo, você pode especificar:
ru: Выбранный вами инструмент сборки диктует, какая дополнительная информация требуется в файле :file:`pyproject.toml`. Например, вы можете указать:
ta: நீங்கள் தேர்வுசெய்த குறிப்பிட்ட உருவாக்க கருவி: கோப்பு: `pyproject.toml` கோப்பில் என்ன கூடுதல் செய்தி தேவை என்பதைக் குறிக்கிறது. எடுத்துக்காட்டாக, நீங்கள் குறிப்பிடலாம்:

source: a ``[project]`` table containing project :doc:`Core Metadata </specifications/core-metadata/>` (name, version, author and so forth),
eo: tabelo ``[project]`` enhavanta la projektajn :doc:`Kernajn Metadatenojn </specifications/core-metadata/>` (nomon, version, aŭtoron ktp),
ja: :doc:`コアとなるメタデータ </specifications/core-metadata/>` (名前・バージョン・作者・その他) を含む ``[project]``、
pt_br: uma tabela ``[project]`` contendo os :doc:`Metadados Principais </specifications/core-metadata/>` (nome, versão, autor e assim por diante),
ru: таблица ``[проект]``, содержащая проект :doc:``Основные метаданные </specifications/core-metadata/>` (название, версия, автор и так далее),
ta: ஒரு `` [திட்டம்] `` திட்டத்தைக் கொண்ட அட்டவணை: டாக்: `கோர் மேனிலை தரவு </விவரக்குறிப்புகள்/கோர்-மெட்டாடேட்டா/>` (பெயர், பதிப்பு, ஆசிரியர் மற்றும் பல),

source: a ``[tool]`` table containing tool-specific configuration options.
eo: tabelo ``[tool]`` enhavantaj agordajn opciojn por specifaj iloj.
ja: ツール特有の設定オプションを含んだ ``[tool]`` テーブル。
pt_br: uma tabela ``[tool]`` contendo opções de configuração específicas da ferramenta.
ru: таблица ``[tool]``, содержащая параметры конфигурации, специфичные для конкретного инструмента.
ta: கருவி-குறிப்பிட்ட உள்ளமைவு விருப்பங்களைக் கொண்ட ஒரு `` [கருவி] `` அட்டவணை.

source: Refer to the :ref:`pyproject.toml guide <writing-pyproject-toml>` for a complete guide to ``pyproject.toml`` configuration.
eo: Vidu la :ref:`gvidilon pri pyproject.toml <writing-pyproject-toml>` por plenaj detaloj pri agordado de ``pyproject.toml``.
ja: ``pyproject.toml`` の設定に関する完全なガイド文書としては、 :ref:`pyproject.toml ガイド文書 <writing-pyproject-toml>` を参照してください。
pt_br: Consulte o :ref:`guia pyproject.toml <writing-pyproject-toml>` para um guia completo para a configuração de ``pyproject.toml``.
ru: Полное руководство по настройке ``pyproject.toml'' см. в :ref:`pyproject.toml guide <writing-pyproject-toml>`.
ta: `` Pyproject.toml`` உள்ளமைவுக்கான முழுமையான வழிகாட்டிக்கு `pyproject.toml வழிகாட்டி <எழுதுதல்-pyproject-toml>` ஐப் பார்க்கவும்.

source: Build artifacts
eo: Konstruaj artefaktoj
ja: ビルド成果物
pt_br: Artefatos de construção
ru: Создание артефактов
ta: கலைப்பொருட்களை உருவாக்குங்கள்

source: The source distribution (sdist)
eo: La fonta distribuo (sdist)
ja: `ソースコード配布物 (またはsdist) <Source Distribution (or "sdist")>`
pt_br: A distribuição fonte (sdist)
ru: Распространение в исходном коде (sdist)
ta: மூல வழங்கல் (SDIST)

source: A source distribution contains enough to install the package from source in an end user's Python environment. As such, it needs the package source, and may also include tests and documentation. These are useful for end users wanting to develop your sources, and for end user systems where some local compilation step is required (such as a C extension).
eo: Fonta distribuo enhavas sufiĉon por instali de fonto la pakon en la Python-medio de la uzanto. Tial, ĝi bezonas la pakan fonton, kaj ankaŭ povas inkluzivi testojn kaj dokumentaron. Tio utilas por tiaj uzantoj, kiaj volas programi kun viaj fontoj, aŭ kies sistemoj postulas lokan tradukadon (ekzemple por C-etendaĵo).
ja: ソースコード配布物には、エンドユーザの Python 環境でソースコードからパッケージをインストールするのに十分なものが含まれています。そのためには、パッケージのソースコードが必要であり、テストや説明文書が含まれているかもしれません。これらは、自身でソースコードを開発したいと考えるエンドユーザにとっては便利であり、ローカルでコンパイルを行うステップが必要とされる (C 拡張など) エンドユーザのシステムで役に立つことでしょう。
pt_br: Uma distribuição fonte contém o suficiente para instalar o pacote fonte no ambiente Python de um usuário final. Como tal, ele precisa da fonte do pacote e também pode incluir testes e documentação. Eles são úteis para usuários finais que desejam desenvolver suas fontes e para sistemas de usuários finais onde alguma etapa de compilação local é necessária (como uma extensão C).
ru: Дистрибутив с исходным кодом содержит достаточно средств для установки пакета из исходного кода в среду Python конечного пользователя. Как таковой, он содержит исходный текст пакета, а также может включать тесты и документацию. Они полезны для конечных пользователей, желающих разработать свои исходные тексты, а также для систем конечных пользователей, где требуется локальная компиляция (например, расширение C).
ta: இறுதி பயனரின் பைதான் சூழலில் மூலத்திலிருந்து தொகுப்பை நிறுவ ஒரு மூல விநியோகத்தில் போதுமானது. எனவே, இதற்கு தொகுப்பு சான்று தேவை, மேலும் சோதனைகள் மற்றும் ஆவணங்களும் இருக்கலாம். உங்கள் ஆதாரங்களை உருவாக்க விரும்பும் இறுதி பயனர்களுக்கும், சில உள்ளக தொகுப்பு படி தேவைப்படும் இறுதி பயனர் அமைப்புகளுக்கும் இவை பயனுள்ளதாக இருக்கும் (சி நீட்டிப்பு போன்றவை).

source: The :ref:`build` package knows how to invoke your build tool to create one of these:
eo: La pako :ref:`build` scias kiel alvoki vian konstruilon por krei unu el la jeno:
ja: :ref:`build` パッケージは、次のうちのいずれかを生成するためにあなたの選んだビルドツールをどのように呼び出すのかを知っています:
pt_br: O pacote :ref:`build` sabe como invocar sua ferramenta de construção para criar uma destas:
ru: Пакет :ref:`build` знает, как вызвать ваш инструмент сборки для создания одного из них:
ta: The: ref: `பில்ட்` தொகுப்புக்கு இவற்றில் ஒன்றை உருவாக்க உங்கள் உருவாக்க கருவியை எவ்வாறு செயல்படுத்துவது என்பது தெரியும்:

source: Or, your build tool may provide its own interface for creating an sdist.
eo: Aŭ via konstruilo povas provizi sian propran interfacon por krei fontan distribuon.
ja: あるいは、あなたの選んだツールが、 sdist を生成するためのツール独自のインタフェースを提供しているかもしれません。
pt_br: Ou sua ferramenta de construção pode fornecer sua própria interface para criar um sdist.
ru: Или же ваш инструмент сборки может предоставлять собственный интерфейс для создания sdist.
ta: அல்லது, உங்கள் உருவாக்க கருவி ஒரு SDIST ஐ உருவாக்குவதற்கான அதன் சொந்த இடைமுகத்தை வழங்கக்கூடும்.

source: The built distributions (wheels)
eo: La konstruita distribuo (wheel)
ja: ビルド済み配布物 (wheels)
pt_br: As distribuições de construídas (wheels)
ru: Построенные дистрибутивы (колеса)
ta: கட்டப்பட்ட விநியோகங்கள் (சக்கரங்கள்)

source: A built distribution contains only the files needed for an end user's Python environment. No compilation steps are required during the install, and the wheel file can simply be unpacked into the ``site-packages`` directory. This makes the install faster and more convenient for end users.
eo: Konstruita distribuo enhavas nur tiujn dosierojn, kiuj necesas en la Python-medio de uzanto. Instalado ne postulas tradukadon, kaj la wheel povas simple esti malpakita al la dosierujo ``site-packages``. Tio plirapidigas kaj plifaciligas instaladon.
ja: ビルド済配布物は、エンドユーザの Python 環境に必要とされるファイル群だけを含んでいます。インストールの際にコンパイル工程は不要で、 wheel ファイルの内容を ``site-packages`` ディレクトリに単純に展開することができます。これによってインストールが素早く行われ、エンドユーザにとってより便利であると言えるでしょう。
pt_br: Uma distribuição construída contém apenas os arquivos necessários para o ambiente Python de um usuário final. Nenhuma etapa de compilação é necessária durante a instalação, e o arquivo wheel pode simplesmente ser descompactado no diretório ``site-packages``. Isso torna a instalação mais rápida e conveniente para os usuários finais.
ru: Собранный дистрибутив содержит только файлы, необходимые для среды Python конечного пользователя. При установке не требуется компиляция, а файл wheel можно просто распаковать в каталог ``ite-packages``. Это делает установку более быстрой и удобной для конечных пользователей.
ta: ஒரு கட்டமைக்கப்பட்ட விநியோகத்தில் இறுதி பயனரின் பைதான் சூழலுக்குத் தேவையான கோப்புகள் மட்டுமே உள்ளன. நிறுவலின் போது தொகுப்பு படிகள் எதுவும் தேவையில்லை, மேலும் சக்கரக் கோப்பை `` தள-பேக்கேச்கள்`` கோப்பகத்தில் திறக்கலாம். இது இறுதி பயனர்களுக்கு நிறுவலை விரைவாகவும் வசதியாகவும் செய்கிறது.

source: A pure Python package typically needs only one "generic" wheel. A package with compiled binary extensions needs a wheel for each supported combination of Python interpreter, operating system, and CPU architecture that it supports. If a suitable wheel file is not available, tools like :ref:`pip` will fall back to installing the source distribution.
eo: Pure Python-a pako tipe nur bezonas unu «generalan» wheel. Pako kun tradukita duuma etendaĵo bezonas po unu wheel por ĉiu subtenata kombinaĵo de Python-interpretilo, mastruma sistemo kaj ĉefprocesora arĥitekturo. Se taŭga wheel ne haveblas, :ref:`pip` kaj aliaj iloj instalos la fontan distribuon.
ja: 純 Python パッケージでは、典型的には、ひとつの "万能型" の wheel さえあれば十分です。コンパイル済みのバイナリ拡張を伴うパッケージでは、そのパッケージがサポートする Python インタプリタ・オペレーティングシステム・ CPU アーキテクチャの組み合わせのそれぞれについて wheel ファイルが必要になります。適切な wheel ファイルが利用できない場合には、 :ref:`pip` のようなツールはソースコード配布物からのインストールにフォールバックします。
pt_br: Um pacote puro Python normalmente precisa apenas de um wheel "genérico". Um pacote com extensões binárias compiladas precisa de um wheel para cada combinação suportada de interpretador Python, sistema operacional e arquitetura de CPU que ele suporta. Se um arquivo wheel adequado não estiver disponível, ferramentas como :ref:`pip` voltarão a instalar a distribuição fonte.
ru: Пакету на чистом Python обычно требуется только одно "общее" колесо. Пакет с компилируемыми бинарными расширениями нуждается в колесе для каждой поддерживаемой комбинации интерпретатора Python, операционной системы и архитектуры процессора, которые он поддерживает. Если подходящий файл колеса недоступен, такие инструменты, как :ref:`pip`, вернутся к установке исходного дистрибутива.
ta: ஒரு தூய பைதான் தொகுப்புக்கு பொதுவாக ஒரே "பொதுவான" சக்கரம் மட்டுமே தேவை. தொகுக்கப்பட்ட பைனரி நீட்டிப்புகளைக் கொண்ட ஒரு தொகுப்புக்கு பைதான் மொழிபெயர்ப்பாளர், இயக்க முறைமை மற்றும் சிபியு கட்டமைப்பு ஆகியவற்றின் ஒவ்வொரு ஆதரிக்கப்பட்ட கலவைக்கும் ஒரு சக்கரம் தேவை. பொருத்தமான சக்கர கோப்பு கிடைக்கவில்லை என்றால், போன்ற கருவிகள்: குறிப்பு: `பிப்` மூல விநியோகத்தை நிறுவுவதற்கு மீண்டும் விழும்.

source: Or, your build tool may provide its own interface for creating a wheel.
eo: Aŭ via konstruilo povas provizi sian propran interfacon por krei wheel.
ja: あるいは、あなたの選んだビルドツールが wheel を生成するための独自のインタフェースを提供しているかもしれません。
pt_br: Ou sua ferramenta de construção pode fornecer sua própria interface para criar um wheel.
ru: Или же ваш инструмент сборки может предоставлять собственный интерфейс для создания колеса.
ta: அல்லது, உங்கள் உருவாக்க கருவி ஒரு சக்கரத்தை உருவாக்குவதற்கான அதன் சொந்த இடைமுகத்தை வழங்கக்கூடும்.

source: The default behaviour of :ref:`build` is to make both an sdist and a wheel from the source in the current directory; the above examples are deliberately specific.
eo: La implicita konduto de :ref:`build` estas fari kaj fontan distribuon kaj wheel el la fonto en la aktuala dosierujo; la ĉi-supraj ekzemploj estas intence specifaj.
ja: :ref:`build` のデフォルトの動作は、カレントディレクトリにあるソースコードから sdist と wheel の両方を作成することです; 上記の例は意図的に特定の動作をさせています。
pt_br: O comportamento padrão do :ref:`build` é fazer tanto um sdist quanto um wheel da fonte no diretório atual; os exemplos acima são deliberadamente específicos.
ru: По умолчанию поведение :ref:`build' состоит в том, чтобы сделать как sdist, так и колесо из источника в текущем каталоге; приведенные выше примеры преднамеренно конкретны.
ta: இதன் இயல்புநிலை நடத்தை: ref: `` பில்ட்` என்பது தற்போதைய கோப்பகத்தில் மூலத்திலிருந்து ஒரு SDIST மற்றும் சக்கரம் இரண்டையும் உருவாக்குவதாகும்; மேலே உள்ள எடுத்துக்காட்டுகள் வேண்டுமென்றே குறிப்பிட்டவை.

source: Upload to the package distribution service
eo: Alŝuti al la paka distribua servo
ja: パッケージ配布サービスへアップロードする
pt_br: Enviando os arquivos de distribuição
ru: Загрузка в службу распространения пакетов
ta: தொகுப்பு விநியோக சேவையில் பதிவேற்றவும்

source: The :ref:`twine` tool can upload build artifacts to PyPI for distribution, using a command like:
eo: La ilo :ref:`twine` povas alŝuti konstruitajn artefaktojn al PyPI por distribuo, uzante komandon kiel la jenon:
ja: ツールの :ref:`twine` の以下のようなコマンドを使って、配布のためにビルド成果物を PyPI へアップロードすることができます:
pt_br: A ferramenta :ref:`twine` pode enviar artefatos de construção para PyPI para distribuição, usando um comando como:
ru: Инструмент :ref:`twine` может загружать артефакты сборки в PyPI для распространения, используя такую команду, как:
ta: தி: ரெஃப்: `ட்வைன்` கருவி விநியோகத்திற்காக பைபிக்கு உருவாக்க கலைப்பொருட்களை பதிவேற்றலாம், இது போன்ற கட்டளையைப் பயன்படுத்துகிறது:

source: Or, your build tool may provide its own interface for uploading.
eo: Aŭ, via konstruilo eble provizas sian propran interfacon por alŝutado.
ja: あるいは、あなたの選んだビルドツールにアップロードのための独自のインタフェースが備わっているかもしれません。
pt_br: Ou sua ferramenta de construção pode fornecer sua própria interface para envio.
ru: Или же ваш инструмент сборки может предоставлять собственный интерфейс для загрузки.
ta: அல்லது, உங்கள் உருவாக்க கருவி பதிவேற்றுவதற்கான அதன் சொந்த இடைமுகத்தை வழங்கக்கூடும்.

source: Download and install
eo: Elŝuti kaj instali
ja: ダウンロードとインストール
pt_br: Baixando e instalando
ru: Скачать и установить
ta: பதிவிறக்கம் செய்து நிறுவவும்

source: Now that the package is published, end users can download and install the package into their Python environment. Typically this is done with :ref:`pip`, using a command like:
eo: Nun, post eldonado de la pako, uzantoj povas elŝuti kaj instali la pakon en siajn Python-mediojn. Oni faras tion per :ref:`pip`, uzante la jenan komandon:
ja: 今やパッケージが公開されたので、エンドユーザがそのパッケージをダウンロードして自分の Python 環境へインストールすることができるようになりました。典型的には、これは、次のようなコマンドを使って :ref:`pip` で行われます:
pt_br: Agora que o pacote foi publicado, os usuários finais podem baixar e instalar o pacote em seu ambiente Python. Normalmente isso é feito com :ref:`pip`, usando um comando como:
ru: Теперь, когда пакет опубликован, конечные пользователи могут загрузить и установить его в свою среду Python. Обычно это делается с помощью :ref:`pip`, используя такую команду, как:
ta: இப்போது தொகுப்பு வெளியிடப்பட்டுள்ளதால், இறுதி பயனர்கள் தங்கள் பைதான் சூழலில் தொகுப்பை பதிவிறக்கம் செய்து நிறுவலாம். பொதுவாக இது செய்யப்படுகிறது: ref: `பிப்`, போன்ற கட்டளையைப் பயன்படுத்துதல்:

source: End users may also use other tools like :ref:`pipenv`, :ref:`poetry`, or :ref:`pdm`.
eo: Uzantoj povas ankaŭ uzi aliajn ilojn kiel :ref:`pipenv`, :ref:`poetry`, aŭ :ref:`pdm`.
ja: エンドユーザは、 :ref:`pipenv` ・ :ref:`poetry` ・ :ref:`ppm` のような他のツールを使うことも可能です。
pt_br: Os usuários finais também podem usar outras ferramentas como :ref:`pipenv`, :ref:`poetry` ou :ref:`pdm`.
ru: Конечные пользователи могут также использовать другие инструменты, такие как:ref:`pipenv`, :ref:`poetry', или :ref:`pdm'.
ta: இறுதி பயனர்கள் போன்ற பிற கருவிகளையும் பயன்படுத்தலாம்: ref: `pipenv`,: ref:` கவிதை`, அல்லது: ref: `PDM`.

source: Glossary
eo: Terminaro
ja: 用語集
pt_br: Glossário
ru: Словарь терминов
ta: சொற்களஞ்சியம்

source: Binary Distribution
eo: Duuma Distribuo
ja: バイナリ配布物
pt_br: Distribuição Binária
ru: Двоичное распределение
ta: பைரான் வழங்கல்

source: A specific kind of :term:`Built Distribution` that contains compiled extensions.
eo: Specifa speco de :term:`Konstruita Distribuo <Built Distribution>` enhavanta tradukitajn etendaĵojn.
ja: `ビルド済配布物 <Built Distribution>`の特定の種類で、コンパイル済みの拡張部分を含むもの。
pt_br: Um tipo específico de :term:`Distribuição Construída` que contém extensões compiladas.
ru: Особый вид :term:`Built Distribution`, содержащий скомпилированные расширения.
ta: ஒரு குறிப்பிட்ட வகை: கால: `கட்டப்பட்ட விநியோகம்` அதில் தொகுக்கப்பட்ட நீட்டிப்புகளைக் கொண்டுள்ளது.

source: Build Backend
eo: Konstrua Malfasado
ja: ビルドバックエンド
pt_br: Backend de construção
ru: Создание бэкэнда
ta: பின்தளத்தில் உருவாக்குங்கள்

source: A library that takes a source tree and builds a :term:`source distribution <Source Distribution (or "sdist")>` or :term:`built distribution <Built Distribution>` from it. The build is delegated to the backend by a :term:`frontend <Build Frontend>`. All backends offer a standardized interface.
eo: Biblioteko prenanta fontarbon kaj konstruanta :term:`fontan distribuon <Source Distribution (or "sdist")>` or :term:`konstritan distribuon <Built Distribution>`. La :term:`fasado <Build Frontend>` delegas la konstruadon al la malfasado. Ĉia malfasado provizas normigitan interfacon.
ja: ソースコードツリーを受け取って、そこから :term:`ソースコード配布物 <Source Distribution (or "sdist")>` や :term:`ビルド済配布物 <Built Distribution>` をビルドするライブラリ。ビルドの作業は、 :term:`フロントエンド <Build Frontend>` によってバックエンドに委任されます。
ru: Библиотека, которая принимает дерево исходных текстов и собирает из него : термин:`источник дистрибутива <Источник дистрибутива (или "sdist")>` или :термин:`сборка дистрибутива <Сборка дистрибутива>`. Сборка делегируется бэкенду с помощью : термин:`фронтенд <Сборка фронтенда>`. Все бэкенды предлагают стандартизированный интерфейс.
ta: ஒரு மூல மரத்தை எடுத்து ஒரு நூலகம் ஒரு: காலத்தை உருவாக்குகிறது: `மூல வழங்கல் <மூல வழங்கல் (அல்லது" SDIST ")>` அல்லது: கால: `கட்டப்பட்ட வழங்கல் <கட்டப்பட்ட விநியோகம்>` அதிலிருந்து. கட்டமைப்பானது பின்தளத்தில் வழங்கப்படுகிறது: கால: `ஃபிரான்டென்ட் <பில்ட் ஃபிரான்டெண்ட்>`. அனைத்து பின்தளத்தில் ஒரு தரப்படுத்தப்பட்ட இடைமுகத்தை வழங்குகிறது.

source: Examples of build backends are :ref:`flit's flit-core <flit>`, :ref:`hatch's hatchling <hatch>`, :ref:`maturin`, :ref:`meson-python`, :ref:`scikit-build-core`, and :ref:`setuptools`.
eo: Ekzemploj de konstruaj malfasadoj estas :ref:`flit-core de flit <flit>`, :ref:`hatchling de hatch <hatch>`, :ref:`maturin`, :ref:`meson-python`, :ref:`scikit-build-core`, kaj :ref:`setuptools`.
ja: ビルドバックエンドの例としては、 :ref:`flit の flit-core <flit>` 、 :ref:`hatchのhatchling <hatch>` 、 :ref:`maturin` 、 :ref:`meson-python` 、 :ref:`scikit-build-core` 、 :ref:`setuptools` があります。
pt_br: Exemplos de backends de construção são :ref:`flit-core do flit <flit>`, :ref:`hatchling do hatch <hatch>`, :ref:`maturin`, :ref:`meson-python`, :ref:`scikit-build-core` e :ref:`setuptools`.
ru: Примерами бэкендов сборки являются :ref:`flit's flit-core <flit>`, :ref:`hatch's hatchling <hatch>`, :ref:`maturin`, :ref:`meson-python`, :ref:`scikit-build-core`, и :ref:`setuptools`.
ta: பின்தளத்தில் கட்டுவதற்கான எடுத்துக்காட்டுகள்: `ஃபிளிட்ச் ஃபிளிட்-கோர் <flit>`,: ref: `அட்ச் அட்ச் அட்ச்லிங் <அட்ச்>`,: குறிப்பு: `மேட்டூரின்`,: குறிப்பு:` மீசன்-பைதான்`,: `ச்கிகிட் -பில்ட்-கோர்`, மற்றும்: குறிப்பு: `செட்ப்டூல்ச்`.

source: Build Frontend
eo: Konstrua Fasado
ja: ビルドフロントエンド
pt_br: Frontend de construção
ru: Сборка фронтенда
ta: முன்பக்கத்தை உருவாக்குங்கள்

source: A tool that users might run that takes arbitrary source trees or :term:`source distributions <Source Distribution (or "sdist")>` and builds source distributions or :term:`wheels <Wheel>` from them. The actual building is delegated to each source tree's :term:`build backend <Build Backend>`.
eo: Ilo, rulebla de uzanto, kiu el arbitra fontarbo aŭ :term:`fonta distribuo <Source Distribution (or "sdist")>` konstruas fontan distribuon aŭ :term:`wheel <Wheel>`. La faktan konstruadon faras la :term:`konstrua malfasado <Build Backend>` de la fontarbo.
ja: 任意のソースコードツリーまたは :term:`ソースコード配布物 <Source Distribution (or "sdist")>` を入力として、それらからソースコード配布物または :term:`wheels <Wheel>` をビルドするためにユーザが走らせるであろうツール。実際のビルド作業は、それぞれのソースコードツリーの :term:`ビルドバックエンド <Build Backend>` に委任されます。
pt_br: Uma ferramenta que os usuários podem executar que pega árvores de fontes arbitrárias ou :term:`distribuições fonte <Source Distribution (or "sdist")>` e constrói distribuições fontes ou :term:`wheels <Wheel>` a partir delas. A construção real é delegada ao :term:`backend de construção <Build Backend>` de cada árvore de fontes.
ru: Инструмент, который может быть запущен пользователями, который принимает произвольные деревья исходных текстов или :term:`дистрибутивы исходных текстов <Source Distribution (или "sdist")>` и собирает из них дистрибутивы исходных текстов или :term:`колеса <Wheel>`. Собственно сборка делегируется каждому дереву исходников :term:`build backend <Build Backend>`.
ta: தன்னிச்சையான மூல மரங்களை எடுக்கும் பயனர்கள் இயக்கக்கூடிய ஒரு கருவி அல்லது: கால: `மூல வழங்கல் <மூல வழங்கல் (அல்லது" SDIST ")>` மற்றும் மூல விநியோகங்களை உருவாக்குகிறது அல்லது: கால: `சக்கரங்கள் <hewhel>` அவர்களிடமிருந்து. உண்மையான கட்டிடம் ஒவ்வொரு மூல மரத்திற்கும் வழங்கப்படுகிறது: சொல்: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>`.
