Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: A common use-case for build numbers is rebuilding a binary distribution due to a change in the build environment, like when using the manylinux image to build distributions using pre-release CPython versions.
eo: Ofta uzkazo por konstrunumero estas rekonstrui duuman distribuon pro ŝanĝo en la konstrua medio, ekzemple por uzi la diskokopion manylinux por konstrui distribuojn kun antaŭeldonaj versioj de CPython.
ja: ビルド番号に係るよくあるユースケースは、CPython のリリース前のバージョンを使って manylinux で配布物をビルドしている場合のように、ビルド環境に変化があったためにバイナリ配布物を再ビルドする時です。
pt_br: Um caso de uso comum para números de construção é reconstruir uma distribuição binária devido a uma mudança no ambiente de construção, como ao usar a imagem manylinux para construir distribuições usando versões de pré-lançamento do CPython.
ru: Частым случаем использования номеров сборок является перестроение бинарного дистрибутива из-за изменения среды сборки, например, при использовании образа manylinux для сборки дистрибутивов, использующих предварительные версии CPython.
ta: உருவாக்க எண்களுக்கான பொதுவான பயன்பாட்டு வழக்கு, உருவாக்கும் சூழலில் ஏற்பட்ட மாற்றத்தின் காரணமாக பைனரி விநியோகத்தை மீண்டும் கட்டியெழுப்புவதாகும், இது மேனிலினக்ச் படத்தைப் பயன்படுத்தும் போது, முன் வெளியீட்டுக்கு முன் சிபிதான் பதிப்புகளைப் பயன்படுத்தி விநியோகங்களை உருவாக்குகிறது.

source: Build numbers are not a part of the distribution version and thus are difficult to reference externally, especially so outside the Python ecosystem of tools and standards. A common case where a distribution would need to referenced externally is when resolving a security vulnerability.
ja: ビルド番号は、配布物のバージョンの一部ではなく、従って外部からの、特に Python エコシステムのツール類や標準類の外側からの参照は困難です。配布物が外部からの参照を必要とするようなケースとしては、セキュリティ上の脆弱性を解決しようとする場合がよくあるケースです。
pt_br: Os números de construção não fazem parte da versão de distribuição e, portanto, são difíceis de se referir externamente, especialmente fora do ecossistema do Python de ferramentas e padrões. Um caso comum em que uma distribuição precisa ser referenciada externamente é quando se resolve uma vulnerabilidade de segurança.
ru: Номера сборок не являются частью версии дистрибутива, поэтому на них сложно ссылаться извне, особенно за пределами экосистемы инструментов и стандартов Python. Чаще всего внешние ссылки на дистрибутив требуются при устранении уязвимости в системе безопасности.
ta: உருவாக்க எண்கள் விநியோக பதிப்பின் ஒரு பகுதியாக இல்லை, இதனால் வெளிப்புறமாகக் குறிப்பிடுவது கடினம், குறிப்பாக கருவிகள் மற்றும் தரங்களின் பைதான் சுற்றுச்சூழல் அமைப்புக்கு வெளியே. பாதுகாப்பு பாதிப்பைத் தீர்க்கும்போது ஒரு வழங்கல் வெளிப்புறமாகக் குறிப்பிட வேண்டிய ஒரு பொதுவான வழக்கு.

source: Due to this limitation, new distributions which need to be referenced externally **should not** use build numbers when building the new distribution. Instead a **new distribution version** should be created for such cases.
eo: Pro tiu limigo, nova distribuo, kiun oni referencas ekstere, **ne uzu** konstruo-numerojn dum konstruado de la nova distribuo. Por tiu bezono, oni kreu **novan distribuo-version**.
ja: この制約のゆえに、外部から参照される必要がある新たな配布物は、新しい配布物をビルドする際にビルド番号を使う **べきではありません** 。そのような場合には、代わりに **新しい配布物バージョン** が作成されるべきです。
pt_br: Devido a esta limitação, novas distribuições que precisam ser referenciadas externamente **não devem** usar números de construção ao construir a nova distribuição. Em vez disso, deve ser criada uma **nova versão de distribuição** para esses casos.
ru: Из-за этого ограничения новые дистрибутивы, на которые необходимо ссылаться извне, **не должны** использовать номера сборок при сборке нового дистрибутива. Вместо этого в таких случаях следует создавать **новую версию дистрибутива**.
ta: இந்த வரம்பு காரணமாக, புதிய விநியோகத்தை உருவாக்கும் போது வெளிப்புறமாக குறிப்பிட வேண்டிய புதிய விநியோகங்கள் ** ** உருவாக்க எண்களைப் பயன்படுத்தக்கூடாது. அதற்கு பதிலாக ** புதிய விநியோக பதிப்பு ** இதுபோன்ற நிகழ்வுகளுக்கு உருவாக்கப்பட வேண்டும்.

source: language implementation and version tag
eo: lingva etikedo
ja: 言語の実装とバージョンタグ
pt_br: implementação da linguagem e tag de versão
ru: реализация языка и тег версии
ta: மொழி செயல்படுத்தல் மற்றும் பதிப்பு குறிச்சொல்

source: E.g. 'py27', 'py2', 'py3'.
eo: Ekz. «py27», «py2», «py3».
ja: 例えば、 'py27' ・ 'py2' ・ 'py3' 。
pt_br: p.ex., 'py27', 'py2', 'py3'.
ru: Например, 'py27', 'py2', 'py3'.
ta: எ.கா. 'PY27', 'PY2', 'PY3'.

source: abi tag
eo: abietikedo
ja: abi タグ
ru: метка abi
ta: அபி நாள்

source: E.g. 'cp33m', 'abi3', 'none'.
eo: Ekz. «cp33m», «abi3», «none».
ja: 例えば、 'cp33m' ・ 'abi3' ・ 'none' 。
pt_br: p.ex., 'cp33m', 'abi3', 'none'.
ru: Например, 'cp33m', 'abi3', 'none'.
ta: எ.கா. 'cp33m', 'abi3', 'எதுவுமில்லை'.

source: platform tag
eo: platforma etikedo
ja: プラットフォームタグ
ru: тег платформы
ta: இயங்குதள குறிச்சொல்

source: E.g. 'linux_x86_64', 'any'.
eo: Ekz. «linux_x86_64», «any».
ja: 例えば、 'linux_x86_64' ・ 'any' 。
pt_br: p.ex., 'linux_x86_64', 'any'.
ru: Например, 'linux_x86_64', 'any'.
ta: எ.கா. 'லினக்ச்_எக்ச் 86_64', 'ஏதேனும்'.

source: For example, ``distribution-1.0-1-py27-none-any.whl`` is the first build of a package called 'distribution', and is compatible with Python 2.7 (any Python 2.7 implementation), with no ABI (pure Python), on any CPU architecture.
eo: Ekzemple, ``distribuo-1.0-1-py27-none-any.whl`` estas la unua konstruo de pako nomita «distribuo» kaj kongruas kun Python 2.7 (ajna realigo de Python 2.7), sen aplika binara interfaco (pura Python), sur ajna ĉefprocesora arĥitekturo.
ja: 例えば、 ``distribution-1.0.1-py27-none-any.whl`` とは、 'distribution' と呼ばれるパッケージの最初のビルドであって、 Python 2.7 (任意の Python 2.7 実装) で動作し、 ABI を持たず (即ち純 Python) 、任意の CPU アーキテクチャで動作するということです。
pt_br: Por exemplo, ``distribution-1.0-1-py27-none-any.whl`` é a primeira construção de um pacote chamado 'distribution' e é compatível com Python 2.7 (qualquer implementação Python 2.7), com sem ABI (puro Python), em qualquer arquitetura de CPU.
ru: Например, ``distribution-1.0-1-py27-none-any.whl`` - это первая сборка пакета под названием "distribution", совместимая с Python 2.7 (любой реализацией Python 2.7), без ABI (чистый Python), на любой архитектуре процессора.
ta: எடுத்துக்காட்டாக, `` வழங்கல் -1.0-1-PY27-NONE-Any.Whl`` என்பது 'வழங்கல்' என்று அழைக்கப்படும் ஒரு தொகுப்பின் முதல் கட்டமைப்பாகும், மேலும் இது பைதான் 2.7 (எந்த பைத்தான் 2.7 அமலாக்கமும்) உடன் இணக்கமானது, பநிஇ இல்லாமல் (தூய்மையானது பைதான்), எந்த சிபியு கட்டிடக்கலையிலும்.

source: The last three components of the filename before the extension are called "compatibility tags." The compatibility tags express the package's basic interpreter requirements and are detailed in PEP 425.
eo: La lastaj tri komponantj de la dosiernomo antaŭ la sufikso nomiĝas «kongruecaj etikedoj». Tiaj etikedoj esprimas la bazajn postulojn de la pako pri interpretilo kaj estas difinitaj en PEP 425.
ja: ファイル名の拡張子を除いて最後の３個の構成要素は、"互換性タグ" と呼ばれます。互換性タグは、インタープリタに対するそのパッケージの基本的な要求事項を表現しており、 PEP 425 に詳しく書かれています。
pt_br: Os últimos três componentes do nome do arquivo antes da extensão são chamados de "tags de compatibilidade". As tags de compatibilidade expressam os requisitos básicos do interpretador do pacote e são detalhadas na PEP 425.
ru: Последние три компонента имени файла перед расширением называются "тегами совместимости". Теги совместимости выражают основные требования пакета к интерпретатору и подробно описаны в PEP 425.
ta: நீட்டிப்புக்கு முன் கோப்பு பெயரின் கடைசி மூன்று கூறுகள் "பொருந்தக்கூடிய குறிச்சொற்கள்" என்று அழைக்கப்படுகின்றன. பொருந்தக்கூடிய குறிச்சொற்கள் தொகுப்பின் அடிப்படை மொழிபெயர்ப்பாளர் தேவைகளை வெளிப்படுத்துகின்றன, மேலும் அவை PEP 425 இல் விவரிக்கப்பட்டுள்ளன.

source: Escaping and Unicode
eo: Eskapado kaj Unikodo
ja: エスケープとユニコード
pt_br: Escape e Unicode
ru: Экранирование и Юникод
ta: தப்பித்தல் மற்றும் யூனிகோட்

source: As the components of the filename are separated by a dash (``-``, HYPHEN-MINUS), this character cannot appear within any component. This is handled as follows:
eo: Ĉar la komponantoj de la dosiernomo estas apartigitaj per streketo (``-``, HYPHEN-MINUS), tiu signo ne povas aperi ene de komponanto. Oni pritraktas tion jene:
ja: ファイル名の構成要素がダッシュ (``-`` つまり HYPHEN-MINUS) で分離されているので、この文字は構成要素の中に出現してはなりません。これは次のように取り扱われます:
pt_br: Como os componentes do nome do arquivo são separados por um traço (``-``, HYPHEN-MINUS), este caractere não pode aparecer em nenhum componente. Isso é tratado da seguinte maneira:
ru: Поскольку компоненты имени файла разделены тире (``-``, HYPHEN-MINUS), этот символ не может появиться ни в одном компоненте. Это решается следующим образом:
ta: கோப்பு பெயரின் கூறுகள் ஒரு கோடு (`` -``, ஐபன்-மைனச்) மூலம் பிரிக்கப்படுவதால், இந்த பாத்திரம் எந்த கூறுகளிலும் தோன்ற முடியாது. இது பின்வருமாறு கையாளப்படுகிறது:

source: In distribution names, any run of ``-_.`` characters (HYPHEN-MINUS, LOW LINE and FULL STOP) should be replaced with ``_`` (LOW LINE), and uppercase characters should be replaced with corresponding lowercase ones. This is equivalent to regular :ref:`name normalization <name-normalization>` followed by replacing ``-`` with ``_``. Tools consuming wheels must be prepared to accept ``.`` (FULL STOP) and uppercase letters, however, as these were allowed by an earlier version of this specification.
eo: En nomo de distribuo, ajna sinsekvo de skribsignoj ``-_.`` (HYPHEN-MINUS, LOW LINE kaj FULL STOP) estu anstataŭigita per ``_`` (LOW LINE), kaj majuskloj estu anstataŭigitaj per la respondantaj minuskloj. Tio ekvivalentas ordinaran :ref:`normigon de nomo <name-normalization>` sekvitan de anstataŭigado de ``-`` per ``_``. Ilo konsumanta wheel devas akcepti ``.`` (FULL STOP) kaj majusklojn, ĉar tiuj estis permesataj de malnova versio de ĉi tiu specifo.
ja: 配布物の名前の部分では、 ``-_.`` (HYPHEN-MINUS ・ LOW LINE ・ FULL STOP) の文字は、すべて ``_`` (LOW LINE) で置き換えられるべきで、かつ、大文字はすべて対応する小文字に置き換えられるべきです。これは、通常の :ref:`名前の正規化 <name-normalization>` の後に ``-`` を ``_`` で置き換えるのと同じです。 wheel ファイルを入力とするツールは、 ``.`` (FULL STOP) や大文字を受け入れる準備ができていなければなりませんが、しかし、それはこの仕様の初期のバージョンで許されていたからです。
pt_br: Em nomes de distribuição, qualquer ocorrência de caracteres ``-_.`` (HYPHEN-MINUS, LOW LINE e FULL STOP) deve ser substituída por ``_`` (LOW LINE) e caracteres maiúsculos devem ser substituídos pelos minúsculos correspondentes. Isso é equivalente à :ref:`normalização de nome <name-normalization>` regular da :pep:`503` seguida pela substituição de ``-`` por ``_``. Porém, ferramentas que usem wheels devem estar preparadas para aceitar ``.`` (FULL STOP) e letras maiúsculas, pois estes eram permitidos por uma versão anterior desta especificação.
ru: В именах дистрибутивов любые пробелы символов ``-_.`` (HYPHEN-MINUS, LOW LINE и FULL STOP) должны быть заменены на ``_`` (LOW LINE), а прописные символы должны быть заменены на соответствующие строчные. Это эквивалентно регулярной :ref:`нормализации имени <имя-нормализация>` с последующей заменой ``-`` на ``_``. Инструменты, использующие колеса, должны быть готовы принять ``.`` (FULL STOP) и заглавные буквы, так как они были разрешены в более ранней версии этой спецификации.
ta: விநியோக பெயர்களில், `` -_. . இது வழக்கமானதாகும்: ref: `பெயர் இயல்பாக்கம் <பெயர்-இயல்பாக்கம்>` தொடர்ந்து `` -`` ஐ `` _`` உடன் மாற்றுவதன் மூலம். `` .` (முழு நிறுத்தம்) மற்றும் பெரிய எழுத்துக்களை ஏற்றுக்கொள்ள கருவிகள் எடுக்கும் சக்கரங்கள் தயாராக இருக்க வேண்டும், இருப்பினும், இந்த விவரக்குறிப்பின் முந்தைய பதிப்பால் இவை அனுமதிக்கப்பட்டன.

source: Version numbers should be normalised according to the :ref:`Version specifier specification <version-specifiers>`. Normalised version numbers cannot contain ``-``.
eo: Versia numero estu normigita laŭ :ref:`la specifo pri versio-specifilo <version-specifiers>`. Normigita versia numero ne enhavas ``-``.
ja: バージョン番号は、 `バージョン指定子仕様 <version-specifiers>` に従って正規化されなければなりません。正規化済みのバージョン番号は ``-`` を含んでいてはなりません。
pt_br: Os números de versão devem ser normalizados de acordo com a :ref:`especificação de especificadores de versão <version-specifiers>`. Os números de versão normalizados não podem conter ``-``.
ru: Номера версий должны быть нормализованы в соответствии с :ref:`Спецификация спецификатора версии <version-specifiers>`. Нормализованные номера версий не могут содержать ``-``.
ta: பதிப்பு எண்களை இயல்பாக்க வேண்டும்: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>`. இயல்பாக்கப்பட்ட பதிப்பு எண்களில் `` -`` இருக்க முடியாது.

source: The remaining components may not contain ``-`` characters, so no escaping is necessary.
eo: La ceteraj komponantoj ne povas enhavi la signon ``-``; tial nenia kodŝanĝo necesas.
ja: 残りの構成要素は、 ``-`` 文字を含んでいてはいけないので、エスケープ処理を行う必要がありません。
pt_br: Os componentes restantes não podem conter caracteres ``-``, portanto, nenhum escape é necessário.
ru: Остальные компоненты не могут содержать символов ``-``, поэтому экранирование не требуется.
ta: மீதமுள்ள கூறுகளில் `` -`` எழுத்துக்கள் இல்லை, எனவே தப்பிப்பது தேவையில்லை.

source: Tools producing wheels should verify that the filename components do not contain ``-``, as the resulting file may not be processed correctly if they do.
eo: Ilo generanta wheel konfirmu, ke la dosiernomo-komponantoj ne enhavas ``-``, ĉar alie la rezulta dosiero eble ne estos ĝuste pritraktita.
ja: wheel ファイルを生成するツールはファイル名部分の構成要素が ``-`` を含んでいないことを検証しなければなりませんが、これは、もし含んでいれば結果として生成されたファイルが正しく処理されないかもしれないからです。
pt_br: Ferramentas que produzem wheels devem verificar se os componentes do nome de arquivo não contêm ``-``, pois o arquivo resultante pode não ser processado corretamente se contiverem.
ru: Утилиты, создающие колеса, должны убедиться, что компоненты имени файла не содержат ``-``, так как в противном случае результирующий файл может быть обработан некорректно.
ta: சக்கரங்களை உருவாக்கும் கருவிகள் கோப்பு பெயர் கூறுகளில் `` -`` ஐக் கொண்டிருக்கவில்லை என்பதை சரிபார்க்க வேண்டும், ஏனெனில் அவை செய்தால் அவை சரியாக செயலாக்கப்படாது.

source: The archive filename is Unicode. It will be some time before the tools are updated to support non-ASCII filenames, but they are supported in this specification.
eo: La arĥiva dosiernomo estas Unikoda. Povas esti, ke iloj ankoraŭ ne estas ĝisdatigitaj por ne-Askia dosiernomo, sed ĉi tiu specifo subtenas tian dosiernomon.
ja: アーカイブのファイル名は Unicode です。いくつかのツールでは非 ASCII 文字のファイル名をサポートするように更新されるまでに幾らかの時間がかかるかもしれませんが、しかし、この仕様ではサポートされているのです。
pt_br: O nome do arquivo é Unicode. Levará algum tempo até que as ferramentas sejam atualizadas para oferecer suporte a nomes de arquivos não ASCII, mas eles são suportados nesta especificação.
ru: Имя архивного файла имеет формат Unicode. Пройдет некоторое время, прежде чем инструменты будут обновлены для поддержки имен файлов, отличных от ASCII, но в данной спецификации они поддерживаются.
ta: காப்பக கோப்பு பெயர் யூனிகோட். ASCII அல்லாத கோப்பு பெயர்களை ஆதரிப்பதற்காக கருவிகள் புதுப்பிக்கப்படுவதற்கு சில காலம் ஆகும், ஆனால் அவை இந்த விவரக்குறிப்பில் ஆதரிக்கப்படுகின்றன.

source: The filenames *inside* the archive are encoded as UTF-8. Although some ZIP clients in common use do not properly display UTF-8 filenames, the encoding is supported by both the ZIP specification and Python's ``zipfile``.
eo: La dosiernomoj *en* la arĥivo estas konditaj laŭ UTF-8. Kvantam kelkaj ofte uzataj ZIP-klientoj ne ĝuste montras dosiernomon en UTF-8, tiu kodado estas subtenata kaj de la normo ZIP kaj la modulo ``zipfile`` de Python.
ja: アーカイブの *中にある* ファイルのファイル名は、 UTF-8 でエンコードされています。 ZIP クライアントのいくつかは共通して UTF-8 のファイル名を正常に表示しませんが、このエンコーディングは ZIP の仕様でも Python の ``zipfile`` の仕様でも、共にサポートされています。
pt_br: Os nomes de arquivos *dentro* do arquivo são codificados como UTF-8. Embora alguns clientes ZIP em uso comum não exibam nomes de arquivo UTF-8 apropriadamente, a codificação é suportada pela especificação ZIP e pelo ``zipfile`` do Python.
ru: Имена файлов *внутри* архива кодируются как UTF-8. Хотя некоторые распространенные ZIP-клиенты не отображают имена файлов в кодировке UTF-8, эта кодировка поддерживается как спецификацией ZIP, так и ``zipfile`` в Python.
ta: கோப்பு பெயர்கள் * உள்ளே * காப்பகம் யுடிஎஃப் -8 என குறியாக்கம் செய்யப்படுகிறது. பொதுவான பயன்பாட்டில் உள்ள சில சிப் வாடிக்கையாளர்கள் யுடிஎஃப் -8 கோப்பு பெயர்களைக் சரியாகக் காட்டவில்லை என்றாலும், குறியாக்கம் சிப் விவரக்குறிப்பு மற்றும் பைதானின் `` சிப்ஃபைல்`` ஆகிய இரண்டாலும் ஆதரிக்கப்படுகிறது.

source: File contents
eo: Dosieraj enhavoj
ja: ファイルの内容
pt_br: Conteúdo dos arquivos
ru: Содержимое файлов
ta: கோப்பு உள்ளடக்கங்கள்

source: The contents of a wheel file, where {distribution} is replaced with the :ref:`normalized name <name-normalization>` of the package, e.g. ``beaglevote`` and {version} is replaced with its :ref:`normalized version <version-specifiers-normalization>`, e.g. ``1.0.0``, (with dash/``-`` characters replaced with underscore/``_`` characters in both fields) consist of:
eo: La enhavo de wheel-dosiero, en kiu {distribution} estas anstataŭigita per la :ref:`normigita <name-normalization>` de la pako, ekz. ``beaglevote``, kaj {version} estas anstataŭigita per la :ref:`normigita versio <version-specifiers-normalization>`, ekz. ``1.0.0``, konsistas el la jeno:
ru: Содержимое файла wheel, где {distribution} заменено на :ref:`нормализованное название <name-normalization>` пакета, например ``beaglevote``, а {version} заменено на его :ref:`нормализованную версию <version-specifiers-normalization>`, например ``1.0.0``, (с символами тире/``-`` замененными на символы подчеркивания/``_`` в обоих полях) состоит из:
ta: ஒரு சக்கர கோப்பின் உள்ளடக்கங்கள், அங்கு {distribution} மாற்றப்படுகிறது: ref: `இயல்பாக்கப்பட்ட பெயர் <பெயர்-இயல்பாக்கம்>` தொகுப்பின், எ.கா. `` பீக்லெவோட்`` மற்றும் {version} அதன் மூலம் மாற்றப்படுகிறது: குறிப்பு: `இயல்பாக்கப்பட்ட பதிப்பு <பதிப்பு-விவரக்குறிப்புகள்-இயல்பாக்கம்>`, எ.கா. `` 1.0.0``, (கோடு/`` -`` எழுத்துக்கள் அடிக்கோடிட்டுக் காட்டுகின்றன/`` _`` இரு துறைகளிலும் எழுத்துக்கள்) பின்வருமாறு:

source: ``/``, the root of the archive, contains all files to be installed in ``purelib`` or ``platlib`` as specified in ``WHEEL``. ``purelib`` and ``platlib`` are usually both ``site-packages``.
eo: ``/``, la radiko de la arĥivo, enhavas ĉiujn dosierojn instalotajn al ``purelib`` aŭ ``platlib`` laŭ la specifo en ``WHEEL``. Kaj ``purelib`` kaj ``platlib`` estas ofte ``site-packages``.
ja: アーカイブのルートディレクトリに当たる ``/`` は、``WHEEL`` で指定されている通り ``purelib`` または ``platlib`` にインストールされるファイルをすべて含んでいます。通常は、 ``purelib`` や ``platlib`` はいずれも ``site-packages`` です。
pt_br: ``/``, a raiz do arquivo, contém todos os arquivos a serem instalados em ``purelib`` ou ``platlib`` conforme especificado em ``WHEEL``. ``purelib`` e ``platlib`` são normalmente ``site-packages``.
ru: ``/``, корень архива, содержит все файлы, которые должны быть установлены в ``purelib`` или ``platlib``, как указано в ``WHEEL``. ``purelib`` и ``platlib`` обычно являются ``сайт-пакетами``.
ta: ``/``, காப்பகத்தின் வேர், `` வீல்`` இல் குறிப்பிடப்பட்டுள்ளபடி `` பியூரிலிப்` அல்லது `` பிளாட்ட்லிப்`` இல் நிறுவப்பட வேண்டிய அனைத்து கோப்புகளையும் கொண்டுள்ளது. `` purelib`` மற்றும் `` பிளாட்ட்லிப்`` ஆகியவை வழக்கமாக `` தள-பேக்கேச்கள்`.

source: ``{distribution}-{version}.dist-info/`` contains metadata.
eo: ``{distribuo}-{versio}.dist-info/`` enhavas metadatenojn.
ja: ``{distribution}-{version}.dist-info/`` はメタデータを含んでいます。
pt_br: ``{distribution}-{version}.dist-info/`` contém metadados.
ru: ``{distribution}-{version}.dist-info/`` содержит метаданные.
ta: `{distribution}-{version} .dist-info/` `மெட்டாடேட்டாவைக் கொண்டுள்ளது.

source: :file:`{distribution}-{version}.dist-info/licenses/` contains license files.
eo: :file:`{distribution}-{version}.dist-info/licenses/` enhavas licenco-dosierojn.
ru: :file:`{distribution}-{version}.dist-info/licenses/` содержит файлы лицензий.
ta: : கோப்பு: `{distribution}-{version} .dist-info/உரிமங்கள்/` உரிமக் கோப்புகளைக் கொண்டுள்ளது.

source: ``{distribution}-{version}.data/`` contains one subdirectory for each non-empty install scheme key not already covered, where the subdirectory name is an index into a dictionary of install paths (e.g. ``data``, ``scripts``, ``headers``, ``purelib``, ``platlib``).
eo: ``{distribuo}-{versio}.data/`` enhavas po unu subdosierujo por ĉiu nemalplena instalskema ŝlosilo ne jam pritraktita, je kio la nomo de subdosierujo estas indico de vortaro de instalaj dosierlokoj (ekz. ``data``, ``scripts``, ``headers``, ``purelib``, ``platlib``).
ja: ``{distribution}-{version}.data/`` は、すでにカバーされているものは別として、サブディレクトリ名がインストールパスの辞書への (例えば、 ``data``, ``scripts``, ``headers``, ``purelib``, ``platlib`` のような) 指示子になっているような、空ではないそれぞれのインストールスキームに対応したディレクトリを含みます。
pt_br: ``{distribution}-{version}.data/`` contém um subdiretório para cada chave de esquema de instalação não vazia ainda não coberta, onde o nome do subdiretório é um índice em um dicionário de caminhos de instalação (p.ex., ``data``, ``scripts``, ``headers``, ``purelib``, ``platlib``).
ru: ``{distribution}-{version}.data/`` содержит один подкаталог для каждого непустого ключа схемы установки, который еще не покрыт, где имя подкаталога является индексом в словаре путей установки (например, ``data``, ``cripts``, ``headers``, ``purelib``, ``platlib``).
ta: `{distribution}-{version} .data/` `என்பது காலியாக இல்லாத நிறுவல் அல்லாத திட்ட விசைக்கு ஒரு துணை அடைவைக் கொண்டுள்ளது, அங்கு துணை அடைவு பெயர் நிறுவல் பாதைகளின் அகராதியாக ஒரு குறியீடாகும் (எ.கா.` தரவு`, `` ச்கிரிப்ட்கள்``, `` தலைப்புகள்``, `` பியூரிலிப்``, `` பிளாட்ட்லிப்``).

source: Python scripts must appear in ``scripts`` and begin with exactly ``b'#!python'`` in order to enjoy script wrapper generation and ``#!python`` rewriting at install time. They may have any or no extension. The ``scripts`` directory may only contain regular files.
eo: Python-programeto devas ekzisti en ``scripts`` kaj komenciĝi ekzakte per ``b'#!python'``, se oni deziras generi programeto-volvaĵon kaj reskribadon de ``#!python`` dum instalado. Ĝi povas havi iun ajn aŭ neniun dosiersufikson. La dosierujo ``scripts`` povas enhavi nur ordinarajn dosierojn.
ru: Python-скрипты должны находиться в ``scripts` и начинаться с ``b'#!python``, чтобы во время установки можно было сгенерировать обертку скрипта и переписать ``#!python``. Они могут иметь любое расширение или не иметь его. Каталог ``scripts`` может содержать только обычные файлы.
ta: பைதான் ச்கிரிப்ட்கள் `` ச்கிரிப்ட்கள்`` இல் தோன்ற வேண்டும், மேலும் ச்கிரிப்ட் ரேப்பர் தலைமுறையை அனுபவிப்பதற்காக சரியாக `` பி '#! அவர்களுக்கு ஏதேனும் அல்லது நீட்டிப்பு இல்லை. `` ச்கிரிப்ட்கள்` `கோப்பகத்தில் வழக்கமான கோப்புகள் மட்டுமே இருக்கலாம்.

source: ``{distribution}-{version}.dist-info/METADATA`` is Metadata version 1.1 or greater format metadata.
eo: ``{distribution}-{version}.dist-info/METADATA`` estas metadatenoj de la formo Metadatenoj versio 1.1 aŭ pli nova.
ja: ``{distribution}-{version}.dist-info/METADATA`` は、バージョン 1.1 またはそれ以上のフォーマットのメタデータです。
pt_br: ``{distribution}-{version}.dist-info/METADATA`` é Metadata versão 1.1 ou metadados de formato superior.
ru: ``{distribution}-{version}.dist-info/METADATA`` - это метаданные формата Metadata версии 1.1 или выше.
ta: ``{distribution}-{version}.dist-info/METADATA`` is Metadata version 1.1 or greater வடிவம் metadata.

source: ``{distribution}-{version}.dist-info/WHEEL`` is metadata about the archive itself in the same basic key: value format::
eo: ``{distribuo}-{versio}.dist-info/WHEEL`` estas metadatenoj pri la arĥivo mem en la sama baza formo «ŝlosilo: valoro»::
ja: ``{distribution}-{version}.dist-info/WHEEL`` は、同様のキー:バリュー形式で表現されたアーカイブそのものに関するメタデータです::
pt_br: ``{distribution}-{version}.dist-info/WHEEL`` são metadados sobre p arquivo em si no mesmo formato "chave: valor"::
ru: ``{distribution}-{version}.dist-info/WHEEL`` - это метаданные о самом архиве в том же базовом формате key: value::
ta: `` {distribution}-{version} .dist-info/wheel`` என்பது ஒரே அடிப்படை விசையில் காப்பகத்தைப் பற்றிய மெட்டாடேட்டா: மதிப்பு வடிவம் ::
