Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Comparison of project names is case insensitive and treats arbitrarily long runs of underscores, hyphens, and/or periods as equal. For example, if you register a project named ``cool-stuff``, users will be able to download it or declare a dependency on it using any of the following spellings: ``Cool-Stuff``, ``cool.stuff``, ``COOL_STUFF``, ``CoOl__-.-__sTuFF``.
eo: Komparo de projektaj nomoj estas usklecblinda kaj ne distingas inter ajna nombro da substrekoj, streketoj kaj/aŭ punktoj. Ekzemple, se vi registrus projekton nomitan ``bonaj-ajhoj``, oni povus elŝuti ĝin aŭ deklari dependecon sur ĝi per la jenaj nomoj: ``Bonaj-Ajhoj``, ``bonaj.ajhoj``, ``BONAJ_AJHOJ``, ``BoNaJ__-.-__aJhOJ``.
ja: プロジェクト名の比較では、大文字小文字を区別せず、また、アンダースコア・ハイフン・ピリオドは何文字連続していても同じものとして扱います。例えば、あなたが ``cool-stuff`` という名前のプロジェクトを登録したなら、利用者がダウンロードしたり依存関係を宣言したりするのに、次に挙げる綴りのいずれであっても使うことができます: ``Cool-Stuff`` ・ ``cool.stuff`` ・ ``COOL_STUFF`` ・ ``CoOl__-.-__sTuFF`` 。
pt_br: A comparação de nomes de projetos não diferencia maiúsculas de minúsculas e trata sequências arbitrariamente longas de sublinhados, hífenes e/ou pontos como iguais. Por exemplo, se você registrar um projeto chamado ``cool-stuff``, os usuários poderão baixá-lo ou declarar uma dependência dele usando qualquer uma das seguintes formas de escrever: ``Cool-Stuff``, ``cool.stuff``, ``COOL_STUFF``, ``CoOl__-.-__sTuFF``.
ru: Сравнение имен проектов не зависит от регистра и рассматривает произвольно длинные символы подчеркивания, дефиса и/или точки как одинаковые. Например, если вы зарегистрируете проект с именем ``cool-stuff``, пользователи смогут загрузить его или объявить зависимость от него, используя любое из следующих написаний: ``Cool-Stuff``, ``cool.stuff``, ``COOL_STUFF``, ``CoOl__-.-__sTuFF``.
ta: திட்டப் பெயர்களின் ஒப்பீடு என்பது வழக்கு உணர்வற்றது மற்றும் தன்னிச்சையாக நீண்டகாலமாக அண்டர்ச்கோர்ச், ஐபன்கள் மற்றும்/அல்லது காலங்களை சமமாக நடத்துகிறது. எடுத்துக்காட்டாக, நீங்கள் `` கூல்-ச்டஃப்`` என்ற திட்டத்தை பதிவுசெய்தால், பயனர்கள் அதை பதிவிறக்கம் செய்ய முடியும் அல்லது பின்வரும் ஏதேனும் எழுத்துப்பிழைகளைப் பயன்படுத்தி அதை சார்புநிலையை அறிவிக்க முடியும்: `` கூல்-ச்டஃப்``, `` கூல்.ச்டஃப் ``, `` கூல்_ச்டஃப்``, `` கூல் __- .-__ பொருள்``.

source: Put the version of your project.
eo: Enmetu la version de via projekto.
ja: プロジェクトのバージョンを書いてください。
pt_br: Coloque a versão do seu projeto.
ru: Положите версию вашего проекта.
ta: உங்கள் திட்டத்தின் பதிப்பை வைக்கவும்.

source: Some more complicated version specifiers like ``2020.0.0a1`` (for an alpha release) are possible; see the :ref:`specification <version-specifiers>` for full details.
eo: Eblas pli komplika versio-specifilo kiel ``2020.0.0a1`` (por alfa-eldono); vidu la :ref:`specifon <version-specifiers>` por plenaj detaloj.
ja: (アルファ版のリリース用の) ``2020.0.0a1`` のようなもっと込み入ったバージョン指定子も可能ですので、 詳細については :ref:`仕様 <version-specifiers>` を見てください。
pt_br: Alguns especificadores de versão mais complicados como ``2020.0.0a1`` (para uma versão alfa) são possíveis; veja a :ref:`especificação <version-specifiers>` para detalhes completos.
ru: Возможны и более сложные спецификации версий, например ``2020.0.0a1`` (для альфа-версии); подробности см. в :ref:`specification <version-specifiers>`.
ta: `` 2020.0.0A1`` (ஆல்பா வெளியீட்டிற்கு) போன்ற இன்னும் சில சிக்கலான பதிப்பு குறிப்பிடப்பட்டவர்கள் சாத்தியமானவை; முழு விவரங்களுக்கு `விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>` ஐப் பார்க்கவும்.

source: This field is required, although it is often marked as dynamic using
eo: Ĉi tiu kampo estas deviga, sed ĝi estas ofte markita dinamika per
ja: 動的であるとマークされることがしばしばではありますが、このフィールドは必須のものです
pt_br: Este campo é necessário, embora muitas vezes seja marcado como dinâmico usando
ru: Это поле является обязательным, хотя часто его помечают как динамическое с помощью
ta: இந்த புலம் தேவைப்படுகிறது, இருப்பினும் இது பெரும்பாலும் மாறும் என்று குறிக்கப்பட்டுள்ளது

source: This allows use cases such as filling the version from a ``__version__`` attribute or a Git tag. Consult the :ref:`single-source-version` discussion for more details.
eo: Tio permesas uzkazon kiel generadon de version el atributo ``__version__`` aŭ etikedo ĉe Git. Vidu la diskuton :ref:`single-source-version` por pliaj detaloj.
ru: Это позволяет использовать такие случаи, как заполнение версии из атрибута ``__version__`` или тега Git. За более подробной информацией обратитесь к обсуждению :ref:`single-source-version`.
ta: `` __Version__`` பண்புக்கூறு அல்லது ஒரு அறிவிலி குறிச்சொல்லிலிருந்து பதிப்பை நிரப்புவது போன்ற நிகழ்வுகளைப் பயன்படுத்த இது அனுமதிக்கிறது. மேலும் விவரங்களுக்கு `ஒற்றை-மூல-பதிப்பு` கலந்துரையாடலை அணுகவும்.

source: Dependencies and requirements
eo: Dependecoj kaj postuloj
ja: 依存関係と要求事項
pt_br: Dependências e requisitos
ru: Зависимости и требования
ta: சார்பு மற்றும் தேவைகள்

source: ``dependencies``/``optional-dependencies``
ru: ``зависимости``/``опциональные-зависимости``
ta: `` சார்புகள்``/`` விருப்ப-சார்புநிலைகள்``

source: If your project has dependencies, list them like this:
eo: Se via projekto havas dependecojn, listigu ilin jene:
ja: もしプロジェクトに依存関係があるなら、このように列挙してください:
pt_br: Se o seu projeto tiver dependências, liste-as assim:
ru: Если у вашего проекта есть зависимости, перечислите их следующим образом:
ta: உங்கள் திட்டத்திற்கு சார்பு இருந்தால், அவற்றை இப்படி பட்டியலிடுங்கள்:

source: See :ref:`Dependency specifiers <dependency-specifiers>` for the full syntax you can use to constrain versions.
eo: Vidu :ref:`Dependeco-specifilojn <dependency-specifiers>` por la plena sintakso por limigi versiojn.
ja: バージョンに制限をかけるために使えるあらゆるシンタックスについては、 :ref:`依存関係指定子 <dependency-specifiers>` を参照してください。
pt_br: Veja :ref:`Especificadores de dependências <dependency-specifiers>` para a sintaxe completa que você pode usar para restringir versões.
ru: Полный синтаксис, который можно использовать для ограничения версий, см. в :ref:`Спецификаторы зависимости <dependency-specifiers>`.
ta: காண்க: குறிப்பு: `சார்பு குறிப்பான்கள் <சார்பு-விவரக்குறிப்புகள்>` முழு தொடரியல் மூலம் பதிப்புகளைக் கட்டுப்படுத்த நீங்கள் பயன்படுத்தலாம்.

source: You may want to make some of your dependencies optional, if they are only needed for a specific feature of your package. In that case, put them in ``optional-dependencies``.
eo: Oni eble volas laŭvoligi kelkajn dependecojn, se ili nur necesas por specifa funkcio de la pako. Tiukaze, metu ilin en ``optional-dependencies``.
ja: パッケージの特定の機能にのみ必要なものであれば、依存関係のうちのいくつかをオプションにしたい時があるかもしれません。そのような場合には、 ``optional-dependencies`` に置きましょう。
pt_br: Você pode querer fazer algumas de suas dependências opcionais, se forem necessárias apenas para um recurso específico do seu pacote. Nesse caso, coloque-os em ``optional-dependencies``.
ru: Вы можете сделать некоторые из ваших зависимостей необязательными, если они необходимы только для определенной функции вашего пакета. В этом случае поместите их в `` по выбору-зависимости``.
ta: உங்கள் தொகுப்பின் ஒரு குறிப்பிட்ட அம்சத்திற்கு மட்டுமே தேவைப்பட்டால், உங்கள் சார்புகளில் சிலவற்றை விருப்பமாக மாற்ற நீங்கள் விரும்பலாம். அவ்வாறான நிலையில், அவற்றை `` விருப்ப-சார்புநிலைகளில் வைக்கவும்`.

source: Each of the keys defines a "packaging extra". In the example above, one could use, e.g., ``pip install your-project-name[gui]`` to install your project with GUI support, adding the PyQt5 dependency.
eo: Ĉiu ŝlosilo difinas «pakan ekstraĵon». En la ĉi-supra ekzemplo, oni povus uzi ekzemploe ``pip install nomo-de-via-projekto[gui]`` por instali vian projekton kun subteno por grafika fasado, aldonante dependecon sur PyQt5.
ja: キーのぞれぞれが "余分のパッケージング <packaging extra>" を定義します。上の例では、プロジェクトを例えば GUI サポート付きでインストールするためには ``pip install your-project-name[gui]`` を使うことができます。
pt_br: Cada uma das chaves define um "extra de empacotamento". No exemplo acima, pode-se usar, por exemplo, ``pip install seu-projeto-de-nome[gui]`` para instalar seu projeto com suporte GUI, adicionando a dependência PyQt5.
ru: Каждый из ключей определяет "дополнительную упаковку". В примере выше можно использовать, например, ``pip install your-project-name[gui]`` для установки проекта с поддержкой графического интерфейса, добавив зависимость PyQt5.
ta: விசைகள் ஒவ்வொன்றும் "பேக்கேசிங் கூடுதல்" என்பதை வரையறுக்கிறது. மேலே உள்ள எடுத்துக்காட்டில், ஒருவர் பயன்படுத்தலாம், எ.கா.

source: ``requires-python``
ru: ``требуется-python``
ta: ``-பைதான் தேவை`

source: This lets you declare the minimum version of Python that you support [#requires-python-upper-bounds]_.
eo: Tio ebligas deklari la minimuman version de Python subtenatan [#requires-python-upper-bounds]_.
ja: これによってサポートされている Python の上限のバージョンを宣言することができます [#requires-python-upper-bounds]_ 。
pt_br: Isso permite que você declare a versão mínima de Python que você suporta [#requires-python-upper-bounds]_.
ru: Это позволяет объявить минимальную версию Python, которую вы поддерживаете [#requires-python-upper-bounds]_.
ta: நீங்கள் ஆதரிக்கும் பைத்தானின் குறைந்தபட்ச பதிப்பை அறிவிக்க இது உங்களை அனுமதிக்கிறது [#-க்கு-பைதான்-மேல்-பிணைப்புகள் தேவை] _.

source: Creating executable scripts
eo: Krei ruleblajn komandojn
ja: 実行可能なスクリプトを作成する
pt_br: Criando scripts executáveis
ru: Создание исполняемых скриптов
ta: இயங்கக்கூடிய ச்கிரிப்ட்களை உருவாக்குதல்

source: To install a command as part of your package, declare it in the ``[project.scripts]`` table.
eo: Por instali komandon kiel parton de via pako, deklaru ĝin en la tabelo ``[project.scripts]]``.
ja: パッケージの一部としてコマンドをインストールするためには、 ``[project.scripts]`` テーブルで宣言してください。
pt_br: Para instalar um comando como parte do seu pacote, declare-o na tabela ``[project.scripts]``.
ru: Чтобы установить команду как часть вашего пакета, объявите ее в таблице ``[project.scripts]``.
ta: உங்கள் தொகுப்பின் ஒரு பகுதியாக ஒரு கட்டளையை நிறுவ, அதை `` [project.scripts] `` அட்டவணையில் அறிவிக்கவும்.

source: In this example, after installing your project, a ``spam-cli`` command will be available. Executing this command will do the equivalent of ``import sys; from spam import main_cli; sys.exit(main_cli())``.
eo: En ĉi tiu ekzemplo, instalado de la projekto disponigos la komandon ``spam-cli``. Rulado de tiu komando ekvivalentas ``import sys; from spam import main_cli; sys.exit(main_cli())``.
ru: В этом примере после установки вашего проекта будет доступна команда ``spam-li``. Выполнение этой команды эквивалентно выполнению команды ``import sys; from spam import main_cli; sys.exit(main_cli())``.
ta: இந்த எடுத்துக்காட்டில், உங்கள் திட்டத்தை நிறுவிய பிறகு, ஒரு `` ச்பேம்-கிளி`` கட்டளை கிடைக்கும். இந்த கட்டளையை செயல்படுத்துவது `` இறக்குமதி sys க்கு சமமானதாக இருக்கும்; ச்பேம் இறக்குமதி Main_cli இலிருந்து; sys.exit (main_cli ()) ``.

source: On Windows, scripts packaged this way need a terminal, so if you launch them from within a graphical application, they will make a terminal pop up. To prevent this from happening, use the ``[project.gui-scripts]`` table instead of ``[project.scripts]``.
eo: Sur Windows, programeto tiel pakita bezonus terminalon; tial, se oni lanĉus ĝin el grafika programo, terminalo ŝprucus. Por malhelpi tion, uzu la tabelon ``[project.gui-scripts]`` anstataŭ ``[project.scripts]``.
ja: Windows では、このやり方でパッケージされたスクリプト群はターミナルを必要としますので、グラフィカルなアプリケーションの内部から起動した場合にはターミナルがポップアップすることでしょう。これが起きないようにするためには、 ``[project.scripts]`` の代わりに ``[project.gui-scripts]`` テープルを使ってください。
pt_br: No Windows, scripts empacotados desta forma precisam de um terminal, então se você lançá-los de dentro de uma aplicação gráfica, eles vão fazer um pop up de terminal. Para evitar que isso aconteça, use o ``[project.gui-scripts]`` tabela em vez de ``[project.scripts]``.
ru: В Windows скрипты, упакованные таким образом, нуждаются в терминале, поэтому если вы запустите их из графического приложения, они вызовут всплывающий терминал. Чтобы этого не происходило, используйте таблицу ``[project.gui-scripts]`` вместо ``[project.scripts]``.
ta: சாளரங்களில், இந்த வழியில் தொகுக்கப்பட்ட ச்கிரிப்ட்களுக்கு ஒரு முனையம் தேவை, எனவே நீங்கள் அவற்றை ஒரு வரைகலை பயன்பாட்டிலிருந்து தொடங்கினால், அவை ஒரு முனையத்தை பாப் அப் செய்யும். இது நிகழாமல் தடுக்க, `` [project.scripts] `` என்பதற்கு பதிலாக `` [project.gui-scripts] `` அட்டவணையைப் பயன்படுத்தவும்.

source: In that case, launching your script from the command line will give back control immediately, leaving the script to run in the background.
eo: Tiukaze, lanĉado de via programo el la komandlinio tuj redonos regpovon al vi, lastante la programon ruliĝi malfone.
ja: そうすることで、コマンドラインからスクリプトを起動してスクリプトがバックグラウンドで走らせることですぐに制御を取り戻すことができるでしょう。
pt_br: Nesse caso, a inicialização do seu script a partir da linha de comando devolve o controle imediatamente, deixando o script a ser executado em segundo plano.
ru: В этом случае запуск скрипта из командной строки сразу же вернет управление, оставив скрипт работать в фоновом режиме.
ta: அவ்வாறான நிலையில், உங்கள் ச்கிரிப்டை கட்டளை வரியிலிருந்து தொடங்குவது உடனடியாக கட்டுப்பாட்டைக் கொடுக்கும், ச்கிரிப்டை பின்னணியில் இயக்கும்.

source: The difference between ``[project.scripts]`` and ``[project.gui-scripts]`` is only relevant on Windows.
eo: La diferenco inter ``[project.scripts]`` kaj ``[project.gui-scripts]`` nur gravas sur Windows.
ja: Windows 上では、 ``[project.scripts]`` と ``[project.gui-scripts]`` の間の差異だけが実質的に効果を持ちます。
pt_br: A diferença entre ``[project.scripts]`` e ``[project.gui-scripts]`` é apenas relevante no Windows.
ru: Разница между ``[project.scripts]`` и ``[project.gui-scripts]`` актуальна только для Windows.
ta: `` [Project.scripts] `` மற்றும் `` [project.gui-scripts] `` ஆகியவற்றுக்கு இடையேயான வேறுபாடு சாளரங்களில் மட்டுமே பொருத்தமானது.

source: About your project
eo: Pri via projekto
ja: あなたのプロジェクトについて
pt_br: Sobre o seu projeto
ru: О вашем проекте
ta: உங்கள் திட்டம் பற்றி

source: ``authors``/``maintainers``
ru: ``авторы``/ ``майнтейнеры``
ta: `` ஆசிரியர்கள்`/`` பராமரிப்பாளர்கள்``

source: Both of these fields contain lists of people identified by a name and/or an email address.
eo: Ambaŭ tiuj kampoj enhavas listojn de homoj identigitaj per nomoj kaj/aŭ retpoŝtaj adresoj.
ja: これらのフィールドは両方とも名前とメールアドレスの両方またはいずれかで識別される人々のリストを含みます。
pt_br: Ambos os campos contêm listas de pessoas identificadas por um nome e/ou um endereço de e-mail.
ru: Оба эти поля содержат списки людей, идентифицированных по имени и/или адресу электронной почты.
ta: இந்த இரண்டு துறைகளிலும் ஒரு பெயர் மற்றும்/அல்லது மின்னஞ்சல் முகவரியால் அடையாளம் காணப்பட்ட நபர்களின் பட்டியல்கள் உள்ளன.

source: ``description``
ja: ``説明 <description>``
ta: `` விளக்கம்``

source: This should be a one-line description of your project, to show as the "headline" of your project page on PyPI (`example <pypi-pip_>`_), and other places such as lists of search results (`example <pypi-search-pip_>`_).
eo: Tio estu unulinia priskribo de via projekto montrota kiel ka titolo de via projekta paĝo ĉe PyPI (`jene <pypi-pip_>`_), kaj interalie en listoj de serĉrezultoj (`jene <pypi-search-pip_>`_).
ja: これは、PyPI におけるプロジェクトページの "ヘッドライン" (`例 <pypi-pip_>`_) や検索結果 (`例 <pypi-search-pip_>`_) のような他の場所で表示されるものなので、１行でプロジェクトの説明をしたものであるべきです。
pt_br: Esta deve ser uma descrição de uma linha do seu projeto, para mostrar como o "título" da sua página do projeto no PyPI (`exemplo <pypi-pip_>`_), e outros lugares como listas de resultados de pesquisa (`exemplo <pypi-search-pip_>`_).
ru: Это должно быть однострочное описание вашего проекта, которое будет отображаться в качестве "заголовка" страницы вашего проекта на PyPI (`пример <pypi-pip_>`_), а также в других местах, таких как списки результатов поиска (`пример <pypi-search-pip_>`_).
ta: இது உங்கள் திட்டத்தின் ஒரு வரி விளக்கமாக இருக்க வேண்டும், இது உங்கள் திட்ட பக்கத்தின் "தலைப்பு" என்று பைபியில் (`எடுத்துக்காட்டு <pypi-pip_>` _), மற்றும் தேடல் முடிவுகளின் பட்டியல்கள் போன்ற பிற இடங்கள் (`எடுத்துக்காட்டு < pypi-search-pip_> `_).

source: ``readme``
ta: `` ரீட்மே``

source: This is a longer description of your project, to display on your project page on PyPI. Typically, your project will have a ``README.md`` or ``README.rst`` file and you just put its file name here.
eo: Tiu estas longa priskribo de via projekto montrota sur la projekta paĝo ĉe PyPI. Ofte, oni simple metas la dosiernomon de dosiero ``README.md`` aŭ ``README.rst``.
ja: これはプロジェクトの長めの説明文で、PyPI のプロジェクトページに表示されます。典型的には、プロジェクトには ``README.md`` か ``README.rst`` のファイルが存在するものなので、その場合にはここにはそのファイル名だけを書いておけば良いでしょう。
pt_br: Esta é uma descrição mais longa do seu projeto, para exibir em sua página do projeto em PyPI. Tipicamente, seu projeto terá um arquivo ``README.md`` ou ``README.rst`` e você acabou de colocar seu nome de arquivo aqui.
ru: Это более длинное описание вашего проекта, которое будет отображаться на странице вашего проекта на PyPI. Обычно у вашего проекта есть файл ``README.md`` или ``README.rst``, и вы просто помещаете его имя сюда.
ta: இது உங்கள் திட்டத்தின் நீண்ட விளக்கமாகும், இது உங்கள் திட்ட பக்கத்தில் PYPI இல் காண்பிக்க. பொதுவாக, உங்கள் திட்டத்தில் `` readme.md`` அல்லது `` Readme.rst`` கோப்பைக் கொண்டிருக்கும், மேலும் அதன் கோப்பு பெயரை இங்கே வைக்கவும்.

source: The README's format is auto-detected from the extension:
eo: La dosierformo de README estas aŭtomate divenita el la dosiersufikso:
ja: README のフォーマットは拡張から自動的に検出されます:
pt_br: O formato do README é detectado automaticamente a partir da extensão:
ru: Формат README определяется автоматически по расширению:
ta: README இன் வடிவம் நீட்டிப்பிலிருந்து தானாக கண்டறியப்படுகிறது:

source: ``README.md`` → `GitHub-flavored Markdown <gfm_>`_,
eo: ``README.md`` → `GitHub-stila Markdown <gfm_>`_,
ja: ``README.md`` → `GitHub 流のマークダウン <gfm_>`_ 、
pt_br: ``README.md`` → `Markdown no estilo do GitHub <gfm_>`_,
ta: `` Readme.md`` → `கிதுப்-சுவை கொண்ட மார்க் பேரூர் <gfm_>` _,

source: ``README.rst`` → `reStructuredText <rest_>`_ (without Sphinx extensions).
eo: ``README.rst`` → `reStructuredText <rest_>`_ (sen etendaĵoj Sphinx).
ja: ``README.rst`` → `reStructuredText <rest_>_`_ (ただし Sphinx 拡張なし)。
pt_br: ``README.rst`` → reStructuredText <rest_>`_ (sem extensões do Sphinx).
ru: ``README.rst`` → ``reStructuredText <rest_>`_ (без расширений Sphinx).
ta: `` Readme.rst`` → `மறுசீரமைப்பு <REST_>` _ (Sphinx நீட்டிப்புகள் இல்லாமல்).

source: You can also specify the format explicitly, like this:
eo: Vi povas ankaŭ eksplici la dosierformon jene:
ja: 次のようにしてフォーマットを明示的に指定することもできます:
pt_br: Você também pode especificar o formato explicitamente assim:
ru: Вы также можете указать формат в явном виде, например, так:
ta: இது போன்ற வடிவமைப்பையும் நீங்கள் வெளிப்படையாகக் குறிப்பிடலாம்:

source: ``license``
ja: ``ライセンス``
ru: ``лицензия``
ta: `` உரிமம்``

source: As a general rule, it is a good idea to use a standard, well-known license, both to avoid confusion and because some organizations avoid software whose license is unapproved.
eo: Ĝenerale, estas bone uzi norman, bone konatan licencon, kaj por eviti konfuziĝon, kaj ĉar kelkaj organizaĵoj evitas programon sen aprobita licenco.
ru: Как правило, лучше использовать стандартную, хорошо известную лицензию, как для того, чтобы избежать путаницы, так и потому, что некоторые организации избегают программ, лицензия которых не утверждена.
ta: ஒரு பொதுவான விதியாக, குழப்பத்தைத் தவிர்ப்பதற்காக, ஒரு நிலையான, நன்கு அறியப்பட்ட உரிமத்தைப் பயன்படுத்துவது நல்லது, ஏனெனில் சில நிறுவனங்கள் உரிமம் அங்கீகரிக்கப்படாத மென்பொருளைத் தவிர்ப்பதால்.

source: If your project is licensed with a license that doesn't have an existing SPDX identifier, you can create a custom one in format ``LicenseRef-[idstring]``. The custom identifiers must follow the SPDX specification, `clause 10.1 <spdxcustomids_>`_ of the version 2.2 or any later compatible one.
eo: Se via projekto havas licencon sen ekzistanta SPDX-identigilo, vi povas krei propran identigilo de la formo ``LicenseRef-[identigilo]``. La propra identigilo devas obei `paragrafon 10.1 <spdxcustomids_>`_ de la normo SPDX, versio 2.2 aŭ ajna pli nova kongrua versio.
ru: Если ваш проект лицензирован по лицензии, для которой не существует идентификатора SPDX, вы можете создать собственный идентификатор в формате ``LicenseRef-[idstring]``. Пользовательские идентификаторы должны соответствовать спецификации SPDX, `пункт 10.1 <spdxcustomids_>`_ версии 2.2 или любой более поздней совместимой.
ta: ஏற்கனவே உள்ள SPDX அடையாளங்காட்டி இல்லாத உரிமத்துடன் உங்கள் திட்டத்திற்கு உரிமம் வழங்கப்பட்டால், நீங்கள் தனிப்பயன் ஒன்றை வடிவத்தில் உருவாக்கலாம் `` licenseref- [idstring] ``. தனிப்பயன் அடையாளங்காட்டிகள் SPDX விவரக்குறிப்பைப் பின்பற்ற வேண்டும், `பிரிவு 10.1 <spdxcustomids_> _ _ _ _ _ _ அல்லது பின்னர் இணக்கமான ஏதேனும் ஒன்று.

source: ``license-files``
ru: ``лицензионные файлы``
ta: `` உரிம-கோப்புகள்``

source: This is a list of license files and files containing other legal information you want to distribute with your package.
eo: Tio estas listo de licenco-dosieroj kaj dosieroj enhavantaj aliajn jurajn informojn, kiujn vi volas distribui kun via pako.
ru: Это список лицензионных файлов и файлов, содержащих другую юридическую информацию, которую вы хотите распространить вместе с пакетом.
ta: இது உங்கள் தொகுப்புடன் விநியோகிக்க விரும்பும் பிற சட்டத் தகவல்களைக் கொண்ட உரிமக் கோப்புகள் மற்றும் கோப்புகளின் பட்டியல்.

source: The glob patterns must follow the specification:
eo: La patroneo devas observi la specifon:
ru: Шаблоны glob должны соответствовать спецификации:
ta: குளோப் வடிவங்கள் விவரக்குறிப்பைப் பின்பற்ற வேண்டும்:

source: Alphanumeric characters, underscores (``_``), hyphens (``-``) and dots (``.``) will be matched verbatim.
eo: Literoj, ciferoj, substrekoj (``_``), streketoj (``-``) kaj punktoj (``.``) prezentas sin laŭlitere.
ru: Буквенно-цифровые символы, знаки подчеркивания (``_``), дефисы (``-``) и точки (``.``) будут соответствовать дословно.
ta: எண்ணெழுத்து எழுத்துக்கள், அடிக்கோடிட்டு (`` _``), ஐபன்கள் (`` -``) மற்றும் புள்ளிகள் (`` .``) ஆகியவை சொற்களஞ்சியத்துடன் பொருந்தும்.

source: Special characters: ``*``, ``?``, ``**`` and character ranges: [] are supported.
eo: La metasignoj ``*``, ``?``, ``**`` kaj signintervaloj [] eblas.
ru: Специальные символы: ``*``, ``?``, ``**`` и диапазоны символов: [] поддерживаются.
ta: சிறப்பு எழுத்துக்கள்: ``*``, ``? ``, `` ** `` மற்றும் எழுத்து வரம்புகள்: [] ஆதரிக்கப்படுகின்றன.

source: Path delimiters must be the forward slash character (``/``).
eo: Dosierloko-apartigilo devas esti la suprenstreko (``/``).
ru: Разделителями путей должны быть символы прямой косой черты (``/``).
ta: பாதை டிலிமிட்டர்கள் முன்னோக்கி ச்லாச் எழுத்துக்குறியாக இருக்க வேண்டும் (``/``).

source: Patterns are relative to the directory containing :file:`pyproject.toml`, and thus may not start with a slash character.
eo: Patroneo estas relativa al la dosierujo enhavanta :file:`pyproject.toml`, kaj tial ne povas komenciĝi per suprenstreko.
ru: Шаблоны являются относительными к директории, содержащей :file:`pyproject.toml`, и поэтому не могут начинаться с символа слэша.
ta: வடிவங்கள் கொண்ட கோப்பகத்துடன் தொடர்புடையவை: கோப்பு: `pyproject.toml`, இதனால் ஒரு ச்லாச் பாத்திரத்துடன் தொடங்கக்கூடாது.

source: Parent directory indicators (``..``) must not be used.
eo: Indikilo de patra dosierujo (``..``) devas esti ne uzita.
ru: Индикаторы родительских каталогов (``..``) не должны использоваться.
ta: பெற்றோர் அடைவு குறிகாட்டிகள் (`` ..``) பயன்படுத்தப்படக்கூடாது.

source: Each glob must match at least one file.
eo: Ĉiu patroneo devas kongrui kun almenaŭ unu dosiero.
ru: Каждый glob должен соответствовать хотя бы одному файлу.
ta: ஒவ்வொரு குளோபும் குறைந்தது ஒரு கோப்பை பொருத்த வேண்டும்.

source: Literal paths are valid globs. Any characters or character sequences not covered by this specification are invalid.
eo: Eksplicita dosierloko estas valida patroneo. Ajna skribsigno aŭ signoĉeno ne diskutita de ĉi tiu specifo estas nevalida.
ru: Буквальные пути являются допустимыми глобусами. Любые символы или последовательности символов, не предусмотренные данной спецификацией, являются недопустимыми.
ta: நேரடி பாதைகள் செல்லுபடியாகும் குளோப்கள். இந்த விவரக்குறிப்பால் மூடப்படாத எந்த எழுத்துக்கள் அல்லது எழுத்துக்குறி காட்சிகளும் தவறானவை.
