Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: It is the intent of this spec that the API should be thought of as URL endpoints that return data, whose interpretation is defined by the version of that data, and then serialized into the target serialization format.
eo: Ĉi tiu normo intencas, ke oni rigardu la API kiel URL-funpunktojn liverantajn datenojn, kies interpreton difinas la versio de tiuj datenoj, seriigitajn laŭ la cela seriigita dosierformo.
ja: この仕様の意図するところは、API はデータを返す URL エンドポイントであって、その解釈は当該データのバージョンによって定義され、その後にターゲットとなるシリアル化フォーマットにシリアライズされるものであると考えられるべきであるということです。
ru: Согласно этой спецификации, API следует рассматривать как конечные точки URL, которые возвращают данные, интерпретация которых определяется версией этих данных, а затем сериализуются в целевой формат сериализации.
ta: இந்த விவரக்குறிப்பின் நோக்கம், பநிஇ தரவைத் தரும் முகவரி இறுதிப் புள்ளிகளாக கருதப்பட வேண்டும், அதன் விளக்கம் அந்த தரவின் பதிப்பால் வரையறுக்கப்படுகிறது, பின்னர் இலக்கு சீரியலைசேசன் வடிவத்தில் வரிசைப்படுத்தப்படுகிறது.

source: JSON Serialization
eo: JSON-igo
ja: JSON シリアル化
ru: Сериализация JSON
ta: சாதொபொகு சீரியலைசேசன்

source: The following constraints apply to all JSON serialized responses described in this spec:
eo: La sekvaj limigoj validas por ĉiuj JSON-seriigitaj respondoj priskribitaj en ĉi tiu specifo:
ja: 後述の制約は、この仕様で記述されたすべての JSON シリアル化応答に適用されます:
ru: Следующие ограничения применяются ко всем сериализованным ответам JSON, описанным в данной спецификации:
ta: இந்த விவரக்குறிப்பில் விவரிக்கப்பட்டுள்ள அனைத்து சாதொபொகு தொடர் பதில்களுக்கும் பின்வரும் தடைகள் பொருந்தும்:

source: All JSON responses will *always* be a JSON object rather than an array or other type.
eo: Ĉiu JSON-respondo *ĉiam* estos JSON-objekto, ne tabelo aŭ alia tipo.
ja: すべての JSON 応答は、配列やその他の型ではなく *常に* JSON オブジェクトであることでしょう。
ru: Все ответы JSON *всегда* будут представлять собой объект JSON, а не массив или другой тип.
ta: அனைத்து சாதொபொகு பதில்களும் * எப்போதும் * ஒரு வரிசை அல்லது பிற வகையை விட சாதொபொகு பொருளாக இருக்கும்.

source: While JSON doesn't natively support a URL type, any value that represents an URL in this API may be either absolute or relative as long as they point to the correct location. If relative, they are relative to the current URL as if it were HTML.
eo: Kvankam JSON ne indiĝene subtenas URL-datentipon, ajna valoro prezentanta URL en ĉi tiu API povas esti aŭ absoluta aŭ relativa, se ĝi montras la ĝustan lokon. Relativa valoro estas relativa al la aktuala URL, same kiel HTML.
ru: Хотя JSON не поддерживает тип URL, любое значение, представляющее URL в этом API, может быть как абсолютным, так и относительным, если оно указывает на правильное местоположение. Если они относительные, то они относятся к текущему URL, как если бы это был HTML.
ta: சாதொபொகு ஒரு முகவரி வகையை சொந்தமாக ஆதரிக்கவில்லை என்றாலும், இந்த பநிஇ இல் ஒரு முகவரி ஐக் குறிக்கும் எந்த மதிப்பும் சரியான இடத்தை சுட்டிக்காட்டும் வரை முழுமையான அல்லது உறவினராக இருக்கலாம். உறவினர் என்றால், அவை தற்போதைய முகவரி உடன் உஉகுமொ போல தொடர்புடையவை.

source: Additional keys may be added to any dictionary objects in the API responses and clients **MUST** ignore keys that they don't understand.
eo: Ekstraj ŝlosiloj povas esti aldonitaj al iuj ajn vortaraj objektoj en la API-respondoj. Kliento **DEVAS** ignori ŝlosilojn ne kompreneblajn.
ja: API 応答の中の任意の辞書オブジェクトに追加的なキー群を追加しても構いませんし、クライアントは自身が理解しないキー群については **無視しなければなりません** 。
ru: Дополнительные ключи могут быть добавлены к любым объектам словаря в ответах API, и клиенты **МОГУТ** игнорировать ключи, которые они не понимают.
ta: பநிஇ பதில்கள் மற்றும் வாடிக்கையாளர்களில் உள்ள எந்த அகராதி பொருள்களிலும் கூடுதல் விசைகள் சேர்க்கப்படலாம் ** அவர்கள் புரிந்து கொள்ளாத விசைகளை புறக்கணிக்க வேண்டும்.

source: All JSON responses will have a ``meta`` key, which contains information related to the response itself, rather than the content of the response.
eo: Ĉiu JSON-respondo havas ŝlosilon ``meta`` enhavantan informojn pri la respondo mem, ne pri la enhavo de la respondo.
ja: あらゆる JSON 応答は、その応答の内容ではなく応答それ自身に関係する情報を含む ``meta`` キーを持つことでしょう。
ru: Все JSON-ответы имеют ключ ``meta``, который содержит информацию, относящуюся к самому ответу, а не к его содержимому.
ta: அனைத்து சாதொபொகு பதில்களிலும் `` மெட்டா`` விசையைக் கொண்டிருக்கும், அதில் பதிலின் உள்ளடக்கத்தை விட பதில் தொடர்பான தகவல்களைக் கொண்டுள்ளது.

source: All JSON responses will have a ``meta.api-version`` key, which will be a string that contains the :ref:`API versioning specification <simple-repository-api-versioning>` ``Major.Minor`` version number, with the same fail/warn semantics as defined in :ref:`the API versioning specification <simple-repository-api-versioning>`.
eo: Ĉiu JSON-respondo havos ŝlosilon ``meta.api-version``, kiu estas teksto enhavanta la versian numeron ``Maĵora.Minora`` de la :ref:`API-versia specifo <simple-repository-api-versioning>`, kun la sama semantiko pri malsukceso/avertado kiel en :ref:`la API-versia specifo <simple-repository-api-versioning>`.
ja: すべての JSON 応答は、 :ref:`API のバージョン付与に関する仕様 <simple-repository-api-versioning>` で定義されたものと同じ失敗/警告のセマンティクスを持ち、かつ、 :ref:`API のバージョン付与に関する仕様 <simple-repository-api-versioning>` の ``Major.Minor`` の形のバージョン番号を文字列として値に取るような ``meta.api-version`` キーを持つことでしょう。
ru: Все JSON-ответы будут содержать ключ ``meta.api-версия``, который будет представлять собой строку, содержащую номер версии : ссылка:спецификация версионности API <простой репозиторий-апи-версия>` ``Major.Minor``, с той же семантикой fail/warn, которая определена в :ссылка:спецификация версионности API <простой репозиторий-апи-версия>`.
ta: அனைத்து சாதொபொகு பதில்களிலும் `` meta.api-version`` விசைக் கொண்டிருக்கும், இது: ref: `ஏபிஐ பதிப்பு விவரக்குறிப்பு <எளிய-ரோபோசிட்டரி-ஆபி-புரிதல்>` `` `மேசர்.மினோர்` பதிப்பு எண், அதே தோல்வி/எச்சரிக்கை சொற்பொருள்கள்:` ஆப்-டெவிங்-டெவிங்-டெவிங்-டி-அப்-டெவிங்-டி-அப்-டெவிங்-டெவிங்-டெவிங்-டெவிங்-டெவிங்-டெவிங்-டெவிங்-டன்-ரெசோரிங்-டோரிங்-டன்-ரெசோரிச்

source: All requirements of :ref:`the base HTML API specification <simple-repository-api-base>` that are not HTML specific still apply.
eo: Ĉiuj postuloj de :ref:`la baza HTML-API-specifo <simple-repository-api-base>` ne specifaj al HTML estas ankoraŭ observendaj.
ja: :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` のすべての要求事項のうちの HTML に特化したもの以外は、依然として適用されます。
ru: Все требования : ссылка:`базовой спецификации HTML API <простой репозиторий-апи-база>`, не относящиеся к HTML, остаются в силе.
ta: இதன் அனைத்து தேவைகளும்: Ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <Simple-repository-api-base>` அவை உஉகுமொ குறிப்பிட்டவை அல்ல.

source: Keys (at any level) with a leading underscore are reserved as private for index server use. No future standard will assign a meaning to any such key.
eo: Ŝlosiloj (en ajna nivelo) komenciĝanta per substreko estas rezervitaj por privata uzado de indeksa servilo. Neniu estonta normo asignos signifon al tia ŝlosilo.
ja: (どのレベルでも) 先頭にアンダースコアを伴うキーは、インデックスサーバが使うプライベートなものとして予約されています。将来の標準において、このようなキーに意味を付与することはありません。
ru: Ключи (любого уровня) с ведущим символом подчеркивания зарезервированы как частные для использования индексным сервером. Ни один будущий стандарт не будет присваивать значение такому ключу.
ta: ஒரு முன்னணி அடிக்கோடிட்டுக் கொண்ட விசைகள் (எந்த மட்டத்திலும்) குறியீட்டு சேவையக பயன்பாட்டிற்கு தனிப்பட்டதாக ஒதுக்கப்பட்டுள்ளன. அத்தகைய எந்தவொரு விசைக்கும் எதிர்கால தரநிலை ஒரு அர்த்தத்தை ஒதுக்காது.

source: The root URL ``/`` for this spec (which represents the base URL) will be a JSON encoded dictionary which has a two keys:
eo: La projekta radika retadreso ``/`` por ĉi tiu specifo (kiu prezentas la bazan retadreson) estas JSON-kodita vortaro kun du ŝlosiloj:
ja: (ベース URL <base URL> を表現する) この仕様でのルート URL <root URL> ``/`` は、 JSON にエンコードされた辞書であって、二つのキーを持つでしょう:
ru: Корневой URL ``/`` для этой спецификации (который представляет собой базовый URL) будет представлять собой словарь в кодировке JSON, имеющий два ключа:
ta: இந்த விவரக்குறிப்பிற்கான ரூட் முகவரி ``/`` (இது அடிப்படை முகவரி ஐக் குறிக்கிறது) இரண்டு விசைகளைக் கொண்ட சாதொபொகு குறியிடப்பட்ட அகராதியாக இருக்கும்:

source: ``projects``: An array where each entry is a dictionary with a single key, ``name``, which represents string of the project name.
eo: ``projects``: Listo, kies ĉiu ero estas vortaro kun ununura ŝlosilo, ``nomo``, kies valoro estas signoĉeno de la projekta nomo.
ja: ``projects``: 各エントリがディレクトリで単独のキー ``name`` を持つような配列で、(そのキーの値は) プロジェクトの名称を表す文字列です。
ru: ``проекты``: Массив, каждая запись которого представляет собой словарь с одним ключом, ``название``, который представляет собой строку с названием проекта.
ta: `` திட்டங்கள்``: திட்டத்தின் பெயரின் சரத்தைக் குறிக்கும் `` பெயர்`` கொண்ட ஒவ்வொரு நுழைவும் ஒரு அகராதியாக இருக்கும் ஒரு வரிசை.

source: ``meta``: The general response metadata as `described earlier <json-serialization_>`__.
eo: ``meta``: La ĝeneralaj respondaj metadatenoj laŭ `la priskribo ĉi-supra <json-serialization_>`__.
ja: ``meta``: `先述の通り <json-serialization_>`__ の一般的な応答メタデータ。
ru: ``meta``: Общие метаданные ответа, как `описано ранее <Json-сериализация_>`__.
ta: `` மெட்டா``: முன்னர் விவரிக்கப்பட்டுள்ள பொதுவான மறுமொழி மேனிலை தரவு <json-cerialization_> ____.

source: As an example:
eo: Ekzemple:
ja: ひとつの例として:
ru: В качестве примера:
ta: உதாரணமாக:

source: The ``name`` field is the same as the one from :ref:`the base HTML API specification <simple-repository-api-base>`, which does not specify whether it is the non-normalized display name or the normalized name. In practice different implementations of these specs are choosing differently here, so relying on it being either non-normalized or normalized is relying on an implementation detail of the repository in question.
ja: ``name`` フィールドは、:ref:`基本となる HTML API の仕様 <simple-repository-api-base>` からのものと同じで、正規化していないディスプレイ用名称であるのか正規化済みの名称であるのかを指定していません。実際には、これらの仕様の相異なる実装において異なる選択を行うことがあり、その選択によって非正規化名称か正規化名称かは当該リポジトリの実装の詳細に依存します。
ru: Поле ``имя`` совпадает с полем из : ссылка:``базовая спецификация HTML API <простой репозиторий-апи-база>``, в которой не указано, является ли оно ненормализованным отображаемым именем или нормализованным. На практике разные реализации этих спецификаций выбирают по-разному, так что полагаться на то, что это ненормализованное или нормализованное имя, - это полагаться на детали реализации данного репозитория.
ta: `` பெயர்`` புலம் இதிலிருந்து சமம்: ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <எளிய-ரெபோசிட்டரி-API-BASE>`, இது இயல்பாக்கப்படாத காட்சி பெயர் அல்லது இயல்பாக்கப்பட்ட பெயர் என்பதைக் குறிப்பிடவில்லை. நடைமுறையில் இந்த விவரக்குறிப்புகளின் வெவ்வேறு செயலாக்கங்கள் இங்கே வித்தியாசமாகத் தேர்வு செய்கின்றன, எனவே அதை இயல்பாக்காத அல்லது இயல்பாக்கப்படுவதை நம்பியிருப்பது கேள்விக்குரிய களஞ்சியத்தின் செயல்படுத்தல் விவரத்தை நம்பியுள்ளது.

source: While the ``projects`` key is an array, and thus is required to be in some kind of an order, neither :ref:`the base HTML API specification <simple-repository-api-base>` nor this spec requires any specific ordering nor that the ordering is consistent from one request to the next. Mentally this is best thought of as a set, but both JSON and HTML lack the functionality to have sets.
eo: Kvankam la ŝlosilo ``projects`` estas listo kaj tial devas esti ordita, nek :ref:`la baza normo de HTML API <simple-repository-api-base>` nek ĉi tiu normo postulas ian specifan ordon aŭ postulas, ke la ordo restu sama inter petoj. Oni rigardu tion kiel aron, sed nek JSON nek HTML kapablas prezenti aron.
ja: ``projects`` キーは配列なので何らかの種類の順序が要求されますが、 :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` もこの仕様も特定の順序に並べることを要求しておらず、また、あるリクエストと次のものとで順序が変わらないことも要求していません。心情としては、これが (配列ではなく) 集合であると考えるのが最適ですが、 JSON も HTML も集合を扱う機能を欠いています。
ru: Хотя ключ ``проекты`` является массивом и, следовательно, должен быть расположен в определенном порядке, ни : ссылка:``базовая спецификация HTML API <простой репозиторий-апи-база>``, ни эта спецификация не требуют какого-либо определенного порядка, ни того, чтобы порядок был последовательным от одного запроса к другому. Мысленно это лучше всего воспринимать как набор, но и JSON, и HTML не имеют функциональности для создания наборов.
ta: `` திட்டங்கள்`` விசை ஒரு வரிசை, இதனால் ஒருவித வரிசையில் இருக்க வேண்டும், மேலும்: ref: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <எளிய-ரோபோசிட்டரி-API-BASE>` அல்லது இந்த விவரக்குறிப்புக்கு ஏதேனும் குறிப்பிட்ட வரிசைப்படுத்தல் தேவைப்படுகிறது அல்லது வரிசைப்படுத்தல் ஒரு கோரிக்கையிலிருந்து அடுத்ததாக ஒத்துப்போகிறது. மனரீதியாக இது ஒரு தொகுப்பாக சிறந்ததாக கருதப்படுகிறது, ஆனால் சாதொபொகு மற்றும் உஉகுமொ இரண்டுமே தொகுப்புகளைக் கொண்டிருப்பதற்கான செயல்பாட்டைக் கொண்டிருக்கவில்லை.

source: The format of this URL is ``/<project>/`` where the ``<project>`` is replaced by the :ref:`the base HTML API specification <simple-repository-api-base>` normalized name for that project, so a project named "Silly_Walk" would have a URL like ``/silly-walk/``.
eo: La formo de ĉi tiu retadreso estas ``/<projekto>/``, en kiu ``<projekto>`` estas anstataŭigita per la normigita nomo de la projekto laŭ :ref:`la specifo de baza HTML API <simple-repository-api-base>`. Do projekto nomita «Ridinda_Piediro» havus la retadreson ``/ridinda-piediro/``.
ja: この URL のフォーマットは ``/<project>/`` で、 ``<project>`` の部分は :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` にしたがって正規化されたプロジェクト名称であり、したがって、 "Silly_Walk" という名称のプロジェクトであれば ``/silly-walk/`` のような URL を持つことになるでしょう。
ru: Формат этого URL - ``/<проект>/``, где ``<проект>`` заменяется на : ссылка:``базовая спецификация HTML API <простой-репозиторий-апи-база>`` нормализованное имя этого проекта, так что проект с именем " Глупый_ход" будет иметь URL типа ``/глупый_ход/``.
ta: இந்த முகவரி இன் வடிவம் ``/<proget>/`` `` `<திட்டம்>` `என்பதன் மூலம் மாற்றப்படுகிறது: ref:` அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <எளிய-ரோபோசிட்டரி-API-BASE> `அந்த திட்டத்திற்கான இயல்பாக்கப்பட்ட பெயர், எனவே" சில்லி_வல் "போன்ற ஒரு திட்டம்` `` `` `` `` `` `` `` `.

source: ``name``: The normalized name of the project.
eo: ``name``: La normigita nomo de la projekto.
ja: ``name``: そのプロジェクトの正規化された名前。
ru: ``название``: Нормализованное имя проекта.
ta: `` பெயர்``: திட்டத்தின் இயல்பாக்கப்பட்ட பெயர்.

source: ``files``: A list of dictionaries, each one representing an individual file.
eo: ``files``: Listo de vortaroj, po unu por individua dosiero.
ja: ``files``: 辞書のリストで、各辞書が個別のファイルを表現しているもの。
ru: ``файлы``: Список словарей, каждый из которых представляет отдельный файл.
ta: `` கோப்புகள்``: அகராதிகளின் பட்டியல், ஒவ்வொன்றும் ஒரு தனிப்பட்ட கோப்பைக் குறிக்கும்.

source: All of the files listed in the ``files`` key MUST be associated with one of the versions in the ``versions`` key. The ``versions`` key MAY contain versions with no associated files (to represent versions with no files uploaded, if the server has such a concept).
eo: Ĉiu dosiero en la ŝlosilo ``files`` DEVAS esti asociita kun unu el la versioj en la ŝlosilo ``versions``. La ŝlosilo ``versions`` POVAS enhavi version sen asociita dosiero (por versio sen âlsutita dosiero, se la servilo subtenas tiaĵon).
ja: ``files`` キーに列挙されたファイルは、すべて、 ``versions`` キー内のバージョンのひとつに対応していなければなりません。 ``versions`` キーは、 (サーバ側がそのような概念を持っているならば、ファイルなしのバージョンというものを表現するために) 対応するファイルがないバージョンを含んでいても構いません。
ru: Все файлы, перечисленные в ключе ``файлы``, ДОЛЖНЫ быть связаны с одной из версий в ключе ``версии``. Ключ ``версии`` МОЖЕТ содержать версии без ассоциированных файлов (для представления версий без загруженных файлов, если сервер имеет такую концепцию).
ta: `` கோப்புகள்` விசையில் பட்டியலிடப்பட்டுள்ள அனைத்து கோப்புகளும் `` பதிப்புகள்` `விசையில் உள்ள பதிப்புகளில் ஒன்றோடு தொடர்புடையதாக இருக்க வேண்டும். `` பதிப்புகள்`` விசையில் தொடர்புடைய கோப்புகள் இல்லாத பதிப்புகள் இருக்கலாம் (சேவையகத்திற்கு அத்தகைய கருத்து இருந்தால், கோப்புகள் பதிவேற்றப்படாத பதிப்புகளைக் குறிக்க).

source: Each individual file dictionary has the following keys:
eo: Ĉiu individua dosiera vortaro havas la jenajn ŝlosilojn:
ja: 個別のファイルを表す辞書は、それぞれ、次のキーを持ちます:
ru: Каждый отдельный словарь файлов имеет следующие ключи:
ta: ஒவ்வொரு தனிப்பட்ட கோப்பு அகராதியிலும் பின்வரும் விசைகள் உள்ளன:

source: ``filename``: The filename that is being represented.
eo: ``filename``: La dosiernomo prezentata.
ja: ``filename``: 表現しようとしているファイルのファイル名。
ru: ``имя файла``: Имя представляемого файла.
ta: `` கோப்பு பெயர்``: பிரதிநிதித்துவப்படுத்தப்படும் கோப்பு பெயர்.

source: ``url``: The URL that the file can be fetched from.
eo: ``url``: Retadreso, ĉe kiu oni povas elŝuti la dosieron.
ja: ``url``: そこからそのファイルを取得できる URL。
ru: ``url``: URL, с которого может быть получен файл.
ta: `` url``: கோப்பிலிருந்து பெறக்கூடிய முகவரி.

source: ``hashes``: A dictionary mapping a hash name to a hex encoded digest of the file. Multiple hashes can be included, and it is up to the client to decide what to do with multiple hashes (it may validate all of them or a subset of them, or nothing at all). These hash names **SHOULD** always be normalized to be lowercase.
ja: ``hashes``: ハッシュ(関数)の名称と、そのファイルの16進数にエンコードされたハッシュ値 (digest) をマッピングした辞書。複数のハッシュを含むことが可能で、その複数のハッシュを使って何をするのか (全部について検証するのか、サブセットについてなのか、全く何もしないのか) についてはクライアントが決めれば良いことになっています。これらのハッシュの名称は、常に小文字に **正規化 されているべきです** 。
ru: ``хэши``: Словарь, отображающий имя хэша на шестнадцатеричный дайджест файла. Можно включить несколько хэшей, и клиент сам решает, что делать с несколькими хэшами (он может подтвердить все из них или их подмножество, или вообще ничего). Имена хэшей **ОБЯЗАТЕЛЬНО** всегда должны быть приведены к нижнему регистру.
ta: `` ஆச்கள்``: கோப்பின் ஃச் குறியிடப்பட்ட டைசெச்டுக்கு ஒரு ஆச் பெயரை மேப்பிங் செய்வது ஒரு அகராதி. பல ஆச்களைச் சேர்க்கலாம், மேலும் பல ஆச்களை என்ன செய்வது என்று வாடிக்கையாளரின் தீர்மானிக்க வேண்டும் (இது அவை அனைத்தையும் அல்லது அவற்றின் துணைக்குழுவை சரிபார்க்கக்கூடும், அல்லது ஒன்றும் இல்லை). இந்த ஆச் பெயர்கள் ** ** எப்போதும் சிறிய எழுத்துக்களாக இயல்பாக்கப்பட வேண்டும்.

source: The ``hashes`` dictionary **MUST** be present, even if no hashes are available for the file, however it is **HIGHLY** recommended that at least one secure, guaranteed-to-be-available hash is always included.
eo: La vortaro ``hashes`` DEVAS ekzisti, eĉ se neniu haketaĵo disponeblas pri la dosiero. Tamen, estas **REKOMENDEGATE** inkluzivi almenaŭ unu sekuran, garantie haveblan haketaĵon.
ja: ``hashes`` 辞書は、仮にそのファイルについてハッシュがひとつも利用可能でないとしても、 **存在していなければなりません** し、少なくともひとつのセキュアで利用可能であることが保証されているハッシュが常に含まれていることが **とても強く** 推奨されています。
ru: Словарь ``хэши`` **ДОЛЖЕН** присутствовать, даже если для файла нет хэшей, однако **НАСТОЯТЕЛЬНО** рекомендуется всегда включать хотя бы один безопасный, гарантированно доступный хэш.
ta: `` ஆச்கள்` `அகராதி ** இருக்க வேண்டும் **, கோப்புக்கு ஆச்கள் எதுவும் கிடைக்கவில்லை என்றாலும், குறைந்தது ஒரு பாதுகாப்பான, உத்தரவாதமளிக்கும் ஆச் எப்போதும் சேர்க்கப்பட வேண்டும் என்று ** மிகவும் ** பரிந்துரைக்கப்படுகிறது.

source: By default, any hash algorithm available via :py:mod:`hashlib` (specifically any that can be passed to :py:func:`hashlib.new()` and do not require additional parameters) can be used as a key for the hashes dictionary. At least one secure algorithm from :py:data:`hashlib.algorithms_guaranteed` **SHOULD** always be included. At the time of this spec, ``sha256`` specifically is recommended.
ja: デフォルトでは、 :py:mod:`hashlib` を経由して利用可能なハッシュアルゴリズム (特に、:py:func:`hashlib.new()` に渡すことができて、かつ、追加のパラメータを要求しないもの) は、すべて、ハッシュの辞書のキーとして使うことができます。 :py:`data:`hashlib.algorithms_guaranteed` から選択した少なくともひとつのセキュアなアルゴリズムが、常に、 **含まれているべきです** 。この仕様の時点では、特に ``sha256`` が推奨されます。
ru: По умолчанию в качестве ключа для словаря хэшей может использоваться любой алгоритм, доступный через :py:mod:`hashlib` (в частности, все, которые могут быть переданы в :py:func:`hashlib.new()` и не требуют дополнительных параметров). По крайней мере один безопасный алгоритм из :py: данные:`hashlib. алгоритмы_гарантированные` **ОБЯЗАТЕЛЬНО** всегда должен быть включен. На момент создания данной спецификации рекомендуется использовать ``sha256``.
ta: இயல்பாக, எந்த ஆச் வழிமுறையும் மூலம் கிடைக்கும்: PY: MOD: `Hashlib` (குறிப்பாக ஏதேனும் தேர்ச்சி பெறக்கூடியது: PY: FUNC:` Hashlib.new () `மற்றும் கூடுதல் அளவுருக்கள் தேவையில்லை) ஆசேச் அகராதிக்கு ஒரு திறவுகோலாகப் பயன்படுத்தப்படலாம். இருந்து குறைந்தது ஒரு பாதுகாப்பான வழிமுறை: PY: தரவு: `hashlib.algorithms_ugranaled` ** ** எப்போதும் சேர்க்கப்பட வேண்டும். இந்த விவரக்குறிப்பின் போது, `` சா 256`` குறிப்பாக பரிந்துரைக்கப்படுகிறது.

source: ``requires-python``: An **optional** key that exposes the :ref:`core-metadata-requires-python` metadata field. Where this is present, installer tools **SHOULD** ignore the download when installing to a Python version that doesn't satisfy the requirement.
eo: ``requires-python``: **Nedeviga** ŝlosilo por la metadatena kampo :ref:`core-metadata-requires-python`. Se ĝi ekzistas, instalilo **IGNORU** la elŝuton dum instalado al Python-versio ne plenumanta la postulon.
ja: ``requires-python``: :ref:`core-metadata-requires-python` メタデータフィールドを顕にする **オプションの** キー。これが存在しているなら、インストーラツール群は、要求事項を満足しない Python のバージョンへインストールしようとする場合、ダウンロードを **無視するべきです** 。
ru: ``requires-python``: **опциональный** ключ, который раскрывает поле метаданных : ссылка:`core-metadata-requires-python`. При наличии этого поля инструменты установки **ДОЛЖНЫ** игнорировать загрузку при установке на версию Python, которая не удовлетворяет этому требованию.
ta: ``-பைதான் தேவை ``: ஒரு ** விருப்ப ** விசை: ref: `கோர்-மெட்டாடேட்டா-முன்நிபந்தனைகள்-மெட்டாடேட்டா புலம். இது இருக்கும் இடத்தில், நிறுவி கருவிகள் ** ** தேவையை நிறைவு செய்யாத பைதான் பதிப்பில் நிறுவும் போது பதிவிறக்கத்தை புறக்கணிக்க வேண்டும்.

source: Unlike ``data-requires-python`` in :ref:`the base HTML API specification <simple-repository-api-base>`, the ``requires-python`` key does not require any special escaping other than anything JSON does naturally.
eo: Malkiel ``data-requires-python`` en :ref:`la baza specifo de HTML API <simple-repository-api-base>`, la ŝlosilo ``requires-python`` ne postulas specialan kodŝanĝadon alian ol la implicitan kodŝanĝon de JSON.
ja: :ref:`基本となる HTML API の仕様 <simple-repository-api-base>` の中の ``data-requires-python`` とは異なって、 ``requires-python`` キーは、JSON が自然に要求することを除けば、特別なエスケープを要求しません。
ru: В отличие от ``данные-запросы-python`` в : ссылка:``базовая спецификация HTML API <simple-repository-api-base>``, ключ ``запросы-python`` не требует никакого специального экранирования, кроме того, что JSON делает естественно.
ta: `` தரவு-வேண்டுகோள்கள்-பைதான்`` இல்: குறிப்பு: `அடிப்படை உஉகுமொ பநிஇ விவரக்குறிப்பு <Simple-Reposition-api-base>` `,` `-` விசைக்கு தேவையில்லை சாதொபொகு இயல்பாகவே எதையும் தவிர வேறு எந்த சிறப்பு தப்பிப்பும் தேவையில்லை.

source: When this is a dictionary of hashes instead of a boolean, then all the same requirements and recommendations as the ``hashes`` key hold true for this key as well.
eo: Se ĉi tiu estas vortaro da haketaĵoj kaj ne bulea valoro, do la postuloj kaj rekomendoj por la ŝlosilo ``hashes`` ankaŭ validas por ĉi tiu ŝlosilo.
ja: これがブーリアンの代わりにハッシュ辞書である時には、 ``hashes`` キーが true を値に取る場合と同じ要求事項と推奨事項の全てが、このキーにも課されます。
ru: Если это словарь хэшей, а не булевых значений, то все те же требования и рекомендации, что и для ключа ``хэши``, справедливы и для этого ключа.
ta: இது ஒரு பூலியனுக்கு பதிலாக ஆச்களின் அகராதியாக இருக்கும்போது, `` ஆச்கள்`` விசையின் அதே தேவைகள் மற்றும் பரிந்துரைகள் அனைத்தும் இந்த விசையிலும் உண்மையாகவே இருக்கின்றன.
