Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Some projects may need to publish version information for external APIs that aren't the version of the module itself. Such projects should define their own project-specific ways of obtaining the relevant information at runtime. For example, the standard library's :mod:`ssl` module offers multiple ways to access the underlying OpenSSL library version::
eo: Kelkaj projektoj devas publikigi versiajn informojn de eksteraj API-oj, kiuj ne estas la versio de la modulo mem. Tia projekto difinu sian projekto-specifan manieron akiri la informon runtempe. Ekzemple, la modulo :mod:`ssl` de la norma biblioteko provizas plurajn manierojn por atingi la version de la biblioteko OpenSSL::
ja: プロジェクトによっては、モジュール自身のバージョン番号ではないバージョン情報を外部の API 群向けに公開する必要があるかもしれません。そのようなプロジェクトでは、ランタイムに適切な情報を取得するための、そのプロジェクト特有の方法を定義するべきです。例えば、標準ライブラリの :mod:`ssl` モジュールは、下敷きにしている OpenSSL ライブラリのバージョンにアクセスするための複数の方法を提供しています::
ru: Некоторым проектам может потребоваться опубликовать информацию о версии внешних API, которая не является версией самого модуля. Такие проекты должны определить свои собственные, специфичные для проекта способы получения соответствующей информации во время выполнения. Например, модуль :mod:`ssl` стандартной библиотеки предлагает несколько способов доступа к версии библиотеки OpenSSL::
ta: சில திட்டங்கள் தொகுதியின் பதிப்பாக இல்லாத வெளிப்புற பநிஇ களுக்கான பதிப்பு தகவல்களை வெளியிட வேண்டியிருக்கலாம். இத்தகைய திட்டங்கள் இயக்க நேரத்தில் தொடர்புடைய தகவல்களைப் பெறுவதற்கான தங்கள் சொந்த திட்ட-குறிப்பிட்ட வழிகளை வரையறுக்க வேண்டும். எடுத்துக்காட்டாக, நிலையான நூலகத்தின்: MOD: `SSL` தொகுதி அடிப்படை OpenSSL நூலக பதிப்பை அணுக பல வழிகளை வழங்குகிறது ::

source: Some more examples of unusual version numbers are given in a `blog post <versions-seth-larson_>`_ by Seth Larson.
eo: Pliaj ekzemploj de strangaj versiaj numeroj troviĝas en `artikolo <versions-seth-larson_>`_ de Seth Larson.
ja: 普通でないバージョン番号のいくつかの例が Seth Larson によって `ブログポスト <versions.seth-larson_>`_ に挙げられています。
pt_br: Mais alguns exemplos de números de versão incomuns são fornecidos em uma `postagem no blog <versions-seth-larson_>`_ de Seth Larson.
ru: Еще несколько примеров необычных номеров версий приведены в `блоговом посте <версии-Сет-Ларсон_>`_ Сета Ларсона.
ta: அசாதாரண பதிப்பு எண்களின் இன்னும் சில எடுத்துக்காட்டுகள் `வலைப்பதிவு இடுகை <பதிப்புகள்-செத்-லார்சன்_>` _ சேத் லார்சனால் கொடுக்கப்பட்டுள்ளன.

source: For some personal viewpoints on this issue, see these blog posts: `by Hynek Schlawak <semver-hynek-schlawack_>`_, `by Donald Stufft <semver-donald-stufft_>`_, `by Bernát Gábor <semver-bernat-gabor_>`_, `by Brett Cannon <semver-brett-cannon_>`_. For a humoristic take, read about ZeroVer_.
eo: Por pli personaj vidpunktoj pri ĉi tiu temo, vidu la jenajn artikolojn: `far Hynek Schlawak <semver-hynek-schlawack_>`_, `far Donald Stufft <semver-donald-stufft_>`_, `far Bernát Gábor <semver-bernat-gabor_>`_, `far Brett Cannon <semver-brett-cannon_>`_. Por humuro, legu pri ZeroVer_.
ja: この問題に関する個人的な観点については、次のようなブログポストを見てください: `Hynek Schlawak によるもの <semver-hynek-schlawack_>`_ ・ `Donald Stufft によるもの <semver-donald-stufft_>`_ ・ `Bernát Gábor によるもの <semver-bernat-gabor_>`_ ・ `Brett Cannon によるもの <semver-brett-cannon_>`_ 。ユーモラスなものが良ければ、 ZeroVer_ について読んでみてください。
pt_br: Para alguns pontos de vista pessoais sobre este assunto, consulte estas postagens do blog: `de Hynek Schlawak <semver-hynek-schlawack_>`_, `de Donald Stufft <semver-donald-stufft_>`_, `de Bernát Gábor <semver-bernat- gabor_>`_, `de Brett Cannon <semver-brett-cannon_>`_. Para uma visão humorística, leia sobre ZeroVer_.
ru: Некоторые личные точки зрения на этот вопрос см. в этих статьях блога: Гинек Шлавак <semver-гинек-шлавак_>`_, Дональд Стаффт <semver-дональд-стаффт_>`_, Бернат Габор <semver-бернат-габор_>`_, Бретт Кэннон <semver-бретт-кэннон_>`_. Для юмористического восприятия читайте о ZeroVer_.
ta: இந்த இதழில் சில தனிப்பட்ட கண்ணோட்டங்களுக்கு, இந்த வலைப்பதிவு இடுகைகளைப் பார்க்கவும்: `ஐனெக் ச்க்லவாக் <செம்வர்-ஐனெக்-ச்லாவாக்_>` _, `டொனால்ட் ச்டஃப் <செம்வர்-டொனால்ட்-ச்டஃப்ட்_>` _, `பெர்னட் கோபர் <செம்வெர்-வெர்னட்- gabor_> `_,` பிரட் கேனன் <semver-brett-cannon_> `_. நகைச்சுவையான எடுத்துக்கொள்ள, Zerover_ பற்றி படியுங்கள்.

source: A full list mapping the top level names available for import to the distribution packages that provide those import packages and modules may be obtained through the standard library's :func:`importlib.metadata.packages_distributions` function. This means that even code that is attempting to infer a version to report for all importable top-level names has a means to fall back to reporting the distribution version information if no ``__version__`` attribute is defined. Only standard library modules, and modules added via means other than Python package installation would fail to have version information reported in that case.
eo: Plena listo rilatanta la supranivelajn importeblajn nomojn al la distribuo-pakoj provizantaj tiujn importeblajn pakojn kaj modulojn estas akirebla per la funkcio :func:`importlib.metadata.packages_distributions` de la norma biblioteko. Tio signifas, ke kodo provanta raporti version por ĉiu importebla nomo havas rimedon raporti ion, eĉ se atributo ``__version__`` mankas. Nur moduloj de la norma biblioteko kaj moduloj disponigitaj per maniero alia ol instalado de Python-pako ne havos versiajn informojn tiukaze.
ja: インポートされるパッケージやモジュールを提供する配布パッケージにインポートするために利用可能なトップレベルの名称をマッピングした全数リストは、標準ライブラリの :func:`importlib.metadata.packages_distributions` 関数を通じて取得することができるかもしれません。これが意味するところは、すべてのインポート可能なトップレベルの名称群向けに報告するバージョン番号を暗に示唆することを試みているコードであってさえも、もし ``__version__`` アトリビュートが定義されていなければ、配布物のバージョン状をを報告するということにフォールバックする方法を持っているということです。標準ライブラリのモジュール群だけが、そして、 Python パッケージインストレーション以外の方法を通じて追加されたモジュール群だけが、このような場合にほうこくするバージョン情報を得ることに失敗することでしょう。
ru: Полный список, отображающий имена верхнего уровня, доступные для импорта, на дистрибутивы, которые предоставляют эти импортируемые пакеты и модули, можно получить с помощью функции стандартной библиотеки :func:`importlib.metadata.packages_distributions`. Это означает, что даже код, пытающийся определить версию для сообщения для всех импортируемых имен верхнего уровня, имеет возможность вернуться к сообщению информации о версии дистрибутива, если атрибут ``__version__`` не определен. Только стандартные библиотечные модули и модули, добавленные другими способами, кроме установки пакета Python, в этом случае не будут сообщать информацию о версии.
ta: அந்த இறக்குமதி தொகுப்புகள் மற்றும் தொகுதிகளை வழங்கும் விநியோக தொகுப்புகளுக்கு இறக்குமதிக்கு கிடைக்கக்கூடிய உயர் மட்ட பெயர்களை மேப்பிங் செய்யும் முழு பட்டியல் நிலையான நூலகத்தின் மூலம் பெறப்படலாம்: func: `importlib.metadata.packages_distributions` செயல்பாடு. இதன் பொருள் என்னவென்றால், இறக்குமதி செய்யக்கூடிய அனைத்து உயர்மட்ட பெயர்களுக்கும் புகாரளிக்க ஒரு பதிப்பை ஊகிக்க முயற்சிக்கும் குறியீடு கூட `__ பதிப்பு__`` பண்புக்கூறு வரையறுக்கப்பட்டால், விநியோக பதிப்பு தகவல்களைப் புகாரளிக்கத் திரும்புவதற்கான வழிமுறைகள் உள்ளன. நிலையான நூலக தொகுதிகள் மற்றும் பைதான் தொகுப்பு நிறுவலைத் தவிர வேறு வழிகளில் சேர்க்கப்பட்ட தொகுதிகள் மட்டுமே அந்த விசயத்தில் பதிப்பு தகவல்களைப் பெறத் தவறும்.

source: The Packaging Flow
eo: La Pakada Laborfluo
ja: パッケージングの流れ
pt_br: O fluxo do empacotamento
ru: Упаковочный поток
ta: பேக்கேசிங் ஓட்டம்

source: The document aims to outline the flow involved in publishing/distributing a :term:`distribution package <Distribution Package>`, usually to the `Python Package Index (PyPI)`_. It is written for package publishers, who are assumed to be the package author.
eo: Jen dokumento resumanta la fluon pri eldonado/distribuado de :term:`distribua pako <Distribution Package>`, ofte al la `Python-Pakindekso <Python Package Index (PyPI)>`_. Ĝi estis verkita por eldonantoj de pakoj, kiuj estas supozite la aŭtoroj de la pakoj.
ja: 文書は、大抵は `Python パッケージインデックス (PyPI) <Python Package Index (PyPI)>`_ への :term:`配布パッケージ <Distribution Package>` の公開や配布に必要な作業の流れをおおまかに描き出すことを目的としています。パッケージの作者と目される、パッケージを公開する人向けに書かれました。
pt_br: O documento visa delinear o fluxo envolvido na publicação/distribuição de um :term:`pacote de distribuição <Distribution Package>`, geralmente para o `Python Package Index (PyPI)`_. Ele é escrito para editores de pacotes, que são considerados os autores do pacote.
ru: Цель этого документа - описать процесс публикации/распространения :term:`распространяемого пакета <Распространяемый пакет>`, обычно в `Индекс пакетов Python (PyPI)`_. Он написан для издателей пакетов, которые, как предполагается, являются авторами пакетов.
ta: ஒரு: காலத்தை வெளியிட/விநியோகிப்பதில் ஈடுபடும் ஓட்டத்தை கோடிட்டுக் காட்டுவதை ஆவணம் நோக்கமாகக் கொண்டுள்ளது: கால: `விநியோக தொகுப்பு <விநியோக தொகுப்பு>`, வழக்கமாக `பைதான் தொகுப்பு குறியீட்டு (PYPI)` _ க்கு. தொகுப்பு வெளியீட்டாளர்களுக்காக இது எழுதப்பட்டுள்ளது, அவர்கள் தொகுப்பு எழுத்தாளராக கருதப்படுகிறார்கள்.

source: While the :doc:`tutorial <tutorials/packaging-projects>` walks through the process of preparing a simple package for release, it does not fully enumerate what steps and files are required, and for what purpose.
eo: Kvankam la :doc:`lernilo <tutorials/packaging-projects>` priskribas la procedon por prepari simplan pakon por eldonado, ĝi ne plene klarigas la postulatajn paŝojn kaj dosierojn kaj la kialojn.
ja: :doc:`チュートリアル <tutorials/packaging-projects>` ではシンプルなプロジェクトについてリリースの準備を行うプロセスを一通り実行しますが、どのステップでどのようなファイルが必要になり、その目的は何かという部分については必ずしも完全に列挙はしていません。
pt_br: Enquanto o :doc:`tutorial <tutorials/packaging-projects>` percorre o processo de preparação de um pacote simples para lançamento, ele não enumera completamente quais etapas e arquivos são necessários e para qual finalidade.
ru: Хотя в :doc:`учебнике <tutorials/packaging-projects>` рассматривается процесс подготовки простого пакета к выпуску, он не полностью перечисляет, какие шаги и файлы требуются и для чего.
ta: TOP: `டுடோரியல் <டுடோரியல்கள்/பேக்கேசிங்-திட்டங்கள்>` வெளியீட்டிற்கு ஒரு எளிய தொகுப்பைத் தயாரிக்கும் செயல்முறையின் மூலம் நடந்து செல்லும்போது, என்ன படிகள் மற்றும் கோப்புகள் தேவை, எந்த நோக்கத்திற்காக அது முழுமையாகக் கணக்கிடாது.

source: Publishing a package requires a flow from the author's source code to an end user's Python environment. The steps to achieve this are:
eo: Eldonado de pako postulas fluon el la fontkodo de la aŭtoro ĝis la Python-medio de la uzanto. Jen la paŝoj de tiu fluo:
ja: パッケージを公開するには、作者のソースコードからエンドユーザの Python 環境に至る流れが必要とされます。これを実現するためのステップとしては:
pt_br: A publicação de um pacote requer um fluxo do código-fonte do autor para o ambiente Python de um usuário final. Os passos para conseguir isso são:
ru: Публикация пакета требует перехода от исходного кода автора к среде Python конечного пользователя. Для этого необходимо выполнить следующие шаги:
ta: ஒரு தொகுப்பை வெளியிடுவதற்கு ஆசிரியரின் மூலக் குறியீட்டிலிருந்து இறுதி பயனரின் பைதான் சூழலுக்கு ஒரு ஓட்டம் தேவைப்படுகிறது. இதை அடைவதற்கான படிகள்:

source: Have a source tree containing the package. This is typically a checkout from a version control system (VCS).
eo: Havu fontarbon enhavantan la pakon. Tiu devenas tipe de versikontrola sistemo (VCS).
ja: パッケージを含むソースツリーを入手します。これは、典型的にはバージョン管理システム (VCS) からのチェックアウトのことです。
pt_br: Tenha uma árvore de fontes contendo o pacote. Este é normalmente um checkout de um sistema de controle de versão (VCS).
ru: Иметь дерево исходных текстов, содержащее пакет. Обычно это проверка из системы контроля версий (VCS).
ta: தொகுப்பைக் கொண்ட ஒரு மூல மரத்தை வைத்திருங்கள். இது பொதுவாக பதிப்பு கட்டுப்பாட்டு அமைப்பிலிருந்து (வி.சி.எச்) ஒரு புதுப்பிப்பு ஆகும்.

source: Prepare a configuration file describing the package metadata (name, version and so forth) and how to create the build artifacts. For most packages, this will be a :file:`pyproject.toml` file, maintained manually in the source tree.
eo: Preparu agordan dosieron priskribantan la pakajn metadatenojn (nomon, version ktp) kaj la manieron konstrui la artefaktojn. Plej ofte tiu estas la dosiero :dosiero:`pyproject.toml` malaŭtomate mastrumata en la fontarbo.
ja: パッケージのメタデータ (名前・バージョン・その他) とビルド成果物を作成するための方法を記述した設定ファイルを用意してください。ほとんどのパッケージ向けには、これは、ソースツリー内で手動で維持管理される :file:`pyproject.toml` ファイルを準備するということになるでしょう。
pt_br: Prepare um arquivo de configuração descrevendo os metadados do pacote (nome, versão e assim por diante) e como criar os artefatos de construção. Para a maioria dos pacotes, este será um arquivo :file:`pyproject.toml`, mantido manualmente na árvore de fontes.
ru: Подготовьте конфигурационный файл, описывающий метаданные пакета (имя, версию и т.д.) и способ создания артефактов сборки. Для большинства пакетов это будет файл :file:`pyproject.toml`, поддерживаемый вручную в дереве исходных текстов.
ta: தொகுப்பு மேனிலை தரவு (பெயர், பதிப்பு மற்றும் பல) மற்றும் உருவாக்க கலைப்பொருட்களை எவ்வாறு உருவாக்குவது என்பதை விவரிக்கும் உள்ளமைவு கோப்பைத் தயாரிக்கவும். பெரும்பாலான தொகுப்புகளுக்கு, இது ஒரு: கோப்பு: `pyproject.toml` கோப்பு, மூல மரத்தில் கைமுறையாக பராமரிக்கப்படுகிறது.

source: Create build artifacts to be sent to the package distribution service (usually PyPI); these will normally be a :term:`source distribution ("sdist") <Source Distribution (or "sdist")>` and one or more :term:`built distributions ("wheels") <Built Distribution>`. These are made by a build tool using the configuration file from the previous step. Often there is just one generic wheel for a pure Python package.
eo: Kreu konstruitajn artefaktojn seldontan al la pako-disdonada servo (kutime PyPI); tiuj ordinare estas :term:`fonta distribuo (sdist) <Source Distribution (or "sdist")>` kaj unu aŭ pli da :term:`konstrutaj distribuoj (wheel) <Built Distribution>`. Tiujn konstruas konstruilo uzante la agordan dosieron de la antaŭa paŝo. Ofte estas nur unu ĝenerala wheel por pure Python-a pako.
ja: パッケージ配布サービス (通常は PyPI) へ送るビルド成果物を作成してください; 普通ならこれらは :term:`ソースコード配布物 ("sdist") <Source Distribution (or "sdist")>` と、ひとつまたはそれ以上の :term:`ビルド済配布物 ("wheels") <Built Distribution>` ということになるでしょう。これらは、前のステップで作成した設定ファイルを使ってビルドツールによって作成されます。純 Python パッケージの場合には、共通の wheel がひとつだけ存在するということもしばしばあります。
pt_br: Crie artefatos de construção para serem enviados ao serviço de distribuição de pacotes (geralmente PyPI); normalmente serão uma :term:`distribuição fonte ("sdist") <Distribuição Fonte (ou "sdist")>` e uma ou mais :term:`distribuições construídas ("wheels") <Distribuição Construída>`. Eles são feitos por uma ferramenta de construção usando o arquivo de configuração da etapa anterior. Muitas vezes, há apenas uma wheel genérica para um pacote puro Python.
ru: Создайте артефакты сборки для отправки в службу распространения пакетов (обычно PyPI); обычно это будет :term:`исходный дистрибутив ("sdist") <Source Distribution (или "sdist")>` и один или несколько :term:`сборных дистрибутивов ("wheels") <Built Distribution>`. Они создаются инструментом сборки с помощью конфигурационного файла, полученного на предыдущем шаге. Часто для пакета чистого Python существует только одно общее колесо.
ta: தொகுப்பு விநியோக சேவைக்கு (பொதுவாக PYPI) அனுப்பப்பட வேண்டிய கட்டமைப்புகளை உருவாக்குங்கள்; இவை பொதுவாக ஒரு: காலமாக இருக்கும்: `மூல வழங்கல் (" SDIST ") <மூல வழங்கல் (அல்லது" SDIST ")>` மற்றும் ஒன்று அல்லது அதற்கு மேற்பட்டவை: சொல்: `கட்டப்பட்ட விநியோகங்கள் (" சக்கரங்கள் ") <கட்டப்பட்ட விநியோகம்>`. முந்தைய படியிலிருந்து உள்ளமைவு கோப்பைப் பயன்படுத்தி ஒரு உருவாக்க கருவியால் இவை செய்யப்படுகின்றன. பெரும்பாலும் தூய பைதான் தொகுப்புக்கு ஒரு பொதுவான சக்கரம் மட்டுமே உள்ளது.

source: Upload the build artifacts to the package distribution service.
eo: Alŝutu la konstruitajn artefaktojn al la pak-distribua servo.
ja: ビルド成果物をパッケージ配布サービスへアップロードしてください。
pt_br: Envie os artefatos de construção para o serviço de distribuição de pacotes.
ru: Загрузите строительные артефакты в службу распределения пакетов.
ta: தொகுப்பு விநியோக சேவையில் உருவாக்க கலைப்பொருட்களை பதிவேற்றவும்.

source: At that point, the package is present on the package distribution service. To use the package, end users must:
eo: Nun, la pako ĉeestas ĉe la pako-distribua servo. Por uzi la pakon, uzantoj faru la jenon:
ja: その時点で、パッケージがパッケージ配布サービス上に存在することになります。そのパッケージを使うためにエンドユーザは次のことをしなければなりません:
pt_br: Nesse ponto, o pacote está presente no serviço de distribuição de pacotes. Para usar o pacote, os usuários finais devem:
ru: На этом этапе пакет присутствует в сервисе распределения пакетов. Для использования пакета конечные пользователи должны:
ta: அந்த நேரத்தில், தொகுப்பு விநியோக சேவையில் தொகுப்பு உள்ளது. தொகுப்பைப் பயன்படுத்த, இறுதி பயனர்கள் வேண்டும்:

source: Download one of the package's build artifacts from the package distribution service.
eo: Elŝutu unu el la konstruitaj artefaktoj de la pako el la pak-distribua servo.
ja: そのパッケージのビルド成果物をパッケージ配布サービスからダウンロードしてください。
pt_br: Baixe um dos artefatos de construção do pacote do serviço de distribuição de pacotes.
ru: Скачайте один из строительных артефактов пакета из службы распространения пакетов.
ta: தொகுப்பு விநியோக சேவையிலிருந்து தொகுப்பின் உருவாக்க கலைப்பொருட்களில் ஒன்றைப் பதிவிறக்கவும்.

source: Install it in their Python environment, usually in its ``site-packages`` directory. This step may involve a build/compile step which, if needed, must be described by the package metadata.
eo: Instalu ĝin en ĝis Python-medio, ordinare en la dosierujo ``site-packages``. Tio povas postuli konstruadon aŭ tradukadon, kiu devas esti priskribita de la pakaj metadatenoj.
ja: それをエンドユーザの Python 環境の通常であれば ``site-packages`` ディレクトリにインストールしてください。もしそれが必要ならパッケージのメタデータにその方法が記述されていなければなりませんが、このステップにはビルド/コンパイルのステップを含むことがあります。
pt_br: Instale-o em seu ambiente Python, geralmente em seu diretório ``site-packages``. Esta etapa pode envolver uma etapa de construção/compilação que, se necessário, deve ser descrita pelos metadados do pacote.
ru: Установите его в своей среде Python, обычно в его каталоге ``site-packages``. Этот шаг может включать в себя этап сборки/компиляции, который при необходимости должен быть описан пакетными метаданными.
ta: வழக்கமாக அதன் `` தள-பேக்கேச்கள்`` கோப்பகத்தில் அதை அவற்றின் பைதான் சூழலில் நிறுவவும். இந்த படி ஒரு கட்டமைப்பை/தொகுக்கும் படி, தேவைப்பட்டால், தொகுப்பு மெட்டாடேட்டாவால் விவரிக்கப்பட வேண்டும்.

source: These last 2 steps are typically performed by :ref:`pip` when an end user runs ``pip install``.
eo: La lastajn du paĵojn faras la ilo :ref:`pip`, kiam uzanto rulas ``pip install``.
ja: これら最後のふたつのステップは、典型的な場合には、エンドユーザが ``pip install`` を走らせた時に :ref:`pip` によって実行されます。
pt_br: Estes últimos 2 passos são normalmente executados por :ref:`pip` quando um usuário final executa ``pip install``.
ru: Эти два последних шага обычно выполняются :ref:`pip`, когда конечный пользователь запускает ``pip install``.
ta: இந்த கடைசி 2 படிகள் பொதுவாக நிகழ்த்தப்படுகின்றன: குறிப்பு: `பிப்` ஒரு இறுதி பயனர் இயங்கும்போது` `பிஐபி நிறுவல்``.

source: The steps above are described in more detail below.
eo: La ĉi-supraj paŝoj estas priskribitaj plidetale ĉi-sube.
ja: 上記のステップについては、以下にもっと詳しく記述してあります。
pt_br: As etapas acima são descritas com mais detalhes abaixo.
ru: Приведенные выше шаги более подробно описаны ниже.
ta: மேலே உள்ள படிகள் கீழே விரிவாக விவரிக்கப்பட்டுள்ளன.

source: The source tree
eo: La fontarbo
ja: ソースコードツリー
pt_br: A árvore fonte
ru: Дерево исходного кода
ta: மூல மரம்

source: The source tree contains the package source code, usually a checkout from a VCS. The particular version of the code used to create the build artifacts will typically be a checkout based on a tag associated with the version.
eo: La fontarbo enhavas la fontkodon de la pako, ofte el versikontrola sistemo. La specifa versio de la kodo uzita por konstrui la artefaktojn ordinare estas asociita al etikedo de la versio en la versikontrola sistemo.
ja: ソースコードツリーには、パッケージのソースコード (通常なら VCS からのチェックアウト) が含まれます。
pt_br: A árvore fonte contém o código-fonte do pacote, geralmente um checkout de um VCS. A versão específica do código usado para criar os artefatos de compilação normalmente será um checkout com base em uma tag associada à versão.
ru: Источниковое дерево содержит исходный код пакета, обычно чек от VCS. Конкретная версия кода, используемого для создания артефактов сборки, как правило, будет проверкой на основе тега, связанного с версией.
ta: மூல மரத்தில் தொகுப்பு மூலக் குறியீடு உள்ளது, பொதுவாக ஒரு வி.சி.எச்சிலிருந்து ஒரு புதுப்பிப்பு. உருவாக்க கலைப்பொருட்களை உருவாக்கப் பயன்படுத்தப்படும் குறியீட்டின் குறிப்பிட்ட பதிப்பு பொதுவாக பதிப்போடு தொடர்புடைய குறிச்சொல்லின் அடிப்படையில் ஒரு புதுப்பித்தலாக இருக்கும்.

source: The configuration file
eo: La agorda dosiero
ja: 設定ファイル
pt_br: O arquivo de configuração
ru: Файл конфигурации
ta: உள்ளமைவு கோப்பு

source: The configuration file depends on the tool used to create the build artifacts. The standard practice is to use a :file:`pyproject.toml` file in the `TOML format`_.
eo: La agorda dosiero dependas de la ilo uzita por krei la konstruitajn artefaktojn. La norma praktiko estas uzi dosieron :file:`pyproject.toml` en la `dosierformo TOML <TOML format>`_.
ja: ビルド成果物を作成するのに用いるツールによって設定ファイルは変わります。`TOML フォーマット <TOML format>`_ で書かれた `pyproject.toml` ファイルを使うのが標準的な慣習です。
pt_br: O arquivo de configuração depende da ferramenta usada para criar os artefatos de construção. A prática padrão é usar um arquivo :file:`pyproject.toml` no `formato TOML`_.
ru: Конфигурационный файл зависит от инструмента, используемого для создания артефактов сборки. Стандартной практикой является использование файла :file:`pyproject.toml` в формате `TOML`_.
ta: உள்ளமைவு கோப்பு உருவாக்க கலைப்பொருட்களை உருவாக்கப் பயன்படுத்தப்படும் கருவியைப் பொறுத்தது. `டாம்ல் வடிவத்தில்`_ இல்` pyproject.toml` கோப்பைப் பயன்படுத்துவது நிலையான நடைமுறை.

source: At a minimum, the :file:`pyproject.toml` file needs a ``[build-system]`` table specifying your build tool. There are many build tools available, including but not limited to :ref:`flit`, :ref:`hatch`, :ref:`pdm`, :ref:`poetry`, :ref:`setuptools`, `trampolim`_, and `whey`_. Each tool's documentation will show what to put in the ``[build-system]`` table.
eo: Minimume, la dosiero :file:`pyproject.toml` bezonas tabelon ``[build-system]`` specifante la konstruilon. Ekzistas multaj konstruiloj, interalie inkluzive de :ref:`flit`, :ref:`hatch`, :ref:`pdm`, :ref:`poetry`, :ref:`setuptools`, `trampolim`_ kaj `whey`_. La dokumentaro de iu ilo klarigos la enhavon de la tabelo ``[build-system]``.
ja: :file:`pyproject.toml` ファイルには、少なくとも、採用したビルドツールを指定する ``[build-system]`` テーブルがなければなりません。ビルドツールとして使えるものには、 :ref:`flit` ・ :ref:`hatch` ・ :ref:`pdm` ・ :ref:`poetry` ・ :ref:`setuptools` ・ `trample`_ ・ `whey`_ を含めて他にもさまざまなものがあります。それぞれのツールの説明文書には、 ``[build-system]`` に何を書けば良いかが示されていることでしょう。
pt_br: No mínimo, o arquivo :file:`pyproject.toml` precisa de uma tabela ``[build-system]`` especificando sua ferramenta de construção. Existem muitas ferramentas de construção disponíveis, incluindo, mas não se limitando a :ref:`flit`, :ref:`hatch`, :ref:`pdm`, :ref:`poetry`, :ref:`setuptools`, `trampolim`_ e `whey`_. A documentação de cada ferramenta mostrará o que colocar na tabela ``[build-system]``.
ru: Как минимум, файл :file:`pyproject.toml' нуждается в ``[build-system]`` таблица с указанием вашего инструмента сборки. Имеется множество инструментов для сборки, в том числе:ref:`flit`, :ref:`hatch`, :ref:`pdm`, :ref:`poetry`, :ref:`setuptools', `trampolim`_ и `whey`_. Документация каждого инструмента покажет, что поместить в таблицу ``[build-system]``.
ta: குறைந்தபட்சம், தி: கோப்பு: `pyproject.toml` கோப்புக்கு` `[பில்ட்-சிச்டம்]` `உங்கள் உருவாக்க கருவியைக் குறிப்பிடும் அட்டவணை தேவை. இதில் பல கட்டமைப்புக் கருவிகள் உள்ளன, அவற்றில் மட்டுப்படுத்தப்படவில்லை: ref: `flit`,: ref:` அட்ச்`,: ref: `pdm`,: ref:` கவிதை`,: ref: `setuptools`,` trampolim` _, மற்றும் `மோர்`_. ஒவ்வொரு கருவியின் ஆவணங்களும் `` [பில்ட்-சிச்டம்] `` அட்டவணையில் எதை வைக்க வேண்டும் என்பதைக் காண்பிக்கும்.
