Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Packaging in Python has a bit of a reputation for being a bumpy ride. This impression is mostly a byproduct of Python's versatility. Once you understand the natural boundaries between each packaging solution, you begin to realize that the varied landscape is a small price Python programmers pay for using one of the most balanced, flexible languages available.
eo: La publika reputacio estas, ke pakado en Python povas esti malglata. Tio estas plejparte rezulto de la diversaj celoj de Python. Post kiam oni scias la naturajn limojn inter la pakadaj manieroj, oni komprenos, ke la diversa pejzaĝo estas malgranda prezo pagata de Python-programistoj por uzi unu el la plej ekvilibraj, flekseblaj lingvoj haveblaj.
ja: Python におけるパッケージングは、凸凹道を車で行くようなもので苦労が多いという評判も少しあります。このような感想は、ほとんどの場合は Python が多用途に使えることの裏返しです。それぞれのパッケージング方法の間にある自然な境界線を理解しさえすれば、さまざまに異なる風景が、もっともバランスが取れていて自由度の高い言語を使うということのために Python プログラマが支払う小さな代償であることに気づくことでしょう。
pt_br: O empacotamento no Python tem a reputação de ser um percurso acidentado. Essa impressão é principalmente um subproduto da versatilidade do Python. Depois de entender os limites naturais entre cada solução de empacotamento, você começa a perceber que o cenário variado é um preço pequeno Python que os programadores pagam por usar uma das linguagens mais equilibradas e flexíveis disponíveis.
ru: Упаковка в Python имеет репутацию не очень удобной. Это впечатление в основном является побочным продуктом универсальности Python. Как только вы поймете естественные границы между каждым решением для упаковки, вы начнете понимать, что разнообразный ландшафт - это небольшая цена, которую программисты на Python платят за использование одного из самых сбалансированных и гибких языков.
ta: பைத்தானில் பேக்கேசிங் ஒரு சமதள சவாரி என்ற நற்பெயரைக் கொண்டுள்ளது. இந்த எண்ணம் பெரும்பாலும் பைத்தானின் பல்துறைத்திறனின் துணை தயாரிப்பு ஆகும். ஒவ்வொரு பேக்கேசிங் தீர்வுக்கும் இடையிலான இயற்கை எல்லைகளை நீங்கள் புரிந்துகொண்டவுடன், மாறுபட்ட நிலப்பரப்பு ஒரு சிறிய விலை பைதான் புரோகிராமர்கள் மிகவும் சீரான, நெகிழ்வான மொழிகளில் ஒன்றைப் பயன்படுத்துவதற்கு செலுத்தும் ஒரு சிறிய விலை என்பதை நீங்கள் உணரத் தொடங்குகிறீர்கள்.

source: Binary distribution format
eo: Duuma distribua formo
ja: バイナリ配布物のフォーマット
pt_br: Formato de distribuição binária
ru: Формат распространения двоичных пакетов
ta: பைனரி விநியோக வடிவம்

source: This page specifies the binary distribution format for Python packages, also called the wheel format.
eo: Jen paĝo specifanta la duuman distribuan dosierformon por Python-pako, nomitan wheel.
ja: このページでは、Python パッケージのバイナリ配布物フォーマット、これは wheel フォーマットとも呼ばれているものですが、これについて仕様を記述します。
ru: Эта страница определяет формат распространения бинарных пакетов Python, также называемый форматом колеса.
ta: இந்த பக்கம் பைதான் தொகுப்புகளுக்கான பைனரி விநியோக வடிவமைப்பைக் குறிப்பிடுகிறது, இது சக்கர வடிவம் என்றும் அழைக்கப்படுகிறது.

source: A wheel is a ZIP-format archive with a specially formatted file name and the ``.whl`` extension. It contains a single distribution nearly as it would be installed according to PEP 376 with a particular installation scheme. Although a specialized installer is recommended, a wheel file may be installed by simply unpacking into site-packages with the standard 'unzip' tool while preserving enough information to spread its contents out onto their final paths at any later time.
eo: Wheel estas ZIP-forma arĥivo kun speciale aranĝita dosiernomo kaj la dosiersufikso ``.whl''. Ĝi enhavas unu distribuon preskaŭ ekzakte kiel la instalon laŭ PEP 376 kun specifa instala skemo. Kvankam speciala instalilo estas rekomendata, oni povas instali wheel-dosieron simple per maldensigado al site-packages uzante la norman ilon ``unzip``, koonservante sufiĉon da informoj por transloki la enhavojn al la finaj dosierlokoj poste.
ja: wheel は、特別にフォーマットされたファイル名と ``.whl`` 拡張子を持った ZIP フォーマットのアーカイブです。 PEP 376 にほぼ従ってインストールされる単一の配布物を含んでいます。特別なインストーラを使うことが推奨されていますが、 wheel ファイルは、いつでも後でその最終的なパス名の場所に内容物を展開するに足りる情報を保存しつつ、サイトパッケージを置くべき場所に標準の 'unxip' ツールで単純にアンパックすればインストールできます。
pt_br: Um wheel é um arquivo em formato ZIP com um nome de arquivo formatado de forma especial e a extensão ``.whl``. Ele contém uma única distribuição quase como seria instalado de acordo com a PEP 376 com um esquema de instalação particular. Embora um instalador especializado seja recomendado, um arquivo wheel pode ser instalado simplesmente descompactando em pacotes de sites com a ferramenta padrão de "descompactação" enquanto preserva informações suficientes para espalhar seu conteúdo em seus caminhos finais a qualquer momento.
ru: Колесо - это архив формата ZIP со специальным именем файла и расширением ``.whl``. Он содержит один дистрибутив почти в том виде, в каком он будет установлен согласно PEP 376 при определенной схеме установки. Хотя рекомендуется использовать специализированный инсталлятор, файл wheel может быть установлен простой распаковкой в site-пакеты стандартным инструментом 'unzip', сохраняя при этом достаточно информации для того, чтобы разложить его содержимое по конечным путям в любое последующее время.
ta: ஒரு சக்கரம் என்பது விசேசமாக வடிவமைக்கப்பட்ட கோப்பு பெயர் மற்றும் `` .Whl`` நீட்டிப்பு கொண்ட ஒரு சிப் வடிவ காப்பகம். ஒரு குறிப்பிட்ட நிறுவல் திட்டத்துடன் PEP 376 இன் படி நிறுவப்படும் என்பதால் இது ஒரு விநியோகத்தைக் கொண்டுள்ளது. ஒரு சிறப்பு நிறுவி பரிந்துரைக்கப்பட்டாலும், நிலையான 'அன்சிப்' கருவியுடன் தளத் தொகுப்புகளைத் திறப்பதன் மூலம் ஒரு சக்கர கோப்பு நிறுவப்படலாம், அதே நேரத்தில் அதன் உள்ளடக்கங்களை எந்த நேரத்திலும் அவற்றின் இறுதி பாதைகளில் பரப்புவதற்கு போதுமான தகவல்களைப் பாதுகாக்கிறது.

source: Details
eo: Detaloj
ja: 詳細
pt_br: Detalhes
ru: Детали
ta: விவரங்கள்

source: Installing a wheel 'distribution-1.0-py32-none-any.whl'
eo: Instali wheel «distribution-1.0-py32-none-any.whl»
ja: wheel の 'distribution-1.0-py32-none-any.whl' をインストールする
pt_br: Instalando um wheel 'distribution-1.0-py32-none-any.whl'
ru: Установка колеса 'distribution-1.0-py32-none-any.whl'
ta: ஒரு சக்கரத்தை நிறுவுதல்

source: Wheel installation notionally consists of two phases:
eo: Instalado de wheel consistas koncepte el du fazoj:
ja: Wheel によるインストールは、概念上、ふたつの段階から構成されています:
pt_br: A instalação do wheel consiste, em teoria, em duas fases:
ru: Установка колес условно состоит из двух этапов:
ta: சக்கர நிறுவல் இரண்டு கட்டங்களைக் கொண்டுள்ளது:

source: Unpack.
eo: Malpaki.
ja: アンパックする。
pt_br: Desempacotar.
ru: Распакуйте.
ta: திறக்க.

source: Parse ``distribution-1.0.dist-info/WHEEL``.
eo: Sintaksanalizi ``distribution-1.0.dist-info/WHEEL``.
ja: ``distribution-1.0.dist-info/WHEEL`` をパースします。
pt_br: Analisar ``distribution-1.0.dist-info/WHEEL``.
ru: Разбор ``distribution-1.0.dist-info/WHEEL``.
ta: `` வழங்கல் -1.0.dist-info/wheel``.

source: Check that installer is compatible with Wheel-Version. Warn if minor version is greater, abort if major version is greater.
eo: Kontroli, ĉu la instalilo kongruas kun Wheel-Version. Averti, se la minora versio estas pli granda; ĉesi, se la maĵora versio estas pli granda.
ja: インストーラが Wheel のバージョンと互換であることを確認します。マイナーバージョンが大きければ警告し、メジャーバージョンが大きければ処理を中断します。
pt_br: Verificar se o instalador é compatível com a versão Wheel. Avisa se a versão secundária é maior, cancela se a versão principal é maior.
ru: Проверка совместимости программы установки с Wheel-Version. Предупреждение, если минорная версия больше, прерывание, если мажорная версия больше.
ta: நிறுவி சக்கர அழுத்தத்துடன் இணக்கமானது என்பதை சரிபார்க்கவும். சிறிய பதிப்பு அதிகமாக இருந்தால் எச்சரிக்கவும், முக்கிய பதிப்பு அதிகமாக இருந்தால் கைவிடவும்.

source: If Root-Is-Purelib == 'true', unpack archive into purelib (site-packages).
eo: Se Root-Is-Purelib == 'true', malpaki arĥivon al purelib (site-packages).
ja: もし、 Root-Is-Purelib == 'true' であれば、アーカイブを purelib (site-packages) へアンパックします。
pt_br: Se Root-Is-Purelib == 'true', descompactar o arquivo em purelib (sites-packages).
ru: Если Root-Is-Purelib == 'true', распакуйте архив в purelib (site-packages).
ta: ரூட்-ஐச்-பூரெலிப் == 'உண்மை' என்றால், காப்பகத்தை பியூரிலிப்பில் (தள-பேக்கேச்கள்) திறக்கவும்.

source: Else unpack archive into platlib (site-packages).
eo: Alikaze, malpaki arĥivon al platlib (site-packages).
ja: そうでなければ、アーカイブを platlib (site-packages) へアンパックします。
pt_br: Caso contrário, descompactar o arquivo em platlib (site-packages).
ru: Иначе распакуйте архив в platlib (site-packages).
ta: பிளாட்ட்லிபில் (தள-பேக்கேச்கள்) காப்பகத்தைத் திறக்கவும்.

source: Spread.
eo: Disvastigi.
ja: 広げる。
pt_br: Espalhar.
ru: Распространение.
ta: பரவுதல்.

source: Unpacked archive includes ``distribution-1.0.dist-info/`` and (if there is data) ``distribution-1.0.data/``.
eo: Malpakita arĥivo inkluzivas ``distribution-1.0.dist-info/`` kaj (se datenoj ekzistas) ``distribution-1.0.data/``.
ja: アンパックされたアーカイブは、 ``distribution-1.0.dist-info/`` と (データ部分があれば) ``distribution-1.0.data/`` を含んでいます。
pt_br: O arquivo descompactado inclui ``distribution-1.0.dist-info/`` e (se houver dados) ``distribution-1.0.data/``.
ru: Распакованный архив включает ``distribution-1.0.dist-info/`` и (если есть данные) ``distribution-1.0.data/``.
ta: தொகுக்கப்படாத காப்பகத்தில் `` வழங்கல் -1.0.dist-info/`` மற்றும் (தரவு இருந்தால்) `` வழங்கல் -1.0.data/`` ஆகியவை அடங்கும்.

source: Move each subtree of ``distribution-1.0.data/`` onto its destination path. Each subdirectory of ``distribution-1.0.data/`` is a key into a dict of destination directories, such as ``distribution-1.0.data/(purelib|platlib|headers|scripts|data)``. These subdirectories are :ref:`installation paths defined by sysconfig <python:installation_paths>`.
eo: Movu ĉiun subarbon de ``distribution-1.0.data/`` al la cela dosierloko. Ĉiu subdosierujo de ``distribution-1.0.data/`` estas ŝlosilo en vortaro da celaj dosierujoj, kiel ``distribution-1.0.data/(purelib|platlib|headers|scripts|data)``. Tiuj subdosierujoj estas :ref:`instalaj dosierlokoj difinitaj de sysconfig <python:installation_paths>`.
ja: ``distribution-1.0.data/`` の下の全てのサブツリーを、その目的地となるディレクトリパスに移動しましょう。 ``distribution-1.0.data/(purelib|platlib|headers|scripts|data)`` のような ``distribution-1.0.data/`` の下のサブディレクトリは、それぞれ、目的地となるディレクトリの辞書のキーになっています。このようなサブディレクトリ群は、 :ref:`sysconfig によって定義されるインストールパス群 <python:installation_paths>` です。
ru: Переместите каждое поддерево из ``распределение-1.0. данные/`` на путь назначения. Каждый подкаталог ``распределение-1.0. данные/`` является ключом к дикте директорий назначения, например ``распределение-1.0. данные/(purelib|platlib|headers|scripts|data)``. Эти подкаталоги являются : ссылка:`путями установки, определенными sysconfig <python:installation_paths>`.
ta: `` வழங்கல் -1.0.data/`` இன் ஒவ்வொரு துணைக்குழுவையும் அதன் இலக்கு பாதையில் நகர்த்தவும். `` வழங்கல் -1.0.data/`` இன் ஒவ்வொரு துணை அடைவுகளும், `` விநியோக -1.0.data/ (PURELIB | PLATLIB | தலைப்புகள் | ச்கிரிப்டுகள் | தரவு) `` போன்ற இலக்கு கோப்பகங்களின் கட்டளைக்கு ஒரு முக்கியமாகும். இந்த துணை அடைவுகள்: குறிப்பு: `சிச்கான்ஃபிக் <பைதான்: நிறுவல்_பாத்ச்> ஆல் வரையறுக்கப்பட்ட நிறுவல் பாதைகள்>`.

source: If applicable, update scripts starting with ``#!python`` to point to the correct interpreter.
eo: Ĝisdatigu tiujn programojn, kiuj komenciĝas per ``#!python``, igante ilin montri la ĝustan interpretilon.
ja: もし該当するならば、 ``#!python`` から始まるスクリプト群が適切なインタープリタを指し示すように更新します。
pt_br: Se aplicável, atualizar os scripts começando com ``#!python`` para apontar para o interpretador correto.
ru: Если применимо, обновите скрипты, начинающиеся с ``#!python``, чтобы они указывали на правильный интерпретатор.
ta: பொருந்தினால், சரியான மொழிபெயர்ப்பாளரை சுட்டிக்காட்ட ``#! பைதான்`` உடன் தொடங்கி ச்கிரிப்ட்களைப் புதுப்பிக்கவும்.

source: Update ``distribution-1.0.dist-info/RECORD`` with the installed paths.
eo: Ĝisdatigi ``distribution-1.0.dist-info/RECORD`` pri la instalitaj dosierlokoj.
ja: ``distribution-1.0.dist-info/RECORD`` をインストール先のディレクトリパスに更新します。
pt_br: Atualizar ``distribution-1.0.dist-info/RECORD`` com os caminhos instalados.
ru: Обновите ``distribution-1.0.dist-info/RECORD`` с установленными путями.
ta: நிறுவப்பட்ட பாதைகளுடன் `` வழங்கல் -1.0.dist-info/பதிவு`` புதுப்பிக்கவும்.

source: Remove empty ``distribution-1.0.data`` directory.
eo: Forigi malplenan dosierujon ``distribution-1.0.data``.
ja: 空の ``distribution-1.0.data`` ディレクトリを削除します。
pt_br: Remover o diretório vazio ``distribution-1.0.data``.
ru: Удалите пустой каталог ``distribution-1.0.data``.
ta: வெற்று `` வழங்கல் -1.0.data`` கோப்பகத்தை அகற்று.

source: Compile any installed .py to .pyc. (Uninstallers should be smart enough to remove .pyc even if it is not mentioned in RECORD.)
eo: Traduki ajnan instalitan .py al .pyc. (Malinstaliloj forigu .pyc, eĉ se ĝi ne estas menciita en RECORD.)
ja: インストールされた .py のファイルを全て .pyc にコンパイルします。 (アンインストーラは、 RECORD で言及されていなくても .pyc ファイルを削除できるほどに賢くあるべきです。)
pt_br: Compilar qualquer .py instalado em .pyc. (Os desinstaladores devem ser inteligentes o suficiente para remover .pyc, mesmo que não seja mencionado em RECORD.)
ru: Скомпилируйте все установленные .py в .pyc. (Деинсталляторы должны быть достаточно умны, чтобы удалять .pyc, даже если он не упомянут в RECORD)
ta: நிறுவப்பட்ட .py பெறுநர் .pyc க்கு தொகுக்கவும். (நிறுவல் நீக்குபவர்கள் .pyc ஐ அகற்றும் அளவுக்கு புத்திசாலித்தனமாக இருக்க வேண்டும்.

source: Recommended installer features
eo: Rekomendataj funkcioj de instaliloj
ja: 推奨されるインストーラの機能
pt_br: Recursos de instalador recomendados
ru: Рекомендуемые функции программы установки
ta: பரிந்துரைக்கப்பட்ட நிறுவி நற்பொருத்தங்கள்

source: Rewrite ``#!python``.
eo: Reskribi ``#!python``.
ja: ``#!python`` を書き換えます。
pt_br: Reescrever ``#!python``.
ru: Переписать ``#!python``.
ta: ``#! பைதான்`` மீண்டும் எழுதவும்.

source: In wheel, scripts are packaged in ``{distribution}-{version}.data/scripts/``. If the first line of a file in ``scripts/`` starts with exactly ``b'#!python'``, rewrite to point to the correct interpreter. Unix installers may need to add the +x bit to these files if the archive was created on Windows.
eo: En wheel, programeto troviĝas en ``{distribuo}-{versio}.data/scripts/``. Se la unua linio de dosiero en ``scripts/`` komenciĝas precize per ``b'#!python'``, modifu ĝin montrante la ĝustan interpretilon. Instalilo por Unikso eble devas aldoni la biton +x al tiaj dosieroj, se la arĥivo estis kreita sur Windows.
ja: wheel では、スクリプトは ``{distribution}-{version}.data/scripts/`` にパッケージされます。 ``scripts/`` ディレクトリにあるファイルの先頭行が正確に ``b'#!python'`` で始まっている場合には、正確なインタープリタを指し示すように書き換えられます。アーカイブが Windows で作成されていれば、 Unix でのインストーラがこのようなファイルに +x ビットを追加設定する必要があるでしょう。
pt_br: No wheel, os scripts são empacotados em ``{distribution}-{version}.data/scripts/``. Se a primeira linha de um arquivo em ``scripts/`` começar exatamente com ``b'#!python'``, reescreva para apontar para o interpretador correto. Os instaladores do Unix podem precisar adicionar o bit +x a esses arquivos se o arquivo tiver sido criado em Windows.
ru: В wheel скрипты упаковываются в ``{distribution}-{version}.data/scripts/``. Если первая строка файла в ``scripts/`` начинается с ``b'#!python'``, перепишите ее, чтобы она указывала на правильный интерпретатор. Установщикам Unix может потребоваться добавить бит +x к этим файлам, если архив был создан под Windows.
ta: சக்கரத்தில், ச்கிரிப்ட்கள் `` {distribution}-{version} .data/ச்கிரிப்டுகள்/`` ஆகியவற்றில் தொகுக்கப்பட்டுள்ளன. `` ச்கிரிப்டுகள்/`` இல் உள்ள ஒரு கோப்பின் முதல் வரி சரியாக `` பி '#! பைதான்'ஆ'` உடன் தொடங்கினால், சரியான மொழிபெயர்ப்பாளரை சுட்டிக்காட்ட மீண்டும் எழுதவும். சாளரங்களில் காப்பகம் உருவாக்கப்பட்டால் யுனிக்ச் நிறுவிகள் இந்த கோப்புகளில் +எக்ச் பிட் சேர்க்க வேண்டியிருக்கலாம்.

source: The ``b'#!pythonw'`` convention is allowed. ``b'#!pythonw'`` indicates a GUI script instead of a console script.
eo: La konvencio ``b'#!pythonw'`` estas permesata. ``b'#!pythonw'`` indikas grafikan programon anstataŭ konzolan programon.
ja: ``b'#!pythonw'`` と書く慣習も許容されています。 ``b'#!pythonw'`` というのはコンソール版ではなくて GUI 版のスクリプトであることを示します。
pt_br: A convenção ``b'#!pythonw'`` é permitida. ``b'#!pythonw'`` indica um script GUI ao invés de um script de console.
ru: Допускается использование соглашения ``b'#!pythonw'``. ``b'#!pythonw'`` указывает на графический, а не консольный сценарий.
ta: `` B '#! பைதன்வ்'` மண்டலத்தை அனுமதிக்கிறது. `` பி '#! பைதன்வ்'`` ஒரு கன்சோல் ச்கிரிப்ட்டுக்கு பதிலாக ஒரு சி.யு.ஐ ச்கிரிப்டைக் குறிக்கிறது.

source: Generate script wrappers.
eo: Generi programvolvaĵoj.
ja: スクリプトラッパを生成します。
pt_br: Gerar script wrappers.
ru: Генерируйте обертки для скриптов.
ta: ச்கிரிப்ட் ரேப்பர்களை உருவாக்குங்கள்.

source: In wheel, scripts packaged on Unix systems will certainly not have accompanying .exe wrappers. Windows installers may want to add them during install.
eo: En wheel, programeto pakita sur Uniksa sistemo ne havas ``.exe``-volvilon. Instalilo por Windows povas provizi tiun dum instalado.
ja: wheel では、 Unix システム上でパッケージされたスクリプトには .exe ラッパーが随伴していないことが普通でしょう。 Windows インストーラは、インストールする際にそれらを追加したくなるかもしれません。
pt_br: No wheel, scripts empacotados em sistemas Unix certamente não serão acompanhados de wrappers .exe. Os instaladores Windows podem querer adicioná-los durante a instalação.
ru: В колесе скрипты, упакованные в Unix-системы, конечно, не будут иметь сопровождающих .exe-оберток. Установщики Windows могут захотеть добавить их во время установки.
ta: சக்கரத்தில், யூனிக்ச் அமைப்புகளில் தொகுக்கப்பட்ட ச்கிரிப்ட்கள் நிச்சயமாக .exe ரேப்பர்களைக் கொண்டிருக்காது. சாளரங்கள் நிறுவிகள் நிறுவலின் போது அவற்றைச் சேர்க்க விரும்பலாம்.

source: Recommended archiver features
eo: Rekomendataj funkcioj de arĥiviloj
ja: 推奨されるアーカイバの機能
pt_br: Recursos de arquivador recomendados
ru: Рекомендуемые функции архиватора
ta: பரிந்துரைக்கப்பட்ட காப்பக நற்பொருத்தங்கள்

source: Place ``.dist-info`` at the end of the archive.
eo: Meti ``.dist-info`` ĉe la fino de la arĥivo.
ja: アーカイブの末尾に ``.dist-info`` を置くこと。
pt_br: Colocar ``.dist-info`` no final do arquivo.
ru: Поместите ``.dist-info`` в конец архива.
ta: காப்பகத்தின் முடிவில் `` .dist-info`` ஐ வைக்கவும்.

source: Archivers are encouraged to place the ``.dist-info`` files physically at the end of the archive. This enables some potentially interesting ZIP tricks including the ability to amend the metadata without rewriting the entire archive.
eo: Arĥivilo metu la dosierojn ``.dist-info`` fizike ĉe la fino de la arĥivo. Tio ebligas utilajn teĥnikojn pri arĥivoj, inkluzive de la kapablo modifi la metadatenojn sen reskribado de la tuta arĥivo.
ja: アーカイバには、 ``.dist-info`` ファイルをアーカイブの物理的な末尾に置くことが推奨されています。こうすることで、アーカイブ全体を書き換えなくてもメタデータを修正することができる点を含む、 ZIP のいくつかの潜在的に興味深いトリックを使うことができるようになります。
pt_br: Os arquivadores são encorajados a colocar os arquivos ``.dist-info`` fisicamente no final do repositório. Isso permite alguns truques de ZIP potencialmente interessantes, incluindo a capacidade de corrigir os metadados sem reescrever todo o arquivo.
ru: Архиваторам рекомендуется помещать файлы ``.dist-info`` физически в конец архива. Это позволяет использовать некоторые потенциально интересные трюки ZIP, включая возможность изменять метаданные, не переписывая весь архив.
ta: காப்பகத்தின் முடிவில் `` .டிச்ட்-இன்ஃபோ`` கோப்புகளை உடல் ரீதியாக வைக்க காப்பகர்கள் ஊக்குவிக்கப்படுகிறார்கள். முழு காப்பகத்தையும் மீண்டும் எழுதாமல் மெட்டாடேட்டாவை திருத்துவதற்கான திறன் உள்ளிட்ட சில சுவையான சிப் தந்திரங்களை இது செயல்படுத்துகிறது.

source: File Format
eo: Dosierformo
ja: ファイルフォーマット
pt_br: Formato de arquivos
ru: Формат файла
ta: கோப்பு வடிவம்

source: File name convention
eo: Dosiernoma konvencio
ja: ファイル名の慣習
pt_br: Convenção de nome de arquivos
ru: Соглашение об именах файлов
ta: கோப்பு பெயர் மாநாடு

source: The wheel filename is ``{distribution}-{version}(-{build tag})?-{python tag}-{abi tag}-{platform tag}.whl``.
eo: La dosiernomo de wheel estas ``{distribuo}-{version}(-{konstrua etikedo})?-{lingva etikedo}-{abietikedo}-{platforma etikedo}.whl``.
ja: wheel のファイル名は(訳注、慣習として) ``{配布物}-{バージョン}(-{ビルドタグ})?-{python タグ}-{abi タグ}-{プラットフォームタグ}.whl <{distribution}-{version}(-{build tag})?-{python tag}-{abi tag}-{platform tag}.whl>`` です。
pt_br: O nome de arquivo do wheel é ``{distribution}-{version}(-{build tag})?-{python tag}-{abi tag}-{platform tag}.whl``.
ru: Имя файла колеса - ``{distribution}-{version}(-{build tag})?-{python tag}-{abi tag}-{platform tag}.whl``.
ta: சக்கர கோப்பு பெயர் `{distribution}-{version} (-{{build tag})?

source: distribution
eo: distribuo
ja: ディストリビューション
ru: дистрибутив
ta: பரவல்

source: Distribution name, e.g. 'django', 'pyramid'.
eo: Nomo de distribuo, ekz. «django», «pyramid».
ja: 配布物の名前、例えば 'django' や 'pyramid' 。
pt_br: Nome da distribuição (p.ex., 'django', 'pyramid').
ru: Имя дистрибутива, например, 'django', 'pyramid'.
ta: விநியோக பெயர், எ.கா. 'சாங்கோ', 'பிரமிட்'.

source: Distribution version, e.g. 1.0.
eo: Versio de la distribuo, ekz. 1.0.
ja: 配布物のバージョン、例えば 1.0 。
pt_br: Versão da distribuição (p.ex., 1.0).
ru: Версия дистрибутива, например, 1.0.
ta: விநியோக பதிப்பு, எ.கா. 1.0.

source: build tag
eo: konstrua etikedo
ja: ビルドタグ
ru: построить тег
ta: குறிச்சொல்லை உருவாக்குங்கள்

source: Optional build number. Must start with a digit. Acts as a tie-breaker if two wheel file names are the same in all other respects (i.e. name, version, and other tags). Sort as an empty tuple if unspecified, else sort as a two-item tuple with the first item being the initial digits as an ``int``, and the second item being the remainder of the tag as a ``str``.
eo: Nedeviga konstruo-numero. Devas komenciĝi per cifero. Oni uzas tiun por komparo, se du wheel-dosiernomoj estas samaj ĉiel alie (ekz. laŭ nomo, versio kaj aliaj etikedoj). Por ordigado, konsideru ĝin kiel malplenan opon, se ĝi mankas; se ne, konsideru ĝin kiel duopo, kies unua ero estas la komencaoj ciferoj kiel ``int``, kaj kies dua ero estas la restaĵo de la etikedo kiel ``str``.
ja: 省略可能なビルドナンバー。数字で始まらなければなりません。ふたつの wheel ファイルのファイル名がこの部分を除いて (すなわち名称やバージョンやその他のタグが) 同一であった場合のタイブレーカ (訳注、いずれかに決めるための方法) として働きます。指定されていれば先頭の数字を ``int`` として解釈して第１要素とし残りを ``str`` として解釈して第２要素とするような要素数が２個のタプルとして解釈され、指定されていない場合には空欄のタプルとして解釈されます。
pt_br: Número de construção opcional. Deve começar com um dígito. Atua como um desempate se os nomes de arquivo de dois wheels forem iguais em todos os outros aspectos (ou seja, nome, versão e outras tags). Classifique como uma tupla vazia se não for especificado, caso contrário, classifique como uma tupla de dois itens com o primeiro item sendo os dígitos iniciais como um ``int``, e o segundo item sendo o restante da tag como um ``str``.
ru: Необязательный номер сборки. Должен начинаться с цифры. Действует как ограничитель, если два имени файлов wheel одинаковы по всем остальным параметрам (т. е. по имени, версии и другим тегам). Сортируется как пустой кортеж, если не указан, иначе сортируется как кортеж из двух элементов, где первый элемент - начальные цифры в виде ``int'', а второй элемент - остаток тега в виде ``str''.
ta: விருப்ப உருவாக்க எண். ஒரு இலக்கத்துடன் தொடங்க வேண்டும். மற்ற எல்லா விசயங்களிலும் (அதாவது பெயர், பதிப்பு மற்றும் பிற குறிச்சொற்கள்) இரு சக்கர கோப்பு பெயர்கள் ஒரே மாதிரியாக இருந்தால் டை-பிரேக்கராக செயல்படுகிறது. குறிப்பிடப்படாவிட்டால் வெற்று டப்பிள் என வரிசைப்படுத்தவும், இல்லையெனில் இரண்டு-உருப்படி டப்பிள் என வரிசைப்படுத்தவும் முதல் உருப்படி ஆரம்ப இலக்கங்களை `` int`` ஆகவும், இரண்டாவது உருப்படி குறிச்சொல்லின் எஞ்சியதான் `` str`` ஆகவும் இருக்கும்.
