Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The major limitation of ``pkg_resources`` based parallel installation is that as soon as you import ``pkg_resources`` it locks in the *default* version of everything which is already available on sys.path. This can cause problems, since ``setuptools`` created command line scripts use ``pkg_resources`` to find the entry point to execute. This means that, for example, you can't use ``require`` tests invoked through ``nose`` or a WSGI application invoked through ``gunicorn`` if your application needs a non-default version of anything that is available on the standard ``sys.path`` - the script wrapper for the main application will lock in the version that is available by default, so the subsequent ``require`` call in your own code fails with a spurious version conflict.
eo: La grava problemo pri ``pkg_resources``-baza paralela instalado estas, ke importado de ``pkg_resources`` tuj ŝlosas la *aprioran* version de ĉio havebla ĉe ``sys.path``. Tio estas problema, ĉar ``setuptools``-kreita komandlinia programeto uzas ``pkg_resources`` por serĉi rulotan enirpunkton. Tio implicas, ke ekzemple vi ne povas uzi ``require``-teston alvokitan per ``nose`` or WSGI-programon alvokitan per ``gunicorn``, se via programo bezonas alian version de io havebla ĉe la norma ``sys.path`` – la programvolvilo por la ĉefprogramo ŝlosos la aprioran version, kaj la posta alvoko al ``require`` en via propra kodo malsukcesos pro iluzia versia konflikto.
ja: 並行インストールに立脚した ``pkg_resources`` の主要な制限事項は、 ``pkg_resources`` をインポートするや否や、sys.path 上で既に利用可能なものはすべてそのバージョンに *デフォルト* バージョンが固定されてしまうことです。コマンドラインスクリプトで生成された ``setuptools`` が ``pkg_resources`` を使ってプログラム実行のためのエントリポイントを探索するので、これは問題を引き起こすかもしれません。これが意味するところは、例えば、そのアプリケーションが、標準の ``sys.path`` 上に存在するものなら何であれ、それとは異なるバージョンを必要とする場合に、 ``nose`` を通じて ``require`` テストを使ったり ``gunicorn`` を通じて WSGI アプリケーションを呼び出したりすることができない - メインのアプリケーションのためのスクリプトラッパがデフォルトで利用可能なバージョンに固定されてしまって、各アプリケーションの引き続く ``require`` 呼び出しが見せかけのバージョン衝突によって失敗してしまう、ということです。
pt_br: A principal limitação da instalação paralela baseada em ``pkg_resources`` é que assim que você importa ``pkg_resources`` ele bloqueia a versão *padrão* de tudo que já está disponível em sys.path. Isso pode causar problemas, já que ``setuptools`` scripts de linha de comando criados usam ``pkg_resources`` para encontrar o ponto de entrada a ser executado. Isso significa que, por exemplo, você não pode usar testes de ``require`` invocados através do ``nose`` ou uma aplicação WSGI invocada através do ``gunicorn`` se sua aplicação precisa de uma versão não padrão de qualquer coisa que está disponível no ``sys.path`` padrão -- o script wrapper para a aplicação principal travará na versão que está disponível por padrão, então a chamada subsequente de ``require`` em seu próprio código falhará com um conflito de versão espúrio.
ru: Основное ограничение параллельной установки на основе ``pkg_resources`` заключается в том, что как только вы импортируете ``pkg_resources``, он фиксирует *default* версию всего, что уже доступно в sys.path. Это может вызвать проблемы, поскольку скрипты командной строки, созданные ``setuptools``, используют ``pkg_resources`` для поиска точки входа для выполнения. Это означает, что, например, вы не сможете использовать тесты ``require``, вызываемые через ``nose``, или приложения WSGI, вызываемые через ``gunicorn``, если вашему приложению нужна версия, отличная от той, что доступна по умолчанию в стандартном ``sys.path`` - скриптовая обертка для основного приложения заблокирует версию, доступную по умолчанию, и последующий вызов ``require`` в вашем собственном коде завершится с ложным конфликтом версий.
ta: `` பி.கே. இது சிக்கல்களை ஏற்படுத்தக்கூடும், ஏனெனில் `` setuptools`` உருவாக்கிய கட்டளை வரி ச்கிரிப்ட்கள் `` pkg_resources`` ஐப் பயன்படுத்துகின்றன. இதன் பொருள், எடுத்துக்காட்டாக, `` மூக்கு`` அல்லது `` `` குனிகார்ன்`` மூலம் பயன்படுத்தப்பட்ட `` தேவை` சோதனைகளை நீங்கள் பயன்படுத்த முடியாது, உங்கள் விண்ணப்பத்திற்கு கிடைக்கக்கூடிய எதையும் தாக்குதல் அல்லாத பதிப்பு தேவைப்பட்டால் நிலையான `` sys.bath`` - முதன்மையான பயன்பாட்டிற்கான ச்கிரிப்ட் ரேப்பர் இயல்புநிலையாக கிடைக்கும் பதிப்பில் பூட்டப்படும், எனவே அடுத்தடுத்த `` தேவை` உங்கள் சொந்த குறியீட்டில் அழைப்பு ஒரு மோசமான பதிப்பு மோதலுடன் தோல்வியடைகிறது.

source: This can be worked around by setting all dependencies in ``__main__.__requires__`` before importing ``pkg_resources`` for the first time, but that approach does mean that standard command line invocations of the affected tools can't be used - it's necessary to write a custom wrapper script or use ``python3 -c '<command>'`` to invoke the application's main entry point directly.
ja: 最初に ``pkg_resources`` をインポートするよりも前に ``__main__.__requires__`` の中のすべての依存関係を設定しておくことでこの問題を回避することができますが、このアプローチでは影響を受けるツールを標準のコマンドラインからの呼び出しで使うことができないことになります - つまり、独自のラッパスクリプトを書くか、アプリケーションの main エントリポイントを直接に呼び出すための ``python -c '<command>'`` を使うかしなければなりません。
pt_br: Isso pode ser contornado definindo todas as dependências em ``__main__.__ require__`` antes de importar ``pkg_resources`` pela primeira vez, mas essa abordagem significa que as invocações de linha de comando padrão das ferramentas afetadas não podem ser usadas -- é necessário escrever um script wrapper personalizado ou usar ``python3 -c '<comando>'`` para invocar o ponto de entrada principal da aplicação diretamente.
ru: Это можно обойти, установив все зависимости в ``__main__.__requires__`` перед первым импортом ``pkg_resources``, но такой подход означает, что стандартные вызовы командной строки соответствующих инструментов не могут быть использованы - необходимо написать собственный сценарий-обертку или использовать ``python3 -c '<command>'`` для прямого вызова основной точки входа приложения.
ta: முதல் முறையாக `` பி.கே. தனிப்பயன் ரேப்பர் ச்கிரிப்டை எழுத தேவை அல்லது பயன்பாட்டின் முதன்மையான நுழைவு புள்ளியை நேரடியாக அழைக்க `` பைதான் 3 -c '<compround>' `` பயன்படுத்த வேண்டும்.

source: Refer to the `pkg_resources documentation <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#workingset-objects>`__ for more details.
eo: Por pliaj detaloj, vidu `la dokumentaron de pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#workingset-objects>`__.
ja: さらに詳しい情報については、 `pkg_resources 説明文書 <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#workingset-objects>`__ を参照してください。
pt_br: Confira a `documentação de pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#workingset-objects>`__ para mais detalhes.
ru: За более подробной информацией обратитесь к документации по `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#workingset-objects>`__.
ta: மேலும் விவரங்களுக்கு `pkg_resources ஆவணங்கள் <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#owml#owml#workingset-objects ஐப் பார்க்கவும்.

source: Packaging binary extensions
eo: Paki duumajn etendaĵojn
ja: バイナリ拡張をパッケージングする
pt_br: Empacotando extensões binárias
ru: Упаковка двоичных расширений
ta: பேக்கேசிங் பைனரி நீட்டிப்புகள்

source: One of the features of the CPython reference interpreter is that, in addition to allowing the execution of Python code, it also exposes a rich C API for use by other software. One of the most common uses of this C API is to create importable C extensions that allow things which aren't always easy to achieve in pure Python code.
eo: La referenca interpretilo CPython, krome permesanta ruli Python-kodon, ankaŭ disponigas riĉan API en C por aliaj programoj. Unu el la plej oftaj uzoj de tiu API en C estas krei importeblan C-etendaĵon por tio, kio malfacilas per pura Python-kodo.
ja: CPython の参照インタープリタの機能の一つは、Python のコードを実行することに加えて、他のソフトウェアによる利用のために豊富な C の API を露出することです。この C の API の最もよくある利用方法は、純粋な Python のコードでは必ずしも簡単には達成できないようなことをインポート可能な C 拡張として作成することです。
pt_br: Uma das características do interpretador de referência CPython é que, além de permitir a execução do código Python, também expõe uma API C rica para uso por outro software. Um dos usos mais comuns dessa API C é criar extensões C importáveis que permitem coisas que nem sempre são fáceis de alcançar em código puro Python.
ru: Одна из особенностей эталонного интерпретатора CPython заключается в том, что, помимо возможности выполнения кода Python, он также предоставляет богатый C API для использования другими программами. Одно из наиболее распространенных применений этого C API - создание импортируемых расширений C, которые позволяют делать вещи, которые не всегда легко реализовать в чистом коде Python.
ta: சிபிதான் குறிப்பு மொழிபெயர்ப்பாளரின் அம்சங்களில் ஒன்று, பைதான் குறியீட்டை செயல்படுத்த அனுமதிப்பதைத் தவிர, மற்ற மென்பொருளால் பயன்படுத்த ஒரு பணக்கார சி பநிஇ அம்பலப்படுத்துகிறது. இந்த சி ஏபிஐயின் மிகவும் பொதுவான பயன்பாடுகளில் ஒன்று, தூய பைதான் குறியீட்டில் எப்போதும் எளிதாக அடையாத விசயங்களை அனுமதிக்கும் இறக்குமதி செய்யக்கூடிய சி நீட்டிப்புகளை உருவாக்குவதாகும்.

source: An overview of binary extensions
eo: Superrigardo pri duumaj etendaĵoj
ja: バイナリ拡張の概要
pt_br: Uma visão geral de extensões binárias
ru: Обзор двоичных расширений
ta: பைனரி நீட்டிப்புகளின் கண்ணோட்டம்

source: Use cases
eo: Uzkazoj
ja: ユースケース
pt_br: Casos de uso
ru: Варианты использования
ta: வழக்குகளைப் பயன்படுத்துங்கள்

source: The typical use cases for binary extensions break down into just three conventional categories:
eo: Jen la tri oftaj uzkazoj de duumaĵ etendaĵoj:
ja: バイナリ拡張の典型的なユースケースは、たった３個の伝統的なカテゴリに分類されます:
pt_br: Os casos de uso típicos para extensões binárias se dividem em apenas três categorias convencionais:
ru: Типичные случаи использования бинарных расширений делятся всего на три условные категории:
ta: பைனரி நீட்டிப்புகளுக்கான வழக்கமான பயன்பாட்டு வழக்குகள் மூன்று வழக்கமான வகைகளாக உடைக்கப்படுகின்றன:

source: **accelerator modules**: these modules are completely self-contained, and are created solely to run faster than the equivalent pure Python code runs in CPython. Ideally, accelerator modules will always have a pure Python equivalent to use as a fallback if the accelerated version isn't available on a given system. The CPython standard library makes extensive use of accelerator modules. *Example*: When importing ``datetime``, Python falls back to the `datetime.py <https://github.com/python/cpython/blob/main/Lib/datetime.py>`_ module if the C implementation ( `_datetimemodule.c <https://github.com/python/cpython/blob/main/Modules/_datetimemodule.c>`_) is not available.
eo: **akcelila modulo**: tia modulo estas plene memstara kaj celas pli rapidi ol la ekvivalenta pur-Python-a kodo en CPython. Ideale, akcelila modulo ĉiam havas pur-Python-an ekvivalenton uzotan, se la akcelita versio ne estas disponebla ĉe iu sistemo. La norma biblioteko de CPython ofte uzas akcelilaijn modulojn. *Ekzemple*: Importante ``datetime``, Python uzas la modulon `datetime.py <https://github.com/python/cpython/blob/main/Lib/datetime.py>`_, se la C-realigo ( `_datetimemodule.C <https://github.com/python/cpython/blob/main/Modules/_datetimemodule.c>`_) ne estas disponebla.
ja: **アクセラレータモジュール**: これらのモジュールは完全に自己完結型で、CPython で同機能の純粋なPython コードを走らせるよりも速く動作するためにだけ作成されます。アクセラレートされたバージョンが当該システム上で動作しなかった時のために、アクセラレータモジュールには同機能の純粋なPythonのコードを予備品として同梱していることが理想的です。CPython の標準ライブラリはアクセラレータモジュールを多用しています。*例*: ``datetime`` をインポートする際、C での実装 (`_datetimemodule.c <https://github.com/python/cpython/blob/main/Modules/_datetimemodule.c>`_) が使えない時には、`datetime.py <https://github.com/python/cpython/blob/main/Lib/datetime.py>`_ にフォールバックします。
pt_br: **Módulos aceleradores**: esses módulos são completamente autocontidos e são criados exclusivamente para executar mais rápido do que o código puro Python equivalente é executado em CPython. Idealmente, os módulos aceleradores sempre terão um Python equivalente puro para usar como fallback se a versão acelerada não estiver disponível em um determinado sistema. A biblioteca padrão do CPython faz uso extensivo de módulos aceleradores. *Exemplo*: Ao importar ``datetime``, Python recorre ao módulo `datetime.py <https://github.com/python/cpython/blob/main/Lib/datetime.py>`_ se a implementação C ( `_datetimemodule.c <https://github.com/python/cpython/blob/main/Modules/_datetimemodule.c>`_) não estiver disponível.
ru: **Модули ускорителей**: эти модули полностью автономны и создаются исключительно для того, чтобы работать быстрее, чем эквивалентный код на чистом Python в CPython. В идеале, модули-ускорители всегда должны иметь эквивалент на чистом Python, который можно использовать в качестве запасного варианта, если ускоренная версия недоступна на данной системе. В стандартной библиотеке CPython широко используются модули-ускорители. *Пример*: При импорте ``datetime`` Python возвращается к модулю ``datetime.py <https://github.com/python/cpython/blob/main/Lib/datetime.py>`_, если реализация на C ( ``_datetimemodule.c <https://github.com/python/cpython/blob/main/Modules/_datetimemodule.c>`_) недоступна.
ta: . வெறுமனே, கொடுக்கப்பட்ட கணினியில் முடுக்கப்பட்ட பதிப்பு கிடைக்கவில்லை என்றால், முடுக்கி தொகுதிகள் எப்போதுமே ஒரு தூய பைத்தானைக் கொண்டிருக்கும். Cpython நிலையான நூலகம் முடுக்கி தொகுதிகளை விரிவாகப் பயன்படுத்துகிறது. . செயல்படுத்தல் (`_datetimemodule.c <https://github.com/python/cpython/blob/main/modules/_datetimemodule.c> _ _) கிடைக்கவில்லை.

source: **wrapper modules**: these modules are created to expose existing C interfaces to Python code. They may either expose the underlying C interface directly, or else expose a more "Pythonic" API that makes use of Python language features to make the API easier to use. The CPython standard library makes extensive use of wrapper modules. *Example*: `functools.py <https://github.com/python/cpython/blob/main/Lib/functools.py>`_ is a Python module wrapper for `_functoolsmodule.c <https://github.com/python/cpython/blob/main/Modules/_functoolsmodule.c>`_.
ja: **ラッパモジュール**: これらのモジュールは、既存の C のインタフェースを Python に見せるために作られます。それらは C のインタフェースを直接に見せるか、または、Python 言語の機能を使ってAPI をより使いやすくするようなもっと "Pythonic" なやり方で見せるかします。CPython の標準ライブラリでは、ラッパモジュールを多用しています。 *例*: `functools.py <https://github.com/python/cpython/blob/main/Lib/functools.py>`_ は、 `_functoolsmodule.c <https://github.com/python/cpython/blob/main/Modules/_functoolsmodule.c>`_ のためのラッパモジュールです。
pt_br: **módulos wrapper**: esses módulos são criados para expor as interfaces C existentes ao código Python. Eles podem expor a interface C subjacente diretamente ou então expor uma API mais "Pythônica" que faz uso dos recursos da linguagem Python para tornar a API mais fácil de usar. A biblioteca padrão do CPython faz uso extensivo de módulos wrapper. *Exemplo*: `functools.py <https://github.com/python/cpython/blob/main/Lib/functools.py>`_ é um módulo Python wrapper para `_functoolsmodule.c <https://github.com/python/cpython/blob/main/Modules/_functoolsmodule.c>`_.
ru: **модули-обертки**: эти модули создаются для раскрытия существующих интерфейсов C в коде Python. Они могут либо напрямую раскрывать основной интерфейс C, либо раскрывать более "питоновский" API, который использует возможности языка Python, чтобы сделать API проще в использовании. В стандартной библиотеке CPython широко используются модули-обертки. *Пример*: `functools.py <https://github.com/python/cpython/blob/main/Lib/functools.py>`_ - это модуль-обертка Python для `_functoolsmodule.c <https://github.com/python/cpython/blob/main/Modules/_functoolsmodule.c>`_.
ta: ** ரேப்பர் தொகுதிகள் **: இந்த தொகுதிகள் தற்போதுள்ள சி இடைமுகங்களை பைதான் குறியீட்டிற்கு வெளிப்படுத்த உருவாக்கப்படுகின்றன. அவை அடிப்படை சி இடைமுகத்தை நேரடியாக அம்பலப்படுத்தலாம், இல்லையெனில் பநிஇ பயன்படுத்த எளிதாக்குவதற்கு பைதான் மொழி அம்சங்களைப் பயன்படுத்தும் அதிக "பைத்தானிக்" பநிஇ அம்பலப்படுத்தலாம். Cpython நிலையான நூலகம் ரேப்பர் தொகுதிகளை விரிவாகப் பயன்படுத்துகிறது. . com/python/cpython/blob/main/தொகுதிகள்/_functoolsmodule.c> `_.

source: **low-level system access**: these modules are created to access lower level features of the CPython runtime, the operating system, or the underlying hardware. Through platform specific code, extension modules may achieve things that aren't possible in pure Python code. A number of CPython standard library modules are written in C in order to access interpreter internals that aren't exposed at the language level. *Example*: ``sys``, which comes from `sysmodule.c <https://github.com/python/cpython/blob/main/Python/sysmodule.c>`_.
ja: **低レベルシステムアクセス**: これらのモジュールは、CPython ランタイムやオペレーティングシステム、あるいはさらに下層のハードウェアの低レベルの機能にアクセスするために作成されています。プラットフォームに固有のコードを通して、純粋な Python コードでは不可能なことを拡張モジュールが達成できるかもしれません。結構な数の CPython の標準ライブラリモジュールが C で書かれていて、言語のレベルには提供されていないようなインタープリタの内部にアクセスできるようになっています。 *例*: ``sys`` は `sysmodule.c <https://github.com/python/cpython/blob/main/Python/sysmodule.c>`_ から来ています。
pt_br: **acesso de baixo nível ao sistema**: esses módulos são criados para acessar os recursos de baixo nível do tempo de execução do CPython, do sistema operacional ou do hardware subjacente. Por meio do código específico da plataforma, os módulos de extensão podem alcançar coisas que não são possíveis no código puro Python. Vários módulos de biblioteca padrão do CPython são escritos em C para acessar as partes internas do interpretador que não são expostas no nível da linguagem. *Exemplo*: ``sys``, que vem de `sysmodule.c <https://github.com/python/cpython/blob/main/Python/sysmodule.c>`_.
ru: **низкоуровневый доступ к системе**: эти модули создаются для доступа к функциям нижнего уровня среды выполнения CPython, операционной системы или базового оборудования. С помощью специфического для платформы кода модули расширения могут достигать того, что невозможно в чистом коде Python. Ряд модулей стандартной библиотеки CPython написан на языке C, чтобы получить доступ к внутренним функциям интерпретатора, которые не раскрываются на уровне языка. *Пример*: ``Sys``, который берется из `sysmodule.c <https://github.com/python/cpython/blob/main/Python/sysmodule.c>`_.
ta: ** குறைந்த-நிலை கணினி அணுகல் **: இந்த தொகுதிகள் CPython இயக்க நேரம், இயக்க முறைமை அல்லது அடிப்படை வன்பொருளின் கீழ் நிலை அம்சங்களை அணுக உருவாக்கப்படுகின்றன. இயங்குதள குறிப்பிட்ட குறியீடு மூலம், நீட்டிப்பு தொகுதிகள் தூய பைதான் குறியீட்டில் சாத்தியமில்லாத விசயங்களை அடையக்கூடும். மொழி மட்டத்தில் வெளிப்படுத்தப்படாத மொழிபெயர்ப்பாளர் உட்புறங்களை அணுகுவதற்காக பல CPYTHON நிலையான நூலக தொகுதிகள் C இல் எழுதப்பட்டுள்ளன. .

source: One particularly notable feature of C extensions is that, when they don't need to call back into the interpreter runtime, they can release CPython's global interpreter lock around long-running operations (regardless of whether those operations are CPU or IO bound).
eo: Unu rimarkinda trajto de C-etendaĵo estas, ke ĝi povas liberigi la mallokan interpretilan seruron de CPython dum longdaŭra operacio, se ĝi ne bezonas alvoki interpretilan rultempon reen (por kaj ĉefprocesoraj kaj eneligaj operacioj).
ja: C 言語拡張の特筆すべき機能は、インタプリタランタイムにコールバックする必要のない時には、 (CPU制約であろうとIO制約であろうと関わりなく) 長時間走り続ける操作を包む CPython グローバルインタプリタロックを解放することができるということです。
pt_br: Um recurso particularmente notável das extensões C é que, quando não precisam chamar de volta para o tempo de execução do interpretador, podem liberar o bloqueio do interpretador global do CPython em torno de operações de longa duração (independentemente de essas operações serem vinculados à CPU ou à E/S).
ru: Особенно примечательной особенностью расширений на C является то, что, когда им не нужно возвращаться во время выполнения интерпретатора, они могут освободить глобальную блокировку интерпретатора CPython для длительных операций (независимо от того, связаны ли эти операции с процессором или IO).
ta: சி நீட்டிப்புகளின் குறிப்பாக குறிப்பிடத்தக்க நற்பொருத்தம் என்னவென்றால், அவர்கள் மொழிபெயர்ப்பாளர் இயக்க நேரத்திற்கு திரும்ப அழைக்கத் தேவையில்லை, அவர்கள் சிபிதானின் உலகளாவிய மொழிபெயர்ப்பாளர் பூட்டை நீண்டகால செயல்பாடுகளைச் சுற்றி வெளியிடலாம் (அந்த செயல்பாடுகள் சிபியு அல்லது IO பிணைப்பு என்பதைப் பொருட்படுத்தாமல்).

source: Not all extension modules will fit neatly into the above categories. The extension modules included with NumPy, for example, span all three use cases - they move inner loops to C for speed reasons, wrap external libraries written in C, FORTRAN and other languages, and use low level system interfaces for both CPython and the underlying operation system to support concurrent execution of vectorised operations and to tightly control the exact memory layout of created objects.
eo: Ne ĉia etendaĵo-modulo estas sole en unu el la ĉi-supraj kategorioj. La etendaĵo-modulo en NumPy, ekzemple, estas por ĉiuj tri uzkazoj – ĝi movas internajn iteraciojn al C por rapidigo, volvas eksterajn bibliotekojn en C, Fortrano kaj aliaj lingvoj, kaj uzas malaltnivelajn sistemajn interfacojn por kaj CPython kaj la mastruma sistemo por samtempa rulado de vektorigitaj operacioj kaj por regi la precizan memoraranĝon de kreitaj objektoj.
ja: 必ずしも全ての拡張モジュールが上記のカテゴリにぴたりと当て嵌まる訳ではありません。例えば NumPy に含まれる拡張モジュールは３個のカテゴリのすべてにまたがっています - 動作速度上の理由から内側のループを C 言語に移しているし、C 言語や FORTRAN 言語その他で書かれた外部のライブラリをラップしているし、また、ベクタ演算の並列実行や生成したオブジェクトのメモリレイアウトを正確な管理のために、 CPython とその下にあるオペレーティングシステムの両方の低レベルなシステムインターフェイスを利用しています。
pt_br: Nem todos os módulos de extensão se encaixam perfeitamente nas categorias acima. Os módulos de extensão incluídos com NumPy, por exemplo, abrangem todos os três casos de uso -- eles movem loops internos para C por motivos de velocidade, agrupam bibliotecas externas escritas em C, FORTRAN e outras linguagens e usam interfaces de sistema de baixo nível para CPython e o sistema operacional subjacente para oferecer suporte à execução simultânea de operações vetorizadas e para controlar rigidamente o layout de memória exato dos objetos criados.
ru: Не все модули расширения будут четко вписываться в вышеперечисленные категории. Например, модули расширения, входящие в состав NumPy, охватывают все три варианта использования - они переносят внутренние циклы на C по соображениям скорости, оборачивают внешние библиотеки, написанные на C, FORTRAN и других языках, и используют низкоуровневые системные интерфейсы как для CPython, так и для базовой операционной системы, чтобы поддерживать одновременное выполнение векторных операций и жестко контролировать точное расположение в памяти созданных объектов.
ta: எல்லா நீட்டிப்பு தொகுதிகளும் மேலே உள்ள வகைகளுக்கு அழகாக பொருந்தாது. NUMPY உடன் சேர்க்கப்பட்ட நீட்டிப்பு தொகுதிகள், எடுத்துக்காட்டாக, மூன்று பயன்பாட்டு நிகழ்வுகளையும் பரப்புகின்றன - அவை வேக காரணங்களுக்காக உள் சுழல்களை C க்கு நகர்த்துகின்றன, C, Fortran மற்றும் பிற மொழிகளில் எழுதப்பட்ட வெளிப்புற நூலகங்களை போர்த்துகின்றன, மேலும் CPyThon மற்றும் அடிப்படை இரண்டிற்கும் குறைந்த அளவிலான கணினி இடைமுகங்களைப் பயன்படுத்துகின்றன திசையன் செய்யப்பட்ட செயல்பாடுகளை ஒரே நேரத்தில் செயல்படுத்துவதற்கும், உருவாக்கப்பட்ட பொருட்களின் சரியான நினைவக அமைப்பை இறுக்கமாகக் கட்டுப்படுத்துவதற்கும் செயல்பாட்டு அமைப்பு.

source: Disadvantages
eo: Malavantaĝoj
ja: 欠点
pt_br: Desvantagens
ru: Недостатки
ta: குறைபாடுகள்
