Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Who are your software's users? Will your software be installed by other developers doing software development, operations people in a datacenter, or a less software-savvy group?
eo: Kiuj estas la uzantoj de via programo? Ĉu via programo estos instalita de alia programisto verkanta programon, operaciisto en datenejo, aŭ nespertulo?
ja: あなたのソフトウェアのユーザはどんな人たちでしょうか？ソフトウェアを開発する他の開発者たちがインストールするのでしょうか、データセンタでオペレーションをする人々でしょうか、それとも、ソフトウェアを知り尽くしているとは言えないような人たちでしょうか？
pt_br: Quem são os usuários do seu software? Seu software será instalado por outros desenvolvedores que fazem o desenvolvimento de software, pessoas de operações em um datacenter ou um grupo com menos experiência em software?
ru: Кто будет пользоваться вашим программным обеспечением? Будет ли ваше программное обеспечение устанавливаться другими разработчиками, занимающимися разработкой программного обеспечения, операторами в центре обработки данных или другими людьми, менее подкованными в вопросах программного обеспечения?
ta: உங்கள் மென்பொருளின் பயனர்கள் யார்? மென்பொருள் மேம்பாடு, டேட்டாசென்டரில் செயல்படும் நபர்கள் அல்லது குறைவான மென்பொருள் ஆர்வமுள்ள குழு ஆகியவற்றைச் செய்யும் பிற டெவலப்பர்களால் உங்கள் மென்பொருள் நிறுவப்படுமா?

source: Is your software intended to run on servers, desktops, mobile clients (phones, tablets, etc.), or embedded in dedicated devices?
eo: Ĉu via programo estas por servilo, labortabla komputilo, portebla kliento (telefono, tabulkomputilo ktp), aŭ enkonstruado en aparaton?
ja: あなたのソフトウェアは、サーバ上で走らせることを想定していますか、それとも、デスクトップ、モバイル端末 (携帯電話やタブレット端末等) 、あるいは、専用端末に組み込む形で？
pt_br: O seu software deve ser executado em servidores, desktops, clientes móveis (telefones, tablets, etc.) ou incorporado em dispositivos dedicados?
ru: Ваше программное обеспечение предназначено для работы на серверах, настольных компьютерах, мобильных клиентах (телефонах, планшетах и т. д.) или встроено в специализированные устройства?
ta: உங்கள் மென்பொருள் சேவையகங்கள், டெச்க்டாப்புகள், மொபைல் கிளையண்டுகள் (தொலைபேசிகள், டேப்லெட்டுகள் போன்றவை) அல்லது அர்ப்பணிப்பு சாதனங்களில் உட்பொதிக்கப்பட்டதா?

source: Is your software installed individually, or in large deployment batches?
eo: Ĉu via programo estas instalata unuope aŭ multope?
ja: あなたのソフトウェアは、単独でインストールされるものですか、それとも、巨大なデプロイメントバッチの一部として？
pt_br: O seu software é instalado individualmente ou em grandes lotes de implantação?
ru: Ваше программное обеспечение устанавливается индивидуально или большими партиями?
ta: உங்கள் மென்பொருள் தனித்தனியாக நிறுவப்பட்டுள்ளதா, அல்லது பெரிய வரிசைப்படுத்தல் தொகுதிகளில் உள்ளதா?

source: Packaging is all about target environment and deployment experience. There are many answers to the questions above and each combination of circumstances has its own solutions. With this information, the following overview will guide you to the packaging technologies best suited to your project.
eo: Pakado temas pri la cela medio kaj la sperto de disponigo. Ekzistas multaj respondoj al la demandoj ĉi-supraj, kaj ĉiu kombinaĵo de cirkonstancoj havas siajn proprajn solvojn. La sekva superrigardo gvidos vin al la pakada teĥniko plej taŭga por via projekto.
ja: パッケージングとは、インストール先となる環境と配置(デプロイ)経験に関わるすべてのことです。上に述べた質問には多くの回答があり、それぞれの事情の組み合わせごとに解決策が存在します。この情報とともに、以下の概要説明の中で、あなたのプロジェクトに最適なパッケージング技術についてご案内します。
pt_br: O empacotamento tem tudo a ver com o ambiente de destino e a experiência de implantação. Existem muitas respostas para as perguntas acima e cada combinação de circunstâncias tem suas próprias soluções. Com essas informações, a visão geral a seguir o guiará para as tecnologias de empacotamento mais adequadas ao seu projeto.
ru: Упаковка зависит от целевой среды и опыта развертывания. Существует множество ответов на поставленные выше вопросы, и для каждого сочетания обстоятельств есть свои решения. Благодаря этой информации следующий обзор поможет вам выбрать технологии упаковки, наиболее подходящие для вашего проекта.
ta: பேக்கேசிங் என்பது இலக்கு சூழல் மற்றும் வரிசைப்படுத்தல் பட்டறிவு பற்றியது. மேலே உள்ள கேள்விகளுக்கு பல பதில்கள் உள்ளன, மேலும் ஒவ்வொரு சூழ்நிலையும் அதன் சொந்த தீர்வுகளைக் கொண்டுள்ளன. இந்த தகவலுடன், பின்வரும் கண்ணோட்டம் உங்கள் திட்டத்திற்கு மிகவும் பொருத்தமான பேக்கேசிங் தொழில்நுட்பங்களுக்கு உங்களை வழிநடத்தும்.

source: Packaging Python libraries and tools
eo: Paki Python-bibliotekojn kaj ilojn
ja: Python のライブラリやツールをパッケージングする
pt_br: Empacotando bibliotecas e ferramentas Python
ru: Python'ьи библиотеки и инструменты для упаковки
ta: பேக்கேசிங் பைதான் நூலகங்கள் மற்றும் கருவிகள்

source: You may have heard about PyPI, ``setup.py``, and ``wheel`` files. These are just a few of the tools Python's ecosystem provides for distributing Python code to developers, which you can read about in :doc:`guides/distributing-packages-using-setuptools`.
eo: Eble vi konas PyPI, ``setup.py``, kaj ``wheel``-dosieroj. Jen kelkaj iloj de la ekosistemo de Python por distribui Python-kodon al programistoj; vi povas legi pri ili en :doc:`guides/distributing-packages-using-setuptools`.
ja: PyPI や ``setup.py`` 、 ``wheel`` ファイルについて聞いたことがあるかもしれません。これらは Python のソースコードを開発者に配布するための Python エコシステムのほんの一部で、これらについては :doc:`guides/distributing-packages-using-setuptools` に説明があります。
pt_br: Você deve ter ouvido falar sobre PyPI, ``setup.py`` e arquivos ``wheel``. Estas são apenas algumas das ferramentas que o ecossistema Python oferece para distribuir código Python para desenvolvedores, sobre as quais você pode ler em :doc:`guides/distributing-packages-using-setuptools`.
ru: Возможно, вы слышали о PyPI, ``setup.py`` и ``wheel`` файлах. Это лишь некоторые из инструментов, предоставляемых экосистемой Python для распространения кода Python среди разработчиков, о которых вы можете прочитать в :doc:`guides/distributing-packages-using-setuptools`.
ta: பைபி, `` setup.py``, மற்றும் `` வீல்`` கோப்புகளைப் பற்றி நீங்கள் கேள்விப்பட்டிருக்கலாம். டெவலப்பர்களுக்கு பைதான் குறியீட்டை விநியோகிக்க பைதானின் சுற்றுச்சூழல் அமைப்பு வழங்கும் சில கருவிகள் இவை: நீங்கள் இதைப் படிக்கலாம்: DOC: `வழிகாட்டிகள்/விநியோகித்தல்-தொகுப்புகள்-பயன்படுத்தும்-செட்டப்டூல்ச்`.

source: The following approaches to packaging are meant for libraries and tools used by technical audience in a development setting. If you're looking for ways to package Python for a non-technical audience and/or a production setting, skip ahead to :ref:`packaging-applications`.
eo: La jenaj manieroj de pakado estas por bibliotekoj kaj iloj uzataj de fakuloj dum programado. Por paki Python-programon por nefakuloj kaj/aŭ por entreprena disponigo, vidu :ref:`packaging-applications`.
ja: パッケージングに関する以下のアプローチは、開発環境における技術に明るい聞き手が用いるライブラリやツールを念頭に置いています。技術にあまり明るくない聞き手向けに Python をパッケージする方法や、製品使用環境での方法を探している場合は、 :ref:`アプリケーションをパッケージングする` まで飛ばしてください。
pt_br: As abordagens a seguir para empacotamento são destinadas a bibliotecas e ferramentas usadas pelo público técnico em um ambiente de desenvolvimento. Se você está procurando maneiras de empacotar Python para um público não técnico e/ou uma configuração de produção, pule para :ref:`packaging-applications`.
ru: Следующие подходы к упаковке предназначены для библиотек и инструментов, используемых технической аудиторией в условиях разработки. Если вы ищете способы упаковки Python для нетехнической аудитории и/или в производственных условиях, переходите к :ref:`packaging-applications`.
ta: பேக்கேசிங் செய்வதற்கான பின்வரும் அணுகுமுறைகள் ஒரு மேம்பாட்டு அமைப்பில் தொழில்நுட்ப பார்வையாளர்களால் பயன்படுத்தப்படும் நூலகங்கள் மற்றும் கருவிகளுக்கானவை. தொழில்நுட்பமற்ற பார்வையாளர்கள் மற்றும்/அல்லது ஒரு தயாரிப்பு அமைப்பிற்காக பைத்தானை தொகுக்க வழிகளை நீங்கள் தேடுகிறீர்கள் என்றால், இதற்கு முன்னால் தவிர்க்கவும்: குறிப்பு: `பேக்கேசிங்-பயன்பாடுகள்`.

source: Python modules
eo: Python-moduloj
ja: Python モジュール
pt_br: Módulos Python
ru: Модули Python'а
ta: பைதான் தொகுதிகள்

source: A Python file, provided it only relies on the standard library, can be redistributed and reused. You will also need to ensure it's written for the right version of Python, and only relies on the standard library.
eo: Python-dosiero dependanta nur de la norma biblioteko estas redistribuebla kaj reuzebla. Oni ankaŭ devas certigi, ke ĝi estis verkita por la ĝusta versio de Python kaj nur dependas de la norma biblioteko.
ja: 標準ライブラリだけに依存している Python のファイルは、再配布して再利用することができます。他には正しいバージョンの Python 用に書かれていることと、標準ライブラリだけに依存していることを確実にしておけば良いでしょう。
pt_br: Um arquivo Python, desde que dependa apenas da biblioteca padrão, pode ser redistribuído e reutilizado. Você também precisará garantir que ele foi escrito para a versão correta do Python e depende apenas da biblioteca padrão.
ru: Файл Python, если он опирается только на стандартную библиотеку, может быть распространен и использован повторно. Вам также нужно убедиться, что он написан для правильной версии Python и опирается только на стандартную библиотеку.
ta: ஒரு பைதான் கோப்பு, நிலையான நூலகத்தை மட்டுமே நம்பியிருந்தால், மறுபகிர்வு செய்யப்பட்டு மீண்டும் பயன்படுத்தப்படலாம். பைத்தானின் சரியான பதிப்பிற்காக இது எழுதப்பட்டிருப்பதை நீங்கள் உறுதிப்படுத்த வேண்டும், மேலும் நிலையான நூலகத்தை மட்டுமே நம்பியுள்ளது.

source: This is great for sharing simple scripts and snippets between people who both have compatible Python versions (such as via email, StackOverflow, or GitHub gists). There are even some entire Python libraries that offer this as an option, such as :doc:`bottle.py<bottle:tutorial>` and :doc:`boltons <boltons:architecture>`.
ja: この方法は、単純なスクリプトやスニペットを互換性のあるバージョンの Python を持っている人たちどうしで (電子メールや StackOverflow や GitHub gists などで) 共有するには優れた方法です。例えば :doc:`bottle.py <bottle:tutorial>` や :doc:`boltons <boltons:architecture>` のように、 Python ライブラリ全体をこのやり方で共有することをオプションの一つとして提供しているものさえあります。
pt_br: Isso é ótimo para compartilhar scripts e trechos simples entre pessoas que possuem versões Python compatíveis (como via e-mail, StackOverflow ou gists do GitHub). Existem até algumas bibliotecas Python inteiras que oferecem isso como uma opção, como :doc:`bottle.py<bottle:tutorial>` e :doc:`boltons <boltons:architecture>`.
ru: Это отлично подходит для обмена простыми скриптами и фрагментами между людьми, у которых обе версии Python совместимы (например, по электронной почте, через StackOverflow или GitHub gists). Есть даже целые библиотеки Python, которые предлагают такую возможность, например :doc:`bottle.py<bottle:tutorial>` и :doc:`boltons <boltons:architecture>`.
ta: இணக்கமான பைதான் பதிப்புகள் (மின்னஞ்சல், ச்டேக்கோவர்ஃப்ளோ அல்லது அறிவிலிமையம் சிச்டுகள் போன்றவை) இருவருக்கும் இடையே எளிய ச்கிரிப்ட்கள் மற்றும் துணுக்குகளைப் பகிர்ந்து கொள்ள இது சிறந்தது. இதை ஒரு விருப்பமாக வழங்கும் சில முழு பைதான் நூலகங்களும் கூட உள்ளன, அதாவது: டாக்: `பாட்டில்.பி <பாட்டில்: டுடோரியல்>` மற்றும்: டாக்: `போல்டன்ச் <போல்டன்ச்: கட்டிடக்கலை>`.

source: However, this pattern won't scale for projects that consist of multiple files, need additional libraries, or need a specific version of Python, hence the options below.
eo: Tamen, tiu metodo ne funkcias bone por projekto konsistanta el multaj dosieroj, bezonanta pliajn bibliotekojn, au postulanta specifan version de Python; tial la ĉi-subaj opcioj.
ja: しかしながら、複数のファイルで構成されるプロジェクトや追加のライブラリを必要とするもの、また、特定バージョンの Python を必要とするものには適用できず、その場合には下のようなやり方が選択肢になります。
pt_br: No entanto, esse padrão não será escalonado para projetos que consistem em vários arquivos, precisam de bibliotecas adicionais ou precisam de uma versão específica do Python, daí as opções abaixo.
ru: Однако этот шаблон не подходит для проектов, состоящих из множества файлов, требующих дополнительных библиотек или конкретной версии Python, поэтому ниже приведены варианты.
ta: இருப்பினும், பல கோப்புகளைக் கொண்ட, கூடுதல் நூலகங்கள் தேவைப்படும் அல்லது பைத்தானின் குறிப்பிட்ட பதிப்பு தேவைப்படும் திட்டங்களுக்கு இந்த முறை அளவிடாது, எனவே கீழே உள்ள விருப்பங்கள்.

source: Python source distributions
eo: Python-fontaj distribuoj
ja: Python ソースコード配布物
pt_br: Distribuições fonte Python
ru: Дистрибутивы с исходным кодом Python
ta: பைதான் மூல வழங்கல்

source: If your code consists of multiple Python files, it's usually organized into a directory structure. Any directory containing Python files can comprise an :term:`Import Package`.
eo: Se via kodo konsistas el pluraj Python-dosieroj, ĝi estas kutime organizita en dosierujan strukturon. Dosierujo enhavanta Python-dosierojn povas esti :term:`Importa Pako <Import Package>`.
ja: あなたのソースコードが複数の Python ファイルでできているなら、ディレクトリ構造の中に整理してあるのが普通です。 Python ファイルを置いてあるディレクトリならどれでも、 :term:`パッケージインポート <Import Package>` ができるはずです。
pt_br: Se o seu código consiste em vários arquivos Python, ele geralmente é organizado em uma estrutura de diretório. Qualquer diretório contendo arquivos Python pode incluir um :term:`Pacote de Importação`.
ru: Если ваш код состоит из нескольких файлов Python, он обычно организован в структуру каталогов. Любой каталог, содержащий файлы Python, может составлять :term:`Import Package`.
ta: உங்கள் குறியீடு பல பைதான் கோப்புகளைக் கொண்டிருந்தால், அது வழக்கமாக ஒரு அடைவு கட்டமைப்பாக ஒழுங்கமைக்கப்படுகிறது. பைதான் கோப்புகளைக் கொண்ட எந்த கோப்பகமும் ஒரு: கால: `இறக்குமதி தொகுப்பு` ஐக் கொண்டிருக்கலாம்.

source: Because packages consist of multiple files, they are harder to distribute. Most protocols support transferring only one file at a time (when was the last time you clicked a link and it downloaded multiple files?). It's easier to get incomplete transfers, and harder to guarantee code integrity at the destination.
eo: Ĉar pako konsistas el pluraj dosieroj, distribui pakon estas pli malfacile. Multaj protokoloj nur kapablas transdoni po unu dosieron por ĉi fojo. (Se oni alklakas hiperligon, oni nur elŝutas unu dosieron.). Oftas neplena transdono, kaj malfacilas garantii la integrecon de la kodo ĉe la celloko.
ja: パッケージは複数のファイルで構成されるので、その配布がやや難しくなります。ほとんどのプロトコルではたった一個のファイルしか一度に送ることができません (リンクをクリックしたら複数のファイルをダウンロードしたことあります？)。不完全な転送になってしまうことは容易く、送り先でソースコードの完全性を保証することは困難です。
pt_br: Como os pacotes consistem em vários arquivos, eles são mais difíceis de distribuir. A maioria dos protocolos oferece suporte à transferência de apenas um arquivo por vez (quando foi a última vez que você clicou em um link e ele baixou vários arquivos?). É mais fácil obter transferências incompletas e mais difícil garantir a integridade do código no destino.
ru: Поскольку пакеты состоят из нескольких файлов, их сложнее распространять. Большинство протоколов поддерживают передачу только одного файла за раз (когда вы в последний раз нажимали на ссылку и она загружала несколько файлов?). Легче получить неполную передачу, и сложнее гарантировать целостность кода в месте назначения.
ta: தொகுப்புகள் பல கோப்புகளைக் கொண்டிருப்பதால், அவை விநியோகிக்க கடினமாக உள்ளன. பெரும்பாலான நெறிமுறைகள் ஒரு நேரத்தில் ஒரு கோப்பை மட்டுமே மாற்றுவதை ஆதரிக்கின்றன (கடைசியாக நீங்கள் ஒரு இணைப்பைக் சொடுக்கு செய்து பல கோப்புகளை பதிவிறக்கம் செய்தது எப்போது?). முழுமையற்ற இடமாற்றங்களைப் பெறுவது எளிதானது, மேலும் இலக்கை நோக்கி குறியீடு ஒருமைப்பாட்டை பொறுப்பு செய்வது கடினம்.

source: So long as your code contains nothing but pure Python code, and you know your deployment environment supports your version of Python, then you can use Python's native packaging tools to create a *source* :term:`Distribution Package`, or *sdist* for short.
eo: Se la kodo enhavas nur Python-kodon kaj la disponiga medio subtenas vian version de Ptyhon, oni povas uzi la indiĝenajn pakilojn de Python por krei *fontan* :term:`Distribuan Pakon <Distribution Package>`, aŭ mallongigite *sdist*.
ja: あなたのソースコードが純粋な Python コード以外は何も含んでいない間は、そして、配置先の環境であなたが想定しているバージョンの Python が動作することを知っていれば、 Python 由来のパッケージングツールを使って *ソースコード* :term:`配布パッケージ <Distribution Package>` もしくは 短縮系で*sdist* を使えば良いでしょう。
pt_br: Contanto que seu código não contenha nada além de código puro Python, e você saiba que seu ambiente de implantação oferece suporte a sua versão de Python, então você pode usar as ferramentas de empacotamento nativas do Python para criar um :term:`Pacote de Distribuição` fonte, ou *sdist*.
ru: Если ваш код содержит только чистый код Python, и вы знаете, что ваша среда развертывания поддерживает вашу версию Python, то вы можете использовать собственные средства упаковки Python для создания *source* :term:`Distribution Package`, или *sdist* для краткости.
ta: உங்கள் குறியீட்டில் தூய பைதான் குறியீட்டைத் தவிர வேறு எதுவும் இல்லை, மேலும் உங்கள் வரிசைப்படுத்தல் சூழல் உங்கள் பைத்தானின் பதிப்பை ஆதரிக்கிறது என்பது உங்களுக்குத் தெரியும், பின்னர் நீங்கள் ஒரு *மூலத்தை உருவாக்க பைத்தானின் சொந்த பேக்கேசிங் கருவிகளைப் பயன்படுத்தலாம் *: கால: `விநியோக தொகுப்பு`, அல்லது *SDIST * சுருக்கமாக.

source: Python's *sdists* are compressed archives (``.tar.gz`` files) containing one or more packages or modules. If your code is pure-Python, and you only depend on other Python packages, you can go to the :ref:`source-distribution-format` specification to learn more.
eo: La *sdist* de Python estas densigita arĥivo (de dosiersufikso ``.tar.gz``) enhavanta unu aŭ plurajn pakojn aŭ modulojn. Se via kodo konsistas nur el Python kaj vi nur dependas de aliaj pakoj verkitaj en Python, vi povas lerni plu ĉe la normo :ref:`source-distribution-format`.
ja: Python の *sdists* は圧縮済みのアーカイブ (``.tar.gz`` ファイル) で、ひとつかそれ以上のパッケージないしモジュールを内包しています。もしあなたのソースコードが純粋に Python だけで書かれていて、他の Python パッケージに依存しているだけなら、 :ref:`ソースコード配布物フォーマット <source-distribution-format>` 仕様を見ればもっと詳しく知ることができます。
pt_br: Os *sdists* do Python são arquivos compactados (arquivos ``.tar.gz``) contendo um ou mais pacotes ou módulos. Se seu código for puro Python e você depender apenas de outros pacotes Python, você pode consultar a especificação de :ref:`source-distribution-format` para saber mais.
ru: Python'овские *sdists* - это сжатые архивы (файлы ``.tar.gz``), содержащие один или несколько пакетов или модулей. Если ваш код - это чистый Python, и вы зависите только от других пакетов Python, вы можете обратиться к спецификации :ref:`source-distribution-format`, чтобы узнать больше.
ta: பைதானின் * Sdists * ஒன்று அல்லது அதற்கு மேற்பட்ட தொகுப்புகள் அல்லது தொகுதிகள் கொண்ட சுருக்கப்பட்ட காப்பகங்கள் (`.tar.gz`` கோப்புகள்) ஆகும். உங்கள் குறியீடு தூய-பைதான் என்றால், நீங்கள் மற்ற பைதான் தொகுப்புகளை மட்டுமே சார்ந்து இருந்தால், நீங்கள்: ref: `மூல-விநியோக-வடிவ விவரக்குறிப்பு` மேலும் அறியச் செல்லலாம்.

source: If you rely on any non-Python code, or non-Python packages (such as `libxml2 <https://en.wikipedia.org/wiki/Libxml2>`_ in the case of `lxml <https://pypi.org/project/lxml/>`_, or BLAS libraries in the case of `numpy <https://pypi.org/project/numpy>`_), you will need to use the format detailed in the next section, which also has many advantages for pure-Python libraries.
eo: Se vi dependas de ne Python-a kodo aŭ ne-Python-a pako (kiel `libxml2 <https://en.wikipedia.org/wiki/Libxml2>`_ por `lxml <https://pypi.org/project/lxml/>`_ aŭ BLAS-bibliotekoj por `numpy <https://pypi.org/project/numpy>`_), vi devas uzi la formon detalitan en la sekva paragrafo, kiu estas ankaŭ utila eĉ por pure Python-a biblioteko.
ja: もし非 Python のソースコード、あるいは、非 Python のパッケージ (`lxml <https://pypi.org/project/lxml/>`_ における `libxml2 <https://en.wikipedia.org/wiki/Libxml2>`_ や、`numpy <https://pypi.org/project/numpy>`_ における BLAS ライブラリなど) に依存しているなら、純 Python で書かれたライブラリにとっても多くの利点がある、次の節で詳細に説明されるフォーマットを使う必要があるでしょう。
pt_br: Se você confiar em qualquer código não-Python ou pacotes não-Python (como `libxml2 <https://en.wikipedia.org/wiki/Libxml2>`_ no caso de `lxml <https: //pypi.org/project/lxml/>`_, ou bibliotecas BLAS no caso de `numpy <https://pypi.org/project/numpy>`_), você precisará usar o formato detalhado no a próxima seção, que também tem muitas vantagens para bibliotecas puro Python.
ru: Если вы полагаетесь на какой-либо не-Python код или не-Python пакеты (например, `libxml2 <https://en.wikipedia.org/wiki/Libxml2>`_ в случае `lxml <https://pypi.org/project/lxml/>`_, или BLAS библиотеки в случае `numpy <https://pypi.org/project/numpy>`_), вам нужно будет использовать формат, подробно описанный в следующем разделе, который также имеет много преимуществ для чисто-Python библиотек.
ta: நீங்கள் ஏதேனும் பைதான் அல்லாத குறியீடு அல்லது பைதான் அல்லாத தொகுப்புகளை நம்பினால் (`libxml2 <https://en.wikipedia.org/wiki/libxml2>` _ _ lxml <https: // pypi விசயத்தில். org/project/lxml/> `_, அல்லது பிளாச் நூலகங்கள் `numpy <https://pypi.org/project/numpy>` _), அடுத்த பகுதியில் விவரிக்கப்பட்டுள்ள வடிவமைப்பை நீங்கள் பயன்படுத்த வேண்டும், இது தூய-பைத்தான் நூலகங்களுக்கு பல நன்மைகளையும் கொண்டுள்ளது.

source: Python and PyPI support multiple distributions providing different implementations of the same package. For instance the unmaintained-but-seminal `PIL distribution <https://pypi.org/project/PIL/>`_ provides the PIL package, and so does `Pillow <https://pypi.org/project/Pillow/>`_, an actively-maintained fork of PIL!
eo: Python kaj PyPI subtenas plurajn distribuojn de malsamaj realigoj de la sama pako. Ekzemple, la ne plu mastrumata sed origina `distribuo PIL <https://pypi.org/project/PIL/>`_ provizas la pakon PIL, ankaŭ provizatan de `Pillow <https://pypi.org/project/Pillow/>`_, kiu estas aktive mastrumata forko de PIL!
ja: Python と PyPI は、同一のパッケージの異なる実装を提供する複数の配布物をサポートしています。例えば、もはや保守されてはいないが先駆的で重要な `PIL 配布物 <https://pypi.org/project/PIL/>`_ が PIL パッケージを提供しているし、 PIL からフォークして今も活発に保守されている `Pillow <https://pypi.org/project/Pillow/>`_ も同様です！
pt_br: Python e PyPI oferecem suporte a várias distribuições, fornecendo diferentes implementações do mesmo pacote. Por exemplo, a `distribuição PIL <https://pypi.org/project/PIL/>`_ não mantida, mas inspiracional, fornece o pacote PIL, e também o `Pillow <https://pypi.org/project/Pillow/>`_, um fork do PIL!
ru: Python и PyPI поддерживают несколько дистрибутивов, предоставляющих различные реализации одного и того же пакета. Например, неосновной, но многозначительный дистрибутив `PIL <https://pypi.org/project/PIL/>`_ предоставляет пакет PIL, как и `Pillow <https://pypi.org/project/Pillow/>`_, активно поддерживаемый форк PIL!
ta: பைதான் மற்றும் பைபி ஆகியவை ஒரே தொகுப்பின் வெவ்வேறு செயலாக்கங்களை வழங்கும் பல விநியோகங்களை ஆதரிக்கின்றன. உதாரணமாக, செயல்படாத-பட்-செமினல் `பைல் வழங்கல் <https://pypi.org/project/pil/>` _ PIL தொகுப்பை வழங்குகிறது, எனவே `தலையணை <https://pypi.org/project/pillow/ > `_, பில் தீவிரமாக பராமரிக்கப்படும் முட்கரண்டி!

source: This Python packaging superpower makes it possible for Pillow to be a drop-in replacement for PIL, just by changing your project's ``install_requires`` or ``requirements.txt``.
eo: Per ĉi tiu pakada kapablo de Python, Pillow povas esti plena anstataŭigaĵo por PIL simple per ŝanĝo de la ``install_requires`` aŭ ``requirements.txt`` de via projekto.
ja: この Python パッケージングの素晴らしいパワーで、あなたのプロジェクトの ``install_requires`` か ``requirements.txt`` を変更するだけで Pillow が PIL に対して単純に入れ替えるだけで済む代替物になっているのです。
pt_br: Este superpoder de empacotamento do Python torna possível que o Pillow seja um substituto imediato para o PIL, apenas alterando o ``install_requires`` ou ``requirements.txt`` do seu projeto.
ru: Эта суперспособность упаковки Python позволяет Pillow стать полноценной заменой PIL, просто изменив ``install_requires`` или ``requirements.txt`` в вашем проекте.
ta: இந்த பைதான் பேக்கேசிங் சூப்பர் பவர் உங்கள் திட்டத்தின் `` install_requires`` அல்லது `` தேவைகள். Txt`` ஐ மாற்றுவதன் மூலம், PIL க்கு ஒரு டிராப்-இன் மாற்றாக தலையணைக்கு சாத்தியமாக்குகிறது.

source: Python binary distributions
eo: Python-duumaj distribuoj
ja: Python バイナリ配布物
pt_br: Distribuições binárias Python
ru: Бинарные дистрибутивы Python
ta: பைதான் பைனரி விநியோகங்கள்
