Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: You can see if your package has successfully uploaded by navigating to the URL ``https://test.pypi.org/project/<sampleproject>`` where ``sampleproject`` is the name of your project that you uploaded. It may take a minute or two for your project to appear on the site.
eo: Vi povas kontroli, ĉu via pako estis sukcese alŝutita, vizitante la retadreson ``https://test.pypi.org/project/<viaprojekto>``, en kiu ``<viaprojekto>`` estas la nomo de via alŝutita projekto. Eblas, ke vi devas atendi unu aŭ du minutojn.
ja: ``https://test.pypi.org/project/<sampleproject>`` の ``sample project`` の部分をあなたがアップロードしたプロジェクトの名前に置き換えた URL を参照すれば、あなたのパッケージがうまくアップロードできたかどうかを確認することができます。サイトにあなたのプロジェクトが反映されるまでには 1,2 分かかるかもしれません。
pt_br: Você pode ver se o seu pacote foi enviado com sucesso navegando para a URL ``https://test.pypi.org/project/<projetoexemplo>`` onde ``projetoexemplo`` é o nome do seu projeto que você enviou. O seu projeto pode demorar um ou dois minutos para aparecer no site.
ru: Вы можете убедиться, что ваш пакет успешно загружен, перейдя по URL-адресу ``https://test.pypi.org/project/<sampleproject>``, где ``sampleproject`` - это имя загруженного вами проекта. Возможно, потребуется минута или две, чтобы ваш проект появился на сайте.
ta: `` Https://test.pypi.org/project/ <amphalproject> `` `` மாதிரி வெளியீட்டு`` என்பது நீங்கள் பதிவேற்றிய உங்கள் திட்டத்தின் பெயர். உங்கள் திட்டம் தளத்தில் தோன்றுவதற்கு ஒரு மணித்துளி அல்லது இரண்டு நேரம் ஆகலாம்.

source: Using TestPyPI with pip
eo: Uzi TestPyPI kun pip
ja: pip で TestPyPI を使う
pt_br: Usando TestPyPI com pip
ru: Использование TestPyPI вместе с pip
ta: PIP உடன் டெச்ட்பைப்பைப் பயன்படுத்துதல்

source: You can tell :ref:`pip` to download packages from TestPyPI instead of PyPI by specifying the ``--index-url`` flag:
eo: Vi povas igi :ref:`pip` elŝuti pakojn el Prova PyPI anstataŭ PyPI per la flago ``--index-url``:
ja: :ref:`pip` で PyPI の代わりに TestPyPI からパッケージをダウンロードするには、 ``--index-url`` フラグを指定しましょう:
pt_br: Você pode dizer ao :ref:`pip` para baixar pacotes do TestPyPI, em vez do PyPI, especificando o sinalizador ``--index-url``:
ru: Вы можете указать :ref:`pip` загружать пакеты с TestPyPI вместо PyPI, указав флаг ``--index-url``:
ta: நீங்கள் சொல்லலாம்: ref: `` --index-url`` கொடியைக் குறிப்பிடுவதன் மூலம் PYPI க்கு பதிலாக டெச்ட்பிஐயிலிருந்து தொகுப்புகளை பதிவிறக்கம் செய்ய `பிப்`:

source: If you want to allow pip to also download packages from PyPI, you can specify ``--extra-index-url`` to point to PyPI. This is useful when the package you're testing has dependencies:
eo: Se oni volas permesi al pip elŝuti pakojn el PyPI, oni specifas ``--extra-index-url`` por montri PyPI. Tio utilas, se la testata pako havas dependecojn:
ja: pip が PyPI からもパッケージをダウンロードできるようにしたいのであれば、 ``--extra-index-url`` に PyPI を指定しましょう。テストしようとしているパッケージが依存関係を持つ場合にこれが役に立ちます:
pt_br: Se você quiser permitir que pip também baixe outros pacotes do PyPI, você pode especificar ``--extra-index-url`` para apontar para PyPI. Isso é útil quando o pacote que você está testando tem dependências:
ru: Если вы хотите, чтобы pip также загружал пакеты с PyPI, вы можете указать ``--extra-index-url``, чтобы он указывал на PyPI. Это полезно, когда у тестируемого пакета есть зависимости:
ta: PYPI இலிருந்து தொகுப்புகளையும் பதிவிறக்கம் செய்ய PIP ஐ அனுமதிக்க விரும்பினால், PYPI ஐ சுட்டிக்காட்ட `` --extra-index-url`` ஐக் குறிப்பிடலாம். நீங்கள் சோதிக்கும் தொகுப்பில் சார்புநிலைகள் இருக்கும்போது இது பயனுள்ளதாக இருக்கும்:

source: Setting up TestPyPI in :file:`.pypirc`
eo: Agordi TestPyPI en :file:`.pypirc`
ja: :file:`.pypirc` ファイルで TestPyPI を設定する
pt_br: Configurando TestPyPI no :file:`.pypirc`
ru: Настройка TestPyPI в :file:`.pypirc`
ta: TestPypi ஐ அமைத்தல்: கோப்பு: `.pypirc`

source: If you want to avoid being prompted for your username and password every time, you can configure TestPyPI in your :file:`$HOME/.pypirc`:
eo: Se vi volas eviti ĉiufoje tajpi viajn salutnomon kaj pasvorton, vi povas agordi Provan PyPI en via :file:`$HOME/.pypirc`:
ja: ユーザ名やパスワードの入力を毎回促されるのを避けたいなら、 :file:`$HOME/.pypirc` 内で TestPyPI の設定をしておくことができます。
pt_br: Se você quiser evitar ser solicitado a informar seu nome de usuário e senha toda vez, você pode configurar o TestPyPI em seu :file:`$HOME/.pypirc`:
ru: Если вы хотите, чтобы вам не приходилось каждый раз запрашивать имя пользователя и пароль, вы можете настроить TestPyPI в вашем :file:`$HOME/.pypirc`:
ta: ஒவ்வொரு முறையும் உங்கள் பயனர்பெயர் மற்றும் கடவுச்சொல்லுக்கு கேட்கப்படுவதைத் தவிர்க்க விரும்பினால், உங்கள்: கோப்பு: `$ home/.pypirc`:

source: Writing your ``pyproject.toml``
eo: Verki vian ``pyproject.toml``
ja: ``pyproject.toml`` を書く
pt_br: Escrevendo seu ``pyproject.toml``
ru: Написание вашего ``pyproject.toml``
ta: உங்கள் `` pyproject.toml`` எழுதுதல்

source: ``pyproject.toml`` is a configuration file used by packaging tools, as well as other tools such as linters, type checkers, etc. There are three possible TOML tables in this file.
eo: ``pyproject.toml`` estas agorda dosiero uzata de iloj pri pakado kaj aliaj iloj kiel sintakskontroliloj, tipkontroliloj ktp. Ekzistas tri eblaj TOML-tabeloj en tiu dosiero.
ja: ``pyproject.toml`` は、lintersやtype checkersやその他のパッケージングツール群でも同様に使われる設定ファイルです。このファイルの中には３個の TOML テーブルを置くことが可能です。
pt_br: ``pyproject.toml`` é um arquivo de configuração usado por ferramentas de empacotamento, bem como outras ferramentas como linters, verificadores de tipo, etc. Existem três tabelas TOML possíveis neste arquivo.
ru: ``pyproject.toml`` - это конфигурационный файл, используемый инструментами упаковки, а также другими инструментами, такими как линеры, программы проверки типов и т.д. В этом файле есть три возможные таблицы TOML.
ta: `` pyproject.toml`` என்பது பேக்கேசிங் கருவிகளால் பயன்படுத்தப்படும் ஒரு உள்ளமைவு கோப்பு, அதே போல் லிண்டர்கள், வகை செக்கர்ச் போன்ற பிற கருவிகளும் இந்த கோப்பில் மூன்று சாத்தியமான டாம்ல் அட்டவணைகள் உள்ளன.

source: The ``[build-system]`` table is **strongly recommended**. It allows you to declare which :term:`build backend` you use and which other dependencies are needed to build your project.
eo: La tabelo ``[build-system]`` estas **rekomendegata**. Ĝi permesas deklari la :term:`konstruan malfasadon <build backend>` uzotan kaj la dependecojn necesajn por konstrui la projekton.
ja: ``[build-system]`` テーブルは、 **強く推奨されています** 。これを使うことで、どの :term:`ビルドバックエンド <build backend>` を使うのか、また、そのプロジェクトをビルドするためには他のどんな依存関係が必要なのかを宣言することができます。
pt_br: A tabela ``[build-system]`` é **altamente recomendada**. Ela permite que você declare qual :term:`backend de construção` você usa e quais outras dependências são necessárias para construir seu projeto.
ru: Таблица ``[build-system]`` является **настоятельно рекомендуемой**. Она позволяет указать, какой :term:`build backend` вы используете и какие другие зависимости необходимы для сборки вашего проекта.
ta: `` [பில்ட்-சிச்டம்] `` அட்டவணை ** வலுவாக பரிந்துரைக்கப்படுகிறது **. எந்தெந்த: கால: `பின்தளத்தில் உருவாக்கு` நீங்கள் பயன்படுத்தும் மற்றும் உங்கள் திட்டத்தை உருவாக்க வேறு எந்த சார்புகள் தேவை என்பதை அறிவிக்க இது உங்களை அனுமதிக்கிறது.

source: The ``[project]`` table is the format that most build backends use to specify your project's basic metadata, such as the dependencies, your name, etc.
eo: La tabelo ``[project]`` estas la formo uzata de multaj konstruaj malfasadoj por specifi la bazajn metadatenojn de la projekto, kiel la dependecojn, vian nomon ktp.
ja: ``[project]`` テーブルは、依存関係や作者の名前など、そのプロジェクトの基本的なメタデータを指定するためにほとんどのビルドバックエンドが用いるものです。
pt_br: A tabela ``[project]`` é o formato que a maioria dos backends de construção usa para especificar os metadados básicos do seu projeto, como as dependências, seu nome, etc.
ru: Таблица ``[project]`` - это формат, который используется большинством сборочных бэкендов для указания основных метаданных вашего проекта, таких как зависимости, ваше имя и т.д.
ta: `` [திட்டம்] `` அட்டவணை என்பது உங்கள் திட்டத்தின் அடிப்படை மெட்டாடேட்டாவான சார்புநிலைகள், உங்கள் பெயர் போன்றவற்றைக் குறிப்பிட பெரும்பாலான பின்தளத்தில் பயன்படுத்தும் வடிவமாகும்.

source: The ``[tool]`` table has tool-specific subtables, e.g., ``[tool.hatch]``, ``[tool.black]``, ``[tool.mypy]``. We only touch upon this table here because its contents are defined by each tool. Consult the particular tool's documentation to know what it can contain.
eo: La ilo ``[tool]`` havas ilo-specifajn subtabelojn kiel ``[tool.hatch]``, ``[tool.black]``, ``[tool.mypy]``. Ni nur mencias tiun tabelon, ĉar ĝiajn enhavojn difinas iloj. Legu la dokumentaron de iu ilo por la enhavo de la subtabelo.
ja: ``[tool]`` テーブルは、例えば ``[tool.hatch]`` や ``[tool.black]`` や ``[tool.mypy]`` のような、ツールに特化したサブテーブルを持っています。テーブルの内容がツール毎に定義されているので、ここでは簡単に触れるだけに留めます。何を含めておくことができるのかを知るためには、それぞれのツールの説明文書に当たってみてください。
pt_br: A tabela ``[tool]`` possui subtabelas específicas da ferramenta, por exemplo, ``[tool.hatch]``, ``[tool.black]``, ``[tool.mypy]``. Tocamos aqui apenas nesta tabela porque seu conteúdo é definido por cada ferramenta. Consulte a documentação da ferramenta específica para saber o que ela pode conter.
ru: Таблица ``[tool]`` имеет подтаблицы, специфичные для каждого инструмента, например, ``[tool.hatch]``, ``[tool.black]``, ``[tool.mypy]``. Здесь мы касаемся только этой таблицы, поскольку ее содержимое определяется каждым инструментом. Чтобы узнать, что в ней может содержаться, обратитесь к документации конкретного инструмента.
ta: `` [கருவி] `` அட்டவணையில் கருவி-குறிப்பிட்ட சப்டேபிள்கள் உள்ளன, எ.கா., `` [கருவி. இந்த அட்டவணையை மட்டுமே இங்கே தொடுகிறோம், ஏனெனில் அதன் உள்ளடக்கங்கள் ஒவ்வொரு கருவியாலும் வரையறுக்கப்படுகின்றன. குறிப்பிட்ட கருவியின் ஆவணங்களை அதில் எதைக் கொண்டிருக்கலாம் என்பதை அறியவும்.

source: The ``[build-system]`` table should always be present, regardless of which build backend you use (``[build-system]`` *defines* the build tool you use).
eo: La tabelo ``[build-system]`` ĉiam ĉeestu, por ĉia konstrua malfasado (``[build-system]`` *difinas* la konstruilon uzatan).
ru: Таблица ``[build-system]`` должна присутствовать всегда, независимо от того, какой бэкенд сборки вы используете (``[build-system]`` *определяет* инструмент сборки, который вы используете).
ta: `` [பில்ட்-சிச்டம்] `` அட்டவணை எப்போதும் இருக்க வேண்டும், நீங்கள் பயன்படுத்தும் பின்தளத்தில் எந்த கட்டமைப்பைப் பொருட்படுத்தாமல் (`` [உருவாக்க-அமைப்பு] `` * நீங்கள் பயன்படுத்தும் உருவாக்க கருவியை வரையறுக்கிறது).

source: On the other hand, the ``[project]`` table is understood by *most* build backends, but some build backends use a different format.
eo: Aliflanke, la tabelo ``[project]`` estas konata de la *plejparto* de konstruaj malfasadoj, sed kelkaj konstruaj malfasadoj uzas aliajn formojn.
ru: С другой стороны, таблица ``[project]`` понимается *большинством* сборочных бэкендов, но некоторые бэкенды используют другой формат.
ta: மறுபுறம், `` [திட்டம்] `` அட்டவணை * பெரும்பாலான * பின்தளத்தில் உருவாக்கப்படுகிறது, ஆனால் சிலர் பின்தளத்தில் கட்டியெழுப்ப வேறு வடிவத்தைப் பயன்படுத்துகின்றனர்.

source: A notable exception is Poetry_, which before version 2.0 (released January 5, 2025) did not use the ``[project]`` table, it used the ``[tool.poetry]`` table instead. With version 2.0, it supports both. Also, the setuptools_ build backend supports both the ``[project]`` table, and the older format in ``setup.cfg`` or ``setup.py``.
eo: Notinda escepto estas Poetry_, kiu antaŭ versio 2.0 (eldonita je la 5a de Januaro 2025) ne uzis la tabelon ``[project]``. Anstataŭe ĝi uzis la tabelon ``[tool.poetry]``. Ekde versio 2.0, ĝi subtenas ambaŭ. Ankaŭ la konstrua malfasado setuptools_ subtenas kaj la tabelon ``[project]`` kaj la malnovan formon en ``setup.cfg`` aŭ ``setup.py``.
ru: Заметным исключением является Poetry_, который до версии 2.0 (выпущенной 5 января 2025 года) не использовал таблицу ``[project]``, а использовал таблицу ``[tool.poetry]``. В версии 2.0 она поддерживает обе таблицы. Кроме того, бэкенд сборки setuptools_ поддерживает как таблицу ``[project]``, так и более старый формат в ``setup.cfg`` или ``setup.py``.
ta: ஒரு குறிப்பிடத்தக்க விதிவிலக்கு கவிதை_, இது பதிப்பு 2.0 க்கு முன் (சனவரி 5, 2025 வெளியிடப்பட்டது) `` [திட்டம்] `` அட்டவணையைப் பயன்படுத்தவில்லை, இது அதற்கு பதிலாக `` [கருவி.பொயெட்ரி] `` அட்டவணையைப் பயன்படுத்தியது. பதிப்பு 2.0 உடன், இது இரண்டையும் ஆதரிக்கிறது. மேலும், Setuptools_ உருவாக்கு Enceded `` [திட்டம்] `` அட்டவணை, மற்றும் பழைய வடிவம் `` setup.cfg`` அல்லது `` setup.py`` இரண்டையும் ஆதரிக்கிறது.

source: For new projects, use the ``[project]`` table, and keep ``setup.py`` only if some programmatic configuration is needed (such as building C extensions), but the ``setup.cfg`` and ``setup.py`` formats are still valid. See :ref:`setup-py-deprecated`.
eo: Por niva projekto, uzu la tabelo ``[project]``. Uzu ``setup.py`` nur se ia programa agornado necesas (ekz. por konstrui C-etendaĵon). Tamen, la formoj ``setup.cfg`` kaj ``setup.py`` ankoraŭ validas. Vidu :ref:`setup-py-deprecated`.
ru: Для новых проектов используйте таблицу ``[project]``, а ``setup.py`` сохраняйте только в том случае, если требуется некоторая программная настройка (например, сборка расширений на C), но форматы ``setup.cfg`` и ``setup.py`` по-прежнему актуальны. См. :ref:`setup-py-deprecated`.
ta: புதிய திட்டங்களுக்கு, `` [திட்டம்] `` அட்டவணையைப் பயன்படுத்தவும், சில நிரல் உள்ளமைவு தேவைப்பட்டால் (சி நீட்டிப்புகளை உருவாக்குவது போன்றவை), ஆனால் `` setup.cfg`` மற்றும் ` `setup.py`` வடிவங்கள் இன்னும் செல்லுபடியாகும். காண்க: ref: `setup-py- deprecated`.

source: Declaring the build backend
eo: Deklari la konstruan malfasadon
ja: ビルドバックエンドを宣言する
pt_br: Declarando o backend de construção
ru: Объявление бэкенда сборки
ta: உருவாக்க பின்தளத்தில் அறிவித்தல்

source: The ``[build-system]`` table contains a ``build-backend`` key, which specifies the build backend to be used. It also contains a ``requires`` key, which is a list of dependencies needed to build the project -- this is typically just the build backend package, but it may also contain additional dependencies. You can also constrain the versions, e.g., ``requires = ["setuptools >= 61.0"]``.
eo: La tabelo ``[build-system]`` enhavas ŝlosilon ``build-backend`` specifantan la uzotan konstruan malfasadon. Ĝi ankaŭ enhavas ŝlosilon ``requires`` listigantan dependecojn por konstrui la projekton – tio estas tipe nur la pako de la konstrua malfasado,sed ĝi povas enhavi aliajn dependecojn. Vi povas ankaŭ limigi la versiojn, ekzemple ``requires = ["setuptools >= 61.0"]``.
ja: ``[build-system]`` テーブルは、使用されるべきビルドバックエンドを指定する ``build-backend`` キーを含んでいます。また、 プロジェクトをビルドするのに必要な依存関係のリストである ``requires`` キーも含んでいます -- これは典型的にはビルドバクエンドのパッケージだけですが、追加の依存関係を含んでいてもかまいません。さらに、例えば ``requires = ["setuptools >= 61.0"]`` のようにバージョンを制限することもできます。
pt_br: A tabela ``[build-system]`` contém uma chave ``build-backend``, que especifica o backend de construção a ser usado. Ele também contém uma chave ``requires``, que é uma lista de dependências necessárias para construir o projeto -- normalmente é apenas o pacote backend de construção, mas também pode conter dependências adicionais. Você também pode restringir as versões, por exemplo, ``requires = ["setuptools >= 61.0"]``.
ru: Таблица ``[build-system]`` содержит ключ ``build-backend``, который указывает используемый бэкенд сборки. Она также содержит ключ ``requires``, который представляет собой список зависимостей, необходимых для сборки проекта - обычно это только пакет бэкенда сборки, но может содержать и дополнительные зависимости. Вы также можете ограничить версии, например, ``requires = ["setuptools >= 61.0"]``.
ta: `` [பில்ட்-சிச்டம்] `` அட்டவணையில் ஒரு `` பில்ட்-பேக்கெண்ட்`` விசையைக் கொண்டுள்ளது, இது பயன்படுத்த வேண்டிய பின்தளத்தில் குறிப்பிடுகிறது. இது ஒரு `` தேவைப்படும் `விசையும் உள்ளது, இது திட்டத்தை உருவாக்கத் தேவையான சார்புகளின் பட்டியல் - இது பொதுவாக உருவாக்கும் பின்தளத்தில் தொகுப்பாகும், ஆனால் அதில் கூடுதல் சார்புகளும் இருக்கலாம். பதிப்புகளையும் நீங்கள் கட்டுப்படுத்தலாம், எ.கா., `` தேவை = ["செட்டப்டூல்ச்> = 61.0"] ``.

source: Usually, you'll just copy what your build backend's documentation suggests (after :ref:`choosing your build backend <choosing-build-backend>`). Here are the values for some common build backends:
eo: Ordinare oni simple kopias la sugestojn de la dokumentaro de la konstrua malfasado (post after :ref:`elekto de la konstrua malfasado <choosing-build-backend>`). Jen la valoroj por oftaj konstruaj malfasadoj:
ja: 通常は、ビルドバックエンドの説明文書が (:ref:`ビルドバックエンドを選択する <choosing-build-backend>`) 示唆するものをコピーするだけでしょう。よく知られたバックエンドでの値をいくつか挙げておきます:
pt_br: Normalmente, você apenas copiará o que a documentação do seu backend de construção sugere (após :ref:`escolher seu backend de construção <choosing-build-backend>`). Aqui estão os valores para alguns backends de construção comuns:
ru: Обычно вы просто копируете то, что предлагает документация вашего бэкенда сборки (после :ref:`выбора бэкенда сборки <choosing-build-backend>`). Вот значения для некоторых распространенных бэкендов сборки:
ta: வழக்கமாக, உங்கள் உருவாக்க பின்தளத்தில் ஆவணங்கள் பரிந்துரைப்பதை நீங்கள் நகலெடுக்கவும் (பிறகு: குறிப்பு: `உங்கள் கட்டமைப்பைத் தேர்ந்தெடுப்பது <தேர்வு-கட்டும்-பின்>`). சில பொதுவான கட்டமைப்பிற்கான மதிப்புகள் இங்கே:

source: Static vs. dynamic metadata
eo: Statikaj kaj dinamikaj metadatenoj
ja: 静的なメタデータと動的なメタデータ
pt_br: Metadados estáticos vs dinâmicos
ru: Статические и динамические метаданные
ta: நிலையான எதிராக மாறும் மேனிலை தரவு

source: The rest of this guide is devoted to the ``[project]`` table.
eo: La resto de ĉi tiu gvidilo temas pri la tabelo ``[project]``.
ja: このガイド文書の残りの部分は、``[project]`` テーブルに捧げます。
pt_br: O resto deste guia é dedicado à tabela ``[project]``.
ru: Остальная часть этого руководства посвящена таблице ``[проекта]``.
ta: இந்த வழிகாட்டியின் மீதமுள்ளவை `` [திட்டம்] `` அட்டவணைக்கு அர்ப்பணிக்கப்பட்டுள்ளன.

source: Most of the time, you will directly write the value of a ``[project]`` field. For example: ``requires-python = ">= 3.8"``, or ``version = "1.0"``.
eo: Plejparte, vi rekte skribas la valoron de kampo ``[project]``. Ekzemple: ``requires-python = ">= 3.8"``, aŭ ``version = "1.0"``.
ja: ほとんどの場合、 ``[project]`` フィールドに直接に値を書き込むことになるでしょう。例えば: ``requires-python = ">= 3.8"`` や ``version = "1.0"`` などです。
pt_br: Na maioria das vezes, você escreverá diretamente o valor de um campo ``[project]``. Por exemplo: ``requires-python = ">= 3.8"``, ou ``version = "1.0"``.
ru: Чаще всего вы будете напрямую записывать значение поля ``[проект]``. Например: ``requires-python = ">= 3.8"``, или ``version = "1.0"``.
ta: பெரும்பாலான நேரங்களில், நீங்கள் ஒரு `` [திட்டம்] `` புலத்தின் மதிப்பை நேரடியாக எழுதுவீர்கள். எடுத்துக்காட்டாக: `` தேவை-பைதான் = "> = 3.8" ``, அல்லது `` பதிப்பு = "1.0" ``.

source: However, in some cases, it is useful to let your build backend compute the metadata for you. For example: many build backends can read the version from a ``__version__`` attribute in your code, a Git tag, or similar. In such cases, you should mark the field as dynamic using, e.g.,
ja: しかしながら、ビルドバックエンドにメタデータを計算させる方が役に立つ場合もあります。例えば: 多くのビルドバックエンドがソースコードや Git タグやその他似たようなものの中にある ``__version__`` 要素を読み取ることができます。そのような場合には、以下の例のような方法を使ってそのフィールドを動的なものにしておくべきです、
pt_br: No entanto, em alguns casos, é útil permitir que o backend de construção calcule os metadados para você. Por exemplo: muitos backend sde construção podem ler a versão de um atributo ``__version__`` em seu código, uma tag Git ou similar. Nesses casos, você deve marcar o campo como dinâmico usando, por exemplo,
ru: Однако в некоторых случаях полезно позволить бэкенду сборки вычислять метаданные за вас. Например, многие сборки могут считывать версию из атрибута ``__version__`` в вашем коде, тега Git или чего-то подобного. В таких случаях вам следует пометить поле как динамическое, например, с помощью,
ta: இருப்பினும், சில சந்தர்ப்பங்களில், உங்கள் உருவாக்க பின்தளத்தில் உங்களுக்காக மெட்டாடேட்டாவைக் கணக்கிட அனுமதிப்பது பயனுள்ளதாக இருக்கும். எடுத்துக்காட்டாக: உங்கள் குறியீட்டில் உள்ள `__ பதிப்பு__`` என்ற பண்புகளிலிருந்து, ஒரு அறிவிலி குறிச்சொல் அல்லது அதற்கு ஒத்ததாக பலவற்றை உருவாக்கும் பின்தளத்தில் கட்டலாம். இதுபோன்ற சந்தர்ப்பங்களில், நீங்கள் புலத்தை மாறும் எனக் குறிக்க வேண்டும், எ.கா.,

source: When a field is dynamic, it is the build backend's responsibility to fill it. Consult your build backend's documentation to learn how it does it.
eo: La konstrua malfasado respondecas por plenigi dinamikajn kampojn. Vidu la dokumentaron de via konstrua malfasado por la preciza maniero de plenigado.
ja: フィールドが動的となっている場合、そこを埋めるのはビルドバックエンドの責任です。どうすれば良いのかについては、ビルドバックエンドの説明文書に当たってみてください。
pt_br: Quando um campo é dinâmico, é da responsabilidade do backend de construção preenchê-lo. Consulte a documentação do seu backend de construção para saber como ele faz.
ru: Если поле динамическое, его заполнение возлагается на бэкенд сборки. Обратитесь к документации вашего бэкенда сборки, чтобы узнать, как он это делает.
ta: ஒரு புலம் மாறும் போது, அதை நிரப்புவது பின்தளத்தில் பொறுப்பு. அது எவ்வாறு செய்கிறது என்பதை அறிய உங்கள் உருவாக்க பின்தளத்தில் ஆவணத்தை அணுகவும்.

source: Basic information
eo: Bazaj informoj
ja: 基本的な情報
pt_br: Informações básicas
ru: Базовая информация
ta: அடிப்படை செய்தி

source: ``name``
ja: ``名称``
ta: `` பெயர்``

source: Put the name of your project on PyPI. This field is required and is the only field that cannot be marked as dynamic.
eo: Uzu la nomon de via projekto ĉe PyPI. Ĉi tiu kampo estas necesa kaj estas la ununura kampo ne markebla kiel dinamika.
ja: PyPI 上でのプロジェクト名称を書いてください。このフィールドは必須のもので、動的であるとマークできない唯一のフィールドです。
pt_br: Coloque o nome do seu projeto em PyPI. Este campo é necessário e é o único campo que não pode ser marcado como dinâmico.
ru: Укажите название вашего проекта на PyPI. Это поле обязательно для заполнения и является единственным полем, которое не может быть помечено как динамическое.
ta: உங்கள் திட்டத்தின் பெயரை பைபியில் வைக்கவும். இந்த புலம் தேவைப்படுகிறது மற்றும் மாறும் எனக் குறிக்க முடியாத ஒரே புலம்.

source: The project name must consist of ASCII letters, digits, underscores "``_``", hyphens "``-``" and periods "``.``". It must not start or end with an underscore, hyphen or period.
eo: La projekta nomo devas konsisti el Askiaj literoj, ciferoj, substrekoj «``_``», streketoj «``-``» kaj punktoj «``.``». Ĝi devas ne komenciĝi nek finiĝi per substreko, streketo aŭ punkto.
ru: Имя проекта должно состоять из букв ASCII, цифр, знаков подчеркивания "``_``", дефисов "``-``" и точек "``.``". Оно не должно начинаться или заканчиваться подчеркиванием, дефисом или точкой.
ta: திட்டத்தின் பெயர் ASCII கடிதங்கள், இலக்கங்கள், "` _`` ", ஐபன்கள்" `` -` "மற்றும்" `` .`` "ஆகியவற்றை அடிக்கோடிட்டுக் காட்ட வேண்டும். இது ஒரு அடிக்கோடிட்ட, ஐபன் அல்லது காலத்துடன் தொடங்கவோ முடிவடையவோ கூடாது.
