Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: This sample uses a sub-package as the namespace package (``myapp.plugins``), but it's also possible to use a top-level package for this purpose (such as ``myapp_plugins``). How to pick the namespace to use is a matter of preference, but it's not recommended to make your project's main top-level package (``myapp`` in this case) a namespace package for the purpose of plugins, as one bad plugin could cause the entire namespace to break which would in turn make your project unimportable. For the "namespace sub-package" approach to work, the plugin packages must omit the :file:`__init__.py` for your top-level package directory (``myapp`` in this case) and include the namespace-package style :file:`__init__.py` in the namespace sub-package directory (``myapp/plugins``). This also means that plugins will need to explicitly pass a list of packages to :func:`setup`'s ``packages`` argument instead of using :func:`setuptools.find_packages`.
eo: Ĉi tiu ekzemplo uzas subpakon kiel la nomspacan pakon (``myapp.plugins``), sed ankaŭ eblas uzi supranivelan pakon por tiu celo (ekzemple ``myapp_plugins``). Elektado de la uzota nomspaco laŭ onia gusto, sed ne estas rekomendata igi la ĉefan supranivelan pakon (``myapp`` en la ekzemplo) nomspaca pako pro kromprogramoj, ĉar unu aĉa kromprogramo rompus la plenan nomspacon, malimportebligante vian projekton. Por la maniero «nomspaca subpako», kromprograma pako devas ne inkluzivi la :file:`__init__.py` por la supranivela paka dosierujo (``myapp`` en la ekzemplo) kaj inkluzivi la nomspacpako-stilan :file:`__init__.py` en la nomspaca subpaka dosierujo (``myapp/plugins``). Tio ankaŭ implicas, ke kromprogramo devas eksplicite doni liston de pakoj kiel la argumenton ``packages`` de :func:`setup`, anstataŭ uzi :func:`setuptools.find_packages`.
ja: この例ではサブパッケージを名前空間を決めるパッケージ(``myapp.plugins``)として使っていますが、トップレベルのパッケージをこの(``myapp_plugins``のような)目的に用いることも可能です。名前空間をどのようにして決めるかは好みの問題ですが、あなたのプロジェクトのトップレベルのパッケージ(この場合では``myapp``)をプラグインの名前空間を決めるために用いると、全体の名前空間を破壊するようなプラグインがひとつあるだけで、あなたのプロジェクトをインポートすることができなくなるのでお勧めしません。「名前空間を決めるサブパッケージ」の手法がうまく動作するためには、プラグインパッケージ側のトップレベルパッケージのディレクトリ(この場合には``myapp``)に :file:`__init__.py` が存在してはいけませんし、名前空間を決めるサブパッケージのディレクトリ(``myapp/plugins``)にある :file:`__init__.py`をプラグインパッケージ側でインクルードしなければなりません。これはまた、 プラグインの側で:func:`setuptools.find_packages` を使うのではなく、パッケージの名前を :func:`setup`の ``packages`` 引数に明示的に渡す必要がある、ということを意味しています。
pt_br: Este exemplo usa um subpacote como o pacote de espaço de nomes (``myapp.plugins``), mas também é possível usar um pacote de nível superior para este propósito (como ``myapp_plugins``). Como escolher o espaço de nomes a ser usado é uma questão de preferência, mas não é recomendado fazer do pacote de nível superior principal do seu projeto (``myapp``, neste caso) um pacote de espaço de nomes para fins de plugins, como um plugin ruim poderia fazer com que todo o espaço de nomes seja interrompido, o que, por sua vez, tornaria seu projeto não importável. Para que a abordagem de "subpacote de espaço de nomes" funcione, os pacotes de plugin devem omitir o :file:`__init__.py` para o diretório de pacote de nível superior (``myapp``, neste caso) e incluir o estilo de pacote de espaço de nomes :file:`__init__.py` no diretório do subpacote de espaço de nomes (``myapp/plugins``). Isso também significa que os plugins precisarão passar explicitamente uma lista de pacotes para o argumento ``packages`` de :func:`setup` ao invés de usar :func:`setuptools.find_packages`.
ru: В этом примере в качестве пакета пространства имен используется подпакет (``myapp.plugins``), но можно также использовать для этой цели пакет верхнего уровня (например, ``myapp_plugins``). Выбор пространства имен - это вопрос предпочтений, но не рекомендуется делать основной пакет верхнего уровня вашего проекта (``myapp`` в данном случае) пакетом пространства имен для плагинов, так как один плохой плагин может привести к поломке всего пространства имен, что в свою очередь сделает ваш проект неимпортируемым. Чтобы подход "namespace sub-package" работал, пакеты плагинов должны опускать :file:`__init__.py` для каталога пакета верхнего уровня (``myapp`` в данном случае) и включать стиль namespace-package :file:`__init__.py` в каталог namespace sub-package (``myapp/plugins``). Это также означает, что плагины должны будут явно передавать список пакетов в аргумент ``packages`` в :func:`setup``, а не использовать :func:`setuptools.find_packages``.
ta: இந்த மாதிரி ஒரு துணை தொகுப்பாக பெயர்வெளி தொகுப்பாக (`` myapp.plugins``) பயன்படுத்துகிறது, ஆனால் இந்த நோக்கத்திற்காக ஒரு உயர்மட்ட தொகுப்பைப் பயன்படுத்தவும் முடியும் (`` MyApp_plugins` போன்றவை). பயன்படுத்த பெயர்வெளியை எவ்வாறு தேர்ந்தெடுப்பது என்பது விருப்பமான சேதி, ஆனால் உங்கள் திட்டத்தின் முக்கிய உயர்மட்ட-நிலை தொகுப்பை (`` MyApp`` `இந்த விசயத்தில்) செருகுநிரல்களின் நோக்கத்திற்காக ஒரு பெயர்வெளி தொகுப்பு செய்ய பரிந்துரைக்கப்படவில்லை, ஒரு மோசமான சொருகி முடியும் முழு பெயர்வெளிகளையும் உடைக்கச் செய்யுங்கள், இது உங்கள் திட்டத்தை இறக்காதது. வேலை செய்வதற்கான "பெயர்வெளி துணை-பேக்கேச்" அணுகுமுறைக்கு, சொருகி தொகுப்புகள் பின்வாங்க வேண்டும்: கோப்பு: `__init __. உங்கள் உயர்மட்ட தொகுப்பு கோப்பகத்திற்கு (இந்த விசயத்தில்` `MyApp``) . செருகுநிரல்கள் தொகுப்புகளின் பட்டியலை வெளிப்படையாக அனுப்ப வேண்டும் என்பதும் இதன் பொருள்: func: `setup` இன்` `தொகுப்புகள்`` பயன்படுத்துவதற்கு பதிலாக: func:` setuptools.find_packages`.

source: Namespace packages are a complex feature and there are several different ways to create them. It's highly recommended to read the :doc:`packaging-namespace-packages` documentation and clearly document which approach is preferred for plugins to your project.
eo: Nomspaca pako estas komplika funkcio, kaj estas pluraj malsamaj manieroj krei iĝin. Estas rekomendegate legi la dokumentaron :doc:`packaging-namespace-packages` kaj klare dokumenti la preferatan manieron por kromprogramoj de via projekto.
ja: 名前空間を決めるパッケージは込み入った機能で、いくつかの異なる作成方法があります。 :doc:`packaging-namespace-packages` 文書を読むとともに、あなたのプロジェクト用のプラグインとしてはどちらの手法が好ましいのかを明白に文書化しておくことを強くお勧めします。
pt_br: Os pacotes de espaço de nomes são um recurso complexo e existem várias maneiras diferentes de criá-los. É altamente recomendado ler a documentação de :doc:`packaging-namespace-packages` e documentar claramente qual abordagem é preferida para plugins em seu projeto.
ru: Пакеты пространства имен - сложная функция, и существует несколько различных способов их создания. Настоятельно рекомендуется прочитать документацию :doc:`packaging-namespace-packages` и четко документировать, какой подход предпочтителен для плагинов вашего проекта.
ta: பெயர்வெளி தொகுப்புகள் ஒரு சிக்கலான அம்சமாகும், அவற்றை உருவாக்க பல்வேறு வழிகள் உள்ளன. உங்கள் திட்டத்திற்கு செருகுநிரல்களுக்கு எந்த அணுகுமுறை விரும்பப்படுகிறது என்பதை தெளிவாக ஆவணப்படுத்த: DOC: `பேக்கேசிங்-பெயர்ச்பேச்-பேக்கேச்கள்` ஆவணங்கள் மற்றும் தெளிவாக ஆவணப்படுத்த இது மிகவும் பரிந்துரைக்கப்படுகிறது.

source: Using package metadata
eo: Uzi pakajn metadatenojn
ja: パッケージのメタデータを用いるやり方
pt_br: Usando metadados de pacote
ru: Использование метаданных пакета
ta: தொகுப்பு மெட்டாடேட்டாவைப் பயன்படுத்துதல்

source: Packages can have metadata for plugins described in the :ref:`entry-points`. By specifying them, a package announces that it contains a specific kind of plugin. Another package supporting this kind of plugin can use the metadata to discover that plugin.
eo: Pako povas enhavi metadatenojn pri kromprogramoj per :ref:`entry-points`. Per tio, pako anoncas, ke ĝi enhavas ian kromprogramon. Alia pako subtenanta tian kromprogramon povas uzi la metadatenojn por trovi tiun kromprogramon.
ja: パッケージは、 :ref:`entry-points` に記述されたプラグインのためのメタデータを持つことができます。それを指定することで、パッケージが特定の種類のプラグインを含んでいることをアナウンスします。そのメタデータを使って、同じ種類のプラグインをサポートする別のパッケージがそのプラグインを検出するのに使うことができます。
pt_br: Os pacotes podem ter metadados para plugins descritos em :ref:`entry-points`. Ao especificá-los, um pacote anuncia que contém um tipo específico de plug-in. Outro pacote que suporta esse tipo de plug-in pode usar os metadados para descobrir esse plug-in.
ru: Пакеты могут иметь метаданные для плагинов, описанные в :ref:`entry-points`. Указывая их, пакет сообщает, что он содержит определенный тип плагина. Другой пакет, поддерживающий этот тип плагина, может использовать метаданные для обнаружения этого плагина.
ta: தொகுப்புகள்: ref: `நுழைவு புள்ளிகள்` இல் விவரிக்கப்பட்டுள்ள செருகுநிரல்களுக்கான மெட்டாடேட்டாவைக் கொண்டிருக்கலாம். அவற்றைக் குறிப்பிடுவதன் மூலம், ஒரு தொகுப்பு ஒரு குறிப்பிட்ட வகையான சொருகி இருப்பதாக அறிவிக்கிறது. இந்த வகையான சொருகி ஆதரிக்கும் மற்றொரு தொகுப்பு அந்த சொருகி கண்டுபிடிக்க மெட்டாடேட்டாவைப் பயன்படுத்தலாம்.

source: For example if you have a package named ``myapp-plugin-a`` and it includes the following in its ``pyproject.toml``:
eo: Ekzemple, se vi havas pakon nomitan ``myapp-plugin-a``, kies ``pyproject.toml`` enhavas la jenon:
ja: 例えば、``myapp-plugin-a`` という名前のパッケージが存在して、その ``pyproject.toml`` に次のものを含む場合：
pt_br: Por exemplo, se você tem um pacote chamado ``myapp-plugin-a`` e ele inclui o seguinte em seu :file:`pyproject.toml`:
ru: Например, если у вас есть пакет с именем ``myapp-plugin-a`` и он включает следующее в свой ``pyproject.toml``:
ta: எடுத்துக்காட்டாக, உங்களிடம் `` myApp-plugin-a`` என்ற தொகுப்பு இருந்தால், அதன் `` pyproject.toml`` இல் பின்வருவனவற்றை உள்ளடக்கியது:

source: Then you can discover and load all of the registered entry points by using :func:`importlib.metadata.entry_points` (or the backport_ ``importlib_metadata >= 3.6`` for Python 3.6-3.9):
eo: Do oni povas serĉi kaj ŝargi ĉiujn registritajn enirpunktojn per :func:`importlib.metadata.entry_points` (aŭ la `retroporto <backport>`_ ``importlib_metadata >= 3.6`` por Python 3.6 – 3.9):
ja: そして、 :func:`import lib.metadata.entry_points` (あるいはPython 3.6-3.9用の backport_``import lib_metadata>=3.6``)を使うことで、登録されたエントリポイントを全て検出することができます。
pt_br: Então você pode descobrir e carregar todos os pontos de entrada registrados usando :func:`importlib.metadata.entry_points` (ou o backport_ ``importlib_metadata >= 3.6`` para Python 3.6-3.9):
ru: Затем вы можете обнаружить и загрузить все зарегистрированные точки входа, используя :func:`importlib.metadata.entry_points` (или backport_ ``importlib_metadata >= 3.6`` для Python 3.6-3.9):
ta: பயன்படுத்துவதன் மூலம் பதிவுசெய்யப்பட்ட அனைத்து நுழைவு புள்ளிகளையும் கண்டுபிடித்து ஏற்றலாம்: func: `இறக்குமதி.

source: In this example, ``discovered_plugins`` would be a collection of type :class:`importlib.metadata.EntryPoint`:
eo: En ĉi tiu ekzemplo, ``discovered_plugins`` estas kolekto de la tipo :class:`importlib.metadata.EntryPoint`:
ja: この例では、 ``discovered_plugins`` は :class:`importlib.metadata.EntryPoint` 型の(オブジェクトの)集合となるでしょう。
pt_br: Neste exemplo, ``discover_plugins`` seria uma coleção do tipo :class:`importlib.metadata.EntryPoint`:
ru: В этом примере ``discovered_plugins`` будет коллекцией типа :class:`importlib.metadata.EntryPoint``:
ta: இந்த எடுத்துக்காட்டில், `` கண்டுபிடிக்கப்பட்ட_பிளகின்ச்`` வகை வகையின் தொகுப்பாக இருக்கும்: வகுப்பு: `இறக்குமதி.

source: Now the module of your choice can be imported by executing ``discovered_plugins['a'].load()``.
eo: Nun via elektita modulo estas importebla per ``discovered_plugins['a'].load()``.
ja: 今や、``discovered_plugins['a'].load()`` を実行することで、あなたが選んだモジュールをインポートすることができます。
pt_br: Agora o módulo de sua escolha pode ser importado executando ``discovered_plugins['a'].Load()``.
ru: Теперь выбранный вами модуль можно импортировать, выполнив команду ``discovered_plugins['a'].load()``.
ta: இப்போது உங்கள் விருப்பத்தின் தொகுதியை `` கண்டுபிடிக்கப்பட்ட_ப்ளூசின்களை ['அ'] செயல்படுத்துவதன் மூலம் இறக்குமதி செய்யலாம். ஏற்றவும் () ``.

source: The ``entry_point`` specification in :file:`setup.py` is fairly flexible and has a lot of options. It's recommended to read over the entire section on :doc:`entry points <setuptools:userguide/entry_point>` .
eo: La specifo de ``entry_point`` en :file:`setup.py` estas fleksebla kaj opcio-plena. Estas rekomendate tralegi la paragrafon pri :doc:`enirpunktoj <setuptools:userguide/entry_point>` .
ja: :file:`setup.py` における ``entry_points`` の指定はかなり自由度が高く、オプションがたくさんあります。 :doc:`entry_point <setuptools:userguide/entry_point>` の全部のセクションに目を通すことをお勧めします。
pt_br: A especificação ``entry_point`` em :file:`setup.py` é bastante flexível e tem muitas opções. É recomendado ler toda a seção sobre :doc:`pontos de entrada <setuptools:userguide/entry_point>` .
ru: Спецификация ``точки входа`` в :file:`setup.py` довольно гибкая и имеет множество опций. Рекомендуется прочитать весь раздел по :doc:``точкам входа <setuptools:userguide/entry_point>` .
ta: `` Entry_point`` விவரக்குறிப்பு: கோப்பு: `setup.py` மிகவும் நெகிழ்வானது மற்றும் நிறைய விருப்பங்களைக் கொண்டுள்ளது. இதில் முழு பகுதியையும் படிக்க பரிந்துரைக்கப்படுகிறது: DOC: `நுழைவு புள்ளிகள் <setuptools: userguide/entry_point>`.

source: Since this specification is part of the :doc:`standard library <python:library/importlib.metadata>`, most packaging tools other than setuptools provide support for defining entry points.
eo: Ĉar ĉi tiu specifo estas parto de la :doc:`norma biblioteko <python:library/importlib.metadata>`, multaj iloj krom setuptools subtenas difinadon de enirpunktoj.
ja: この仕様は :doc:`標準ライブラリ <python:library/importlib.metadata>` の一部なので、setuptools以外のほとんどのパッケージングツールでもエントリポイントを定義できる機能を提供しています。
pt_br: Visto que esta especificação é parte da :doc:`biblioteca padrão <python:library/importlib.metadata>`, a maioria das ferramentas de empacotamento, exceto setuptools, fornecem suporte para definir pontos de entrada.
ru: Поскольку эта спецификация является частью :doc:`стандартной библиотеки <python:library/importlib.metadata>`, большинство инструментов упаковки, кроме setuptools, обеспечивают поддержку определения точек входа.
ta: இந்த விவரக்குறிப்பு: டாக்: `நிலையான நூலகம் <பைதான்: நூலகம்/இறக்குமதி லிப்.மெட்டாடேட்டா>` `, செட்டுப்டூல்கள் தவிர பிற பெரும்பாலான பேக்கேசிங் கருவிகள் நுழைவு புள்ளிகளை வரையறுப்பதற்கான ஆதரவை வழங்குகின்றன.

source: Creating and packaging command-line tools
eo: Krei kaj paki komandliniajn programojn
ja: コマンドライン動作のツールを作成しパッケージングする
ru: Создание и упаковка инструментов командной строки
ta: கட்டளை-வரி கருவிகளை உருவாக்கி பேக்கேசிங் செய்யுங்கள்

source: Creating the package
eo: Krei la pakon
ja: パッケージを作成する
ru: Создание пакета
ta: தொகுப்பை உருவாக்குதல்

source: First of all, create a source tree for the :term:`project <Project>`. For the sake of an example, we'll build a simple tool outputting a greeting (a string) for a person based on arguments given on the command-line.
eo: Unue, kreu fontarbon por la :term:`projekto <Project>`. Kiel ekzemplo, ni verkos simplan ilon eligantan tekstan saluton dependantan de komandliniaj argumentoj.
ja: まず最初に、 :term:`プロジェクト <Project>` のためのソースツリーを作成しましょう。例示のために、コマンドラインの引数として与えられた人物名に挨拶 (文字列) を出力する単純なツールをビルドするものとしましょう。
ru: Прежде всего, создайте дерево исходных текстов для :term:`project <Project>`. Для примера мы создадим простой инструмент, выводящий приветствие (строку) для человека на основе аргументов, заданных в командной строке.
ta: முதலாவதாக, ஒரு மூல மரத்தை உருவாக்கவும்: கால: `திட்டம் <திட்டம்>`. ஒரு உதாரணத்தின் பொருட்டு, கட்டளை வரியில் கொடுக்கப்பட்ட வாதங்களின் அடிப்படையில் ஒரு நபருக்கு வாழ்த்து (ஒரு சரம்) வெளியிடுவதற்கான எளிய கருவியை உருவாக்குவோம்.

source: Todo
eo: FIXME
pt_br: Para fazer
ta: அனைத்தும்

source: Advise on the optimal structure of a Python package in another guide or discussion and link to it here.
eo: Konsili pri la optimuma strukturo de Python-pako en alia gvidilo aŭ diskuto kaj ligi al ĝi ĉi tie.
ja: Python パッケージの最適な構造に関するアドバイスについて、他のガイド文書や議論、リンク集はこちら。
ru: Посоветуйте оптимальную структуру пакета Python в другом руководстве или обсуждении и дайте на него ссылку здесь.
ta: மற்றொரு வழிகாட்டி அல்லது கலந்துரையாடலில் பைதான் தொகுப்பின் உகந்த கட்டமைப்பைப் பற்றி அறிவுறுத்துங்கள், அதனுடன் இங்கே இணைக்கவும்.

source: This project will adhere to :ref:`src-layout <src-layout-vs-flat-layout>` and in the end be alike this file tree, with the top-level folder and package name ``greetings``:
eo: Ĉi tiu projekto sekvos la :ref:`src-aranĝon <src-layout-vs-flat-layout>` kaj similas la jenan dosierarbon, kun supranivela dosierujo (kaj paknomo) nomita ``greetings``:
ja: このプロジェクトは、 :ref:`src-layout <src-layout-vs-flat-layout>` を厳守し、最後には、トップレベルのフォルダとパッケージの名称として ``greetings`` を伴った、このファイルツリーのようになります:
ru: Этот проект будет придерживаться :ref:`src-layout <src-layout-vs-flat-layout>` и в итоге будет похож на это дерево файлов, с папкой верхнего уровня и именем пакета ``greetings``:
ta: இந்த திட்டம் இதைக் கடைப்பிடிக்கும்: குறிப்பு: `எச்.ஆர்.சி-லேஅவுட் <எச்.ஆர்.சி-லேஅவுட்-வி.எச்-ஃப்ளாட்-லேஅவுட்>` மற்றும் இறுதியில் இந்த கோப்பு மரத்தில், உயர்மட்ட கோப்புறை மற்றும் தொகுப்பு பெயர் `` வாழ்த்துக்கள்`` உடன் ஒரே மாதிரியாக இருக்கும்:

source: The actual code responsible for the tool's functionality will be stored in the file :file:`greet.py`, named after the main module:
eo: La reala kodo respondeca por la funkciado de la ilo troviĝos en la dosiero :file:`greet.py`, nomita laŭ la ĉefmodulo:
ja: ツールの機能性に責任のある実際のソースコードは、メインのモジュールの名称から命名された :file:`greet.py` の中に保存されるでしょう。
ru: Собственно код, отвечающий за функциональность инструмента, будет храниться в файле :file:`greet.py`, названном в честь основного модуля:
ta: கருவியின் செயல்பாட்டிற்கு பொறுப்பான உண்மையான குறியீடு கோப்பில் சேமிக்கப்படும்: கோப்பு: `வாழ்த்துக்கள்.

source: The above function receives several keyword arguments that determine how the greeting to output is constructed. Now, construct the command-line interface to provision it with the same, which is done in :file:`cli.py`:
eo: La ĉi-supra funkcio ricevas plurajn ŝlosilvortajn argumentojn pri konstruado de la saluto. Nun, konstruu la komandlinian fasadon kun la samaj argumentoj en :file:`cli.py`:
ja: 上記の関数は、どのように出力すべき挨拶を組み立てるかを決定するいくつかのキーワード引数を受け取ります。さて、同様にそれを準備するためのコマンドラインインタフェースを :file:`cli.py` の中に構築しましょう:
ru: Приведенная выше функция получает несколько аргументов-ключей, которые определяют, как будет построено приветствие для вывода. Теперь сконструируйте интерфейс командной строки, чтобы обеспечить его тем же самым, что делается в :file:`cli.py`:
ta: மேலே உள்ள செயல்பாடு பல முக்கிய வாதங்களைப் பெறுகிறது, இது வெளியீட்டிற்கான வாழ்த்து எவ்வாறு கட்டமைக்கப்படுகிறது என்பதை தீர்மானிக்கிறது. இப்போது, கட்டளை-வரி இடைமுகத்தை அதை வழங்குவதற்காக உருவாக்குங்கள், இது செய்யப்படுகிறது: கோப்பு: `cli.py`:

source: The command-line interface is built with typer_, an easy-to-use CLI parser based on Python type hints. It provides auto-completion and nicely styled command-line help out of the box. Another option would be :py:mod:`argparse`, a command-line parser which is included in Python's standard library. It is sufficient for most needs, but requires a lot of code, usually in ``cli.py``, to function properly. Alternatively, docopt_ makes it possible to create CLI interfaces based solely on docstrings; advanced users are encouraged to make use of click_ (on which ``typer`` is based).
eo: La komandlinia fasado estas konstruita per typer_, kiu estas facile uzebla komandlinia argumentanalizilo uzante tipo-konsiletoj de Python. Ĝi provizas aŭtomatan kompletigon kaj bone aranĝitan komandlinian helpon senmodife. Alia opcio estus :py:mod:`argparse`, kiu estas komandlinia argumentanalizilo inkluzivita en la norma biblioteko de Python. Ĝi sufiĉas por la plejparto de bezonoj, sed postulas multe da kodo, ofte en ``cli.py``, por bona funkciado. Alterntaive, docopt_ kreas komandlinian fasadon nur per docstring; altnivela uzanto uzu click_ (sur kiu ``typer`` estas bazita).
ja: コマンドラインインタフェースは、 Python の型品とを基礎とした使いやすい CLI パーサである typer_ とともにビルドされます。自動補完と申し分のないスタイルを持つコマンドラインヘルプが、最初から使えます。別のオプションは、 Python 標準ライブラリに含まれる :py:mod:`argparse` でしょう。これはほとんどの必要性に十分に応えるものですが、適切に機能させるためには、通常は ``cli.py`` に、ソースコードをたくさん書かなければなりません。さらに別の方法としては、 docopt_ を使うことで、 docstrings だけに基づいて CLI インタフェースを作成することができます; 熟練ユーザには、 click_ (``typer`` はこれを基礎として使っています) の使用をお勧めします。
ru: Интерфейс командной строки построен с помощью typer_, простого в использовании парсера CLI, основанного на подсказках типов Python. Он обеспечивает автозавершение и красиво оформленную справку по командной строке из коробки. Другим вариантом может быть :py:mod:`argparse`, парсер командной строки, включенный в стандартную библиотеку Python. Он достаточен для большинства потребностей, но требует много кода, обычно в ``cli.py``, для правильной работы. В качестве альтернативы, docopt_ позволяет создавать интерфейсы CLI, основанные исключительно на строках документов; продвинутым пользователям рекомендуется использовать click_ (на котором основан ``typer``).
ta: கட்டளை-வரி இடைமுகம் பைதான் வகை குறிப்புகளின் அடிப்படையில் பயன்படுத்த எளிதான கிளி பாகுபடுத்தி TYPER_ உடன் கட்டப்பட்டுள்ளது. இது தானாக முடக்கம் மற்றும் பெட்டியின் நேர்த்தியான பாணியில் கட்டளை-வரி உதவியை வழங்குகிறது. மற்றொரு விருப்பம்: PY: MOD: `ArgParse`, ஒரு கட்டளை-வரி பாகுபடுத்தி, இது பைத்தானின் நிலையான நூலகத்தில் சேர்க்கப்பட்டுள்ளது. இது பெரும்பாலான தேவைகளுக்கு போதுமானது, ஆனால் நிறைய குறியீடு தேவைப்படுகிறது, பொதுவாக `` cli.py`` இல், சரியாக செயல்பட வேண்டும். மாற்றாக, டாக்ச்டோப்_ டாக்ச்ட்ரிங்சை மட்டுமே அடிப்படையாகக் கொண்ட சி.எல்.ஐ இடைமுகங்களை உருவாக்குவதை சாத்தியமாக்குகிறது; மேம்பட்ட பயனர்கள் கிளிக்_ ஐப் பயன்படுத்த ஊக்குவிக்கப்படுகிறார்கள் (இதில் `` டைபர்`` அடிப்படையாகும்).

source: Now, add an empty :file:`__init__.py` file, to define the project as a regular :term:`import package <Import Package>`.
eo: Nun, aldonu malplenan dosieron :file:`__init__.py`, por marki la projekton kiel ordinaran :term:`importan pakon <Import Package>`.
ja: さて、プロジェクトを通常の :term:`インポートパッケージ <Import Package>` として定義するために、空の :file:`__init__.py` ファイルを追加しましょう。
ru: Теперь добавьте пустой файл :file:`__init__.py`, чтобы определить проект как обычный :term:`import package <Import Package>`.
ta: இப்போது, ஒரு வெற்று: கோப்பு: `__init __. Py` கோப்பு, திட்டத்தை ஒரு வழக்கமானதாக வரையறுக்க: கால:` இறக்குமதி தொகுப்பு <இறக்குமதி தொகுப்பு> `.

source: In order to enable calling the command-line interface directly from the :term:`source tree <Project Source Tree>`, i.e. as ``python src/greetings``, a certain hack could be placed in this file; read more at :ref:`running-cli-from-source-src-layout`.
eo: Por ebligi uzadon de la komandlinia fasado rekte de la :term:`fontarbo <Project Source Tree>`, ekzemple kiel ``python src/greetings``, oni povas meti trukon en tiun dosieron; legu pri tio en :ref:`running-cli-from-source-src-layout`.
ja: 例えば ``python src/greetings`` のように、:term:`ソースコードツリー <Project Source Tree>` から直接にコマンドラインインタフェースを呼び出すことができるようにするためには、このファイルの中にそれなりのハックが置かれていることでしょう; もっと読みたければ :ref:`running-cli-from-source-src-layout` をどうぞ。
ru: Для того чтобы можно было вызывать интерфейс командной строки непосредственно из :term:`source tree <Project Source Tree>`, т.е. как ``python src/greetings``, в этот файл можно поместить определенный хак; подробнее читайте в :ref:`running-cli-from-source-src-layout``.
ta: கட்டளை-வரி இடைமுகத்தை நேரடியாக அழைப்பதை இயக்குவதற்கு: `மூல மரம் <திட்ட மூல மரம்>`, அதாவது `` பைதான் எச்.ஆர்.சி/வாழ்த்துக்கள்``, இந்த கோப்பில் ஒரு குறிப்பிட்ட ஏக் வைக்கப்படலாம்; மேலும் வாசிக்க: ref: `ரன்னிங்-கிளி-ஃபிரோம்-மூல-எச்.ஆர்.சி-லேஅவுட்`.
