Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: For those projects that do use strict semantic versioning, this approach allows users to make use of :ref:`compatible release version specifiers <version-specifiers-compatible-release>`, with the ``~=`` operator. For example, ``name ~= X.Y`` is roughly equivalent to ``name >= X.Y, == X.*``, i.e., it requires at least release X.Y, and allows any later release with greater Y as long as X is the same. Likewise, ``name ~= X.Y.Z`` is roughly equivalent to ``name >= X.Y.Z, == X.Y.*``, i.e., it requires at least X.Y.Z and allows a later release with same X and Y but higher Z.
eo: Por tiuj projektoj, kiuj uzas striktan semantikan versiadon, tiu maniero ebligas uzi :ref:`versio-specifilon de kongrua eldono <version-specifiers-compatible-release>`, per la operatoro ``~=``. Ekzemple, ``nomo ~= X.Y`` proksimume ekvivalentas ``nomo >= X.Y, == X.*``, t.e., ĝi postulas minimume la eldonon X.Y, kaj permesas ajnan pli novan eldonon kun pli granda Y kaj sama X. Simile, ``nomo ~= X.Y.Z`` proksimume ekvivalentas ``nomo >= X.Y.Z, == X.Y.*``, t.e., ĝi postulas minimume X.Y.Z kaj permesas pli novan eldonon de samaj X kaj Y sed pli granda Z.
ja: 厳密なセマンティックバージョニングを採用しているプロジェクトでは、このアプローチによってユーザが ``~=`` 演算子を用いた :ref:`互換リリースバージョン指定子 <version-specifiers-compatible-release>` を使うことができるようになります。例えば、 ``name ~= X.Y`` は ``name >= X.Y, == X.*`` と大まかに言って等価で、つまり、少なくともリリース X.Y を要求していて X が同じである限りは Y が大きくなった後続リリースを許容するということです。同様に、 ``name ~= X.Y.Z`` は大まかに ``name >= X.Y.Z, == X.Y.*`` と等価で、少なくとも X.Y.Z を要求していて X と Y が同じである限り Z が大きくなった後続のリリースを許容するということです。
pt_br: Para aqueles projetos que usam controle de versão semântico estrito, esta abordagem permite que os usuários façam uso de :ref:`especificadores de versão de lançamento compatíveis <version-specifiers-compatível-release>`, com o operador ``~=``. Por exemplo, ``name ~= X.Y`` é aproximadamente equivalente a ``name >= X.Y, == X.*``, ou seja, requer pelo menos a versão X.Y, e permite qualquer versão posterior com Y maior, desde que X é o mesmo. Da mesma forma, ``name ~= X.Y.Z`` é aproximadamente equivalente a ``name >= X.Y.Z, == X.Y.*``, ou seja, requer pelo menos X.Y.Z e permite uma versão posterior com o mesmo X e Y, mas Z superior.
ru: Для тех проектов, которые используют строгую семантическую версионность, этот подход позволяет использовать спецификаторы версий : ссылка:`совместимых релизов <Спецификаторы версий-совместимых релизов>`, с помощью оператора ``~=``. Например, ``имя ~= X.Y`` примерно эквивалентно ``имя >= X.Y, == X.*``, то есть требует как минимум релиза X.Y, и допускает любой более поздний релиз с большим Y при условии, что X тот же самый. Аналогично, ``имя ~= X.Y.Z`` примерно эквивалентно ``имя >= X.Y.Z, == X.Y.*``, то есть требует не менее X.Y.Z и допускает более поздний выпуск с теми же X и Y, но более высоким Z.
ta: கண்டிப்பான சொற்பொருள் பதிப்பைப் பயன்படுத்தும் அந்த திட்டங்களுக்கு, இந்த அணுகுமுறை பயனர்களை பயன்படுத்த அனுமதிக்கிறது: Ref: `இணக்கமான வெளியீட்டு பதிப்பு விவரக்குறிப்புகள் <பதிப்பு-விவரக்குறிப்புகள்-இணக்கமான-வெளியீட்டு>`, `~ ~ =` `ஆபரேட்டருடன். எடுத்துக்காட்டாக, `` பெயர் ~ = X.Y`` தோராயமாக `` பெயர்> = x.y, == x.*``, அதாவது, இதற்கு குறைந்தபட்சம் வெளியீடு X.y க்கு தேவைப்படுகிறது, மேலும் எந்தவொரு பின்னர் வெளியீட்டை அதிக ஒய் உடன் அனுமதிக்கிறது ஃச் ஒன்றே. அதேபோல், `` பெயர் ~ = x.y.z`` தோராயமாக `` பெயர்> = x.y.z, == x.y.*``, அதாவது, அதற்கு குறைந்தபட்சம் x.y.z தேவைப்படுகிறது மற்றும் அதே ஃச் மற்றும் ஒய் உடன் பின்னர் வெளியீட்டை அனுமதிக்கிறது.

source: Python projects adopting semantic versioning should abide by clauses 1-8 of the `Semantic Versioning 2.0.0 specification <semver_>`_.
eo: Python-projektoj uzantaj semantikan versiadon observu la regulojn 1–8 de la `specifo Semantika Versiado 2.0.0 <semver_>`_.
ja: セマンティックバージョニングを採用しているPythonプロジェクトでは、 `セマンティックバージョニング 2.0.0 仕様書 <semver_>`_ の第１節から第８節までを甘受すべきです。
pt_br: Projetos Python que adotam versões semânticas devem obedecer às cláusulas 1-8 da `especificação de Versionamento Semântico 2.0.0 <semver_>`_.
ru: Python-проекты, использующие семантическое версионирование, должны следовать пунктам 1-8 спецификации `Семантическое версионирование 2.0.0 <semver_>`_.
ta: சொற்பொருள் பதிப்பைப் பின்பற்றும் பைதான் திட்டங்கள் `சொற்பொருள் பதிப்பு 2.0.0 விவரக்குறிப்பு <செம்வர்_>` _ `_ ஆகியவற்றின் 1-8 உட்பிரிவுகளுக்கு கட்டுப்பட வேண்டும்.

source: The popular :doc:`Sphinx <sphinx:index>` documentation generator is an example project that uses strict semantic versioning (:doc:`Sphinx versioning policy <sphinx:internals/release-process>`). The famous :doc:`NumPy <numpy:index>` scientific computing package explicitly uses "loose" semantic versioning, where releases incrementing the minor version can contain backwards-incompatible API changes (:doc:`NumPy versioning policy <numpy:dev/depending_on_numpy>`).
eo: The populara dokumentargenerilo :doc:`Sphinx <sphinx:index>` estas ekzemplo de projekto uzanta striktan semantikan versiadon (vidu la :doc:`regulojn pri versiado de Sphinx <sphinx:internals/release-process>`). La fama scienckomputa pako :doc:`NumPy <numpy:index>` eksplicite uzas «malstriktan» semantikan versiadon, je kiu eldono alkrementa la minoran version povas enhavi neretrokongruajn API-ŝanĝojn (vidu la :doc:`regulojn pri versiado de NumPy <numpy:dev/depending_on_numpy>`).
ja: 人気のあるドキュメンテーションジェネレータである :doc:`Sphinx <sphinx:index>` は、厳密なセマンティックバージョニング (:doc:`Sphinx バージョニング方針 <sphinx:internals/release-process>`) を採用しているプロジェクトの例です。有名な科学計算パッケージである :doc:`NumPy <numpy:index>` は、マイナーバージョンの更新でも後方互換性のない API 変更を含む場合がある (:doc:`NumPy バージョニング方針 <numpy:dev/depending_on_numpy>`) ということで、明示的に "ゆるい" セマンティックバージョニングを採用しています。
pt_br: O popular gerador de documentação :doc:`Sphinx <sphinx:index>` é um exemplo de projeto que usa controle de versionamento semântico estrito (:doc:`Política de versionamento do Sphinx <sphinx:internals/release-process>`). O famoso pacote de computação científica :doc:`NumPy <numpy:index>` usa explicitamente versionamento semântico "folgado", onde lançamentos incrementando a versão menor podem conter alterações de API incompatíveis com versões anteriores (:doc:`Política de versionamento do NumPy <numpy:dev/depending_on_numpy>`).
ru: Популярный генератор документации : документ:`Sphinx <сфинкс:индекс>` - пример проекта, использующего строгое семантическое версионирование (:документ:`сфинкс политика версионирования <сфинкс: внутренние/процесс выпуска>`). Известный пакет для научных вычислений :doc:`NumPy <numpy:index>` явно использует "свободное" семантическое версионирование, где релизы, увеличивающие минорную версию, могут содержать обратно-несовместимые изменения API (:doc:`NumPy версионная политика <numpy:dev/depending_on_numpy>`).
ta: பிரபலமான: டிஓசி: `ச்பின்க்ச் <ச்பின்க்ச்: இன்டெக்ச்>` ஆவணப்படுத்தல் செனரேட்டர் என்பது கடுமையான சொற்பொருள் பதிப்பைப் பயன்படுத்தும் ஒரு எடுத்துக்காட்டு திட்டமாகும் (: டாக்: `ச்பிங்க்ச் பதிப்பு கொள்கை <ச்பிங்க்ச்: இன்டர்ன்ச்/வெளியீட்டு-செயல்முறை>`). புகழ்பெற்ற: டிஓசி: `நம்பி <நம்பி: இன்டெக்ச்>` அறிவியல் கணினி தொகுப்பு வெளிப்படையாக "தளர்வான" சொற்பொருள் பதிப்பைப் பயன்படுத்துகிறது, அங்கு சிறிய பதிப்பை அதிகரிக்கும் வெளியீடுகள் பின்னோக்கி-இணக்கமான பநிஇ மாற்றங்களைக் கொண்டிருக்கலாம் (: டாக்: `நம்பி பதிப்பு கொள்கை <நம்பி: தேவ்/ _ON_NUMPY> `).

source: Calendar versioning
eo: Kalendara versiado
ja: カレンダーバージョニング
pt_br: Versionamento de calendário
ru: Версионирование календаря
ta: காலண்டர் பதிப்பு

source: A key advantage of date-based versioning, or `calendar versioning <calver_>`_ (CalVer), is that it is straightforward to tell how old the base feature set of a particular release is given just the version number.
eo: La ĉefavantaĝo de datobaza versiado aŭ `kalendara versiado <calver_>`_ (CalVer) estas, ke estas facile kompreni kiel malnova la baza funkciaro de iu eldono estas nur per la versia numero.
ja: `カレンダーバージョニング <calver_>`_ (CalVer) の最大の利点は、バージョン番号を見ただけで基盤になっている機能セットがどれほど古いのかが直截にわかることです。
pt_br: Uma vantagem principal do versionamento baseado em data, ou `versionamento de calendário <calver_>`_ (CalVer), é que é simples dizer quantos anos o conjunto de recursos básicos de uma determinada versão recebe apenas o número da versão.
ru: Ключевое преимущество версионирования на основе даты, или `календарного версионирования <calver_>`_ (CalVer), заключается в том, что по номеру версии можно легко определить, насколько устарел базовый набор функций конкретного выпуска.
ta: தேதி அடிப்படையிலான பதிப்பின் முக்கிய நன்மை, அல்லது `காலண்டர் பதிப்பு <கால்வர்_>` _ (கால்வர்), ஒரு குறிப்பிட்ட வெளியீட்டின் அடிப்படை அம்சத் தொகுப்பிற்கு பதிப்பு எண்ணை எவ்வளவு பழையதாகக் கூறுவது நேரடியானது.

source: Calendar version numbers typically take the form *year.month* (for example, 23.12 for December 2023).
eo: Kalendara versia numero ordinare estas de la formo *jaro.monato* (ekzemple, 23.12 por Decembro 2023).
ja: カレンダーバージョン番号は、典型的には *年.月* (例えば2023年12月に対して 23.12) の形を取ります。
pt_br: Os números de versão do calendário normalmente assumem o formato *ano.mês* (por exemplo, 23.12 para dezembro de 2023).
ru: Календарные номера версий обычно имеют вид *год.месяц* (например, 23.12 для декабря 2023 года).
ta: காலண்டர் பதிப்பு எண்கள் பொதுவாக * year.month * படிவத்தை எடுக்கும் (எடுத்துக்காட்டாக, டிசம்பர் 2023 க்கு 23.12).

source: :doc:`Pip <pip:index>`, the standard Python package installer, uses calendar versioning.
eo: :doc:`Pip <pip:index>`, la norma Python-pakinstalilo, uzas kalendaran versiadon.
ja: 標準的な Python パッケージインストーラである :doc:`Pip <pip:index>` はカレンダーバージョニングを採用しています。
pt_br: :doc:`Pip <pip:index>`, o instalador padrão do pacote Python, usa versionamento de calendário.
ru: : документ:`Pip <pip: индекс>`, стандартная программа установки пакетов Python, использует календарную версификацию.
ta: : டாக்: `பிப் <பிப்: இன்டெக்ச்>`, நிலையான பைதான் தொகுப்பு நிறுவி, காலண்டர் பதிப்பைப் பயன்படுத்துகிறது.

source: Other schemes
eo: Aliaj skemoj
ja: 他の方法
pt_br: Outros esquemas
ru: Другие схемы
ta: பிற திட்டங்கள்

source: Serial versioning refers to the simplest possible versioning scheme, which consists of a single number incremented every release. While serial versioning is very easy to manage as a developer, it is the hardest to track as an end user, as serial version numbers convey little or no information regarding API backwards compatibility.
eo: Seria versiado estas la plej simpla versia skemo konsistanta el unu enjreo alkrementata po unu fojo por ĉiu eldono. Kvankam seria versiado estas tre facile administrebla por la aŭtoro, ĝi estas malfacila por la uzanto, ĉar seria versia numero enhavas neniom aŭ apenaŭon da informo pri retrokongrueco de la API.
ja: 一連番号によるバージョン付与は、リリースの度に増加する単一の数字で構成されていて、可能な限り単純なバージョニング方法であると見なされています。一連番号によるバージョン付与は開発者にとってはとても管理しやすい反面、一連番号によるバージョン番号を見てもAPIの後方互換性に関する情報がほとんど又は全くわからないので、ユーザにとっては追跡するのが最も困難です。
pt_br: O versionamento serial refere-se ao esquema de versionamento mais simples possível, que consiste em um único número incrementado a cada versão. Embora o versionamento serial seja muito fácil de gerenciar como desenvolvedor, é o mais difícil de rastrear como usuário final, pois os números de versão serial transmitem pouca ou nenhuma informação sobre compatibilidade com versões anteriores da API.
ru: Серийное версионирование относится к самой простой схеме версионирования, которая состоит из одного числа, увеличивающегося с каждым выпуском. Хотя серийной версией очень легко управлять разработчику, ее сложнее всего отслеживать конечному пользователю, поскольку серийные номера версий практически не передают информации об обратной совместимости API.
ta: சீரியல் பதிப்பு என்பது எளிமையான சாத்தியமான பதிப்பு திட்டத்தைக் குறிக்கிறது, இது ஒவ்வொரு வெளியீட்டையும் அதிகரிக்கும் ஒற்றை எண்ணைக் கொண்டுள்ளது. சீரியல் பதிப்பு ஒரு டெவலப்பராக நிர்வகிக்க மிகவும் எளிதானது என்றாலும், இறுதி பயனராக கண்காணிப்பது கடினம், ஏனெனில் தொடர் பதிப்பு எண்கள் பநிஇ பின்னோக்கி பொருந்தக்கூடிய தன்மை குறித்து சிறிய அல்லது எந்த தகவலையும் தெரிவிக்கின்றன.

source: Local version identifiers
eo: Loka versi-identigilo
ja: ローカルバージョン識別子
pt_br: Identificadores de versão local
ru: Идентификаторы локальных версий
ta: உள்ளக பதிப்பு அடையாளங்காட்டிகள்

source: Public version identifiers are designed to support distribution via :term:`PyPI <Python Package Index (PyPI)>`. Python packaging tools also support the notion of a :ref:`local version identifier <local-version-identifiers>`, which can be used to identify local development builds not intended for publication, or modified variants of a release maintained by a redistributor.
eo: Publika versio-identigilo celas subteni distribuadon per :term:`PyPI <Python Package Index (PyPI)>`. Python-pakiloj ankaŭ subtenas :ref:`lokan versio-identigilon <local-version-identifiers>`, kiu identigas lokan evoluadan konstruon ne por publika eldonado, aŭ modifitan varianton de eldono far redistribuanto.
ja: 公的バージョン識別子は、 :term:`PyPI <Python Package Index (PyPI)>` を通じた配布をサポートするように設計されています。Pythonのパッケージングツール群は、ローカルでの開発でビルドごとの識別子や再配布者が維持管理している変種のリリースの識別子として用いるような :ref:`局所的バージョン識別子 <local-version-identifiers>` の考え方もサポートします。
pt_br: Identificadores de versão pública são projetados para suportar distribuição via :term:`PyPI <Python Package Index (PyPI)>`. As ferramentas de empacotamento do Python também oferecem suporte à noção de um :ref:`identificador de versão local <local-version-identifiers>`, que pode ser usado para identificar compilações de desenvolvimento local não destinadas à publicação, ou variantes modificadas de uma versão mantida por um redistribuidor.
ru: Идентификаторы публичных версий предназначены для поддержки распространения через : термин:`PyPI <Python Package Index (PyPI)>`. Средства упаковки Python также поддерживают понятие :ref:`локального идентификатора версии <локальный идентификатор версии>`, который может использоваться для идентификации локальных сборок разработки, не предназначенных для публикации, или модифицированных вариантов релиза, поддерживаемого редистрибьютором.
ta: பொது பதிப்பு அடையாளங்காட்டிகள் விநியோகத்தை ஆதரிக்க வடிவமைக்கப்பட்டுள்ளன: கால: `பைபி <பைதான் தொகுப்பு குறியீட்டு (PYPI)>`. பைதான் பேக்கேசிங் கருவிகள் A: ref: `உள்ளூர் பதிப்பு அடையாளங்காட்டி <உள்ளூர்-பதிப்பு-அடையாளங்காட்டிகள்>` என்ற கருத்தையும் ஆதரிக்கின்றன, இது வெளியீட்டிற்காக அல்ல, அல்லது மறுவிநியோகத்தால் பராமரிக்கப்படும் வெளியீட்டின் மாற்றியமைக்கப்பட்ட மாறுபாடுகளை அடையாளம் காண பயன்படுத்தலாம்.

source: A local version identifier takes the form of a public version identifier, followed by "+" and a local version label. For example, a package with Fedora-specific patches applied could have the version "1.2.1+fedora.4". Another example is versions computed by setuptools-scm_, a setuptools plugin that reads the version from Git data. In a Git repository with some commits since the latest release, setuptools-scm generates a version like "0.5.dev1+gd00980f", or if the repository has untracked changes, like "0.5.dev1+gd00980f.d20231217".
eo: Loka versio-identigilo konsistas el publika versio-identigilo sekvita de «+» kaj loka versia etikedo. Ekzemple, pako kun Fedora-specifaj flikoj havus la version «1.2.1+fedora.4». Alia ekzemplo estas versio komputita de setuptools-scm_, kiu estas kromprogramo por setuptools leganta la version el Git-datenoj. En Git-deponejo kun kelko da ŝanĝoj post la plej nova eldono, setuptools-scm generas version kiel «0.5.dev1+gd00980f» aŭ, se la deponejo havas nespuratajn ŝanĝojn, kiel «0.5.dev1+gd00980f.d20231217».
ja: ローカルバージョン識別子は、公的バージョン識別子の後ろに "+" とローカルバージョンラベルを並べた形を採ります。例えば、Fedora に特有のパッチが適用されたパッケージは、 "1.2.1+fedora.4" といったバージョンになるという具合です。別の例としては、 setuptools-scm_ によって計算されたバージョンで、Git のデータからバージョンを読み取る setuptools プラグインによるものです。最新のリリース以後に幾つかのコミットがなされた Git リポジトリでは setuptools-scm は "0.5.dev1+gd00980f" のようなバージョンを生成することもありますし、トラックされていない変更のあるリポジトリなら "0.5.dev1+00980f.d20231217" のようになることがあります。
pt_br: Um identificador de versão local assume a forma de um identificador de versão pública, seguido por "+" e um rótulo de versão local. Por exemplo, um pacote com patches específicos do Fedora aplicados poderia ter a versão "1.2.1+fedora.4". Outro exemplo são as versões calculadas pelo setuptools-scm_, um plugin do setuptools que lê a versão dos dados do Git. Em um repositório Git com alguns commits desde a versão mais recente, setuptools-scm gera uma versão como "0.5.dev1+gd00980f", ou se o repositório tiver alterações não rastreadas, como "0.5.dev1+gd00980f.d20231217".
ru: Идентификатор локальной версии имеет вид идентификатора публичной версии, за которым следует "+" и метка локальной версии. Например, пакет с примененными исправлениями, специфичными для Fedora, может иметь версию "1.2.1+fedora.4". Другой пример - версии, вычисляемые setuptools-scm_, плагином setuptools, который считывает версию из данных Git. В Git-репозитории с некоторыми фиксациями после последнего релиза setuptools-scm генерирует версию типа "0.5.dev1+gd00980f", или, если в репозитории есть неотслеживаемые изменения, типа "0.5.dev1+gd00980f.d20231217".
ta: உள்ளக பதிப்பு அடையாளங்காட்டி பொது பதிப்பு அடையாளங்காட்டியின் வடிவத்தை எடுக்கிறது, அதைத் தொடர்ந்து "+" மற்றும் உள்ளக பதிப்பு சிட்டை. எடுத்துக்காட்டாக, ஃபெடோரா-குறிப்பிட்ட திட்டுகள் பயன்படுத்தப்படும் ஒரு தொகுப்பில் "1.2.1+ஃபெடோரா 4" பதிப்பைக் கொண்டிருக்கலாம். மற்றொரு எடுத்துக்காட்டு, செட்ப்டூல்ச்-எச்.சி.எம்_ ஆல் கணக்கிடப்பட்ட பதிப்புகள், செடுப்டூல்ச் சொருகி, இது அறிவிலி தரவிலிருந்து பதிப்பைப் படிக்கிறது. அண்மைக் கால வெளியீட்டிலிருந்து சில கமிட்டுகளுடன் கூடிய ஒரு சிஐடி களஞ்சியத்தில், செடுப்டூல்ச்-எச்.சி.எம் "0.5.DEV1+GD00980F" போன்ற ஒரு பதிப்பை உருவாக்குகிறது, அல்லது களஞ்சியத்தில் "0.5.DEV1+GD00980F.D2021217" போன்ற மாற்றங்கள் கட்டுப்படுத்தப்படாத மாற்றங்களைக் கொண்டிருந்தால்.

source: Accessing version information at runtime
eo: Akiri versiajn informojn dum rultempo
ja: ランタイムにバージョン情報にアクセスする
ru: Доступ к информации о версии во время выполнения
ta: இயக்க நேரத்தில் பதிப்பு தகவல்களை அணுகும்

source: Version information for all :term:`distribution packages <Distribution Package>` that are locally available in the current environment can be obtained at runtime using the standard library's :func:`importlib.metadata.version` function::
eo: Versiaj informoj por ĉiuj :term:`distribuaj pakoj <Distribution Package>` loke haveblaj en la aktuala medio estas akireblaj per la funkcio :func:`importlib.metadata.version` en la norma biblioteko::
ja: 現在の環境でローカルに利用可能な :term:`配布パッケージ <Distribution Package>` のバージョン情報は、標準ライブラリの :func:`importlib.metadata.version` 関数を使ってランタイム内から取得することが可能です::
ru: Информация о версии всех :term:`distribution packages <Distribution Package>`, локально доступных в текущем окружении, может быть получена во время выполнения с помощью функции :func:`importlib.metadata.version` стандартной библиотеки::
ta: அனைவருக்கும் பதிப்பு தகவல்: கால: `விநியோக தொகுப்புகள் <விநியோக தொகுப்பு>` தற்போதைய சூழலில் உள்ளூரில் கிடைக்கக்கூடியவை நிலையான நூலகத்தைப் பயன்படுத்தி இயக்க நேரத்தில் பெறலாம்: FUNC: `importlib.metadata.version` செயல்பாடு ::

source: Many projects also choose to version their top level :term:`import packages <Import Package>` by providing a package level ``__version__`` attribute::
eo: Multaj projektoj ankaŭ provizas version al la supranivela :term:`importa pako <Import Package>` per paknivela atributo ``__version__``::
ja: 多くのプロジェクトでは、パッケージレベルの ``__version__`` アトリビュートを提供することで、トップレベルの :term:`インポートパッケージ <Import Package>`:term:`インポートパッケージ <Import Package>` にバージョン番号を付与することも選択しています::
ru: Многие проекты также выбирают версионирование своего верхнего уровня :term:`import packages <Import Package>`, предоставляя атрибут ``__version__`` на уровне пакета::
ta: பல திட்டங்கள் அவற்றின் உயர் மட்டத்தை பதிப்பதற்கும் தேர்வு செய்கின்றன: கால: `இறக்குமதி தொகுப்புகளை <இறக்குமதி தொகுப்பு>` ஒரு தொகுப்பு நிலையை வழங்குவதன் மூலம் `__version__`` பண்புக்கூறு ::

source: This technique can be particularly valuable for CLI applications which want to ensure that version query invocations (such as ``pip -V``) run as quickly as possible.
eo: Tiu teĥniko estas speciale utila por komandlinia programo, kies versio-peto (kiel ekzemple ``pip -V``) devas ruliĝi rapide.
ja: このテクニックは、とりわけ、バージョン番号を問い合わせる呼び出し (``pip -V`` など) が可能な限り素早く動作することが保証されることを望む CLI アプリケーションにおいて価値があります。
ru: Эта техника может быть особенно ценной для приложений CLI, которые хотят обеспечить максимально быстрое выполнение запросов версий (например, ``pip -V``).
ta: சி.எல்.ஐ பயன்பாடுகளுக்கு இந்த நுட்பம் குறிப்பாக மதிப்புமிக்கதாக இருக்கும், இது பதிப்பு வினவல் அழைப்பிதழ்கள் (`` பிப் -வி`` போன்றவை) முடிந்தவரை விரைவாக இயங்குவதை உறுதிசெய்ய விரும்புகின்றன.

source: Package publishers wishing to ensure their reported distribution package and import package versions are consistent with each other can review the :ref:`single-source-version` discussion for potential approaches to doing so.
eo: Eldonanto de pako, kiu volas certigi, ke la versioj de la distribua pako kaj importa pako estu samaj, legu la diskuton :ref:`single-source-version` por eblaj metodoj por fari tion.
ja: 報告された配布パッケージとインポートパッケージのバージョン番号が互いに整合性のあるものとなることを保証したいと望むパッケージの公開者は、そのようにするための潜在的なアプローチとして :ref:`シングルソースのバージョン番号 <single-source-version>` の議論を復習することができます。
ru: Издатели пакетов, желающие обеспечить соответствие версий дистрибутивного и импортного пакетов, могут ознакомиться с обсуждением :ref:`single-source-version` для потенциальных подходов к решению этой задачи.
ta: தங்கள் அறிக்கையிடப்பட்ட விநியோக தொகுப்பு மற்றும் இறக்குமதி தொகுப்பு பதிப்புகள் ஒருவருக்கொருவர் ஒத்துப்போகின்றன என்பதை உறுதிப்படுத்த விரும்பும் தொகுப்பு வெளியீட்டாளர்கள் மறுபரிசீலனை செய்யலாம்: Ref: `ஒற்றை-மூல-பதிப்பு` அவ்வாறு செய்வதற்கான சாத்தியமான அணுகுமுறைகளுக்கு விவாதம்.

source: As import packages and modules are not *required* to publish runtime version information in this way (see the withdrawn proposal in :pep:`PEP 396 <396>`), the ``__version__`` attribute should either only be queried with interfaces that are known to provide it (such as a project querying its own version or the version of one of its direct dependencies), or else the querying code should be designed to handle the case where the attribute is missing [#fallback-to-dist-version]_.
eo: Ĉar importaj pako kaj moduloj ne *devas* sciigi pri rultempa versia informo tiel (vidu la neaprobitan proponon :pep:`PEP 396 <396>`), oni serĉu la atributon ``__version__`` nur por tiuj interfacoj, por kiuj oni scias ke la atributo ekzistas (kiel ekzemple projekto serĉanta sian propran version aŭ la version de unu el siaj rektaj dependaĵoj). Alie, la serĉanta kodo pritraktu la kazon, kiam la atributo mankas [#fallback-to-dist-version]_.
ja: インポートされたパッケージやモジュールはランタイムのバージョン情報をこのやり方で公開することを *要求* されてはいない (:pep:`396` で撤回された提案を見てください) ので、 ``__version__`` アトリビュートは、それを提供するものとして知られているインターフェース (あるプロジェクトが自身のバージョン番号やその直接の依存先のバージョン番号を問い合わせるなど) だけから問い合わせを受けるか、または、問い合わせる側のコードがアトリビュート欠損の場合 [#fallback-to-dist-version]_ を取り扱えるように設計されているかのいずれかであるべきです。
ru: Поскольку импортные пакеты и модули не *обязаны* публиковать информацию о версии во время выполнения таким образом (см. отозванное предложение в :pep:`PEP 396 <396>`), атрибут ``__version__`` должен запрашиваться только в интерфейсах, которые, как известно, его предоставляют (например, проект запрашивает свою собственную версию или версию одной из своих прямых зависимостей), или же код запроса должен быть разработан для обработки случая, когда атрибут отсутствует [#fallback-to-dist-version]_.
ta: இயக்க நேர பதிப்பு தகவல்களை இந்த வழியில் வெளியிட இறக்குமதி தொகுப்புகள் மற்றும் தொகுதிகள் * தேவையில்லை * (திரும்பப் பெறப்பட்ட திட்டத்தைப் பார்க்கவும்: PEP: `PEP 396 <396>`) அவை வழங்குவதாக அறியப்படுகிறது (அதன் சொந்த பதிப்பை வினவுவது அல்லது அதன் நேரடி சார்புகளில் ஒன்றின் பதிப்பு போன்றவை), இல்லையெனில் வினவல் குறியீடு பண்புக்கூறு காணாமல் போன வழக்கைக் கையாள வடிவமைக்கப்பட வேண்டும் [#குறைவுக்கு-தூரத்திற்கு -்வெர்சன்] _.
