Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: :pep:`685` restricted valid values to be unambiguous (i.e. no normalization required). For older metadata versions, value restrictions were brought into line with ``Name:`` and normalization rules were introduced.
eo: :pep:`685` limigis validajn valorojn al la malambiguaj valoroj (alivorte, sen postulata normigo.Por malnovaj versioj de metadatenoj, limigoj de valoro kongruiĝis kun ``Name:``, kaj reguloj pri normigado estis starigitaj.
ja: 曖昧さ (すなわち正規化が要求されていない) を避けるために :pep:`685` で制限された正当な値を。古めのメタデータのバージョンでは、 ``Name:`` を伴う行で値に制限が導入され、正規化規則も導入されました。
pt_br: A :pep:`685` restringiu os valores válidos para serem inequívocos (ou seja, sem necessidade de normalização). Para versões de metadados mais antigas, as restrições de valor foram alinhadas com ``Name:`` e as regras de normalização foram introduzidas.
ru: :pep:`685` ограничивал допустимые значения, чтобы они были однозначными (т.е. нормализация не требовалась). Для более старых версий метаданных ограничения на значения были приведены в соответствие с ``Name:`` и были введены правила нормализации.
ta: : PEP: `685` தடைசெய்யப்பட்ட செல்லுபடியாகும் மதிப்புகள் தெளிவற்றதாக இருக்க வேண்டும் (அதாவது இயல்பாக்கம் தேவையில்லை). பழைய மேனிலை தரவு பதிப்புகளுக்கு, மதிப்பு கட்டுப்பாடுகள் `` பெயர்: `` மற்றும் இயல்பாக்குதல் விதிகள் அறிமுகப்படுத்தப்பட்டன.

source: A string containing the name of an optional feature. A valid name consists only of lowercase ASCII letters, ASCII numbers, and hyphen. It must start and end with a letter or number. Hyphens cannot be followed by another hyphen. Names are limited to those which match the following regex (which guarantees unambiguity)::
eo: Signoĉeno enhavanta la nomon de nedeviga funkcio. Valida nomo konsistas nur el minusklaj Askiaj literoj, Askiaj ciferoj, kaj streketo. Ĝi devas komenciĝi kaj finiĝi per litero aŭ cifero. Streketo devas ne sekvi alian streketon. Nomo devas konformi al la jena regula esprimo (garantiante malambiguecon)::
ja: 追加的な機能の名前を含む文字列。正当な名前は、 ASCII 小文字・ ASCII 数字・ハイフンからのみ構成されます。先頭と末尾は文字か数字でなければなりません。ハイフンは連続してはいけません。名前は次の正規表現にマッチしなければなりません (そうすることで曖昧さを排除します)::
pt_br: Uma string contendo o nome de um recurso opcional. Um nome válido consiste apenas em letras ASCII minúsculas e números ASCII e hífen. Deve começar e terminar com uma letra ou número. Hífenes não podem ser seguidos por outro hífen. Os nomes são limitados àqueles que correspondem ao seguinte regex (que elimina ambiguidade)::
ru: Строка, содержащая имя необязательной функции. Правильное имя состоит только из строчных букв ASCII, цифр ASCII и дефиса. Оно должно начинаться и заканчиваться буквой или цифрой. За дефисом не может следовать другой дефис. Имена ограничиваются теми, которые соответствуют следующему регексу (который гарантирует однозначность)::
ta: விருப்ப அம்சத்தின் பெயரைக் கொண்ட ஒரு சரம். செல்லுபடியாகும் பெயர் சிறிய ASCII எழுத்துக்கள், ASCII எண்கள் மற்றும் ஐபன் ஆகியவற்றை மட்டுமே கொண்டுள்ளது. இது ஒரு கடிதம் அல்லது எண்ணுடன் தொடங்கி முடிக்க வேண்டும். ஐபன்களை மற்றொரு ஐபன் பின்பற்ற முடியாது. பின்வரும் ரீசெக்சுடன் பொருந்தக்கூடிய பெயர்களுக்கு பெயர்கள் வரையறுக்கப்பட்டுள்ளன (இது தெளிவற்ற தன்மைக்கு பொறுப்பு அளிக்கிறது) ::

source: The specified name may be used to make a dependency conditional on whether the optional feature has been requested.
eo: La specifita nomo povas esti uzata por igi dependecon kondiĉa pri ĉu la nedeviga funkcio estas petata.
ja: 指定された名前は、追加的な機能が要求されたか否かに応じて依存関係を構築するために使われます。
pt_br: O nome especificado pode ser usado para tornar uma dependência condicional ao fato de o recurso opcional ter sido solicitado.
ru: Указанное имя можно использовать, чтобы сделать зависимость зависимой от того, была ли запрошена необязательная функция.
ta: விருப்ப நற்பொருத்தம் கோரப்பட்டுள்ளதா என்பதைப் பற்றி சார்புநிலையை நிபந்தனை செய்ய குறிப்பிட்ட பெயர் பயன்படுத்தப்படலாம்.

source: A second distribution requires an optional dependency by placing it inside square brackets, and can request multiple features by separating them with a comma (,). The requirements are evaluated for each requested feature and added to the set of requirements for the distribution.
ja: ２番目の配布物は、角括弧の中に書くことで追加の依存先を要求し、コンマ (,) で区切ることで複数の機能を要求することができます。要求事項は、要求されたそれぞれの機能について評価され、配布物の要求する依存関係の組に追加されます。
pt_br: Uma segunda distribuição requer uma dependência opcional, colocando-a entre colchetes, e pode solicitar vários recursos, separando-os com uma vírgula (,). Os requisitos são avaliados para cada recurso solicitado e adicionados ao conjunto de requisitos para a distribuição.
ru: Второй дистрибутив требует необязательную зависимость, помещая ее в квадратные скобки, и может запросить несколько функций, разделяя их запятой (,). Требования оцениваются для каждой запрошенной функции и добавляются к набору требований для дистрибутива.
ta: இரண்டாவது விநியோகத்திற்கு சதுர அடைப்புக்குறிக்குள் வைப்பதன் மூலம் விருப்பமான சார்பு தேவைப்படுகிறது, மேலும் அவற்றை கமா (,) உடன் பிரிப்பதன் மூலம் பல அம்சங்களைக் கோரலாம். கோரப்பட்ட ஒவ்வொரு அம்சத்திற்கும் தேவைகள் மதிப்பீடு செய்யப்பட்டு விநியோகத்திற்கான தேவைகளின் தொகுப்பில் சேர்க்கப்படுகின்றன.

source: Two feature names ``test`` and ``doc`` are reserved to mark dependencies that are needed for running automated tests and generating documentation, respectively.
eo: Du funkcio-nomoj ``test`` kaj ``doc`` estas rezervataj por marki dependecojn por aŭtomataj testoj kaj generado de dokumentaro respektive.
ja: ``test`` と ``doc`` という二つの名前は、順に自動化されたテストと説明文書の生成のために必要な依存先として予約されています。
pt_br: Dois nomes de recursos ``test`` e ``doc`` são reservados para marcar dependências que são necessárias para executar testes automatizados e gerar documentação, respectivamente.
ru: Два имени функций ``test`` и ``doc`` зарезервированы для обозначения зависимостей, необходимых для выполнения автоматизированных тестов и создания документации, соответственно.
ta: இரண்டு அம்ச பெயர்கள் `` சோதனை`` மற்றும் `டாக்`` முறையே தானியங்கி சோதனைகளை இயக்குவதற்கும் ஆவணங்களை உருவாக்குவதற்கும் தேவையான சார்புகளுக்கு ஒதுக்கப்பட்டுள்ளன.

source: It is legal to specify ``Provides-Extra:`` without referencing it in any ``Requires-Dist:``.
eo: Validas specifi ``Provides-Extra:`` sen referencado de ĝi en ajna ``Requires-Dist:``.
ja: ``Requires-Diet:`` のどこからも参照されていなくても、 ``Provides-Extra:`` を指定しても構いません。
pt_br: É válido especificar ``Provides-Extra:`` sem referenciá-lo em qualquer ``Requer-Dist:``.
ru: Разрешается указывать ``Provides-Extra:`` без ссылки на него в каком-либо ``Requires-Dist:``.
ta: `` வழங்கும்-எக்ச்ட்ரா: `` எந்தவொரு `` தேவைப்படும்-டிச்ட்: `` இல் குறிப்பிடாமல் குறிப்பிடுவது சட்டபூர்வமானது.

source: When writing data for older metadata versions, names MUST be normalized following the same rules used for the ``Name:`` field when performing comparisons. Tools writing metadata MUST raise an error if two ``Provides-Extra:`` entries would clash after being normalized.
eo: Dum skribado de datenoj por pli malnovaj versioj de metadatenoj, oni DEVAS normigi nomon laŭ la samajn regulojn por la kampo ``Name:`` dum komparado. Iloj skribantaj metadatenojn DEVAS sciigi pri eraro, se du kampoj ``Provides-Extra:`` konfliktus post normigo.
ja: 古めのメタデータのバージョンでデータを書く時、比較を行う時には ``Name:`` フィールドに使われるのと同じ規則に従って正規化されなければなりません。ふたつの ``Provides-Extra:`` エントリが正規化後に衝突する場合には、メタデータを書き込むツールはエラーを発生させなければなりません。
pt_br: Ao escrever dados para versões de metadados mais antigas, os nomes DEVEM ser normalizados seguindo as mesmas regras usadas para o campo ``Name:`` ao realizar comparações. Ferramentas que escrevem metadados DEVEM gerar um erro se duas entradas ``Provides-Extra:`` colidirem após serem normalizadas.
ru: При записи данных для старых версий метаданных имена ДОЛЖНЫ быть нормализованы по тем же правилам, которые используются для поля ``Name:`` при выполнении сравнений. Средства записи метаданных ДОЛЖНЫ выдавать ошибку, если две записи ``Provides-Extra:`` будут конфликтовать после нормализации.
ta: பழைய மேனிலை தரவு பதிப்புகளுக்கான தரவை எழுதும்போது, `` பெயருக்குப் பயன்படுத்தப்படும் அதே விதிகளைப் பின்பற்றி பெயர்கள் இயல்பாக்கப்பட வேண்டும்: `` ஒப்பீடுகளைச் செய்யும்போது புலம். இரண்டு `` வழங்கும்-எக்ச்ட்ரா: `` இயல்பாக்கப்பட்ட பின்னர் உள்ளீடுகள் மோதினால் மெட்டாடேட்டாவை எழுதும் கருவிகள் பிழையை உயர்த்த வேண்டும்.

source: When reading data for older metadata versions, tools SHOULD warn when values for this field would be invalid under newer metadata versions. If a value would be invalid following the rules for ``Name:`` in any core metadata version, the user SHOULD be warned and the value ignored to avoid ambiguity. Tools MAY choose to raise an error when reading an invalid name for older metadata versions.
ja: メタデータの古めのバージョンから読み込む時、このフィールドの値が新しめのメタデータバージョンとして正当でない場合にツールが警告するべきです。コアとなるメタデータのバージョンで ``Name:`` に対する規則に照らして値が正当ではないとすればユーザは警告されるべきで、その値は曖昧さを避けるために無視されるべきです。古めのメタデータバージョンとして不当な名前を読み取った場合には、ツールはエラーを発出することを選択しても構いません。
pt_br: Ao ler dados para versões de metadados mais antigas, as ferramentas DEVEM avisar quando os valores para este campo seriam inválidos em versões de metadados mais recentes. Se um valor for inválido seguindo as regras para ``Name:`` em qualquer versão de metadados principais, o usuário DEVE ser avisado e o valor ignorado para evitar ambiguidade. As ferramentas PODEM optar por gerar um erro ao ler um nome inválido para versões de metadados mais antigas.
ru: При чтении данных для старых версий метаданных инструменты ДОЛЖНЫ предупреждать, что значения для этого поля будут недопустимы в новых версиях метаданных. Если значение будет недействительным в соответствии с правилами для ``Имя:`` в любой основной версии метаданных, пользователь ДОЛЖЕН быть предупрежден, а значение проигнорировано, чтобы избежать двусмысленности. Инструментальные средства МОГУТ выдавать ошибку при чтении недопустимого имени для старых версий метаданных.
ta: பழைய மேனிலை தரவு பதிப்புகளுக்கான தரவைப் படிக்கும்போது, புதிய மேனிலை தரவு பதிப்புகளின் கீழ் இந்த புலத்திற்கான மதிப்புகள் செல்லாது என்பதை கருவிகள் எச்சரிக்க வேண்டும். `` பெயருக்கான விதிகளைப் பின்பற்றி ஒரு மதிப்பு செல்லாது என்றால்: `` எந்தவொரு முக்கிய மேனிலை தரவு பதிப்பிலும், பயனருக்கு எச்சரிக்கை செய்யப்பட வேண்டும் மற்றும் தெளிவற்ற தன்மையைத் தவிர்க்க மதிப்பு புறக்கணிக்கப்பட வேண்டும். பழைய மேனிலை தரவு பதிப்புகளுக்கு தவறான பெயரைப் படிக்கும்போது பிழையை உயர்த்த கருவிகள் தேர்வு செய்யலாம்.

source: Rarely Used Fields
eo: Malofte uzataj kampoj
ja: 稀に使われるフィールド
pt_br: Campos raramente usados
ru: Редко используемые поля
ta: அரிதாகவே பயன்படுத்தப்படும் புலங்கள்

source: The fields in this section are currently rarely used, as their design was inspired by comparable mechanisms in Linux package management systems, and it isn't at all clear how tools should interpret them in the context of an open index server such as `PyPI <https://pypi.org>`__.
eo: La kampoj en ĉi tiu paragrafo estas nuntempe malofte uzataj, ĉar ili estis fasonitaj simile al meĥanismoj en Linux-pakadministraj sistemoj, kaj ne klasas, kiel ilo interpretu ilin por malfermita indeksoservilo kiel `PyPI <https://pypi.org>`__.
ja: この節のフィールドは、 Linux のパッケージ管理システムにおける類似の機構に触発されて設計されましたが、 `PyPI <https://pypi.org>`__ のような開放的なインデックスサーバの文脈でツールがどのように翻案するべきかが全く明らかではないので、現在ではほとんど使われません。
pt_br: Os campos nesta seção são raramente usados atualmente, já que seu design foi inspirado por mecanismos comparáveis em sistemas de gerenciamento de pacotes Linux, e não está claro como as ferramentas devem interpretá-los no contexto de um servidor de indexação aberto, como `PyPI <https://pypi.org>`__.
ru: Поля в этом разделе в настоящее время используются редко, поскольку их дизайн был вдохновлен аналогичными механизмами в системах управления пакетами Linux, и совершенно не ясно, как инструменты должны интерпретировать их в контексте открытого индексного сервера, такого как `PyPI <https://pypi.org>`__.
ta: இந்த பிரிவில் உள்ள புலங்கள் தற்போது அரிதாகவே பயன்படுத்தப்படுகின்றன, ஏனெனில் அவற்றின் வடிவமைப்பு லினக்ச் தொகுப்பு மேலாண்மை அமைப்புகளில் ஒப்பிடக்கூடிய வழிமுறைகளால் ஈர்க்கப்பட்டது, மேலும் `பைபி <போன்ற திறந்த குறியீட்டு சேவையகத்தின் சூழலில் கருவிகள் அவற்றை எவ்வாறு விளக்க வேண்டும் என்பது தெளிவாகத் தெரியவில்லை https://pypi.org> ____.

source: As a result, popular installation tools ignore them completely, which in turn means there is little incentive for package publishers to set them appropriately. However, they're retained in the metadata specification, as they're still potentially useful for informational purposes, and can also be used for their originally intended purpose in combination with a curated package repository.
ja: その結果として、人気のあるインストールツールでは完全に無視されていて、そのために今度はパッケージを公開する側でもこれらのフィールドを適切に設定しておく誘因がほとんどなくなっています。しかしながら、これらのフィールドは、情報提供の目的ではまだ潜在的に役に立つことと、細かく注釈をつけるようなパッケージリポジトリと組み合わせれば本来意図された目的に用いることができることから、メタデータの仕様には残されています。
pt_br: Como resultado, as ferramentas de instalação populares os ignoram completamente, o que significa que há pouco incentivo para os editores de pacotes configurá-los apropriadamente. No entanto, eles são retidos na especificação de metadados, pois ainda são potencialmente úteis para fins informativos e também podem ser usados para o propósito originalmente pretendido em combinação com um repositório de pacotes com curadoria.
ru: В результате популярные инструменты установки полностью игнорируют их, что, в свою очередь, не стимулирует издателей пакетов устанавливать их должным образом. Тем не менее, они сохранены в спецификации метаданных, поскольку все еще потенциально полезны в информационных целях, а также могут быть использованы по своему первоначальному назначению в сочетании с курируемым репозиторием пакетов.
ta: இதன் விளைவாக, பிரபலமான நிறுவல் கருவிகள் அவற்றை முற்றிலுமாக புறக்கணிக்கின்றன, இதன் பொருள் தொகுப்பு வெளியீட்டாளர்கள் அவற்றை சரியான முறையில் அமைக்க சிறிய ஊக்கத்தொகை இல்லை. இருப்பினும், அவை மேனிலை தரவு விவரக்குறிப்பில் தக்கவைக்கப்பட்டுள்ளன, ஏனெனில் அவை செய்தி நோக்கங்களுக்காக இன்னும் பயனுள்ளதாக இருக்கும், மேலும் அவை ஒரு தொகுக்கப்பட்ட தொகுப்பு களஞ்சியத்துடன் இணைந்து அவற்றின் முதலில் நோக்கம் கொண்ட நோக்கத்திற்காக பயன்படுத்தப்படலாம்.

source: Provides-Dist (multiple use)
eo: Provides-Dist (plurfoje uzebla)
ja: Provides-Dist (複数回の使用可)
pt_br: Provides-Dist (vários usos)
ru: Provides-Dist (можно использовать несколько раз)
ta: வழங்கும்-டீச்ட் (பல பயன்பாடு)

source: Each entry contains a string naming a Distutils project which is contained within this distribution. This field *must* include the project identified in the ``Name`` field, followed by the version : Name (Version).
eo: Ĉiu ero enhavas signoĉenon nomantan projekton Distutils, kiun ĉi tiu distribuo enhavas. Tiu kampo *devas* inkluzivi la projekton identigitan en la kampo ``Name``, sekvita de la versio: Nomo (Versio).
ja: それぞれのエントリは、この配布物に含まれている Distutils プロジェクトの名前を文字列で含みます。このフィールドは、プロジェクトを特定する ``Name`` フィールドと後続するバージョンを *含んでいなければなりません*: Name (Version) 。
pt_br: Cada entrada contém uma string nomeando um projeto Distutils que está contido nesta distribuição. Este campo *deve* incluir o projeto identificado no campo ``Name``, seguido da versão: Nome (Versão).
ru: Каждая запись содержит строку, называющую проект Distutils, который содержится в этом дистрибутиве. Это поле *должно* включать проект, указанный в поле ``Имя``, за которым следует версия : Имя (Версия).
ta: ஒவ்வொரு நுழைவுக்கும் இந்த விநியோகத்திற்குள் இருக்கும் ஒரு டிச்டிடில்ச் திட்டத்திற்கு பெயரிடும் சரம் உள்ளது. இந்த புலம் * `` பெயர்`` புலத்தில் அடையாளம் காணப்பட்ட திட்டத்தை சேர்க்க வேண்டும், அதைத் தொடர்ந்து பதிப்பு: பெயர் (பதிப்பு).

source: A distribution may provide additional names, e.g. to indicate that multiple projects have been bundled together. For instance, source distributions of the ``ZODB`` project have historically included the ``transaction`` project, which is now available as a separate distribution. Installing such a source distribution satisfies requirements for both ``ZODB`` and ``transaction``.
ja: 配布物は、複数のプロジェクトが一緒に束ねられている場合には、それを示す追加の名前を持っていても構いません。例えば、 ``ZODB`` プロジェクトのソースコード配布物は、歴史的に ``transaction`` プロジェクトを包含していましたが、今では個別の配布物として利用可能です。そのようなソースコード配布物をインストールすると、 ``ZODB`` と ``transaction`` の両方の要求事項を満たします。
pt_br: Uma distribuição pode fornecer nomes adicionais, por exemplo, para indicar que vários projetos foram agrupados. Por exemplo, distribuições de código-fonte do projeto ``ZODB`` historicamente incluíram o projeto ``transaction``, que agora está disponível como uma distribuição separada. Instalar tal distribuição de código-fonte satisfaz os requisitos para ``ZODB`` e ``transaction``.
ru: Дистрибутив может содержать дополнительные имена, например, чтобы указать, что несколько проектов были объединены вместе. Например, исходные дистрибутивы проекта ``ZODB`` исторически включали проект ``transaction``, который теперь доступен как отдельный дистрибутив. Установка такого исходного дистрибутива удовлетворяет требованиям как для ``ZODB``, так и для ``transaction``.
ta: ஒரு வழங்கல் கூடுதல் பெயர்களை வழங்கக்கூடும், எ.கா. பல திட்டங்கள் ஒன்றாக தொகுக்கப்பட்டுள்ளன என்பதைக் குறிக்க. உதாரணமாக, `` சோட்பி`` திட்டத்தின் மூல விநியோகங்கள் வரலாற்று ரீதியாக `` பரிவர்த்தனை`` திட்டத்தை உள்ளடக்கியுள்ளன, இது இப்போது ஒரு தனி விநியோகமாக கிடைக்கிறது. அத்தகைய மூல விநியோகத்தை நிறுவுவது `` சோட் பி`` மற்றும் `` பரிவர்த்தனை` ஆகிய இரண்டிற்கும் தேவைகளை நிறைவு செய்கிறது.

source: A distribution may also provide a "virtual" project name, which does not correspond to any separately-distributed project: such a name might be used to indicate an abstract capability which could be supplied by one of multiple projects. E.g., multiple projects might supply RDBMS bindings for use by a given ORM: each project might declare that it provides ``ORM-bindings``, allowing other projects to depend only on having at most one of them installed.
ja: 配布物は、また、個別に配布されているどんなプロジェクトにも紐付かない "仮想の" プロジェクト名を持っていても構いません: そのような名前は、複数のプロジェクトのうちのひとつで供給される抽象的な能力を示すために使われるかもしれません。例えば、複数のプロジェクトがとある ORM で使われる RDBMS バインディングを提供していても構いません: それぞれのプロジェクトが、他のプロジェクトが依存する時にはそのうちの高々１個だけがインストールされていれば十分な ``ORM-bindings`` を提供すると宣言していても構わないのです。
pt_br: Uma distribuição também pode fornecer um nome de projeto "virtual", que não corresponde a nenhum projeto distribuído separadamente: tal nome pode ser usado para indicar uma capacidade abstrata que pode ser fornecida por um de vários projetos. Por exemplo, vários projetos podem fornecer ligações *(bindings)* de RDBMS para uso por um determinado ORM: cada projeto pode declarar que fornece ``ORM-bindings``, permitindo que outros projetos dependam apenas de ter no máximo um deles instalado.
ru: Дистрибутив может также предоставлять "виртуальное" имя проекта, которое не соответствует ни одному отдельно распространяемому проекту: такое имя может использоваться для обозначения абстрактной возможности, которая может быть предоставлена одним из нескольких проектов. Например, несколько проектов могут поставлять привязки к РСУБД для использования данной ORM: каждый проект может объявить, что он предоставляет ``ORM-bindings'', позволяя другим проектам зависеть только от наличия хотя бы одной из этих привязок.
ta: ஒரு வழங்கல் ஒரு "மெய்நிகர்" திட்ட பெயரையும் வழங்கக்கூடும், இது தனித்தனியாக விநியோகிக்கப்பட்ட எந்தவொரு திட்டத்திற்கும் பொருந்தாது: பல திட்டங்களில் ஒன்றால் வழங்கக்கூடிய ஒரு சுருக்க திறனைக் குறிக்க அத்தகைய பெயர் பயன்படுத்தப்படலாம். எ.கா., பல திட்டங்கள் கொடுக்கப்பட்ட ORM ஆல் பயன்படுத்த RDBMS பிணைப்புகளை வழங்கக்கூடும்: ஒவ்வொரு திட்டமும் இது `` ORM-பிணைப்புகளை` வழங்குகிறது என்று அறிவிக்கலாம், மற்ற திட்டங்கள் அவற்றில் பெரும்பாலானவற்றில் நிறுவப்பட்டிருப்பதை மட்டுமே சார்ந்து இருக்க அனுமதிக்கிறது.

source: A version declaration may be supplied and must follow the rules described in :doc:`version-specifiers`. The distribution's version number will be implied if none is specified.
eo: Oni povas provizi versio-deklaron, kiu devas observi la regulojn en :doc:`version-specifiers`. Se nenio estas provizita, tio implicas la versian numeron de la distribuo.
ja: バージョンの宣言があっても構いませんが、 :doc:`バージョン指定子 <version-specifiers>` に記述された規則に従ったものでなければなりません。もし指定されていなければ、配布物のバージョン番号が暗黙理に使われます。
pt_br: Uma declaração de versão pode ser fornecida e deve seguir as regras descritas em :doc:`version-specifiers`. O número da versão da distribuição estará implícito se nenhum for especificado.
ru: Может быть указано объявление версии, которое должно соответствовать правилам, описанным в :doc:`version-specifiers`. Номер версии дистрибутива будет подразумеваться, если он не указан.
ta: ஒரு பதிப்பு அறிவிப்பு வழங்கப்படலாம் மற்றும் விவரிக்கப்பட்டுள்ள விதிகளைப் பின்பற்ற வேண்டும்: DOC: `பதிப்பு-விவரக்குறிப்புகள்`. எதுவும் குறிப்பிடப்படாவிட்டால் விநியோகத்தின் பதிப்பு எண் குறிக்கப்படும்.

source: Obsoletes-Dist (multiple use)
eo: Obsoletes-Dist (plurfoje uzebla)
ja: Obsoletes-Dist (複数回の使用可)
pt_br: Obsoletes-Dist (vários usos)
ru: Obsoletes-Dist (можно использовать несколько раз)
ta: வழக்கற்றுப் போகும் (பல பயன்பாடு)

source: Each entry contains a string describing a distutils project's distribution which this distribution renders obsolete, meaning that the two projects should not be installed at the same time.
eo: Ĉiu ero enhavas signiĉenon priskribantan distribuon de distutils-projekto, kiun ĉi tiu distribuo evitindigas – alivorte, oni ne instalu ambaŭ projektojn samtempe.
ja: それぞれのエントリは、この配布物が出たことで旧式化した、従ってこれらふたつのプロジェクトが同時にインストールされるべきではない distutils プロジェクトの配布物を記述する文字列を含みます。
pt_br: Cada entrada contém uma string que descreve a distribuição de um projeto distutils que esta distribuição torna obsoleta, o que significa que os dois projetos não devem ser instalados ao mesmo tempo.
ru: Каждая запись содержит строку, описывающую дистрибутив проекта distutils, который этот дистрибутив делает устаревшим, что означает, что эти два проекта не должны быть установлены одновременно.
ta: ஒவ்வொரு நுழைவுக்கும் ஒரு டிச்டிடில்ச் திட்டத்தின் விநியோகத்தை விவரிக்கும் ஒரு சரம் உள்ளது, இது இந்த வழங்கல் வழக்கற்றுப் போகிறது, அதாவது இரண்டு திட்டங்களும் ஒரே நேரத்தில் நிறுவப்படக்கூடாது.

source: Version declarations can be supplied. Version numbers must be in the format specified in :doc:`version-specifiers`.
eo: Versio-deklaroj povas esti provizitaj. Versia numero devas observi la formon en :doc:`version-specifiers`.
ja: バージョンの宣言があっても構いません。バージョン番号は :doc:`バージョン指定子 <version-specifiers>` で指定されたフォーマットでなければなりません。
pt_br: Declarações de versão podem ser fornecidas. Os números de versão devem estar no formato especificado em :doc:`version-specifiers`.
ru: Декларации версий могут быть предоставлены. Номера версий должны быть в формате, указанном в :doc:`version-specifiers`.
ta: பதிப்பு அறிவிப்புகள் வழங்கப்படலாம். பதிப்பு எண்கள் குறிப்பிடப்பட்ட வடிவத்தில் இருக்க வேண்டும்: DOC: `பதிப்பு-விவரிப்பாளர்கள்`.

source: The most common use of this field will be in case a project name changes, e.g. Gorgon 2.3 gets subsumed into Torqued Python 1.0. When you install Torqued Python, the Gorgon distribution should be removed.
eo: La plej ofta uzo de tiu kampo estas por ŝanĝo de nomo de projekto. Ekzemple, Gorgon 2.3 fariĝis Torqued Python 1.0. Kiam oni instalas Torqued Python, do oni malinstalu la distribuon de Gorgon.
ja: このフィールドの最もよくある使い方は、例えば Gorgon 2.3 が Torqued Python 1.0 の一部として組み込まれた時のように、プロジェクトの名前が変更された場合でしょう。 Torqued Python をインストールするなら、 Gorgon 配布物は削除されるべきです。
pt_br: O uso mais comum deste campo será no caso de alteração do nome de um projeto, por exemplo, Gorgon 2.3 é incluído no Torqued Python 1.0. Quando você instala o Torqued Python, a distribuição Gorgon deve ser removida.
ru: Чаще всего это поле используется в случае изменения названия проекта, например, когда Gorgon 2.3 переходит в Torqued Python 1.0. При установке Torqued Python дистрибутив Gorgon должен быть удален.
ta: திட்டத்தின் பெயர் மாற்றங்கள் இருந்தால் இந்த துறையின் மிகவும் பொதுவான பயன்பாடு, எ.கா. கோர்கன் 2.3 முறுக்கு பைதான் 1.0 க்குள் நுழைகிறது. நீங்கள் முறுக்கு பைதானை நிறுவும்போது, கோர்கன் விநியோகத்தை அகற்ற வேண்டும்.

source: Deprecated Fields
eo: Evitindaj Kampoj
ja: 非推奨となったフィールド
pt_br: Campos descontinuados
ru: Утраченные поля
ta: நீக்கப்பட்ட புலங்கள்
