Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The saving grace is that the target path does not *have* to actually match the URL being fetched from the Simple API, and it can just be a sigil that the fetching code knows how to transform into the actual URL that needs to be fetched. This same thing can hold true for other aspects of the actual HTTP request, such as the ``Accept`` header.
eo: Dankinde, la cela dosierloko *ne devas* kongrui kun la retadreso de la Simpla API; ĝi povas esti simple ĵetono, kiun la elŝuta kodo povas transformi al la fakta elŝutota retadreso. La samo veras por aliaj aspektoj de la fakta HTTP-peto kiel la ĉapo ``Accept``.
ja: 欠点を補う取り柄は、シンプル API から持ってきた URL にターゲットパスが実際に *合致していなければならないということはない* ことで、取得する必要のある URL の実際の形への変換の方法を取得したコードが知っていることが魔法の印形になり得ます。これと同じことが、 ``Accept`` ヘッダのような実際の HTTP リクエスト他の側面についても当てはまります。
ta: சேமிக்கும் கருணை என்னவென்றால், எளிய ஏபிஐயிலிருந்து பெறப்பட்ட முகவரி உடன் பொருந்துவதற்கு இலக்கு பாதையில் * இல்லை * இல்லை, மேலும் இது ஒரு சிகிலாக இருக்கக்கூடும், பெறும் குறியீடு பெறப்பட வேண்டிய உண்மையான முகவரி ஆக மாற்றுவது எப்படி என்று தெரியும். `` ஏற்றுக்கொள்` தலைப்பு போன்ற உண்மையான HTTP கோரிக்கையின் பிற அம்சங்களுக்கும் இதே சேதி உண்மையாக இருக்க முடியும்.

source: Ultimately figuring out how to map a directory to a filename is out of scope for this spec (but it would be in scope for :pep:`458`), and this spec defers making a decision about how exactly to represent this inside of :pep:`458` metadata.
ja: 結局、あるディレクトリをファイル名に対応させる方法を解明することはこの仕様のスコープの外にあります (しかし :pep:`458` のスコープの中にはあるでしょう) が、この仕様では、 :pep:`458` のメタデータの中にこれをどれほど正確に表現するのかについての決断を行うことを遅延させているのです。
ta: இறுதியில் ஒரு கோப்பகத்திற்கு ஒரு கோப்பகத்தை எவ்வாறு வரைபடமாக்குவது என்பதைக் கண்டுபிடிப்பது இந்த விவரக்குறிப்பிற்கான வாய்ப்புக்கு அப்பாற்பட்டது (ஆனால் இது: PEP: `458`), மேலும் இந்த விவரக்குறிப்பு இதை எவ்வாறு பிரதிநிதித்துவப்படுத்துவது என்பது பற்றி ஒரு முடிவை எடுக்கிறது: PEP:` 458` மேனிலை தரவு.

source: However, it appears that the current WIP branch against pip that attempts to implement :pep:`458` is using a target path like ``simple/PROJECT/index.html``. This could be modified to include the API version and serialization format using something like ``simple/PROJECT/vnd.pypi.simple.vN.FORMAT``. So the v1 HTML format would be ``simple/PROJECT/vnd.pypi.simple.v1.html`` and the v1 JSON format would be ``simple/PROJECT/vnd.pypi.simple.v1.json``.
eo: Tamen, ŝajnas ke la nuna evoluanta branĉo de pip, kiu provas realigi :pep:`458`, uzas celan dosierlokon kiel `simple/PROJEKTO/index.html``. Oni povus modifi tion inkluzivante la version de la API kaj la seriigon, kiel ``simple/PROJEKTO/vnd.pypi.simple.vN.FORMO``. Do la versio 1 de la HTML-formo estus ``simple/PROJEKTO/vnd.pypi.simple.v1.html``, dum la versio 1 de la JSON-formo estus ``simple/PROJEKTO/vnd.pypi.simple.v1.json``.
ja: しかしながら、 :pep:`458` を実装しようと試みる pip に対する現在の WIP ブランチは、 ``simple/PROJECT/index.html`` のようなターゲットパスを使っているようです。これは、何か ``simple/PROJECT/vnd.pypi.simple.vN.Format`` のようなものを使うことで、 API のバージョンやシリアル化フォーマットを包含するように修正できるかもしれません。それで、 v1 の HTML フォーマットは ``simple/PROJECT/vnd.pypi.v1.html`` のように、 v1 の JSON フォーマットは ``simple/PROJECT/vnd.pypi.simple.v1.json`` のようになることでしょう。
ta: இருப்பினும், PIP க்கு எதிரான தற்போதைய WIP கிளை செயல்படுத்த முயற்சிக்கிறது: PEP: `458`` `எளிய/திட்டம்/INDEX.HTML`` போன்ற இலக்கு பாதையைப் பயன்படுத்துகிறது. `` எளிய/திட்டம்/vnd.pypi.simple.vn.format`` போன்ற ஒன்றைப் பயன்படுத்தி பநிஇ பதிப்பு மற்றும் சீரியலைசேசன் வடிவமைப்பைச் சேர்க்க இதை மாற்றியமைக்கலாம். எனவே V1 உஉகுமொ வடிவம் `` எளிய/திட்டம்/vnd.pypi.simple.v1.html`` மற்றும் V1 சாதொபொகு வடிவம் `` எளிய/திட்டம்/vnd.pypi.simple.v1.json`` ஆக இருக்கும்.

source: In this case, since ``text/html`` is an alias to ``application/vnd.pypi.simple.v1+html`` when interacting through TUF, it likely will make the most sense to normalize to the more explicit name.
eo: Tiukaze, ĉar ``text/html`` estas sinonimo de ``application/vnd.pypi.simple.v1+html`` dum interagado per TUF, estas pli bone normigi al la pli eksplicita nomo.
ja: このケースでは、 ``text/html`` が ``application/vnd.pypi.simple.v1+html`` へのエイリアスであることから、 TUF を通じて相互作用する時にはもっと明示的な名称に正規化する方が最大の意味をなすことになるでしょう。
ta: இந்த விசயத்தில், `` உரை/html`` என்பது `` பயன்பாடு/vnd.pypi.simple.v1+html`` க்கு ஒரு மாற்றுப்பெயராக இருப்பதால், இது மிகவும் வெளிப்படையான பெயரை இயல்பாக்குவது மிகவும் அர்த்தமுள்ளதாக இருக்கும்.

source: Likewise the ``latest`` metaversion should not be included in the targets, only explicitly declared versions should be supported.
eo: Simile la metaversio ``latest`` ne inkluziviĝu en la celoj; nur eksplicite deklarita versio estu subtenata.
ja: ``latest`` メタバージョンがターゲットの中に含まれているべきではないのと同様に、明示的に宣言されたバージョンだけがサポートされるべきです。
ta: அதேபோல் `` சமீபத்திய`` மெட்டாசன் இலக்குகளில் சேர்க்கப்படக்கூடாது, வெளிப்படையாக அறிவிக்கப்பட்ட பதிப்புகள் மட்டுமே ஆதரிக்கப்பட வேண்டும்.

source: This section is non-normative, and represents what the spec authors believe to be the best default implementation decisions for something implementing this spec, but it does **not** represent any sort of requirement to match these decisions.
eo: Jen nedeviga paragrafo pri la plej bonaj aprioraj decidoj por realigi ĉi tiun normon laŭ la opinioj de la aŭtoroj. Ĝi **ne** devige postulas tiajn decidojn.
ja: この節は 規範的ではなく、この仕様を実装する上での最善のデフォルト実装の決定だと仕様の執筆者たちが信じるものを表現していますが、しかし、これらの決定に合致させるための要求事項としてはいかなるものも **表現していません** 。
ru: Этот раздел не является нормативным и представляет собой то, что, по мнению авторов спецификации, является наилучшими решениями по умолчанию для реализации этой спецификации, но он **не** представляет собой никаких требований по соответствию этим решениям.
ta: இந்த பிரிவு நெறிமுறையற்றது, மேலும் இந்த விவரக்குறிப்பை செயல்படுத்துவதற்கான சிறந்த இயல்புநிலை செயல்படுத்தல் முடிவுகள் என்று ச்பெக் ஆசிரியர்கள் நம்புவதைக் குறிக்கிறது, ஆனால் இந்த முடிவுகளுடன் பொருந்தக்கூடிய எந்தவொரு தேவையையும் இது குறிக்கிறது.

source: These decisions have been chosen to maximize the number of requests that can be moved onto the newest version of an API, while maintaining the greatest amount of compatibility. In addition, they've also tried to make using the API provide guardrails that attempt to push clients into making the best choices it can.
ja: これらの決断は、 API の最新のバージョンの上に移行できるような、その一方でなるべく大量の互換性も維持するような要求事項を数の上でなるべく最大化するように選択されています。加えて、クライアント側が最善の選択を行うようにと試みるガードレールを API が提供するように試みてきました。
ru: Эти решения были выбраны для того, чтобы максимизировать количество запросов, которые можно перенести на новейшую версию API, сохранив при этом максимальную совместимость. Кроме того, они постарались сделать так, чтобы использование API обеспечивало защитные ограждения, которые пытаются подтолкнуть клиента к наилучшему выбору.
ta: இந்த முடிவுகள் ஒரு ஏபிஐயின் புதிய பதிப்பிற்கு நகர்த்தக்கூடிய கோரிக்கைகளின் எண்ணிக்கையை அதிகரிக்க தேர்வு செய்யப்பட்டுள்ளன, அதே நேரத்தில் மிகப் பெரிய அளவிலான பொருந்தக்கூடிய தன்மையைப் பராமரிக்கின்றன. கூடுதலாக, அவர்கள் பநிஇ வழங்கும் காவலாளிகளைப் பயன்படுத்தி செய்ய முயற்சித்தனர், இது வாடிக்கையாளர்களை தன்னால் முடிந்த சிறந்த தேர்வுகளைச் செய்ய முயற்சிக்கிறது.

source: It is recommended that servers:
eo: Ni rekomendas, ke serviloj faru la jenon:
ja: サーバには次のことが推奨されます:
ru: Рекомендуется использовать серверы:
ta: சேவையகங்கள் பரிந்துரைக்கப்படுகிறது:

source: Support all 3 content types described in this spec, using server-driven content negotiation, for as long as they reasonably can, or at least as long as they're receiving non trivial traffic that uses the HTML responses.
eo: Subtenu ĉiujn tri enhavtipojn priskribitajn en ĉi tiu normo, uzante servilan marĉandadon, por tiel longe kiel oni racie povas, aŭ minimume tiel longe kiel oni ricevas iom da trafiko uzanta la HTML-respondojn.
ja: サーバ主導のコンテントネゴシエーションを使って、合理的に可能である限り、もしくは、少なくとも HTML 応答を用いる非自明のトラフィックを受け取る限り、この仕様の中で記述される３個のコンテント型の全てをサポートすること。
ru: Поддерживать все 3 типа контента, описанные в данной спецификации, используя согласование контента с сервером, до тех пор, пока это возможно, или, по крайней мере, пока они получают нетривиальный трафик, использующий ответы HTML.
ta: இந்த விவரக்குறிப்பில் விவரிக்கப்பட்டுள்ள அனைத்து 3 உள்ளடக்க வகைகளையும் ஆதரிக்கவும், சேவையகத்தால் இயக்கப்படும் உள்ளடக்க பேச்சுவார்த்தையைப் பயன்படுத்தி, அவை நியாயமான முறையில் முடிந்தவரை, அல்லது குறைந்தபட்சம் உஉகுமொ பதில்களைப் பயன்படுத்தும் கீழான போக்குவரத்தை அவர்கள் பெறும் வரை.

source: When encountering an ``Accept`` header that does not contain any content types that it knows how to work with, the server should not ever return a ``300 Multiple Choice`` response, and instead return a ``406 Not Acceptable`` response.
eo: Se servilo ricevas ĉapon ``Accept`` kiu ne enhavas ajnan konatan dosiertipon, ĝi ne liveru respondon ``300 Multiple Choice``; anstataŭe ĝi liveru respondon ``406 Not Acceptable``.
ja: サーバは、どのように協働すれば良いかを知っているコンテント型をひとつも含まないような ``Accept`` ヘッダに遭遇した時、 ``300 Multiple Choice`` 応答を返すべきではなく、その代わりに ``406 Not Acceptable`` 応答を返すべきです。
ru: При встрече с заголовком ``Принять``, который не содержит типов содержимого, с которыми сервер умеет работать, сервер не должен возвращать ответ ``300 Множественный выбор``, а вместо этого возвращает ответ ``406 Неприемлемо``.
ta: ஒரு `` ஏற்றுக்கொள்` `தலைப்பை எதிர்கொள்ளும்போது, அது எவ்வாறு செயல்பட வேண்டும் என்று தெரிந்த எந்த உள்ளடக்க வகைகளும் இல்லை, சேவையகம் ஒருபோதும்` `300 பல தேர்வு`` பதிலைத் தரக்கூடாது, அதற்கு பதிலாக` `406 ஏற்றுக்கொள்ள முடியாதது`` பதிலைத் தரும்.

source: However, if choosing to use the endpoint configuration, you should prefer to return a ``200 OK`` response in the expected content type for that endpoint.
eo: Tamen, se oni elektas uzi la finpunktan agordon, oni prefere liveru respondon ``200 OK`` en la atendata enhavtipo de tiu finpunkto.
ja: しかしながら、このエンドポイント設定を使うことを選択したなら、 できることならそのエンドポイントが期待しているコンテント型で ``200 Ok`` を返したいと考えるべきです。
ru: Однако, если вы решили использовать конфигурацию конечной точки, вы должны предпочесть возвращать ответ ``200 OK`` в ожидаемом типе содержимого для данной конечной точки.
ta: இருப்பினும், எண்ட்பாயிண்ட் உள்ளமைவைப் பயன்படுத்தத் தேர்வுசெய்தால், அந்த இறுதிப்புள்ளிக்கு எதிர்பார்க்கப்படும் உள்ளடக்க வகையில் `` 200 சரி`` பதிலைத் தர வேண்டும்.

source: When selecting an acceptable version, the server should choose the highest version that the client supports, with the most expressive/featureful serialization format, taking into account the specificity of the client requests as well as any quality priority values they have expressed, and it should only use the ``text/html`` content type as a last resort.
ja: 受け入れ可能なバージョンを選択する時、サーバは、クライアントがサポートする中で、最も表現力が豊かで機能的なシリアル化フォーマットを伴っていて、クライアント側が表現したクオリティ優先度 <quality priority> と同じくクライアントからのリクエストの特質を考慮に入れて、最も高いバージョンを選択するべきであり、 ``text/html`` コンテント型の使用は最後の逃避先とするべきです。
ru: При выборе приемлемой версии сервер должен выбрать самую высокую версию, которую поддерживает клиент, с наиболее выразительным/функциональным форматом сериализации, принимая во внимание специфику запросов клиента, а также любые значения приоритета качества, которые он выразил, и должен использовать тип содержимого ``текст/html`` только в качестве последнего средства.
ta: ஏற்றுக்கொள்ளக்கூடிய பதிப்பைத் தேர்ந்தெடுக்கும்போது, கிளையன்ட் ஆதரிக்கும் மிக உயர்ந்த பதிப்பை சேவையகம் தேர்வு செய்ய வேண்டும், மிகவும் வெளிப்படையான/அம்சம் கொண்ட சீரியலைசேசன் வடிவத்துடன், கிளையன்ட் கோரிக்கைகளின் தனித்துவத்தையும், அவர்கள் வெளிப்படுத்திய எந்தவொரு தரமான முன்னுரிமை மதிப்புகளையும் கணக்கில் எடுத்துக்கொள்கிறது, மேலும் இது `` உரை/HTML`` உள்ளடக்க வகையை கடைசி முயற்சியாக மட்டுமே பயன்படுத்த வேண்டும்.

source: It is recommended that clients:
eo: Ni rekomendas, ke klientoj faru la jenon:
ja: クライアント側には次のことが推奨されます:
ru: Рекомендуется, чтобы клиенты:
ta: வாடிக்கையாளர்கள் என்று பரிந்துரைக்கப்படுகிறது:

source: Support all 3 content types described in this spec, using server-driven content negotiation, for as long as they reasonably can.
eo: Subtenu ĉiujn 3 enhavtipojn priskribitajn en ĉi tiu specifo, per servila enhavo-marĉandado, tiel longe kiel racie eblas.
ja: それが合理的に実行可能である限り、サーバ側が駆動するコンテンツネゴシエーションを使ってこの仕様に記述された３個のコンテント型の全てをサポートすること。
ru: Поддерживать все 3 типа контента, описанные в данной спецификации, используя согласование контента с сервером, до тех пор, пока это возможно.
ta: இந்த விவரக்குறிப்பில் விவரிக்கப்பட்டுள்ள அனைத்து 3 உள்ளடக்க வகைகளையும் ஆதரிக்கவும், சேவையகத்தால் இயக்கப்படும் உள்ளடக்க பேச்சுவார்த்தையைப் பயன்படுத்தி, அவை நியாயமான முறையில் முடிந்தவரை.

source: When constructing an ``Accept`` header, include all of the content types that you support.
eo: Dum konstruado de ĉapo ``Accept``, inkluzivu ĉiujn enhavtipojn subtenatajn.
ja: ``Accept`` ヘッダを構築する時、サポートしているコンテント型の全てを含めること。
ru: При составлении заголовка ``Принять`` включите в него все типы содержимого, которые вы поддерживаете.
ta: `` ஏற்றுக்கொள்` `தலைப்பைக் கட்டும் போது, நீங்கள் ஆதரிக்கும் அனைத்து உள்ளடக்க வகைகளையும் சேர்க்கவும்.

source: You should generally *not* include a quality priority value for your content types, unless you have implementation specific reasons that you want the server to take into account (for example, if you're using the standard library HTML parser and you're worried that there may be some kinds of HTML responses that you're unable to parse in some edge cases).
ja: サーバ側で考慮に入れてもらいたい特定の理由 (例えば、標準ライブラリの HTML パーサを使っていて、何らかのエッジケースにおいてパースできない何らかの種類の HTML 応答があるかもしれないと心配している場合) のある実装でない限り、一般的にコンテント型にはクオリティ優先度 <quality priority> を含めるべきではありません。
ru: Обычно не следует *не* включать значение приоритета качества для типов содержимого, если только у вас нет конкретных причин, которые вы хотите, чтобы сервер принял во внимание (например, если вы используете HTML-парсер стандартной библиотеки и беспокоитесь о том, что некоторые типы HTML-ответов могут быть не в состоянии разобрать в некоторых крайних случаях).
ta: உங்கள் உள்ளடக்க வகைகளுக்கான தரமான முன்னுரிமை மதிப்பை நீங்கள் பொதுவாக * இல்லை * சேர்க்க வேண்டும், சேவையகம் கணக்கில் எடுத்துக்கொள்ள விரும்பும் குறிப்பிட்ட காரணங்கள் உங்களிடம் இல்லையென்றால் (எடுத்துக்காட்டாக, நீங்கள் நிலையான நூலக உஉகுமொ பாகுபடுத்தலைப் பயன்படுத்துகிறீர்கள் என்றால், சில விளிம்பு நிகழ்வுகளில் நீங்கள் பாகுபடுத்த முடியாத சில வகையான உஉகுமொ பதில்கள் இருக்கக்கூடும் என்று நீங்கள் கவலைப்படுகிறீர்கள்).

source: The one exception to this recommendation is that it is recommended that you *should* include a ``;q=0.01`` value on the legacy ``text/html`` content type, unless it is the only content type that you are requesting.
eo: La unu escepto al tiu rekomendo estas, ke estas rekomendate *inkluzivi* valoron ``;q=0.01`` sur la malnova enhavtipo ``text/html``, krom se tiu estas la sola enhavtipo, kiun vi petas.
ja: この推奨事項に対する例外のひとつは、それがリクエストしている唯一のコンテント型であるという場合を除けば、伝統的な ``text/html`` コンテント型には ``;q=0.01`` を含めることが推奨されるということです。
ru: Единственным исключением из этой рекомендации является то, что рекомендуется *включать значение ``;q=0.01`` для унаследованного типа содержимого ``текст/html``, если только это не единственный тип содержимого, который вы запрашиваете.
ta: இந்த பரிந்துரைக்கு ஒரு விதிவிலக்கு என்னவென்றால், நீங்கள் * `உரை/HTML`` உள்ளடக்க வகைக்கு ஒரு` `; q = 0.01`` மதிப்பை நீங்கள் * சேர்க்க வேண்டும் என்று பரிந்துரைக்கப்படுகிறது, இது நீங்கள் கோரும் ஒரே உள்ளடக்க வகையாக இல்லாவிட்டால்.

source: Explicitly select what versions they are looking for, rather than using the ``latest`` meta version during normal operation.
eo: Eksplicite elektu la version serĉatan, anstataŭ uzi la metadatenan version ``latest``, dum ordinara funkciado.
ja: 通常操作では ``latest`` メタバージョンを使うのではなくて、希求しているバージョンがどれであるかを明示的に選択すること。
ru: Явно выбирайте версии, которые они ищут, вместо того чтобы использовать ``последнюю`` мета-версию во время обычной работы.
ta: இயல்பான செயல்பாட்டின் போது `` சமீபத்திய`` மேவு பதிப்பைப் பயன்படுத்துவதை விட, அவர்கள் தேடும் எந்த பதிப்புகளை வெளிப்படையாகத் தேர்ந்தெடுக்கவும்.

source: Check the ``Content-Type`` of the response and ensure it matches something that you were expecting.
eo: Kontrolu la ``Content-Type`` de la respondo, kaj certigu, ke ĝi kongruas kun io atendata de vi.
ja: 応答の ``Content-Type`` を調べて、こちらが期待しているものに合致していることを確認すること。
ru: Проверьте ``Контент-Тип`` в ответе и убедитесь, что он соответствует тому, что вы ожидали.
ta: பதிலின் `` உள்ளடக்க-வகை`` ஐச் சரிபார்த்து, நீங்கள் எதிர்பார்த்த ஒன்றோடு பொருந்துகிறது என்பதை உறுதிப்படுத்தவும்.

source: September 2015: initial form of the HTML format, in :pep:`503`
eo: Septembro 2015: unua versio de la HTML-formo, en :pep:`503`
ja: 2015年9月: :pep:`503` で HTML フォーマットの初期フォーム
ru: Сентябрь 2015 года: начальная форма формата HTML, в :pep:`503`
ta: செப்டம்பர் 2015: உஉகுமொ வடிவமைப்பின் ஆரம்ப வடிவம், இல்: PEP: `503`

source: July 2016: Requires-Python metadata, in an update to :pep:`503`
eo: Julio 2016: Metadateno Requires-Python, en ĝisdatigo al :pep:`503`
ja: 2016年7月: :pep:`503` で Requires-Python メタデータ
ru: Июль 2016 г: Метаданные Требуется-Python, в обновлении :pep:`503`
ta: சூலை 2016: ஒரு புதுப்பிப்பில்-பைதான் மேனிலை தரவு தேவைப்படுகிறது: PEP: `503`

source: May 2019: "yank" support, in :pep:`592`
eo: Majo 2019: Subteno de «fortiro», en :pep:`592`
ja: 2019年5月: :pep:`592` で "ヤンク <yank>" サポート
ru: Май 2019: поддержка "янки", в :pep:`592`
ta: மே 2019: "யாங்க்" உதவி, இல்: பெப்: `592`

source: July 2020: API versioning convention and metadata, and declaring the HTML format as API v1, in :pep:`629`
eo: Julio 2020: Versia konvencio de API kaj metadatenoj, kaj deklaro de la HTML-formo kiel versio 1 de la API, en :pep:`629`
ja: 2020年7月: :pep:`629` で、 API バージョン付け慣行とメタデータ、 HTML フォーマットを API v1.として宣言
ru: Июль 2020 года: Соглашение о версиях API и метаданные, а также объявление формата HTML как API v1, в :pep:`629`
ta: சூலை 2020: பநிஇ பதிப்பு மாநாடு மற்றும் மேனிலை தரவு, மற்றும் உஉகுமொ வடிவமைப்பை பநிஇ V1 என அறிவித்தல், IN: PEP: `629`

source: May 2021: providing package metadata independently from a package, in :pep:`658`
eo: Majo 2021: provizi pakajn metadatenojn sendepende de pako, laŭ :pep:`658`
ja: 2021年5月: :pep:`658` で、パッケージとは独立にパッケージのメタデータを提供
ru: Май 2021: предоставление метаданных пакета независимо от пакета, в :pep:`658`
ta: மே 2021: ஒரு தொகுப்பிலிருந்து சுயாதீனமாக தொகுப்பு மெட்டாடேட்டாவை வழங்குதல், IN: PEP: `658`

source: May 2022: initial form of the JSON format, with a mechanism for clients to choose between them, and declaring both formats as API v1, in :pep:`691`
eo: Majo 2022: komenca versio de la JSON-formo, kun meĥanismo por kliento elekti inter ili, kaj deklaro de ambaŭ formoj kiel versio 1 de la API, en :pep:`691`
ja: 2022年5月: :pep:`691` により、クライアント側が選択する機構とともに JSON フォーマットの初期の形、両フォーマットを API v1 として宣言
ru: Май 2022: начальная форма формата JSON, с механизмом выбора между ними для клиентов, и объявление обоих форматов как API v1, в :pep:`691`
ta: மே 2022: சாதொபொகு வடிவமைப்பின் ஆரம்ப வடிவம், வாடிக்கையாளர்களுக்கு இடையே தேர்வு செய்வதற்கான ஒரு பொறிமுறையுடன், இரு வடிவங்களையும் பநிஇ V1 என அறிவித்தல், IN: PEP: `691`

source: October 2022: project versions and file size and upload-time in the JSON format, in :pep:`700`
eo: Oktobro 2022: projekta versio kaj dosiera grando kaj alŝuta tempo en la formo JSON laŭ :pep:`700`
ja: 2022年10月: :pep:`700` により、 JSON フォーマットにおけるプロジェクトバージョン・ファイルサイズ・アップロード日時
ru: Октябрь 2022: версии проектов, размер файлов и время загрузки в формате JSON, в :pep:`700`
ta: அக்டோபர் 2022: திட்ட பதிப்புகள் மற்றும் கோப்பு அளவு மற்றும் சாதொபொகு வடிவத்தில் பதிவேற்ற நேரம், IN: PEP: `700`

source: June 2023: renaming the field which provides package metadata independently from a package, in :pep:`714`
eo: Junio 2023: ŝanĝi la nomon de la kampo provizantan pakajn metadatenojn sendepende de pako laŭ :pep:`714`
ja: 2023年6月: :pep:`714` により、パッケージから独立したパッケージメタデータを提供するフィールドを名称変更
ru: Июнь 2023: переименование поля, предоставляющего метаданные пакета независимо от пакета, в :pep:`714`
ta: சூன் 2023: ஒரு தொகுப்பிலிருந்து சுயாதீனமாக தொகுப்பு மெட்டாடேட்டாவை வழங்கும் புலத்தை மறுபெயரிடுதல், IN: PEP: `714`

source: November 2024: provenance metadata in the HTML and JSON formats, in :pep:`740`
eo: Novembro 2024: originpruvaj metadatenoj en la formoj HTML kaj JSON, en :pep:`740`
ru: Ноябрь 2024: метаданные о проверке в форматах HTML и JSON, в :pep:`740`
ta: நவம்பர் 2024: உஉகுமொ மற்றும் சாதொபொகு வடிவங்களில் ஆதார மேனிலை தரவு, IN: PEP: `740`

source: Source distribution format
eo: Fonta distribua formo
ja: ソースコード配布物のフォーマット
pt_br: Formato de distribuição fonte
ru: Формат распространения в исходных кодах
ta: மூல விநியோக வடிவம்

source: There is also the legacy source distribution format, implicitly defined by the behaviour of ``distutils`` module in the standard library, when executing :command:`setup.py sdist`. This document does not attempt to standardise this format, except to note that if a legacy source distribution contains a ``PKG-INFO`` file using metadata version 2.2 or later, then it MUST follow the rules applicable to source distributions defined in the metadata specification.
ja: これとは別に従来のソースコード配布物のフォーマットが存在しており、それは標準ライブラリの ``distutils`` モジュールが :command:`setup.py sdist` の形で実行される時の動作によって暗黙裡に定義されています。この説明文書では、この従来のソースコード配布物がバージョン 2.2 およびそれ以降のバージョンのメタデータを使った ``PKG-INFO`` ファイルを含んでいる場合には、メタデータの仕様で定義されたルールが該当のソースコード配布物にも適用されなければならないことを注記する以外には、このフォーマットの標準化を試みることはしません。
pt_br: Existe também o formato de distribuição fonte legado, implicitamente definido pelo comportamento do módulo ``distutils`` na biblioteca padrão, ao executar :command:`setup.py sdist`. Este documento não tenta padronizar este formato, exceto para observar que se uma distribuição de fonte legada contém um arquivo ``PKG-INFO`` usando metadados versão 2.2 ou posterior, então ela DEVE seguir as regras aplicáveis às distribuições de fonte definidas nos metadados especificação.
ru: Существует также формат дистрибутива унаследованных исходных текстов, неявно определяемый поведением модуля ``distutils`` в стандартной библиотеке при выполнении :command:``setup.py sdist``. Этот документ не пытается стандартизировать этот формат, за исключением того, что если дистрибутив унаследованного исходного кода содержит файл ``PKG-INFO``, использующий метаданные версии 2.2 или более поздней, то он ДОЛЖЕН следовать правилам, применимым к дистрибутивам исходного кода, определенным в спецификации метаданных.
ta: மரபு மூல விநியோக வடிவமைப்பும் உள்ளது, இது நிலையான நூலகத்தில் `` தொலைதூரங்கள்` `தொகுதியின் நடத்தை மூலம் மறைமுகமாக வரையறுக்கப்படுகிறது, செயல்படுத்தும் போது: கட்டளை:` setup.py sdist`. மேனிலை தரவு பதிப்பு 2.2 அல்லது அதற்குப் பிறகு ஒரு மரபு மூல விநியோகத்தில் `` பி.கே.சி-இன்ஃபோ`` கோப்பைக் கொண்டிருந்தால், இந்த ஆவணம் இந்த வடிவமைப்பை தரப்படுத்த முயற்சிக்கவில்லை, பின்னர் அது மேனிலை தரவு விவரக்குறிப்பில் வரையறுக்கப்பட்ட மூல விநியோகங்களுக்கு பொருந்தக்கூடிய விதிகளைப் பின்பற்ற வேண்டும்.

source: Source distributions are also known as *sdists* for short.
eo: Fonta distribuo ankaŭ estas konata kiel *sdist* mallonge.
ja: ソースコード配布物は、短く *sdists* としても知られています。
pt_br: Distribuições fonte também são conhecidas pela abreviação *sdists*.
ru: Дистрибутивы с исходными текстами также известны как *sdists*.
ta: மூல விநியோகங்கள் சுருக்கமாக * sdists * என்றும் அழைக்கப்படுகின்றன.

source: Source trees
eo: Fontarboj
ja: ソースコードツリー
pt_br: Árvores fonte
ru: Деревья источников
ta: மூல மரங்கள்

source: Source distribution file name
eo: Dosiernomo de fonta distribuo
ja: ソースコード配布物のファイル名
pt_br: Nome de arquivo da distribuição fonte
ru: Имя файла исходного дистрибутива
ta: மூல விநியோக கோப்பு பெயர்
