Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Although it is technically possible to import packages/modules that do not have a valid Python identifier as their name, using :doc:`importlib <python:library/importlib>`, this is vanishingly rare and strongly discouraged.
eo: Kvantam teĥnike eblas importi pakon/modulon, kies nomo ne estas valida Python-identigilo, per :doc:`importlib <python:library/importlib>`, tio estas maloftega kaj malrekomendegata.
ja: 正当な Python 識別子をその名称として持たないパッケージ/モジュールをインストールすることは、 :doc:`importlib <python:library/importlib>` を使うことで技術的には可能ではありますが、絶無と言って良いほど稀であり、強く抑制されています。
pt_br: Embora seja tecnicamente possível importar pacotes/módulos que não têm um identificador válido Python como seu nome, usando :doc:`importlib <python:library/importlib>`, isso é extremamente raro e fortemente desencorajado.
ru: Хотя технически возможно импортировать пакеты/модули, не имеющие в качестве имени действительного идентификатора Python, используя :doc:`importlib <python:library/importlib>`, это происходит крайне редко и настоятельно не рекомендуется.
ta: செல்லுபடியாகும் பைதான் அடையாளங்காட்டி இல்லாத தொகுப்புகள்/தொகுதிகளை அவற்றின் பெயராக இறக்குமதி செய்வது தொழில்நுட்ப ரீதியாக சாத்தியமானது என்றாலும், பயன்படுத்துகிறது: டாக்: `இறக்குமதி <பைதான்: நூலகம்/இறக்குமதி லிப்>`, இது மறைந்துபோகும் அரிதானது மற்றும் கடுமையாக ஊக்கமளிக்கிறது.

source: **Discussions** are focused on providing comprehensive information about a specific topic. If you're just trying to get stuff done, see :doc:`/guides/index`.
eo: **Diskutoj** celas provizi plenajn informojn pri specifa temo. Se vi nur volas eklabori, legu :doc:`/guides/index`.
ja: **議論型文書**は、特定の話題について網羅的な情報を提供することに重点を置いています。もしあなたがとにかく何かを終わらせようとしているだけなら、:doc:`/guides/index`を見た方が良いでしょう。
pt_br: **Discussões** têm como objetivo fornecer informações abrangentes sobre um tópico específico. Se você está apenas tentando fazer as coisas, veja :doc:`/guides/index`.
ru: **Дискуссии** направлены на предоставление исчерпывающей информации по определенной теме. Если вы просто хотите сделать что-то, смотрите :doc:`/guides/index`.
ta: ** கலந்துரையாடல்கள் ** ஒரு குறிப்பிட்ட தலைப்பைப் பற்றிய விரிவான தகவல்களை வழங்குவதில் கவனம் செலுத்துகின்றன. நீங்கள் விசயங்களைச் செய்ய முயற்சிக்கிறீர்கள் என்றால், காண்க: DOC: `/வழிகாட்டிகள்/குறியீட்டு`.

source: install_requires vs requirements files
eo: install_requires kontraste kun requirements.txt
ja: install_requiresかrequirementsか
pt_br: install_requires vs arquivos requirements
ru: Файл :file:`install_requires` против файла :file:`requirements`
ta: Install_requires vs தேவைகள் கோப்புகள்

source: ``install_requires`` is a :ref:`setuptools` :file:`setup.py` keyword that should be used to specify what a project **minimally** needs to run correctly. When the project is installed by :ref:`pip`, this is the specification that is used to install its dependencies.
eo: ``install_requires`` estas ŝlosilvorto de :ref:`setuptools` en :file:`setup.py` kiu specifas la *minimumon* necesan por rulado de projekto. Kiam la projekto estas instalata de :ref:`pip`, ĝi estas la specifo uzatan por instali la dependaĵojn.
ja: ``install_requires``は:ref:`setuptools` :file:`setup.py`のキーワードで、そのプロジェクトが正しく動作するために必要な最小限のものを指定するものです。プロジェクトが:ref:`pip`でインストールされた場合には、プロジェクトが依存するパッケージをインストールするのに用いられます。
pt_br: ``install_requires`` é uma palavra-chave de :file:`setup.py` do :ref:`setuptools` que deve ser usada para especificar o que um projeto **minimamente** precisa para executar corretamente. Quando o projeto é instalado por :ref:`pip`, esta é a especificação que é usada para instalar suas dependências.
ru: ``install_requires`` - это ключевое слово :ref:`setuptools` :file:`setup.py`, которое должно использоваться для указания того, что проекту **минимально** необходимо для корректной работы. Когда проект устанавливается с помощью :ref:`pip`, это спецификация, которая используется для установки его зависимостей.
ta: `` install_requires`` என்பது ஒரு: ref: `setuptools`: கோப்பு:` setup.py` முக்கிய சொல் ஒரு திட்டம் ** குறைந்தபட்சமாக ** சரியாக இயங்க வேண்டும் என்பதைக் குறிப்பிட பயன்படுத்த வேண்டும். திட்டத்தை நிறுவும் போது: ref: `பிப்`, இது அதன் சார்புகளை நிறுவ பயன்படும் விவரக்குறிப்பு.

source: For example, if the project requires A and B, your ``install_requires`` would be like so:
eo: Ekzemple, se la projekto postulas A kaj B, via ``install_requires`` estos jena:
ja: 例えば、プロジェクトがAとBに依存しているなら、``install_requires``は次のようになるでしょう：
pt_br: Por exemplo, se o projeto requer A e B, seu ``install_requires`` seria assim:
ru: Например, если проект требует A и B, ваш ``install_requires`` будет выглядеть так:
ta: எடுத்துக்காட்டாக, திட்டத்திற்கு A மற்றும் B தேவைப்பட்டால், உங்கள் `` install_requires`` அவ்வாறு இருக்கும்:

source: Additionally, it's best practice to indicate any known lower or upper bounds.
eo: Cetere, bone estas specifi ajnan konatan malsupran aŭ supran limojn.
ja: さらに、下限や上限がわかっているなら、それを示しておくことがベストプラクティスです。
pt_br: Além disso, é uma prática recomendada indicar qualquer limite inferior ou superior conhecido.
ru: Кроме того, лучше всего указать все известные нижние и верхние границы.
ta: கூடுதலாக, அறியப்பட்ட குறைந்த அல்லது மேல் எல்லைகளைக் குறிப்பது சிறந்த நடைமுறையாகும்.

source: For example, it may be known, that your project requires at least v1 of 'A', and v2 of 'B', so it would be like so:
eo: Ekzemple, eble vi scias, ke via projekto postulas almenaŭ v1 de «A»k aj v2 de «B», jene:
ja: 例えば、あなたのプロジェクトが少なくともv1の'A'と少なくともv2の'B'を必要とするとわかっているなら、次のようになるでしょう：
pt_br: Por exemplo, pode-se saber que seu projeto requer pelo menos v1 de "A" e v2 de "B", então seria assim:
ru: Например, может быть известно, что ваш проект требует по крайней мере v1 'A' и v2 'B', так что это было бы так:
ta: எடுத்துக்காட்டாக, உங்கள் திட்டத்திற்கு குறைந்தது 'A' இன் V1 மற்றும் 'B' இன் V2 தேவைப்படுகிறது, எனவே இது அப்படியே இருக்கும்:

source: It may also be known that project 'A' introduced a change in its v2 that breaks the compatibility of your project with v2 of 'A' and later, so it makes sense to not allow v2:
eo: Oni eble ankaŭ scias, ke projekto «A» enkondukis ŝanĝon en sia versio 2 rompantan la kongruecon de onia projekton kun versio 2 aŭ posta de «A», kaj tial volas malpermesi version 2:
ja: また、プロジェクト 'A' が v2 になる時にある変更を行なったために、あなたのプロジェクトと 'A' の v2 以降のバージョンとの間の互換性が失われるであろうという場合には、 v2 を許容しないことが筋の通ったことになるでしょう。
pt_br: Também pode ser sabido que o projeto 'A' introduziu uma alteração em sua v2 que quebra a compatibilidade do seu projeto com a v2 de 'A' e posteriores, portanto, faz sentido não permitir a v2:
ru: Также может быть известно, что проект «A» ввел изменение в его v2, которое нарушает совместимость вашего проекта с v2 «A», а затем, поэтому имеет смысл не разрешать v2:
ta: 'A' திட்டம் அதன் V2 இல் ஒரு மாற்றத்தை அறிமுகப்படுத்தியது, இது உங்கள் திட்டத்தின் பொருந்தக்கூடிய தன்மையை 'A' இன் V2 மற்றும் அதற்குப் பிறகு உடைக்கிறது, எனவே V2 ஐ அனுமதிக்காதது அர்த்தமுள்ளதாக இருக்கும்:

source: It is not considered best practice to use ``install_requires`` to pin dependencies to specific versions, or to specify sub-dependencies (i.e. dependencies of your dependencies). This is overly-restrictive, and prevents the user from gaining the benefit of dependency upgrades.
eo: Ne estas bona praktiko uzi ``install_requires`` por alpingli dependaĵojn al specifaj versioj aŭ specifi subdependaĵojn (dependaĵojn de dependaĵo). Tio estas tro strikta kaj malhelpas ĝisdatigon de dependaĵoj.
ja: 依存関係にあるものを特定のバージョンに固定するために、あるいは、さらなる依存関係(すなわち、あなたの依存先が依存するもの)を指定するために``install_requires``を使うことはベストプラクティスとは考えられていません。これは過剰に制限的であり、依存関係にあるものをまとめて更新することからユーザが得られる利益を阻害するものと考えられています。
pt_br: Não é considerada a melhor prática usar ``install_requires`` para fixar dependências em versões específicas, ou para especificar subdependências (ou seja, dependências de suas dependências). Isso é excessivamente restritivo e evita que o usuário obtenha o benefício de atualizações de dependência.
ru: Не считается лучшей практикой использовать ``install_requires`` для определения зависимостей к конкретным версиям или для указания подзависимости (т.е. зависимости от ваших зависимостей). Это чрезмерно ограничено и не позволяет пользователю получать выгоду от обновления зависимости.
ta: குறிப்பிட்ட பதிப்புகளுக்கு சார்புகளை பின் செய்ய `` install_requires`` ஐப் பயன்படுத்துவது அல்லது துணை சார்புநிலைகளைக் குறிப்பிடுவது சிறந்த நடைமுறையாக கருதப்படவில்லை (அதாவது உங்கள் சார்புகளின் சார்புநிலைகள்). இது அதிகப்படியான கட்டுப்பாடானது, மேலும் பயனர்கள் சார்பு மேம்பாடுகளின் நன்மையைப் பெறுவதைத் தடுக்கிறது.

source: Lastly, it's important to understand that ``install_requires`` is a listing of "Abstract" requirements, i.e just names and version restrictions that don't determine where the dependencies will be fulfilled from (i.e. from what index or source). The where (i.e. how they are to be made "Concrete") is to be determined at install time using :ref:`pip` options. [1]_
eo: Fine, estas grave kompreni, ke ``install_requires`` estas listo de «Abstraktaj» postuloj, t.e. nuraj nomoj kaj versiaj restriktoj, kiuj ne determinas la lokon, de kiu la dependecoj estos plenumitaj (t.e. de kiu indekso aŭ fonto). La kieo (t.e. kiel «Konkretigi» ilin) estas determinota rultempe per la opcioj de :ref:`pip`. [1]_
ja: 最後に、``install_requires``が必要事項の「要約」のリスト、つまり、単に必要事項の名前とバージョンが要求されるだけあって、どこから(すなわち、どんな索引や情報源から)充当するのかについては要求していないのだということを理解することは重要です。どこから(すなわち、どのようにして「具体化」されるのか)という点については、:ref:`pip`のオプションを使ってインストール時に決定されるのです。[1]_
pt_br: Por último, é importante entender que ``install_requires`` é uma lista de requisitos "abstratos", ou seja, apenas nomes e restrições de versão que não determinam de onde as dependências serão preenchidas (ou seja, de qual índice ou fonte). O local (ou seja, como eles devem ser feitos de "concreto") deve ser determinado no momento da instalação usando as opções :ref:`pip`. [1]_
ru: Наконец, важно понимать, что ``install_requires`` - это список "Абстрактных" требований, т.е. просто имена и ограничения версий, которые не определяют, откуда будут выполняться зависимости (т.е. из какого индекса или источника). Где (т.е. как они должны быть сделаны "конкретными"), определяется во время установки с помощью опций :ref:`pip`. [1]_
ta: கடைசியாக, `` Install_requires`` என்பது "சுருக்கம்" தேவைகளின் பட்டியல் என்பதை புரிந்து கொள்ள வேண்டியது தேவை, அதாவது பெயர்கள் மற்றும் பதிப்பு கட்டுப்பாடுகள் சார்புநிலைகள் எங்கிருந்து நிறைவு செய்யப்படும் என்பதை தீர்மானிக்காத (அதாவது எந்த குறியீட்டு அல்லது மூலத்திலிருந்து). எங்கே (அதாவது அவை எவ்வாறு "கான்கிரீட்" செய்யப்பட வேண்டும்) நிறுவும் நேரத்தில் தீர்மானிக்கப்பட வேண்டும்: குறிப்பு: `பிப்` விருப்பங்கள். [1] _

source: Requirements files
eo: Dosiero requirements.txt
ja: Requirementsファイル
pt_br: Arquivos de requisitos
ru: Файлы требований
ta: தேவைகள் கோப்புகள்

source: :ref:`Requirements Files <pip:Requirements Files>` described most simply, are just a list of :ref:`pip:pip install` arguments placed into a file.
eo: :ref:`Postulo-Dosiero <pip:Requirements Files>`, plej simple, estas listo de argumentoj al :ref:`pip:pip install` en dosiero.
ja: :ref:`Requirementsファイル <pip:Requirements Files>`は、一番簡単にいうならば、:ref:`pip:pip install`の引数のリストをファイルに書いただけのものです。
pt_br: :ref:`Arquivos de requisitos <pip:Requirements Files>` descritos de forma mais simples, são apenas uma lista de argumentos :ref:`pip:pip install` colocados em um arquivo.
ru: :ref:`Requirements Files <pip:Requirements Files>`, описанный проще всего, - это всего лишь список :ref:`pip:pip install` аргументов, помещенных в файл.
ta: :ref:`Requirements கோப்புகள் <pip:Requirements Files>` described பெரும்பாலானவை simply, அரே just a பட்டியல் of :ref:`pip:pip install` arguments placed into a file.

source: Whereas ``install_requires`` defines the dependencies for a single project, :ref:`Requirements Files <pip:Requirements Files>` are often used to define the requirements for a complete Python environment.
eo: Dum ``install_requires`` difinas dependecojn de unu projekto, :ref:`Postulo-Dosiero <pip:Requirements Files>` ofte difinas la postulojn pri plena Python-medio.
ja: ``install_requires``が単一のプロジェクトにおける依存関係を定義する一方で、:ref:`Requirements Files <pip:Requirements Files>`はPython環境全体に対する要求事項を定義するのにしばしば用いられます。
pt_br: Considerando que ``install_requires`` define as dependências para um único projeto, :ref:`arquivos de requisitos <pip:Requirements Files>` são frequentemente usados para definir os requisitos para um ambiente Python completo.
ru: В то время как ``install_requires`` определяет зависимости для одного проекта, :ref:`Requirements Files <pip:Requirements Files>` часто используются для определения требований для полной Python среды.
ta: அதேசமயம் `` Install_requires`` ஒரு திட்டத்திற்கான சார்புகளை வரையறுக்கிறது,: ref: `தேவைகள் கோப்புகள் <PIP: தேவைகள் கோப்புகள்>` ஒரு முழுமையான பைதான் சூழலுக்கான தேவைகளை வரையறுக்க பெரும்பாலும் பயன்படுத்தப்படுகின்றன.

source: Whereas ``install_requires`` requirements are minimal, requirements files often contain an exhaustive listing of pinned versions for the purpose of achieving :ref:`repeatable installations <pip:Repeatability>` of a complete environment.
eo: Dum postuloj de ``install_requires`` estas minimumaj, postulo-dosiero ofte enhavas plenan liston de alpinglitaj versioj por :ref:`ripeteblaj instaloj <pip:Repeatability>` de plena medio.
ja: ``install_requires``での要求事項が最小限のものである一方で、requirementsファイルは再現可能な形で環境全体をインストールできるようにする:ref:`repeatable installations <pip:Repeatability>`という目的に沿って限定されたバージョンの網羅的なリストを含むことがしばしばです。
pt_br: Considerando que os requisitos de ``install_requires`` são mínimos, os arquivos de requisitos frequentemente contêm uma lista exaustiva de versões fixadas com o propósito de alcançar :ref:`instalações repetíveis <pip:Repeatability>` de um ambiente completo.
ru: В то время как требования ``install_requires`` являются минимальными, файлы требований часто содержат исчерпывающий список пинированных версий для достижения :ref:`repeatable installations <pip:Repeatability>` полной среды.
ta: `` Install_requires`` தேவைகள் மிகக் குறைவு, தேவைகள் கோப்புகள் பெரும்பாலும் அடைவதற்கான நோக்கத்திற்காக பின் செய்யப்பட்ட பதிப்புகளின் முழுமையான பட்டியலைக் கொண்டிருக்கின்றன: குறிப்பு: `மீண்டும் மீண்டும் செய்யக்கூடிய நிறுவல்கள் <PIP: மீண்டும் நிகழ்தகவு>` ஒரு முழுமையான சூழலின்.

source: Whereas ``install_requires`` requirements are "Abstract", i.e. not associated with any particular index, requirements files often contain pip options like ``--index-url`` or ``--find-links`` to make requirements "Concrete", i.e. associated with a particular index or directory of packages. [1]_
eo: Dum postuloj de ``install_requires`` estas «Abstraktaj» (ne asociitaj al iu indekso), postulo-dosiero ofte enhavas pip-flagojn kiel ``--index-url`` aŭ ``--find-links`` por «Konkretigi» la postulojn (asocii ilin al iuj indeksoj aŭ dosierujoj da pakoj). [1]_
ja: ``install_requires``での要求事項が「要約」、すなわち特定の索引には紐づけられていないのに対して、requirementsファイルではしばしば``--index-url``や``--find-links``のようなpipのオプションが含まれていて特定の索引やパッケージ登録簿に紐づけられた「具体的な」要求事項になっています。[1]_
pt_br: Considerando que os requisitos de ``install_requires`` são "abstratos", ou seja, não estão associados a nenhum índice em particular, os arquivos de requisitos geralmente contêm opções de pip como ``--index-url`` ou ``--find-links`` para fazer requisitos "concreto ", isto é, associado a um determinado índice ou diretório de pacotes. [1]_
ru: В то время как ``install_requires`` требования являются "Abstract", т.е. не связаны с каким-либо конкретным индексом, файлы требований часто содержат pip опции, такие как ``--index-url`` или ``--find-links``, чтобы сделать требования "Concrete", т.е. связанные с конкретным индексом или каталогом пакетов. [1]_
ta: `` Install_requires`` தேவைகள் "சுருக்கம்", அதாவது எந்தவொரு குறிப்பிட்ட குறியீட்டுடனும் தொடர்புடையவை அல்ல, தேவைகள் கோப்புகளில் பெரும்பாலும் தேவைகள் `` --index-URL`` அல்லது ``-FIND-LINKS`` போன்ற பிஐபி விருப்பங்கள் உள்ளன கான்கிரீட் ", அதாவது தொகுப்புகளின் ஒரு குறிப்பிட்ட குறியீட்டு அல்லது கோப்பகத்துடன் தொடர்புடையது. [1] _

source: Whereas ``install_requires`` metadata is automatically analyzed by pip during an install, requirements files are not, and only are used when a user specifically installs them using ``python -m pip install -r``.
eo: Dum metadatenoj de ``install_requires`` estas aŭtomate analizitaj far pip dum instalado, postulo-dosieroj ne estas, kaj nur estas uzataj, kiam oni specife instalas per ``python -m pip install -r``.
ja: ``install_requires``では、メタデータがインストール中にpipによって自動的に解析される一方、requirementsファイルではそうではなく、``python -m pip install -r``を使ってユーザが明示的にインストールする時に使われるだけです。
pt_br: Enquanto os metadados ``install_requires`` são automaticamente analisados pelo pip durante uma instalação, os arquivos de requisitos não são, e são usados apenas quando um usuário os instala especificamente usando ``python -m pip install -r``.
ru: В то время как метаданные ``install_requires`` автоматически анализируются pip во время установки, файлы требований не являются и используются только тогда, когда пользователь специально устанавливает их с помощью ``python -m pip install -r``.
ta: அதேசமயம் `` Install_requires`` ஒரு நிறுவலின் போது PIP ஆல் தானாகவே பகுப்பாய்வு செய்யப்படுகிறது, தேவைகள் கோப்புகள் இல்லை, மேலும் ஒரு பயனர் குறிப்பாக `` பைதான் -எம் பிஐபி நிறுவல் -r`` ஐப் பயன்படுத்தி அவற்றை நிறுவும்போது மட்டுமே பயன்படுத்தப்படுகிறது.

source: For more on "Abstract" vs "Concrete" requirements, see https://caremad.io/posts/2013/07/setup-vs-requirement/.
eo: Por pli pri «abstraktaj» kaj «konkretaj» postuloj, legu https://caremad.io/posts/2013/07/setup-vs-requirement/.
ja: 要求事項が「要約」か「具体的」かの議論についてもっと知りたい場合は、https://caremad.io/posts/2013/07/setup-vs-requirement/をご覧ください。
pt_br: Para obter mais informações sobre os requisitos "abstratos" vs "concretos", consulte https://caremad.io/posts/2013/07/setup-vs-requirement/.
ru: Подробнее о требованиях "Абстрактные" и "Конкретные" см. на сайте https://caremad.io/posts/2013/07/setup-vs-requirement/.
ta: "சுருக்கம்" Vs "கான்கிரீட்" தேவைகள் பற்றி மேலும் அறிய, https://caremad.io/posts/2013/07/setup-vs-requirement/ ஐப் பார்க்கவும்.

source: Package Formats
eo: Pakaj formoj
ja: パッケージフォーマット
pt_br: Formatos de Pacotes
ru: Форматы пакетов
ta: தொகுப்பு வடிவங்கள்

source: This page discusses the file formats that are used to distribute Python packages and the differences between them.
eo: Jen paĝo pri la dosierformoj uzataj por distribui Python-pakojn kaj la diferencojn inter ili.
ja: このページでは、 Python パッケージの配布に使われるファイルフォーマット群とその相違点について議論します。
pt_br: Esta página discute os formatos de arquivo usados para distribuir pacotes Python e as diferenças entre eles.
ru: На этой странице обсуждаются форматы файлов, которые используются для распространения пакетов Python, и различия между ними.
ta: இந்த பக்கம் பைதான் தொகுப்புகளை விநியோகிக்கப் பயன்படும் கோப்பு வடிவங்களையும் அவற்றுக்கிடையேயான வேறுபாடுகளையும் விவாதிக்கிறது.

source: You will find files in two formats on package indices such as PyPI_: **source distributions**, or **sdists** for short, and **binary distributions**, commonly called **wheels**. For example, the `PyPI page for pip 23.3.1 <pip-pypi_>`_ lets you download two files, ``pip-23.3.1.tar.gz`` and ``pip-23.3.1-py3-none-any.whl``. The former is an sdist, the latter is a wheel. As explained below, these serve different purposes. When publishing a package on PyPI (or elsewhere), you should always upload both an sdist and one or more wheel.
eo: Ekzistas dosieroj en du formoj en pakindicoj kiel PyPI_: **fontaj distribuoj** (anglalingve mallonge **sdist**) kaj **duumaj distribuoj**, ofte konata kiel **wheel**. Ekzemple, la `paĝo ĉe PyPI por pip 23.3.1 <pip-pypi_>`_ provizas du dosierojn, ``pip-23.3.1.tar.gz`` kaj ``pip-23.3.1-py3-none-any.whl``. La unua estas fonta distribuo; la dua estas wheel. Kiel klarigite ĉi-sube, tiuj du servas malsamajn celojn. Kiam vi eldonas pakon ĉe PyPI (aŭ aliloke), vi ĉiam elŝutu fontan distribuon kaj unu aŭ pluraj wheel-o(j)n.
ja: PyPI_ のようなパッケージインデックス上には、２種類のフォーマットが見つかることでしょう: **ソースコード配布物 <source distributions>** 、短縮形で **sdists**と呼ばれるものと **バイナリ配布物 <binary distributions>** 、普通は **wheels** を呼ばれるものです。例えば、 `pip 23.3.1 用の PyPI ページ <pip-pypi_>`_ では、 ``pip-23.3.1.tar.gz`` と ``pip-23.3.1-py3-none-any.whl`` の二つのファイルをダウンロードすることができます。前者は sdist であり、後者は wheel です。下で説明するように、これらは異なった目的のために提供されています。 PyPI (にせよ他のどこかにせよ) パッケージを公開する時は、常に sdist とひとつまたは複数の wheel の両方をアップロードするべきです。
pt_br: Você encontrará arquivos em dois formatos em índices de pacotes como PyPI_: **distribuições fonte**, ou a abreviação **sdists**, e **distribuições binárias**, comumente chamadas de **wheels**. Por exemplo, a `página PyPI para pip 23.3.1 <pip-pypi_>`_ permite baixar dois arquivos, ``pip-23.3.1.tar.gz`` e ``pip-23.3.1-py3-none-any.whl``. O primeiro é um sdist, o último é uma wheel. Conforme explicado abaixo, eles têm finalidades diferentes. Ao publicar um pacote no PyPI (ou em outro lugar), você deve sempre enviar um sdist e um ou mais wheel.
ru: На индексах пакетов, таких как PyPI_, вы найдете файлы в двух форматах: **исходные дистрибутивы**, или сокращенно **sdists**, и **бинарные дистрибутивы**, обычно называемые **wheels**. Например, `PyPI-страница для pip 23.3.1 <pip-pypi_>`_ позволяет вам скачать два файла, ``pip-23.3.1.tar.gz`` и ``pip-23.3.1-py3-none-any.whl``. Первый представляет собой sdist, второй - wheel. Как объясняется ниже, они служат для разных целей. Публикуя пакет на PyPI (или где-либо еще), вы всегда должны загружать как sdist, так и один или несколько wheel.
ta: PYPI_: ** மூல விநியோகங்கள் **, அல்லது ** Sdists ** போன்ற தொகுப்பு குறியீடுகளில் இரண்டு வடிவங்களில் கோப்புகளை நீங்கள் காண்பீர்கள், மற்றும் ** பைனரி விநியோகங்கள் **, பொதுவாக ** சக்கரங்கள் ** என்று அழைக்கப்படுகின்றன. எடுத்துக்காட்டாக, பிஐபி 23.3.1 <pip-pypi_> `_ க்கான` பைபி பக்கம் இரண்டு கோப்புகளை பதிவிறக்கம் செய்ய அனுமதிக்கிறது, `` பிஐபி -23.3.1.tar.gz`` மற்றும் `` PIP-23.3.1-NONE -any.whl``. முந்தையது ஒரு SDIST, பிந்தையது ஒரு சக்கரம். கீழே விளக்கப்பட்டுள்ளபடி, இவை வெவ்வேறு நோக்கங்களுக்கு உதவுகின்றன. பைபியில் (அல்லது வேறு இடங்களில்) ஒரு தொகுப்பை வெளியிடும்போது, நீங்கள் எப்போதும் ஒரு SDIST மற்றும் ஒன்று அல்லது அதற்கு மேற்பட்ட சக்கரம் இரண்டையும் பதிவேற்ற வேண்டும்.

source: What is a source distribution?
eo: Kio estas fonta distribuo?
ja: ソースコード配布物とは何か？
pt_br: O que é uma distribuição fonte?
ru: Что такое исходный дистрибутив?
ta: மூல வழங்கல் என்றால் என்ன?
