Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The **name** identifies this entry point within its group. The precise meaning of this is up to the consumer. For console scripts, the name of the entry point is the command that will be used to launch it. Within a distribution, entry point names should be unique. If different distributions provide the same name, the consumer decides how to handle such conflicts. The name may contain any characters except ``=``, but it cannot start or end with any whitespace character, or start with ``[``. For new entry points, it is recommended to use only letters, numbers, underscores, dots and dashes (regex ``[\w.-]+``).
eo: La **nomo** identigas la enirpunkton en ĝia grupo. La preciza signifo dependas de la uzanto de metadatenoj. Por konzola programeto, la nomo de la enirpunkto estas la komando uzota por lanĉi ĝin. En distribuo, nomoj de enirpunktoj estu unikaj. Se pluraj distribuoj provizas la saman nomon, la uzanto de metadatenoj decidas kion fari. La nomo povas konsisti el ajna skribsigno krom ``=``, sed ĝi povas ne komenciĝi nek finiĝi per blanka spaco, kaj ĝi ne povas komenciĝi per ``[``. Nomo de nova enirpunkto konsistu el literoj, ciferoj, substrekoj, punktoj kaj streketoj (laŭ la regula esprimo ``[\w.-]+``).
ja: グループ内では、エントリポイントを **name** で識別します。このことの正確な意味は利用する側次第です。コンソールスクリプトでは、エントリポイントの名前はそのコマンドを起動するのに使われる名前です。配布物の内部では、エントリポイントの名前は一意に決まるべきです。別の配布物が同じ名前を提供する場合には、利用する側でそのような衝突をどのように扱うのかを決めます。名前は ``=`` を除いてどんな文字を含んでいても構いませんが、空白文字で始まったり終わったりすることはできず、 ``[`` で始まることもできません。エントリポイントをこれから作るのであれば、文字・数字・アンダースコア・ドットとダッシュ (正規表現で言うと ``[\w.-]+``) だけを用いることが推奨されています。
pt_br: O **nome** identifica este ponto de entrada em seu grupo. O significado preciso disso depende do cliente. Para scripts de console, o nome do ponto de entrada é o comando que será usado para iniciá-lo. Em uma distribuição, os nomes dos pontos de entrada devem ser exclusivos. Se distribuições diferentes fornecerem o mesmo nome, o consumidor decide como lidar com tais conflitos. O nome pode conter quaisquer caracteres, exceto ``=``, mas não pode começar ou terminar com nenhum caractere de espaço em branco, ou começar com ``[``. Para novos pontos de entrada, é recomendado usar apenas letras, números, sublinhados, pontos e travessões (regex ``[\w.-]+``).
ru: Имя **name** идентифицирует эту точку входа в своей группе. Точное значение этого параметра зависит от пользователя. Для консольных скриптов имя точки входа - это команда, которая будет использована для ее запуска. В пределах дистрибутива имена точек входа должны быть уникальными. Если разные дистрибутивы предоставляют одно и то же имя, потребитель решает, как справиться с такими конфликтами. Имя может содержать любые символы, кроме ``=``, но оно не может начинаться или заканчиваться любым символом пробела, а также начинаться с ``[``. Для новых точек входа рекомендуется использовать только буквы, цифры, символы подчеркивания, точки и тире (regex ``[\w.-]+``).
ta: ** பெயர் ** இந்த நுழைவு புள்ளியை அதன் குழுவிற்குள் அடையாளம் காட்டுகிறது. இதன் துல்லியமான பொருள் நுகர்வோர் வரை. கன்சோல் ச்கிரிப்ட்களைப் பொறுத்தவரை, நுழைவு புள்ளியின் பெயர் அதைத் தொடங்க பயன்படுத்தப்படும் கட்டளை. ஒரு விநியோகத்திற்குள், நுழைவு புள்ளி பெயர்கள் தனித்துவமாக இருக்க வேண்டும். வெவ்வேறு விநியோகங்கள் ஒரே பெயரை வழங்கினால், இதுபோன்ற மோதல்களை எவ்வாறு கையாள்வது என்பதை நுகர்வோர் தீர்மானிக்கிறார். பெயரில் `` = `` தவிர வேறு எந்த எழுத்துக்களும் இருக்கலாம், ஆனால் அது எந்த இடைவெளி எழுத்திலும் தொடங்கவோ முடிவடையவோ முடியாது, அல்லது `` [`` உடன் தொடங்க முடியாது. புதிய நுழைவு புள்ளிகளுக்கு, எழுத்துக்கள், எண்கள், அடிக்கோடிட்டுக் காட்டுதல், புள்ளிகள் மற்றும் கோடுகள் (regex `[\ w .-]+` `) மட்டுமே பயன்படுத்த பரிந்துரைக்கப்படுகிறது.

source: The **object reference** points to a Python object. It is either in the form ``importable.module``, or ``importable.module:object.attr``. Each of the parts delimited by dots and the colon is a valid Python identifier. It is intended to be looked up like this::
eo: La **objekta referenco** montras Python-objekton. Ĝi estas aŭ en la formo ``importebla.modulo`` aŭ en la formo ``importebla.modulo:objekto.atributo``. Ĉiu parto inter punktoj kaj dupunktoj estas valida Python-identigilo. Oni serĉas ĝin jene::
ja: **object reference** は Python のオブジェクトを指し示しています。 ``importable.module`` 、または、 ``importable.module:object.attr`` の形式のいずれかです。ドットやコロンで区切られた各部分は、 Python の正当な識別子です。次のようにルックアップされることを意図したものです::
pt_br: A **referência de objeto** aponta para um objeto Python. Ele está no formato ``importable.module`` ou ``importable.module:object.attr``. Cada uma das partes delimitadas por pontos e dois pontos é um identificador válido Python. Destina-se a ser consultado assim::
ru: Ссылка **объект** указывает на объект Python. Она имеет вид ``importable.module`` или ``importable.module:object.attr``. Каждая из частей, разделенных точками и двоеточием, является допустимым идентификатором Python. Он предназначен для поиска следующим образом::
ta: ** பொருள் குறிப்பு ** பைதான் பொருளை சுட்டிக்காட்டுகிறது. இது `` இறக்குமதி செய்யக்கூடியது. புள்ளிகள் மற்றும் பெருங்குடல் ஆகியவற்றால் பிரிக்கப்பட்ட ஒவ்வொரு பகுதிகளும் சரியான பைதான் அடையாளங்காட்டியாகும். இது இப்படி பார்க்கப்பட வேண்டும் ::

source: Some tools call this kind of object reference by itself an 'entry point', for want of a better term, especially where it points to a function to launch a program.
eo: Kelkaj iloj nomas tian objektan referencon mem «enirpunkto», speciale kiam ĝi montras funkcion por lanĉi programon.
ja: とりわけそれがプログラムを起動する関数を指し示している場合には、いくつかのツールはこの種のオブジェクトへの参照、もっと良い用語で言えば 'エントリポイント' を自分自身で呼び出します。
pt_br: Algumas ferramentas chamam esse tipo de referência de objeto por si só de "ponto de entrada", por falta de um termo melhor, especialmente quando aponta para uma função para iniciar um programa.
ru: В некоторых инструментах такая ссылка на объект сама по себе называется "точкой входа", за неимением лучшего термина, особенно если она указывает на функцию для запуска программы.
ta: சில கருவிகள் இந்த வகையான பொருள் குறிப்பை ஒரு 'நுழைவு புள்ளி' என்று அழைக்கின்றன, ஒரு சிறந்த காலத்தை விரும்புவதற்காக, குறிப்பாக ஒரு நிரலைத் தொடங்குவதற்கான செயல்பாட்டை இது சுட்டிக்காட்டுகிறது.

source: There is also an optional property: the **extras** are a set of strings identifying optional features of the distribution providing the entry point. If these are specified, the entry point requires the dependencies of those 'extras'. See the metadata field :ref:`metadata_provides_extra`.
ja: さらに追加のプロパティがあります: **extras** は、エントリポイントを提供する配布物の追加的な機能をを識別する１組みの文字列です。もし指定されていれば、そのような 'extras' の依存関係をエントリポイントが要求しています。メタデータのフィールド :ref:`metadata_provides_extra` を見てください。
pt_br: Há também uma propriedade opcional: os **extras** são um conjunto de strings que identifica recursos opcionais da distribuição que fornece o ponto de entrada. Se forem especificados, o ponto de entrada requer as dependências desses 'extras'. Veja o campo de metadados :ref:`metadata_provides_extra`.
ru: Есть также необязательное свойство: **extras** - это набор строк, определяющих необязательные возможности дистрибутива, предоставляющего точку входа. Если они указаны, то точка входа требует зависимостей от этих "дополнений". См. поле метаданных :ref:`metadata_provides_extra`.
ta: ஒரு விருப்ப சொத்து உள்ளது: ** கூடுதல் ** என்பது நுழைவு புள்ளியை வழங்கும் விநியோகத்தின் விருப்ப அம்சங்களை அடையாளம் காணும் சரங்களின் தொகுப்பாகும். இவை குறிப்பிடப்பட்டால், நுழைவு புள்ளிக்கு அந்த 'கூடுதல்' சார்புநிலைகள் தேவைப்படுகின்றன. மேனிலை தரவு புலத்தைக் காண்க: ref: `Metadata_provides_extra`.

source: Using extras for an entry point is no longer recommended. Consumers should support parsing them from existing distributions, but may then ignore them. New publishing tools need not support specifying extras. The functionality of handling extras was tied to setuptools' model of managing 'egg' packages, but newer tools such as pip and virtualenv use a different model.
ja: エントリポイント用に extras を使うことはもはや推奨されていません。利用する側は、既存の配布物からそれを取り出して解析することをサポートするべきですが、しかし、無視しても構いません。新しい公開用ツールは、 extras を指定することをサポートする必要はありません。 extras を扱う機能は setuptools が 'egg' パッケージを管理するモデルに紐づいたものですが、しかし、 pip や virtualenv のようなもっと新しいツールでは異なるモデルを採用しています。
pt_br: Usar extras para um ponto de entrada não é mais recomendado. Os consumidores devem oferecer suporte para analisá-los em distribuições existentes, mas podem então ignorá-los. Novas ferramentas de publicação não precisam suportar especificações extras. A funcionalidade de manipulação de extras estava ligada ao modelo do setuptools de gerenciamento de pacotes "egg", mas as ferramentas mais recentes, como pip e virtualenv, usam um modelo diferente.
ru: Использовать extras в качестве точки входа больше не рекомендуется. Потребители должны поддерживать их разбор из существующих дистрибутивов, но затем могут их игнорировать. Новые инструменты публикации не должны поддерживать указание дополнений. Функциональность работы с дополнениями была привязана к модели setuptools по управлению "яичными" пакетами, но новые инструменты, такие как pip и virtualenv, используют другую модель.
ta: ஒரு நுழைவு புள்ளிக்கு கூடுதல் பயன்படுத்துவது இனி பரிந்துரைக்கப்படாது. ஏற்கனவே உள்ள விநியோகங்களிலிருந்து அவற்றை பாகுபடுத்த நுகர்வோர் ஆதரிக்க வேண்டும், ஆனால் பின்னர் அவற்றைப் புறக்கணிக்கலாம். புதிய வெளியீட்டு கருவிகள் கூடுதல் குறிப்புகளை ஆதரிக்க தேவையில்லை. கூடுதல் கையாளுதலின் செயல்பாடு 'முட்டை' தொகுப்புகளை நிர்வகிக்கும் செடுப்டூல்சின் மாதிரியுடன் பிணைக்கப்பட்டுள்ளது, ஆனால் பிஐபி மற்றும் மெய்நிகர்இவி போன்ற புதிய கருவிகள் வேறு மாதிரியைப் பயன்படுத்துகின்றன.

source: File format
eo: Dosierformo
ja: ファイルフォーマット
pt_br: Formato de arquivo
ru: Формат файла
ta: கோப்பு வடிவம்

source: Entry points are defined in a file called :file:`entry_points.txt` in the :file:`*.dist-info` directory of the distribution. This is the directory described in :ref:`recording-installed-packages` for installed distributions, and in :ref:`binary-distribution-format` for wheels. The file uses the UTF-8 character encoding.
eo: Enirpunktoj difiniĝas en dosiero nomita :file:`entry_points.txt` en la dosierujo :file:`*.dist-info` de la distribuo. Tiu estas la dosierujo priskribita en :ref:`recording-installed-packages` por instaleblaj distribuoj kaj en :ref:`binary-distribution-format` por wheel. La dosiero estas kodita laŭ UTF-8.
ja: エントリポイントは、配布物の `*.dist-info` ディレクトリの中の :file:`entry_points.txt` と呼ばれるファイル内で定義されます。これは、インストール済みの配布物に関しては :ref:`インストール済みパッケージを記録する <recording-installed-packages>` 、 wheels に関しては :ref:`バイナリ配布物のフォーマット <binary-distribution-format>` に記述されます。このファイルでは UTF-8 エンコーディングを使います。
pt_br: Os pontos de entrada são definidos em um arquivo chamado :file:`entry_points.txt` no diretório :file:`*.dist-info` da distribuição. Este é o diretório descrito em :ref:`recording-installed-packages` para distribuições instaladas e em :ref:`binary-distribution-format` para wheels. O arquivo usa a codificação de caracteres UTF-8.
ru: Точки входа определяются в файле :file:`entry_points.txt` в каталоге :file:`*.dist-info` дистрибутива. Это каталог, описанный в :ref:`recording-installed-packages` для установленных дистрибутивов, и в :ref:`binary-distribution-format` для колес. В файле используется кодировка UTF-8.
ta: நுழைவு புள்ளிகள் எனப்படும் கோப்பில் வரையறுக்கப்பட்டுள்ளன: கோப்பு: `entry_points.txt` இல்: கோப்பு:`*. டிச்ட்-இன்ஃபோ` விநியோகத்தின் அடைவு. இது விவரிக்கப்பட்டுள்ள கோப்பகமாகும்: குறிப்பு: நிறுவப்பட்ட விநியோகங்களுக்கான `பதிவு-நிறுவப்பட்ட-பேக்கேச்கள்`, மற்றும் இல்: ref:` பைனரி-விநியோக வடிவிலான சக்கரங்களுக்கு. கோப்பு யுடிஎஃப் -8 எழுத்து குறியாக்கத்தைப் பயன்படுத்துகிறது.

source: The file contents are in INI format, as read by Python's :mod:`configparser` module. However, configparser treats names as case-insensitive by default, whereas entry point names are case sensitive. A case-sensitive config parser can be made like this::
eo: La dosieraj enhavoj estas en la dosierformo INI, legata de la modulo :mod:`configparser` de Python. Tamen, configparser apriore estas usklecoblinda pri nomoj, sed enirpunktoj estas usklecdistinga. Oni povas krei usklecdistingan ``ConfigParser`` jene::
ja: ファイルの内容は、 Python の :mod:`configparser` モジュールで読み取ることができる INI フォーマットです。しかしながら、 configparser はデフォルトでは変数名を大文字小文字の区別をせずに扱う一方で、エントリポイントでは区別をします。大文字小文字の区別をする configparser はこのようにして作成できます::
pt_br: O conteúdo do arquivo está no formato INI, conforme lido pelo módulo :mod:`configparser` do Python. No entanto, o configparser trata os nomes como não diferenciando maiúsculas de minúsculas por padrão, enquanto os nomes de pontos de entrada diferenciam maiúsculas de minúsculas. Um analisador de configuração com distinção entre maiúsculas e minúsculas pode ser feito assim::
ru: Содержимое файла имеет формат INI, читаемый модулем Python :mod:`configparser`. Однако по умолчанию configparser рассматривает имена как нечувствительные к регистру, в то время как имена точек входа чувствительны к регистру. Конфигурационный парсер с учетом регистра может быть сделан следующим образом::
ta: பைதான் படித்தபடி கோப்பு உள்ளடக்கங்கள் ஐ.என்.ஐ வடிவத்தில் உள்ளன: மோட்: `கட்டமைப்பு பார்வையாளர்` தொகுதி. இருப்பினும், கட்டமைப்பாளரின் பெயர்களை இயல்புநிலையாக வழக்கு-உணர்வற்றதாகக் கருதுகிறது, அதேசமயம் நுழைவு புள்ளி பெயர்கள் வழக்கு உணர்திறன் கொண்டவை. ஒரு வழக்கு-உணர்திறன் உள்ளமைவு பாகுபடுத்தி இப்படி செய்யப்படலாம் ::

source: The entry points file must always use ``=`` to delimit names from values (whereas configparser also allows using ``:``).
eo: La enirpunkta dosiero devas uzi ``=`` por apartigi nomon kaj valoron (dum configparser ankaŭ permesas uzi ``:``).
ja: エントリポイントのファイルでは、名前と値を区切るのに常に ``=`` を使わなければなりません (他方で configparser は ``:`` で区切ることも許容します) 。
pt_br: O arquivo de pontos de entrada deve sempre usar ``=`` para delimitar nomes de valores (enquanto o configparser também permite o uso de ``:``).
ru: В файле точек входа всегда должно использоваться ``=`` для разделения имен и значений (в то время как configparser также позволяет использовать ``:``).
ta: மதிப்புகளிலிருந்து பெயர்களை வரையறுக்க நுழைவு புள்ளிகள் கோப்பு எப்போதும் `` = `` பயன்படுத்த வேண்டும் (அதேசமயம் கட்டமைப்பாளர்களும் ``: ``) பயன்படுத்த அனுமதிக்கிறது.

source: The sections of the config file represent entry point groups, the names are names, and the values encode both the object reference and the optional extras. If extras are used, they are a comma-separated list inside square brackets.
eo: La sekcioj de la agorda dosiero respondas al enirpunktogrupoj: la sekciaj nomoj estas la nomoj de la enirpunktogrupoj, kaj la valoroj kodas kaj la objektan referencon kaj la nedevigajn ekstraĵojn. Se ekstraĵoj ekzistas, ili estas kome disigita listo inter rektaj krampoj.
ja: 設定ファイルの各セクションはエントリポイントの各グループを表していて、名前は名前であり、値はオブジェクトへの参照と任意の extras の両方をエンコードします。 extras が使われる場合には、角括弧の中にコンマ区切りで列挙します。
pt_br: As seções do arquivo de configuração representam grupos de pontos de entrada, os nomes são nomes e os valores codificam a referência do objeto e os extras opcionais. Se extras forem usados, eles serão uma lista separada por vírgulas entre colchetes.
ru: Секции конфигурационного файла представляют собой группы точек входа, имена - это имена, а значения кодируют как ссылку на объект, так и необязательные дополнения. Если используются дополнительные параметры, они представляют собой список, разделенный запятыми, заключенный в квадратные скобки.
ta: கட்டமைப்பு கோப்பின் பிரிவுகள் நுழைவு புள்ளி குழுக்களைக் குறிக்கின்றன, பெயர்கள் பெயர்கள், மற்றும் மதிப்புகள் பொருள் குறிப்பு மற்றும் விருப்ப கூடுதல் இரண்டையும் குறியாக்குகின்றன. கூடுதல் பயன்படுத்தப்பட்டால், அவை சதுர அடைப்புக்குறிக்குள் கமாவால் பிரிக்கப்பட்ட பட்டியல்.

source: Within a value, readers must accept and ignore spaces (including multiple consecutive spaces) before or after the colon, between the object reference and the left square bracket, between the extra names and the square brackets and colons delimiting them, and after the right square bracket. The syntax for extras is formally specified as part of :pep:`508` (as ``extras``) and restrictions on values specified in :pep:`685`. For tools writing the file, it is recommended only to insert a space between the object reference and the left square bracket.
eo: En valoro, legilo devas akcepti kaj ignori spacetojn (inkluzive de sinsekvo de pluraj spacetoj) antaŭ aŭ post dupunkto, inter la objekta referenco kaj la malferma rekta krampo, inter la ekstraĵaj nomoj kaj la apartigantaj kvadrataj krampoj kaj dupunktoj, kaj post la ferma rekta krampo. La sintakso de ekstraĵoj estas formale specifita kiel parto de :pep:`508` (kiel ``extras``), kaj restriktoj pri valoroj estas formale specifitaj en :pep:`685`. Ilo skribanta la dosieron metu spaceton nur inter la objekta referenco kaj la malferma rekta krampo.
ja: 値の内部では、読み取る側はコロンの前後・オブジェクト参照と左角括弧の間・extraの名前と角括弧や区切り文字のコロンの間・右角括弧の後にある空白文字 (連続する複数の空白文字を含む) を許容し無視しなければなりません。 extras の文法は公式に :pep:`508` の一部 (の ``extras`` 部分) として指定されており、値に関する制限事項は :pep:`685` で指定されています。ファイルを書き出すようなツールでは、オブジェクト参照と左角括弧の間に限って空白文字を挿入することが推奨されています。
pt_br: Dentro de um valor, os leitores devem aceitar e ignorar os espaços (incluindo vários espaços consecutivos) antes ou depois dos dois pontos, entre a referência do objeto e o colchete esquerdo, entre os nomes extras e os colchetes e dois pontos que os delimitam, e depois do quadrado direito suporte. A sintaxe para extras é formalmente especificada como parte da :pep:`508` (como ``extras``) e restrições em valores especificados na :pep:`685`. Para ferramentas de gravação de arquivo, é recomendável inserir apenas um espaço entre a referência do objeto e o colchete esquerdo.
ru: Внутри значения читатели должны принимать и игнорировать пробелы (включая несколько последовательных пробелов) до или после двоеточия, между ссылкой на объект и левой квадратной скобкой, между дополнительными именами и разграничивающими их квадратными скобками и двоеточиями, а также после правой квадратной скобки. Синтаксис для extras формально указан в :pep:`508` (как ``extras``), а ограничения на значения указаны в :pep:`685`. Для инструментов, записывающих файл, рекомендуется вставлять пробел только между ссылкой на объект и левой квадратной скобкой.
ta: ஒரு மதிப்புக்குள், வாசகர்கள் பெருங்குடலுக்கு முன் அல்லது அதற்குப் பிறகு, பொருள் குறிப்பு மற்றும் இடது சதுர அடைப்புக்குறிக்கு இடையில், கூடுதல் பெயர்களுக்கும் சதுர அடைப்புக்குறிகளுக்கும், அவற்றை வரையறுக்கும் காலன்களுக்கும் இடையில், மற்றும் சரியான சதுரத்திற்குப் பிறகு இடங்களை ஏற்றுக்கொண்டு புறக்கணிக்க வேண்டும் அடைப்புக்குறி. கூடுதல் அம்சங்களுக்கான தொடரியல் முறையாக குறிப்பிடப்பட்டுள்ளது: PEP: `508` (` `கூடுதல்``) மற்றும் குறிப்பிடப்பட்ட மதிப்புகள் மீதான கட்டுப்பாடுகள்: PEP:` 685`. கோப்பை எழுதும் கருவிகளுக்கு, பொருள் குறிப்பு மற்றும் இடது சதுர அடைப்புக்குறிக்கு இடையில் ஒரு இடத்தை செருக மட்டுமே பரிந்துரைக்கப்படுகிறது.

source: Use for scripts
eo: Uzado por programetoj
ja: スクリプト向けの使用法
pt_br: Uso para scripts
ru: Используйте для скриптов
ta: ச்கிரிப்டுகளுக்கு பயன்படுத்தவும்

source: Two groups of entry points have special significance in packaging: ``console_scripts`` and ``gui_scripts``. In both groups, the name of the entry point should be usable as a command in a system shell after the package is installed. The object reference points to a function which will be called with no arguments when this command is run. The function may return an integer to be used as a process exit code, and returning ``None`` is equivalent to returning ``0``.
eo: Du grupoj de enirpunktoj havas specialan signifon je pakado: ``console_scripts`` kaj ``gui_scripts``. En ambaŭ grupoj, la nomo de la enirpunkto estu uzebla kiel komando en sistema terminalo post instalo de la pako. La objekta referenco montras funkcion alvokotan senargumente, kiam la komando ruliĝos. La funkcio povas livero entjeron kiel procezan elirkodon. Liveri ``None`` ekvivalentas liveri ``0``.
ja: ``console_scripts`` と ``gui_scripts``: エントリポイントのふたつのグループは、パッケージング全体の中で特別な重要性を持っています。このふたつのグループでは、エントリポイントの名前は、パッケージがインストールされた後にシステムのシェルでコマンドとして使えるものでなければなりません。オブジェクト参照は、このコマンドが動作する際に引数なしで呼び出される関数を指し示しています。関数は、プロセスの終了コードとして使われる整数を返しても構わず、 ``None`` を返すと ``0`` を返したのと同じに扱われます。
pt_br: Dois grupos de pontos de entrada têm um significado especial no empacotamento: ``console_scripts`` e ``gui_scripts``. Em ambos os grupos, o nome do ponto de entrada deve ser usado como um comando em um shell do sistema após a instalação do pacote. A referência do objeto aponta para uma função que será chamada sem argumentos quando este comando for executado. A função pode retornar um inteiro para ser usado como um código de saída do processo, e retornar ``None`` é equivalente a retornar ``0``.
ru: Две группы точек входа имеют особое значение при упаковке: ``console_scripts`` и ``gui_scripts``. В обеих группах имя точки входа должно быть пригодно для использования в качестве команды в системной оболочке после установки пакета. Ссылка на объект указывает на функцию, которая будет вызвана без аргументов при выполнении этой команды. Функция может возвращать целое число, которое будет использоваться в качестве кода завершения процесса, а возврат ``None`` эквивалентен возврату ``0``.
ta: நுழைவு புள்ளிகளின் இரண்டு குழுக்கள் பேக்கேசிங்கில் சிறப்பு முக்கியத்துவம் வாய்ந்தவை: `` கன்சோல்_ச்கிரிப்ட்ச்`` மற்றும் `` gui_scripts``. இரு குழுக்களிலும், தொகுப்பு நிறுவப்பட்ட பின் கணினி செல்லில் கட்டளையாக நுழைவு புள்ளியின் பெயர் பயன்படுத்தப்பட வேண்டும். பொருள் குறிப்பு ஒரு செயல்பாட்டை சுட்டிக்காட்டுகிறது, இது இந்த கட்டளை இயக்கப்படும்போது எந்த வாதங்களும் இல்லாமல் அழைக்கப்படும். செயல்பாடு ஒரு முழு எண்ணாக ஒரு செயல்முறை வெளியேறும் குறியீடாகப் பயன்படுத்தப்படலாம், மேலும் `` எதுவுமில்லை` `திரும்பப் பெறுவது` `0``.

source: For instance, the entry point ``mycmd = mymod:main`` would create a command ``mycmd`` launching a script like this::
eo: Ekzemple, la enirpunkto ``mycmd = mymod:main`` kreus komandon ``mycmd`` lanĉante jenan programon::
ja: 例えば、 ``micmd = memo:main`` というエントリポイントは、 ``micmd`` というコマンドを生成し、このようにスクリプトを起動することになるでしょう::
pt_br: Por exemplo, o ponto de entrada ``mycmd = mymod:main`` criaria um comando ``mycmd`` lançando um script como este::
ru: Например, точка входа ``mycmd = mymod:main`` создаст команду ``mycmd``, запускающую скрипт следующего вида::
ta: உதாரணமாக, நுழைவு புள்ளி `` mycmd = mymod: main`` இது போன்ற ஒரு ச்கிரிப்டைத் தொடங்கும் கட்டளையை உருவாக்கும் ::
