Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Different Python projects may use different versioning schemes based on the needs of that particular project, but in order to be compatible with tools like :ref:`pip`, all of them are required to comply with a flexible format for version identifiers, for which the authoritative reference is the :ref:`specification of version specifiers <version-specifiers>`. Here are some examples of version numbers [#version-examples]_:
eo: Diversaj Python-projektoj uzas malsamajn versiajn skemojn pro siaj malsamaj bezonoj. Tamen, por kongrui kun :ref:`pip` kaj aliaj iloj, ĉia projekto devas observi flekseblan formon por versiaj identigiloj, pri kio la aŭtoritata referenco estas la :ref:`specifo pri versio-specifiloj <version-specifiers>`. Jen kelkaj ekzemploj de versiaj numeroj [#version-examples]_:
ja: 相異なるPythonプロジェクトがそれぞれの事情に合わせて異なるバージョン体系を採用することは構いませんが、しかし、:ref:`pip` のようなツールとの互換性を保つためには、バージョン識別子のための自由度の高いフォーマット、その権威ある参照先は :ref:`バージョン識別子仕様 <version-specifiers>` ですが、これに準拠することが要求されます。ここではバージョン番号のいくつかの例を紹介しましょう [#version-examples]_:
pt_br: Diferentes projetos Python podem usar diferentes esquemas de versionamento com base nas necessidades daquele projeto específico, mas para serem compatíveis com ferramentas como :ref:`pip`, todos eles são obrigados a cumprir um formato flexível para identificadores de versão, para o qual a referência oficial é a :ref:`especificação dos especificadores de versão <version-specifiers>`. Aqui estão alguns exemplos de números de versão [#version-examples]_:
ru: Различные Python-проекты могут использовать различные схемы версионирования в зависимости от потребностей конкретного проекта, но для совместимости с такими инструментами, как :ref:`pip`, все они должны соответствовать гибкому формату идентификаторов версий, для которого авторитетной ссылкой является :ref:`specification of version specifiers <version-specifiers>`. Вот несколько примеров номеров версий [#version-examples]_:
ta: வெவ்வேறு பைதான் திட்டங்கள் அந்த குறிப்பிட்ட திட்டத்தின் தேவைகளின் அடிப்படையில் வெவ்வேறு பதிப்பு திட்டங்களைப் பயன்படுத்தலாம், ஆனால் போன்ற கருவிகளுடன் இணக்கமாக இருக்க, ref: `பிப்`, அவை அனைத்தும் பதிப்பு அடையாளங்காட்டிகளுக்கு நெகிழ்வான வடிவத்துடன் இணங்க வேண்டும், அதற்காக அதிகாரப்பூர்வ குறிப்பு: ref: `பதிப்பு விவரக்குறிப்புகளின் விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>`. பதிப்பு எண்களின் சில எடுத்துக்காட்டுகள் இங்கே [#பதிப்பு-எடுத்துக்காட்டுகள்] _:

source: A simple version (final release): ``1.2.0``
eo: Simpla versio (fina eldono): ``1.2.0``
ja: 簡明なバージョン (最終的なリリース): ``1.2.0``
pt_br: Uma versão simples (versão final): ``1.2.0``
ru: Простая версия (финальный релиз): ``1.2.0``
ta: ஒரு எளிய பதிப்பு (இறுதி வெளியீடு): `` 1.2.0``

source: A development release: ``1.2.0.dev1``
eo: Evoluanta eldono: ``1.2.0.dev1``
ja: 開発リリース: ``1.2.0.dev1``
pt_br: Uma versão de desenvolvimento: ``1.2.0.dev1``
ru: Релиз разработки: ``1.2.0.dev1``
ta: ஒரு மேம்பாட்டு வெளியீடு: `` 1.2.0.dev1``

source: An alpha release: ``1.2.0a1``
eo: Alfa-eldono: ``1.2.0a1``
ja: アルファリリース: ``1.2.0a1``
pt_br: Uma versão alfa: ``1.2.0a1``
ru: Альфа-версия: ``1.2.0a1``
ta: ஆல்பா வெளியீடு: `` 1.2.0a1``

source: A beta release: ``1.2.0b1``
eo: Beta-eldono: ``1.2.0b1``
ja: ベータリリース: ``1.2.0b1``
pt_br: Uma versão beta: ``1.2.0b1``
ru: Бета-версия: ``1.2.0b1``
ta: ஒரு பீட்டா வெளியீடு: `` 1.2.0b1``

source: A release candidate: ``1.2.0rc1``
eo: Eldonkandidato: ``1.2.0rc1``
ja: リリース候補: ``1.2.0rc1``
pt_br: Um candidato a lançamento: ``1.2.0rc1``
ru: Кандидат на релиз: ``1.2.0rc1``
ta: ஒரு வெளியீட்டு வேட்பாளர்: `` 1.2.0rc1``

source: A post-release: ``1.2.0.post1``
eo: Posteldono: ``1.2.0.post1``
ja: ポストリリース: ``1.2.0.post1``
pt_br: Um pós-lançamento: ``1.2.0.post1``
ru: Пост-релиз: ``1.2.0.post1``
ta: ஒரு வெளியீட்டுக்கு பிந்தைய: `` 1.2.0.post1``

source: A post-release of an alpha release (possible, but discouraged): ``1.2.0a1.post1``
eo: Posteldono de alfa-eldono (ebla, sed malrekomendata): ``1.2.0a1.post1``
ja: アルファリリースのポストリリース (こういうことも可能ではあるが非推奨): ``1.2.0a1.post1``
pt_br: Um pós-lançamento de uma versão alfa (possível, mas desencorajado): ``1.2.0a1.post1``
ru: Пост-релиз альфа-релиза (возможно, но не рекомендуется): ``1.2.0a1.post1``
ta: ஆல்பா வெளியீட்டின் பிந்தைய வெளியீட்டை (சாத்தியம், ஆனால் ஊக்கமளித்தது): `` 1.2.0a1.post1```

source: A simple version with only two components: ``23.12``
eo: Simpla versio kun nur du komponantoj: ``23.12``
ja: 二つの部分からのみ構成される簡明なバージョン: ``23.12``
pt_br: Uma versão simples com apenas dois componentes: ``23.12``
ru: Простая версия, состоящая всего из двух компонентов: ``23.12``
ta: இரண்டு கூறுகள் மட்டுமே கொண்ட எளிய பதிப்பு: `` 23.12``

source: A simple version with just one component: ``42``
eo: Simpla versio kun nur unu komponanto: ``42``
ja: たったひとつの部分から構成される簡明なバージョン: ``42``
pt_br: Uma versão simples com apenas um componente: ``42``
ru: Простая версия с одним компонентом: ``42``
ta: ஒரு கூறு கொண்ட எளிய பதிப்பு: `` 42``

source: A version with an epoch: ``1!1.0``
eo: Versio kun epoko: ``1!1.0``
ja: エポック付きのバージョン: ``1!1.0``
pt_br: Uma versão com uma época: ``1!1.0``
ru: Версия с эпохой: ``1!1.0``
ta: ஒரு சகாப்தத்துடன் ஒரு பதிப்பு: `` 1! 1.0``

source: Projects can use a cycle of pre-releases to support testing by their users before a final release. In order, the steps are: alpha releases, beta releases, release candidates, final release. Pip and other modern Python package installers ignore pre-releases by default when deciding which versions of dependencies to install, unless explicitly requested (e.g., with ``pip install pkg==1.1a3`` or ``pip install --pre pkg``).
eo: Projektoj povas uzi ciklon de antaŭeldonoj por testado far uzantoj antaŭ fina eldono. Laŭorde, jen la ŝtupoj: alfa-eldonoj, beta-eldonoj, eldonkandidatoj, fina eldono. Pip kaj aliaj modernaj Python-pakistaliloj apriore ignoras antaŭeldonojn decidadante la instalotan version de dependaĵo, escepte de eksplicita postulo (ekzemple per ``pip install pako==1.1a3`` or ``pip install --pre pako``).
ja: プロジェクトにおいては、最終的なリリースの前にいくつかのプレリリースのサイクルを置くことで既存ユーザによる試験をサポートすることができます。その段階は、アルファリリース、ベータリリース、リリース候補、最終的なリリースの順です。 pip や他の近代的な Python パッケージインストーラは、依存関係にあるパッケージのどのバージョンをインストールするかを決定する際、 (例えば ``pip install pkg==1.1a3`` とか ``pip install --pre pkg`` のように) 明示的に要求されていない限りデフォルト設定ではプレリリース群を無視します。
pt_br: Os projetos podem usar um ciclo de pré-lançamentos para dar suporte aos testes de seus usuários antes do lançamento final. Em ordem, as etapas são: versões alfa, versões beta, candidatos a lançamento, versão final. Pip e outros instaladores modernos de pacotes Python ignoram pré-lançamentos por padrão ao decidir quais versões de dependências instalar, a menos que solicitado explicitamente (por exemplo, com ```pip install pkg==1.1a3`` ou ``pip install --pre pkg``).
ru: Проекты могут использовать цикл предварительных выпусков для поддержки тестирования пользователями перед выпуском финального релиза. По порядку эти шаги выглядят так: альфа-релизы, бета-релизы, релиз-кандидаты, финальный релиз. Pip и другие современные программы установки пакетов Python по умолчанию игнорируют предварительные выпуски при принятии решения о том, какие версии зависимостей устанавливать, если это не запрошено явно (например, с помощью ``pip install pkg==1.1a3`` или ``pip install --pre pkg``).
ta: இறுதி வெளியீட்டிற்கு முன்னர் தங்கள் பயனர்களால் சோதனையை ஆதரிக்க திட்டங்கள் முன் வெளியீட்டு சுழற்சியைப் பயன்படுத்தலாம். வரிசையில், படிகள்: ஆல்பா வெளியீடுகள், பீட்டா வெளியீடுகள், வெளியீட்டு வேட்பாளர்கள், இறுதி வெளியீடு. பிஐபி மற்றும் பிற நவீன பைதான் தொகுப்பு நிறுவிகள் வெளிப்படையாகக் கோரப்படாவிட்டால் (எ.கா., பி.கே.சி நிறுவும் பி.கே. `).

source: The purpose of development releases is to support releases made early during a development cycle, for example, a nightly build, or a build from the latest source in a Linux distribution.
eo: Evoluada eldono celas subteni eldonadon dum frua parto de evoluada ciklo — ekzemple, ĉiutaga konstruo aŭ konstruo el la plej nova fonto en Linux-distribuo.
ja: 開発リリースの目的は、例えば夜毎のビルド <nightly build> のように開発サイクルの早い時期にリリースを行うことや、Linux ディストリビューションの最新のソースコードからビルドを行うことです。
pt_br: O objetivo dos lançamentos de desenvolvimento é oferecer suporte aos lançamentos feitos no início de um ciclo de desenvolvimento, por exemplo, uma construção noturna ou uma construção a partir do código-fonte mais recente em uma distribuição Linux.
ru: Цель релизов разработки - поддержать релизы, выпущенные на ранних этапах цикла разработки, например, ночные сборки или сборки из последних исходных текстов в дистрибутиве Linux.
ta: வளர்ச்சி வெளியீடுகளின் நோக்கம் ஒரு வளர்ச்சி சுழற்சியின் போது ஆரம்பத்தில் செய்யப்பட்ட வெளியீடுகளை ஆதரிப்பதாகும், எடுத்துக்காட்டாக, ஒரு இரவு கட்டமைப்பை அல்லது லினக்ச் விநியோகத்தில் அண்மைக் கால மூலத்திலிருந்து ஒரு கட்டமைப்பை உருவாக்குவது.

source: Post-releases are used to address minor errors in a final release that do not affect the distributed software, such as correcting an error in the release notes. They should not be used for bug fixes; these should be done with a new final release (e.g., incrementing the third component when using semantic versioning).
eo: Posteldono estas por korekti negravajn erarojn en fina eldono, kiuj ne efikas sur la distribuita programo, kiel ekzemple korektado de eraro en la eldonaj notoj. Oni ne uzu posteldonon por ripari cimon; por tio oni uzu novan finan eldonon (ekz., alkremante la trian komponanton por semantika versio).
ja: ポストリリースは、リリースノート内のエラーのように配布されたソフトウェアに大きな悪影響を与えないようなファイナルリリースの軽微なエラーを修正するために使われます。バグ修正のために使うべきではなく、それは新たな (即ち、セマンティックバージョニングを使っているなら第３要素を１だけ増加させた) ファイナルリリースで行うべきです。
pt_br: Os pós-lançamentos são usados para corrigir pequenos erros em uma versão final que não afetam o software distribuído, como corrigir um erro nas notas de versão. Eles não devem ser usados para correção de bugs; isso deve ser feito com uma nova versão final (por exemplo, incrementando o terceiro componente ao usar o versionamento semântico).
ru: Пост-релизы используются для устранения мелких ошибок в финальном релизе, которые не влияют на распространяемое программное обеспечение, например, для исправления ошибки в примечаниях к релизу. Они не должны использоваться для исправления ошибок; это должно быть сделано в новом финальном выпуске (например, инкремент третьего компонента при использовании семантической версионности).
ta: வெளியீட்டுக் குறிப்புகளில் பிழையை சரிசெய்வது போன்ற விநியோகிக்கப்பட்ட மென்பொருளை பாதிக்காத இறுதி வெளியீட்டில் சிறிய பிழைகளை நிவர்த்தி செய்ய பிந்தைய உறவுகள் பயன்படுத்தப்படுகின்றன. பிழை திருத்தங்களுக்கு அவை பயன்படுத்தப்படக்கூடாது; இவை புதிய இறுதி வெளியீட்டில் செய்யப்பட வேண்டும் (எ.கா., சொற்பொருள் பதிப்பைப் பயன்படுத்தும் போது மூன்றாவது கூறுகளை அதிகரிக்கும்).

source: Finally, epochs, a rarely used feature, serve to fix the sorting order when changing the versioning scheme. For example, if a project is using calendar versioning, with versions like 23.12, and switches to semantic versioning, with versions like 1.0, the comparison between 1.0 and 23.12 will go the wrong way. To correct this, the new version numbers should have an explicit epoch, as in "1!1.0", in order to be treated as more recent than the old version numbers.
eo: Fine, epoko, kiuj estas malofte uzata, helpas ripari la ordon dum ŝanĝado de la versia skemo. Ekzemple, se projekto uzas kalendaran versiadon, kun versioj kiel 23.12, kaj ŝanĝas al semantika versiado, kun versioj kiel 1.0, la komparo inter 1.0 kaj 23.12 estus malĝusta. Por korekti tion, la novaj versiaj numeroj havu eksplicitan epokon, kiel «1!1.0», por esti pli novaj ol la malnovaj versiaj numeroj.
ja: 最後に、エポックは、稀にしか使われない機能ですが、バージョニングの方法を変更するときに順序を訂正するために使われます。例えば、 23.12 のようなカレンダーバージョニングを使っているプロジェクトが 1.0 のようなセマンティックバージョニングに移行するような場合に、 1.0 と 23.12 の間の比較は誤った結果になるでしょう。これを訂正するために、明示的に示された "1!1.0" のようなエポックを持つことで、新しいバージョン番号が古いバージョン番号よりもより最近のものとして扱われるようにするべきです。
pt_br: Por fim, as épocas, um recurso raramente usado, servem para corrigir a ordem de classificação ao alterar o esquema de versionamento. Por exemplo, se um projeto estiver usando versionamento de calendário, com versões como 23.12, e mudar para versionamento semântico, com versões como 1.0, a comparação entre 1.0 e 23.12 irá para o lado errado. Para corrigir isso, os novos números de versão devem ter uma época explícita, como em "1!1.0", para serem tratados como mais recentes que os números de versão antigos.
ru: Наконец, эпохи, редко используемая функция, служат для фиксации порядка сортировки при изменении схемы версионирования. Например, если проект использует календарную версификацию, с версиями типа 23.12, и переходит на семантическую версификацию, с версиями типа 1.0, то сравнение между 1.0 и 23.12 будет идти в неправильном направлении. Чтобы исправить это, новые номера версий должны иметь явную эпоху, как в "1!1.0", чтобы считаться более новыми, чем старые номера версий.
ta: இறுதியாக, பதிப்புத் திட்டத்தை மாற்றும்போது வரிசையாக்க வரிசையை சரிசெய்ய, அரிதாகப் பயன்படுத்தப்படும் அம்சமான சகாப்தங்கள். எடுத்துக்காட்டாக, ஒரு திட்டம் 23.12 போன்ற பதிப்புகளுடன் காலெண்டர் பதிப்பைப் பயன்படுத்தினால், மற்றும் சொற்பொருள் பதிப்பிற்கு மாறினால், 1.0 போன்ற பதிப்புகளுடன், 1.0 மற்றும் 23.12 க்கு இடையிலான ஒப்பீடு தவறான வழியில் செல்லும். இதை சரிசெய்ய, பழைய பதிப்பு எண்களை விட மிக சமீபத்தியதாக கருதப்படுவதற்கு, "1! 1.0" இல் உள்ளதைப் போல புதிய பதிப்பு எண்கள் வெளிப்படையான சகாப்தத்தைக் கொண்டிருக்க வேண்டும்.

source: Semantic versioning vs. calendar versioning
eo: Semantika versiado kaj kalendara versiado
ja: セマンティックバージョニング対カレンダーバージョニング
pt_br: Versionamento semântico vs. versionamento de calendário
ru: Семантическое версионирование по сравнению с календарным версионированием
ta: சொற்பொருள் பதிப்பு எதிராக காலண்டர் பதிப்பு

source: A versioning scheme is a formalized way to interpret the segments of a version number, and to decide which should be the next version number for a new release of a package. Two versioning schemes are commonly used for Python packages, semantic versioning and calendar versioning.
eo: Versia skemo estas formala maniero interpreti la segmentojn de versia numero kaj decidi la sekvan versian numeron por nova eldono de pako. Ekzistas du versiaj skemoj ofte uzataj por Python-pakoj: semantika versiado kaj kalendara versiado.
ja: バージョニング方法とは、バージョン番号の断片を翻訳するために決められたやり方で、パッケージの新しいリリースように次のバージョン番号がどのようなものになるべきかを決めるやり方です。Python パッケージにしばしば用いられる二つのバージョニング方法は、セマンティックバージョニングとカレンダーバージョニングです。
pt_br: Um esquema de versionamento é uma forma formalizada de interpretar os segmentos de um número de versão e de decidir qual deve ser o próximo número de versão para um novo lançamento de um pacote. Dois esquemas de versionamento são comumente usados para pacotes Python, versionamento semântico e versionamento de calendário.
ru: Схема версионирования - это формализованный способ интерпретации сегментов номера версии и принятия решения о том, какой номер версии должен быть следующим для нового выпуска пакета. Для пакетов Python обычно используются две схемы версионирования: семантическое версионирование и календарное версионирование.
ta: பதிப்பு எண்ணின் பிரிவுகளை விளக்குவதற்கும், ஒரு தொகுப்பின் புதிய வெளியீட்டிற்கான அடுத்த பதிப்பு எண்ணாக இருக்க வேண்டும் என்பதை தீர்மானிப்பதற்கும் ஒரு பதிப்பு திட்டம் ஒரு முறையான வழியாகும். பைதான் தொகுப்புகள், சொற்பொருள் பதிப்பு மற்றும் காலண்டர் பதிப்பிற்கு இரண்டு பதிப்பு திட்டங்கள் பொதுவாகப் பயன்படுத்தப்படுகின்றன.

source: The decision which version number to choose is up to a project's maintainer. This effectively means that version bumps reflect the maintainer's view. That view may differ from the end-users' perception of what said formalized versioning scheme promises them.
eo: La projekta mastrumanto decidas la uzotan versian numeron. Tio signifas, ke versia alkremento reflektas la opinion de la mastrumanto. Tiu opinio povas devii de la percepto de la uzantoj pri la promesoj de la formaligita versia skemo.
ja: どのようなバージョン番号を選択するべきかの決定権はプロジェクトのメンテナに委ねられています。これは、バージョン上げにメンテナの観点を反映しているということを実質的に意味します。そのような観点は、バージョニング方法が約束するやり方についてのエンドユーザの受け取り方とは異なるかも知れません。
pt_br: A decisão de qual número de versão escolher cabe ao mantenedor do projeto. Isso efetivamente significa que os incrementos de versão refletem a visão do mantenedor. Essa visão pode diferir da percepção dos usuários finais sobre o que o referido esquema de versionamento formalizado lhes promete.
ru: Решение о том, какой номер версии выбрать, принимает сопровождающий проекта. Это фактически означает, что переходы по версиям отражают точку зрения сопровождающего. Это мнение может отличаться от восприятия конечными пользователями того, что обещает им формализованная схема версионирования.
ta: எந்த பதிப்பு எண் தேர்வு செய்ய வேண்டும் என்பது ஒரு திட்டத்தின் பராமரிப்பாளர் வரை. பதிப்பு புடைப்புகள் பராமரிப்பாளரின் பார்வையை பிரதிபலிக்கின்றன என்பதே இதன் பொருள். முறைப்படுத்தப்பட்ட பதிப்பு திட்டம் அவர்களுக்கு உறுதியளிக்கிறது என்ற இறுதி பயனர்களின் பார்வையில் இருந்து அந்த பார்வை வேறுபடலாம்.

source: Semantic versioning
eo: Semantika versiado
ja: セマンティックバージョニング
pt_br: Versionamento semântico
ru: Семантическая версификация
ta: சொற்பொருள் பதிப்பு

source: The idea of *semantic versioning* (or SemVer) is to use 3-part version numbers, *major.minor.patch*, where the project author increments:
eo: La ideo de *semantika versiado* (aŭ SemVer) estas uzi tripartajn versiajn numerojn, *maĵora.minora.flika*, je kiu la projekta aŭtoro alkrementas:
ja: *セマンティックバージョニング* (または SemVer) のアイデアは、３個の部分から構成されるバージョン番号、つまり *major.minor.patch* を用いることで、プロジェクトの作者は以下のように各段階の数字を増やします:
pt_br: A ideia do *versionamento semântico* (ou SemVer) é usar números de versão de 3 partes, *principal.menor.correção*, onde o autor do projeto incrementa:
ru: Идея *семантического версионирования* (или SemVer) заключается в использовании номеров версий, состоящих из трех частей, *major.minor.patch*, которые автор проекта увеличивает:
ta: *சொற்பொருள் பதிப்பு *(அல்லது செம்வர்) இன் சிந்தனை 3-பகுதி பதிப்பு எண்களைப் பயன்படுத்துவதாகும், *mater.minor.patch *, அங்கு திட்ட ஆசிரியர் அதிகரிக்கும்:

source: *major* when they make incompatible API changes,
eo: *maĵora* kiam nekongruaj API-ŝanĝoj okazas,
ja: APIの変更で互換性を失う時には *major* 番号、
pt_br: *principal* quando são feitas alterações incompatíveis à API,
ru: *главное*, когда они вносят несовместимые изменения в API,
ta: * மேசர்* அவர்கள் பொருந்தாத பநிஇ மாற்றங்களைச் செய்யும்போது,

source: *minor* when they add functionality in a backwards-compatible manner, and
eo: *minora* kiam funkcioj aldoniĝas retrokongrue, kaj
ja: 後方互換性を保ったままで新機能を追加する場合には *minor* を、そして
pt_br: *menor* quando é adicionada funcionalidade de maneira compatível com versões anteriores, e
ru: *незначительные*, когда они добавляют функциональность, совместимую с обратным развитием, и
ta: * சிறிய* அவை பின்னோக்கி-இணக்கமான முறையில் செயல்பாட்டைச் சேர்க்கும்போது, மற்றும்

source: *patch*, when they make backwards-compatible bug fixes.
eo: *flika*, kiam okazas retrokongruaj cimriparoj.
ja: 後方互換性を維持したままのバグ修正の場合には *patch* を増加させます。
pt_br: *correção*, quando são feitas correções de bugs compatíveis com versões anteriores.
ru: *патчи*, когда они исправляют ошибки, совместимые с обратными версиями.
ta: *பேட்ச்*, அவை பின்னோக்கி-இணக்கமான பிழை திருத்தங்களைச் செய்யும்போது.

source: A majority of Python projects use a scheme that resembles semantic versioning. However, most projects, especially larger ones, do not strictly adhere to semantic versioning, since many changes are technically breaking changes but affect only a small fraction of users. Such projects tend to increment the major number when the incompatibility is high, or to signal a shift in the project, rather than for any tiny incompatibility [#semver-strictness]_. Conversely, a bump of the major version number is sometimes used to signal significant but backwards-compatible new features.
eo: Plimulto de Python-projektoj uzas skemon similan al semantika versiado. Tamen, multaj projektoj, speciale la grandegaj, ne strikte observas semantikan versiadon, ĉar multaj ŝanĝoj havas teĥnike rompantajn ŝanĝojn sed efikas sur nur malgrandan frakcion da uzantoj. Tiaj projektoj ofte alkrementas la maĵoran numeron tiam, kiam la nekongrueco estas multa aŭ por signali ŝanĝon pri la projekto, ne por ĉia malgranda nekongrueco [#semver-strictness]_. Inverse, alkremento de la maĵora versia numero kelkfoje signalas signifajn sed retrokongruajn novajn funkciojn.
ja: Python プロジェクトの大多数は、セマンティックバージョニングに似た方式を使っています。しかしながら、ほとんどのプロジェクト、とりわけ大規模なものでは、多くの変更が技術的には互換性を保たないけれども少数のユーザにしか影響を与えないので、セマンティックバージョニングに厳密に従うことはしていません。そのようなプロジェクトでは、小さな非互換性であってもいつも major 番号を増やす [#semver-strictness]_ というよりは、非互換性が高い場合やプロジェクトの方向性が変わることを示す時に増やす傾向にあります。逆に、時には、重要ではあるが後方互換性を損なわない新機能に注目を集めるために major バージョン番号を増加させることもあります。
pt_br: A maioria dos projetos Python usa um esquema que se assemelha ao versionamento semântico. No entanto, a maioria dos projetos, especialmente os maiores, não aderem estritamente ao versionamento semântico, uma vez que muitas alterações são tecnicamente prejudiciais, mas afetam apenas uma pequena fração dos usuários. Tais projetos tendem a aumentar o número maior quando a incompatibilidade é alta, ou para sinalizar uma mudança no projeto, ao invés de qualquer pequena incompatibilidade [#semver-strictness]_. Por outro lado, um aumento no número da versão principal às vezes é usado para sinalizar novos recursos significativos, mas compatíveis com versões anteriores.
ru: Большинство проектов на Python используют схему, напоминающую семантическое версионирование. Однако большинство проектов, особенно крупных, не строго придерживаются семантического версионирования, поскольку многие изменения являются технически разрушающими, но затрагивают лишь небольшую часть пользователей. Такие проекты склонны увеличивать основной номер, когда несовместимость высока или сигнализирует о сдвигах в проекте, а не для любой крошечной несовместимости [#semver-strictness]_. И наоборот, увеличение номера основной версии иногда используется, чтобы сообщить о значительных, но обратно совместимых новых возможностях.
ta: பைதான் திட்டங்களில் பெரும்பாலானவை சொற்பொருள் பதிப்பை ஒத்த ஒரு திட்டத்தைப் பயன்படுத்துகின்றன. இருப்பினும், பெரும்பாலான திட்டங்கள், குறிப்பாக பெரியவை, சொற்பொருள் பதிப்பைக் கண்டிப்பாக கடைப்பிடிக்காது, ஏனெனில் பல மாற்றங்கள் தொழில்நுட்ப ரீதியாக மாற்றங்களை உடைக்கின்றன, ஆனால் பயனர்களில் ஒரு சிறிய பகுதியை மட்டுமே பாதிக்கின்றன. பொருந்தாத தன்மை அதிகமாக இருக்கும்போது இத்தகைய திட்டங்கள் முக்கிய எண்ணிக்கையை அதிகரிக்க முனைகின்றன, அல்லது எந்தவொரு சிறிய பொருந்தாத தன்மையைக் காட்டிலும் [#செம்வர்-ச்ட்ரிக்டெச்] _. மாறாக, முக்கிய பதிப்பு எண்ணின் ஒரு பம்ப் சில நேரங்களில் குறிப்பிடத்தக்க ஆனால் பின்னோக்கி-இணக்கமான புதிய அம்சங்களை சமிக்ஞை செய்யப் பயன்படுகிறது.
