Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: As of Metadata 2.4, ``License`` and ``License-Expression`` are mutually exclusive. If both are specified, tools which parse metadata will disregard ``License`` and PyPI will reject uploads. See `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-field>`__.
eo: Ekde Metadatenoj 2.4, ``License`` kaj ``License-Expression`` ne estas samtempe specifeblaj. Se ambaŭ estas specifitaj, ilo pritraktanta metadatenojn ignoros ``License``, kaj PyPI rifuzos alŝutojn. Vidu `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-field>`__.
ru: Начиная с версии Metadata 2.4, ``License`` и ``License-Expression`` являются взаимоисключающими. Если указаны оба значения, инструменты, анализирующие метаданные, будут игнорировать ``Лицензию``, а PyPI будет отклонять загрузки. Смотрите `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-field>`__.
ta: மேனிலை தரவு 2.4 இன் படி, `` உரிமம்`` மற்றும் `` உரிமம்-வெளிப்பாடு`` இருவழி. இரண்டும் குறிப்பிடப்பட்டால், மேனிலை தரவு பாகுபடுத்தும் கருவிகள் `` உரிமம்`` ஐ புறக்கணிக்கும், மேலும் பதிவேற்றங்களை PYPI நிராகரிக்கும். `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-field> ____ ஐப் பார்க்கவும்.

source: Text indicating the license covering the distribution where the license is not a selection from the "License" Trove classifiers. See :ref:`"Classifier" <metadata-classifier>` below. This field may also be used to specify a particular version of a license which is named via the ``Classifier`` field, or to indicate a variation or exception to such a license.
ja: "License" Trove 分類子から選択したものではないライセンスの場合は、配布物をカバーするライセンスを示すテキスト。後述の :ref:`"Classifier" <metadata-classifier>` を見てください。このフィールドは、 ``Classifier`` フィールドを経由して名指しされたライセンスの特定のバージョンを指定したり、そのようなライセンスに対する変種や例外事項を示したりするのに使っても構いません。
pt_br: Texto indicando a licença cobrindo a distribuição onde a licença não é uma seleção dos classificadores Trove "License". Veja :ref:`"Classifier "<metadata-classifier>` abaixo. Este campo também pode ser usado para especificar uma versão particular de uma licença que é nomeada através do campo ``Classifier``, ou para indicar uma variação ou exceção a tal licença.
ru: Текст, указывающий на лицензию, распространяемую на дистрибутив, если лицензия не является выбором из классификаторов "License" Trove. См. :ref:``Классификатор`` <metadata-classifier>` ниже. Это поле также может использоваться для указания конкретной версии лицензии, названной через поле ``Классификатор'', или для указания разновидности или исключения из такой лицензии.
ta: "உரிமம்" ட்ரோவ் வகைப்படுத்திகளிடமிருந்து உரிமம் இல்லாத விநியோகத்தை உள்ளடக்கிய உரிமத்தை குறிக்கும் உரை. காண்க: குறிப்பு: `" வகைப்படுத்தி "<மெட்டாடேட்டா-கிளாசிஃபையர்>` கீழே. உரிமத்தின் ஒரு குறிப்பிட்ட பதிப்பைக் குறிப்பிடவும் இந்த புலம் பயன்படுத்தப்படலாம், இது `` வகைப்படுத்தி`` புலம் வழியாக பெயரிடப்பட்டது, அல்லது அத்தகைய உரிமத்திற்கு மாறுபாடு அல்லது விதிவிலக்கைக் குறிக்கலாம்.

source: License-Expression
ta: உரிம-வெளிப்பாடு

source: License-File (multiple use)
eo: License-File (plurfoje uzebla)
ru: Лицензия-файл (многократное использование)
ta: உரிம-கோப்பு (பல பயன்பாடு)

source: Each entry is a string representation of the path of a license-related file. The path is located within the project source tree, relative to the project root directory. For details see :pep:`639`.
eo: Ĉiu ero estas signoĉena prezento de la dosierloko de licenco-rilata dosiero. La dosierloko troviĝas en la projekta fontarbo relative al la projekta radika dosierujo. Por detaloj, vidu :pep:`639`.
ru: Каждая запись представляет собой строковое представление пути к файлу, связанному с лицензией. Путь находится в дереве исходных текстов проекта, относительно корневого каталога проекта. Подробности см. в :pep:`639`.
ta: ஒவ்வொரு நுழைவும் உரிமம் தொடர்பான கோப்பின் பாதையின் சரம் பிரதிநிதித்துவமாகும். திட்ட மூல மரத்திற்குள் இந்த பாதை அமைந்துள்ளது, இது திட்ட ரூட் கோப்பகத்துடன் ஒப்பிடும்போது. விவரங்களுக்கு காண்க: PEP: `639`.

source: Classifier (multiple use)
eo: Classifier (plurfoje uzebla)
ja: Classifier (複数回の使用可)
pt_br: Classifier (vários usos)
ru: Classifier (можно использовать несколько раз)
ta: வகைப்படுத்தி (பல பயன்பாடு)

source: Each entry is a string giving a single classification value for the distribution. Classifiers are described in :pep:`301`, and the Python Package Index publishes a dynamic list of `currently defined classifiers <https://pypi.org/classifiers/>`__.
eo: Ĉiu ero estas signoĉeno de unu klasigila valoro por la distribuo. Klasigiloj estas priskribitaj en :pep:`301`, kaj la Python-Pakindekso eldonas dinamikan liston de `aktuale difinitaj klasigiloj <https://pypi.org/classifiers/>`__.
ja: それぞれのエントリは、当該配布物を分類する値をひとつ与える文字列です。分類子については :pep:`301` に記述されていて、The Python Package Index は `現在定義されている分類子 <https://pypi.org/classifiers/>`__ という動的なリストを公開しています。
pt_br: Cada entrada é uma string que fornece um único valor de classificação para a distribuição. Os classificadores são descritos na :pep:`301`, e o Python Package Index publica uma lista dinâmica de `classificadores atualmente definidos <https://pypi.org/classifiers/>`__.
ru: Каждая запись представляет собой строку, дающую одно значение классификации для дистрибутива. Классификаторы описаны в :pep:`301`, а Python Package Index публикует динамический список `определенных в данный момент классификаторов` <https://pypi.org/classifiers/>`__.
ta: ஒவ்வொரு நுழைவும் விநியோகத்திற்கான ஒற்றை வகைப்பாடு மதிப்பைக் கொடுக்கும் ஒரு சரம். வகைப்படுத்திகள் இதில் விவரிக்கப்பட்டுள்ளன: PEP: `301`, மற்றும் பைதான் தொகுப்பு குறியீடு` தற்போது வரையறுக்கப்பட்ட வகைப்படுத்திகள் <https://pypi.org/classifiers/> __ __.

source: The use of ``License ::`` classifiers is deprecated as of Metadata 2.4, use ``License-Expression`` instead. See `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-classifiers>`_.
eo: La uzo de la klasigiloj ``License ::`` estas evitinda ekde Metadatenoj 2.4. Uzu ``License-Expression`` anstataŭe. Vidu `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-classifiers>`_.
ru: Использование классификаторов ``License ::`` устарело начиная с версии Metadata 2.4, вместо них используйте ``License-Expression``. См. `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-classifiers>`_.
ta: `` உரிமம் :: `` வகைப்படுத்துபவர்களின் பயன்பாடு மேனிலை தரவு 2.4 இல் நீக்கப்பட்டது, அதற்கு பதிலாக `` உரிம-வெளிப்பாடு` ஐப் பயன்படுத்தவும். `PEP 639 <https://peps.python.org/pep-0639/#deprecate-license-classifiers>` _ ஐப் பார்க்கவும்.

source: This field may be followed by an environment marker after a semicolon.
eo: Tiu kampo povas esti sekvita per media marko post punktokomo.
ja: このフィールドでは、セミコロンの後に環境指標を続けても構いません。
pt_br: Este campo pode ser seguido por um marcador de ambiente após um ponto e vírgula.
ru: За этим полем может следовать маркер окружения после точки с запятой.
ta: இந்த புலத்தை ஒரு அரைக்காற்புள்ளிக்குப் பிறகு சுற்றுச்சூழல் குறிப்பான் பின்பற்றலாம்.

source: Requires-Dist (multiple use)
eo: Requires-Dist (plurfoje uzebla)
ja: Requires-Dist (複数回の使用可)
pt_br: Requires-Dist (vários usos)
ru: Requires-Dist (можно использовать несколько раз)
ta: தேவைப்படும் (பல பயன்பாடு)

source: The field format specification was relaxed to accept the syntax used by popular publishing tools.
eo: La specifo pri la kampa formo estis malstriktigita por akcepti la sintakson uzatan de popularaj eldoniloj.
ja: フィールドの仕様は、人気のある公開ツール群が用いる構文を許容するように緩められました。
pt_br: A especificação do formato de campo foi relaxada para aceitar a sintaxe usada por ferramentas de publicação populares.
ru: Спецификация формата полей была смягчена, чтобы принять синтаксис, используемый популярными издательскими инструментами.
ta: பிரபலமான வெளியீட்டு கருவிகளால் பயன்படுத்தப்படும் தொடரியல் ஏற்றுக்கொள்ள புல வடிவமைப்பு விவரக்குறிப்பு தளர்த்தப்பட்டது.

source: Each entry contains a string naming some other distutils project required by this distribution.
eo: Ĉiu ero enhavas signoĉenon nomantan alian distutils-projekton postulatan de tiu distribuo.
ja: それぞれのエントリは、この配布物が要求する他の distutils のプロジェクトを名指しする文字列を含みます。
pt_br: Cada entrada contém uma string nomeando algum outro projeto distutils requerido por esta distribuição.
ru: Каждая запись содержит строку с названием другого проекта distutils, необходимого для данного дистрибутива.
ta: ஒவ்வொரு நுழைவுக்கும் இந்த விநியோகத்தால் தேவைப்படும் வேறு சில தொலைதூர திட்டங்களுக்கு பெயரிடும் சரம் உள்ளது.

source: The format of a requirement string contains from one to four parts:
eo: La formo de postulo-signoĉeno enhavas minimume unu, maksimume kvar partojn:
ja: 要求事項を示す文字列のフォーマットは、１個から４個の部分を含みます:
pt_br: O formato de uma string de requisito contém de uma a quatro partes:
ru: Формат строки требований содержит от одной до четырех частей:
ta: ஒரு தேவை சரத்தின் வடிவம் ஒன்று முதல் நான்கு பகுதிகளைக் கொண்டுள்ளது:

source: A project name, in the same format as the ``Name:`` field. The only mandatory part.
eo: Projekta nomo en la sama formo kiel la kampo ``Name:``. La sola deviga parto.
ja: ``Name:`` フィールドと同じフォーマットのプロジェクト名。これだけが必須部分です。
pt_br: Um nome de projeto, no mesmo formato do campo ``Name:``. A única parte obrigatória.
ru: Название проекта в том же формате, что и поле ``Имя:``. Единственная обязательная часть.
ta: ஒரு திட்ட பெயர், `` பெயர்: `` புலம் போன்ற அதே வடிவத்தில். ஒரே கட்டாய பகுதி.

source: A comma-separated list of 'extra' names. These are defined by the required project, referring to specific features which may need extra dependencies. The names MUST conform to the restrictions specified by the ``Provides-Extra:`` field.
eo: Kome disigita listo de nomoj de «ekstraĵoj». Tiuj estas difinitaj de la postulata projekto, por specifaj funkcioj postulantaj ekstrajn dependecojn. La nomoj DEVAS observi la limigojn de la kampo ``Provides-Extra:``.
ja: コンマ区切りの '追加の' 名前のリスト。これらは、追加的な依存先を必要とする特定の機能に応じて、要求されたプロジェクトによって定義されます。この名前は、 ``Provides-Extra:`` フィールドで指定された制約事項に従うものでなければなりません。
pt_br: Uma lista separada por vírgulas de nomes "extras". Estes são definidos pelo projeto requerido, referindo-se a recursos específicos que podem precisar de dependências extras. Os nomes DEVEM estar em conformidade com as restrições especificadas pelo campo ``Provides-Extra:``.
ru: Список "дополнительных" имен, разделенный запятыми. Они определяются требуемым проектом и относятся к конкретным функциям, для которых могут потребоваться дополнительные зависимости. Имена ДОЛЖНЫ соответствовать ограничениям, указанным в поле ``Provides-Extra:``.
ta: 'கூடுதல்' பெயர்களின் கமாவால் பிரிக்கப்பட்ட பட்டியல். இவை தேவையான திட்டத்தால் வரையறுக்கப்படுகின்றன, கூடுதல் சார்புகள் தேவைப்படக்கூடிய குறிப்பிட்ட அம்சங்களைக் குறிக்கின்றன. `` வழங்கும்-எக்ச்ட்ரா: `` புலத்தால் குறிப்பிடப்பட்ட கட்டுப்பாடுகளுக்கு பெயர்கள் இணங்க வேண்டும்.

source: A version specifier. Tools parsing the format should accept optional parentheses around this, but tools generating it should not use parentheses.
eo: Versio-specifilo. Ilo sintakse analizanta la formon akceptu nedevigajn rondajn krampojn ĉirkaŭ tiu, sed ilo generanta ĝin ne uzu rondajn krampojn.
ja: バージョン指定子。この部分をパースするツールはバージョンを囲む括弧を許容しなければならないが、生成する際には括弧を使ってはなりません。
pt_br: Um especificador de versão. As ferramentas que analisam o formato devem aceitar parênteses opcionais em torno disso, mas as ferramentas que o geram não devem usar parênteses.
ru: Спецификатор версии. Инструменты, разбирающие формат, должны принимать необязательные круглые скобки вокруг него, но инструменты, генерирующие его, не должны использовать круглые скобки.
ta: ஒரு பதிப்பு விவரக்குறிப்பு. வடிவமைப்பை பாகுபடுத்தும் கருவிகள் இதைச் சுற்றியுள்ள விருப்ப அடைப்புக்குறிப்புகளை ஏற்க வேண்டும், ஆனால் அதை உருவாக்கும் கருவிகள் அடைப்புக்குறிகளைப் பயன்படுத்தக்கூடாது.

source: An environment marker after a semicolon. This means that the requirement is only needed in the specified conditions.
eo: Media marko post punktokomo. Tio signifas, ke la postulo estas nur efektiva sub la specifitaj kondiĉoj.
ja: セミコロンの後ろに環境マーカ。要求事項が必要となるのが指定された条件の時のみであることを示します。
pt_br: Um marcador de ambiente após um ponto e vírgula. Isso significa que o requisito só é necessário nas condições especificadas.
ru: Маркер окружения после точки с запятой. Это означает, что требование необходимо только в указанных условиях.
ta: அரைக்காற்புள்ளிக்குப் பிறகு ஒரு சுற்றுச்சூழல் குறிப்பான். இதன் பொருள் குறிப்பிட்ட நிபந்தனைகளில் மட்டுமே தேவை தேவைப்படுகிறது.

source: See :pep:`508` for full details of the allowed format.
eo: Vidu :pep:`508` por plenaj detaloj pri la permesataj formoj.
ja: 許容されるフォーマットの詳細については :pep:`508` を見てください。
pt_br: Veja a :pep:`508` para detalhes completos do formato permitido.
ru: Подробную информацию о допустимом формате см. в :pep:`508`.
ta: காண்க: PEP: `508` அனுமதிக்கப்பட்ட வடிவமைப்பின் முழு விவரங்களுக்கு.

source: The project names should correspond to names as found on the `Python Package Index`_.
eo: La projektaj nomoj respondu al nomoj ĉe la `Python-Pakindekso <Python Package Index>`_.
ja: プロジェクト名は、 `Python パッケージインデックス <Python Package Index>`_ に出現する名前に対応していなければなりません。
pt_br: Os nomes dos projetos devem corresponder aos nomes encontrados no `Python Package Index`_.
ru: Имена проектов должны соответствовать именам, найденным в `Python Package Index`_.
ta: திட்ட பெயர்கள் `பைதான் தொகுப்பு குறியீட்டு`_ இல் காணப்படும் பெயர்களுடன் ஒத்திருக்க வேண்டும்.

source: Version specifiers must follow the rules described in :doc:`version-specifiers`.
eo: Versispecifilo devas observi la regulojn en :doc:`version-specifiers`.
ja: バージョン指定子は :doc:`version-specifiers` に記述された規則に従っていなければなりません。
pt_br: Os especificadores de versão devem seguir as regras descritas em :doc:`version-specifiers`.
ru: Спецификаторы версий должны следовать правилам, описанным в :doc:`version-specifiers`.
ta: பதிப்பு விவரக்குறிப்புகள் விவரிக்கப்பட்டுள்ள விதிகளைப் பின்பற்ற வேண்டும்: DOC: `பதிப்பு-விவரிப்பாளர்கள்`.

source: This field specifies the Python version(s) that the distribution is compatible with. Installation tools may look at this when picking which version of a project to install.
eo: Tiu kampo specifas tiu(j)n versio(j)n de Python, kun kiu(j) la distribuo kongruas. Instalilo povas konsideri tion dum elektado de instalota versio de projekto.
ja: このフィールドは、配布物が互換性を持つ Python のバージョン (複数可) を指定します。インストールツールは、プロジェクトのインストールするべきバージョンを選択する時にこのフィールドを参照しても構いません。
pt_br: Este campo especifica a(s) versão(ões) do Python com as quais a distribuição é compatível. As ferramentas de instalação podem observar isso ao escolher qual versão de um projeto instalar.
ru: В этом поле указывается версия(и) Python, с которой(ыми) совместим(ы) дистрибутив. Утилиты установки могут учитывать это поле при выборе версии проекта для установки.
ta: இந்த புலம் வழங்கல் பொருந்தக்கூடிய பைதான் பதிப்பை (களை) குறிப்பிடுகிறது. நிறுவ வேண்டிய திட்டத்தின் எந்த பதிப்பை எடுக்கும்போது நிறுவல் கருவிகள் இதைப் பார்க்கலாம்.

source: The value must be in the format specified in :doc:`version-specifiers`.
eo: La valoro devas observi la formon specifitan en :doc:`version-specifiers`.
ja: 値は、 :doc:`version-specifiers` で指定されたフォーマットでなければなりません。
pt_br: O valor deve estar no formato especificado em :doc:`version-specifiers`.
ru: Значение должно быть в формате, указанном в :doc:`version-specifiers`.
ta: மதிப்பு குறிப்பிடப்பட்ட வடிவத்தில் இருக்க வேண்டும்: DOC: `பதிப்பு-விவரிப்பாளர்கள்`.

source: For example, if a distribution uses :ref:`f-strings <whatsnew36-pep498>` then it may prevent installation on Python < 3.6 by specifying::
eo: Ekzemple, se distribuo uzas :ref:`f-signoĉenon <whatsnew36-pep498>`, ĝi povas malpermesi instaladon sur Python < 3.6 jene::
ja: 例えば、ある配布物が :ref:`f-strings <whatsnew36-pep498>` を使っているなら、次のように指定することで Python < 3.6 上にインストールするのを抑止してもかまいません::
ru: Например, если дистрибутив использует :ref:`f-strings <whatsnew36-pep498>`, то он может предотвратить установку на Python < 3.6, указав::
ta: எடுத்துக்காட்டாக, ஒரு வழங்கல் பயன்படுத்தினால்: ref: `f-strings <whatsnew36-pep498>` பின்னர் இது பைதான் <3.6 இல் நிறுவுவதைத் தடுக்கலாம் ::

source: This field cannot be followed by an environment marker.
eo: Ĉi tiu kampo ne povas esti sekvita de media marko.
ja: このフィールドでは、環境マーカを後ろに付けることはできません。
pt_br: Este campo não pode ser seguido por um marcador de ambiente.
ru: За этим полем не может следовать маркер окружения.
ta: இந்த புலத்தை சுற்றுச்சூழல் குறிப்பானைப் பின்பற்ற முடியாது.

source: Requires-External (multiple use)
eo: Requires-External (plurfoje uzebla)
ja: Requires-External (複数回の使用可)
pt_br: Requires-External (vários usos)
ru: Requires-External (можно использовать несколько раз)
ta: தேவை-எக்ச்டெர்னல் (பல பயன்பாடு)

source: Each entry contains a string describing some dependency in the system that the distribution is to be used. This field is intended to serve as a hint to downstream project maintainers, and has no semantics which are meaningful to the ``distutils`` distribution.
ja: それぞれのエントリは、その配布物が使われるシステムにおける何らかの依存関係を記述する文字列です。このフィールドは、ダウンストリームプロジェクトの維持管理担当者向けにヒントを提供することを意図しており、 ``distutils`` 配布物にとっては何ら意味を持ちません。
pt_br: Cada entrada contém uma string que descreve alguma dependência no sistema de que a distribuição deve ser usada. Este campo tem como objetivo servir como uma dica para os mantenedores do projeto downstream, e não tem semântica que seja significativa para a distribuição ``distutils``.
ru: Каждая запись содержит строку, описывающую некоторую зависимость в системе, в которой будет использоваться дистрибутив. Это поле служит подсказкой для сопровождающих проектов и не имеет семантики, значимой для дистрибутива ``distutils``.
ta: ஒவ்வொரு நுழைவுக்கும் வழங்கல் பயன்படுத்தப்பட வேண்டிய அமைப்பில் சில சார்புநிலையை விவரிக்கும் ஒரு சரம் உள்ளது. இந்த புலம் கீழ்நிலை திட்ட பராமரிப்பாளர்களுக்கு ஒரு குறிப்பாக செயல்படுவதை நோக்கமாகக் கொண்டுள்ளது, மேலும் `` தொலைதூரங்கள்` விநியோகத்திற்கு அர்த்தமுள்ள சொற்பொழிவுகள் இல்லை.

source: The format of a requirement string is a name of an external dependency, optionally followed by a version declaration within parentheses.
eo: La formo de postulo-signoĉeno estas nomo de ekstera dependaĵo, nedevige sekvita de versia deklaro ene de rondaj krampoj.
ja: 要求事項の文字列のフォーマットは外部の依存先の名前で、必須ではありませんが括弧に入れたバージョンの宣言を後ろにつけても構いません。
pt_br: O formato de uma string de requisito é o nome de uma dependência externa, opcionalmente seguido por uma declaração de versão entre parênteses.
ru: Формат строки требований - это имя внешней зависимости, за которым в круглых скобках по желанию следует объявление версии.
ta: ஒரு தேவை சரத்தின் வடிவம் வெளிப்புற சார்புநிலையின் பெயர், விருப்பமாக அடைப்புக்குறிக்குள் ஒரு பதிப்பு அறிவிப்பு.

source: Because they refer to non-Python software releases, version numbers for this field are **not** required to conform to the format specified in the :ref:`Version specifier specification <version-specifiers>`: they should correspond to the version scheme used by the external dependency.
eo: Ĉar tiu kampo temas pri ne-Python-a programa versio, la valoro de tiu kampo *ne* devas observi la formon precizigita en la :ref:`Normo pri versio-specifiloj <version-specifiers>`; ĝi sekvu la versian skemon de la ekstera dependaĵo.
ja: それらは非 Python のソフトウェアリリースを参照するものですので、このフィールドでのバージョン番号は :ref:`バージョン指定子仕様 <version-specifiers>` で指定されたフォーマットに適合することを **要求されていません** : それらは、外部依存関係によって使われるバージョンスキームに対応するべきです。
pt_br: Como eles se referem a lançamentos de software não-Python, os números de versão para este campo **não** são obrigados a estar em conformidade com o formato especificado na :ref:`especificação de especificadores de versão <version-specifiers>`: eles devem corresponder ao esquema de versão usado pela dependência externa.
ru: Поскольку они ссылаются на релизы программного обеспечения, отличного от Python, номера версий в этом поле **не обязаны соответствовать формату, указанному в :ref:`Спецификация спецификатора версии <version-specifiers>`: они должны соответствовать схеме версий, используемой внешней зависимостью.
ta: அவை பைதான் அல்லாத மென்பொருள் வெளியீடுகளைக் குறிப்பிடுவதால், இந்த புலத்திற்கான பதிப்பு எண்கள் ** அல்ல ** இல் குறிப்பிடப்பட்டுள்ள வடிவமைப்பிற்கு இணங்க தேவையில்லை: re: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>`: அவை பதிப்பிற்கு ஒத்ததாக இருக்க வேண்டும் வெளிப்புற சார்பு பயன்படுத்தும் திட்டம்.

source: Notice that there is no particular rule on the strings to be used.
eo: Notu, ke ekzistas neniu speciala regulo pri la uzota signoĉeno.
ja: 使用される文字列に対して特に規則がないという点に注意してください。
pt_br: Observe que não há uma regra específica sobre as strings a serem usadas.
ru: Обратите внимание, что нет никаких особых правил относительно используемых строк.
ta: பயன்படுத்த வேண்டிய சரங்களில் குறிப்பிட்ட விதி எதுவும் இல்லை என்பதைக் கவனியுங்கள்.

source: Project-URL (multiple-use)
eo: Project-URL (plurfoje uzebla)
ja: Project-URL (複数回の使用可)
pt_br: Project-URL (vários usos)
ru: Project-URL (можно использовать несколько раз)
ta: PROJECT-URL (பல பயன்பாடு)

source: A string containing a browsable URL for the project and a label for it, separated by a comma.
eo: Signoĉeno enhavanta alireblan retadreson de la projekto kaj etikedon, apartigitajn de komo.
ja: そのプロジェクトの閲覧可能な URL とラベルを含む文字列をコンマで区切ったもの。
pt_br: Uma string contendo uma URL navegável para o projeto e um rótulo para ele, separados por uma vírgula.
ru: Строка, содержащая просматриваемый URL-адрес проекта и его метку, разделенные запятой.
ta: திட்டத்திற்கான உலாவக்கூடிய முகவரி மற்றும் அதற்கான சிட்டை கொண்ட ஒரு சரம், கமாவால் பிரிக்கப்பட்டுள்ளது.

source: The label is free text limited to 32 characters.
eo: La etikedo estas arbitra teksto limigita al 32 skribsignoj.
ja: このラベルは32 文字以内のフリーテキストです。
pt_br: O rótulo é um texto livre limitado a 32 caracteres.
ru: Этикетка представляет собой свободный текст, ограниченный 32 символами.
ta: சிட்டை இலவச உரை 32 எழுத்துகளுக்கு வரையறுக்கப்பட்டுள்ளது.

source: Starting with :pep:`753`, project metadata consumers (such as the Python Package Index) can use a standard normalization process to discover "well-known" labels, which can then be given special presentations when being rendered for human consumption. See :ref:`well-known-project-urls`.
eo: Ekde :pep:`753`, konsumanto de projektaj metadatenoj (kiel la Python-Pakindekso) povas uzi normigan procedon por trovi «bone konatajn» etikedojn, kiujn oni povas prezenti speciale por homoj. Vidu :ref:`well-known-project-urls`.
ru: Начиная с :pep:`753`, потребители метаданных проекта (такие как Python Package Index) могут использовать стандартный процесс нормализации для обнаружения «известных» меток, которые затем могут быть представлены в особом виде при выводе на экран. См. :ref:`well-known-project-urls`.
ta: தொடங்கி: PEP: `753`, திட்ட மேனிலை தரவு நுகர்வோர் (பைதான் தொகுப்பு குறியீட்டு போன்றவை)" நன்கு அறியப்பட்ட "லேபிள்களைக் கண்டறிய ஒரு நிலையான இயல்பாக்கம் செயல்முறையைப் பயன்படுத்தலாம், பின்னர் மனித நுகர்வுக்காக வழங்கப்படும்போது சிறப்பு விளக்கக்காட்சிகள் வழங்கப்படலாம். காண்க: ref: `நன்கு அறியப்பட்ட-திட்ட-urls`.

source: Provides-Extra (multiple use)
eo: Provides-Extra (plurfoje uzebla)
ja: Provides-Extra (複数回の使用可)
pt_br: Provides-Extra (vários usos)
ru: Provides-Extra (можно использовать несколько раз)
ta: வழங்குகிறது-எக்ச்ட்ரா (பல பயன்பாடு)
