Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Look at the :doc:`guides </guides/index>` on this site for more advanced practical information, or the :doc:`discussions </discussions/index>` for explanations and background on specific topics.
eo: Legu la :doc:`gvidilojn </guides/index>` ĉe ĉi tiu retejo por pli komplikaj praktikaj informoj aŭ la :doc:`diskutojn </discussions/index>` por klarigoj kaj fonaj informoj pri specifaj temoj.
ja: もっと先進的な実際上の情報についてはこのサイトの :doc:`説明文書群 </guides/index>` を、あるいは、特定の話題の説明や背景については :doc:`議論 </discussions/index>` を見てください。
ru: Более подробную практическую информацию можно найти в :doc:`guides </guides/index>` на этом сайте или в :doc:`discussions </discussions/index>` для объяснений и справочной информации по конкретным темам.
ta: மேலும் மேம்பட்ட நடைமுறை தகவல்களுக்காக இந்த தளத்தில் `வழிகாட்டிகள் </வழிகாட்டிகள்/குறியீட்டு>` ஐப் பாருங்கள்: குறிப்பிட்ட தலைப்புகளில் விளக்கங்கள் மற்றும் பின்னணிக்கு: டாக்: `விவாதங்கள் </கலந்துரையாடல்கள்/குறியீட்டு>`.

source: Consider packaging tools that provide a single command-line interface for project management and packaging, such as :ref:`hatch`, :ref:`flit`, :ref:`pdm`, and :ref:`poetry`.
eo: Konsideru pakadan ilon disponigantan unu komandlinian fasadon por projektadministrado kaj pakado, kiel ekzemple :ref:`hatch`, :ref:`flit`, :ref:`pdm` kaj :ref:`poetry`.
ja: :ref:`hatch` ・ :ref:`flit` ・ :ref:`pdm` ・ :ref:`poetry` のように、単一のコマンドラインインタフェースでプロジェクト管理もパッケージングもできるパッケージングツールについて検討しましょう。
pt_br: Considere as ferramentas de empacotamento que fornecem uma única interface de linha de comando para gerenciamento e empacotamento de projetos, como :ref:`hatch`, :ref:`flit`, :ref:`pdm` e :ref:`poetry`.
ru: Рассмотрите инструменты для упаковки, которые предоставляют единый интерфейс командной строки для управления проектом и упаковки, такие как :ref:`hatch`, :ref:`flit`, :ref:`pdm` и :ref:`poetry`.
ta: திட்ட மேலாண்மை மற்றும் பேக்கேசிங்கிற்கான ஒற்றை கட்டளை-வரி இடைமுகத்தை வழங்கும் பேக்கேசிங் கருவிகளைக் கவனியுங்கள், அதாவது: ref: `அட்ச்`,: ref:` ஃபிளிட்`,: ref: `PDM`, மற்றும்: ref:` கவிதை`.

source: Notes
eo: Notoj
ja: ノート
pt_br: Notas
ru: Примечания
ta: குறிப்புகள்

source: Technically, you can also create Python packages without an ``__init__.py`` file, but those are called :doc:`namespace packages </guides/packaging-namespace-packages>` and considered an **advanced topic** (not covered in this tutorial). If you are only getting started with Python packaging, it is recommended to stick with *regular packages* and ``__init__.py`` (even if the file is empty).
eo: Teĥnike, vi ankaŭ povas krei Python-pakon sen dosiero ``__init__.py``, sed tia pako nomiĝas :doc:`nomspaca pako </guides/packaging-namespace-packages>` kaj estas **altnivelaĵo** (ne pridiskutata en ĉi tiu lernilo). Se vi estas komencanto pri Python-pakado, recomendate estas nur uzi *ordinarajn pakojn* kaj ``__init__.py`` (eĉ se tiu dosiero estas malplena).
ja: ``__init__.py`` ファイルなしの Python パッケージを作ることも技術的には可能ですが、そのようなものは :doc:`名前空間パッケージ </guides/packaging-namespace-packages>` と呼ばれるもので、 (このチュートリアルでは取り扱わない) **先進的な話題** であると見做されています。Pythonのパッケージングについてやり始めたばかりなのであれば、 *通常のパッケージ* と (空のファイルだとしても) ``__init__.py`` から離れないことをお薦めします。
ru: Технически вы также можете создать Python пакеты без файла ``__init__.py``, но они называются :doc:`namespace Package </guides/packaging-namespace-packages>` и считаются **продвинутой темой** (не охваченной этим учебником). Если вы только начинаете с Python упаковки, рекомендуется придерживаться *регулярных пакетов* и ``__init__.py`` (даже если файл пуст).
ta: தொழில்நுட்ப ரீதியாக, நீங்கள் ஒரு `` __init __. Py`` கோப்பு இல்லாமல் பைதான் தொகுப்புகளையும் உருவாக்கலாம், ஆனால் அவை அழைக்கப்படுகின்றன: DOC: `பெயர்வெளி தொகுப்புகள் </வழிகாட்டிகள்/பேக்கேசிங்-பெயர்ச்பேச்-பேக்கேச்கள்>` மற்றும் ** மேம்பட்ட தலைப்பாக கருதப்படுகிறது ** (இந்த டூட்டோரியலில் மறைக்கப்படவில்லை). நீங்கள் பைதான் பேக்கேசிங் மூலம் மட்டுமே தொடங்கினால், * வழக்கமான தொகுப்புகள் * மற்றும் `__init __. பை`` (கோப்பு காலியாக இருந்தாலும் கூட) ஒட்டிக்கொள்ள பரிந்துரைக்கப்படுகிறது.

source: Translating the guide
eo: Traduki ĉi tiun gvidilon
ja: ガイド文書を翻訳する
ru: Перевод руководства

source: Supporting downstream packaging
eo: Subteni pakadon far malsupruloj
ja: 下流のパッケージングをサポートする
ru: Поддержка последующей упаковки

source: Draft
eo: Malneto
ja: ドラフト
ru: Черновик

source: While PyPI and the Python packaging tools such as :ref:`pip` are the primary means of distributing Python packages, they are also often made available as part of other packaging ecosystems. These repackaging efforts are collectively called *downstream* packaging (your own efforts are called *upstream* packaging), and include such projects as Linux distributions, Conda, Homebrew and MacPorts. They generally aim to provide improved support for use cases that cannot be handled via Python packaging tools alone, such as native integration with a specific operating system, or assured compatibility with specific versions of non-Python software.
eo: Kvankam PyPI kaj la Python-pakiloj kiel :ref:`pip` estas la ĉefrimedoj por distribui Python-pakojn, Python-pakoj ankaŭ ofte estas parto de aliaj pakadaj ekosistemoj. Tiaj repakadaj klopodoj kolektive nomiĝas *malsuprula* pakado (viaj propraj klopodoj nomiĝas *suprula* pakado), kaj inkluzivas interalie Linux-distribuojn, Conda, Homebrew kaj MacPorts. Ili ĝenerale celas pli bone subteni tiajn uzkazojn, kiajn Python-pakiloj sole ne povas subteni, kiel ekzemple indiĝenan integriĝon kun iu mastruma sistemo, aŭ certan kongruecon kun iu versio de ne-Python-a programo.
ja: PyPI および :ref:`pip` のような Python のパッケージングツールは、Python パッケージを配布する主要な手段ですが、その一方で、しばしば他のパッケージングエコシステムの一部として利用可能にされています。これらの再パッケージングの努力は、*ダウンストリーム* パッケージングと総称され (対して元の方は *アップストリーム* パッケージングと総称されます)、 Linux ディストロ・Conda・Homebrew・MacPorts といったプロジェクトが (訳註：ダウンストリームパッケージングに) 該当します。これらは、一般的には、 Python パッケージングツール単独では取り扱えないようなユースケースをよりよくサポートすること、例えば、特定のオペレーティングシステムとの間でネイティブな統合をすることや、非 Python ソフトウェアの特定のバージョンとの互換性を保証することを目指しています。
ru: Хотя PyPI и инструменты для упаковки Python, такие как :ref:`pip`, являются основными средствами распространения пакетов Python, они также часто становятся доступными в рамках других экосистем упаковки. Эти усилия по переупаковке в совокупности называются *downstream* упаковкой (ваши собственные усилия называются *upstream* упаковкой), и включают такие проекты, как дистрибутивы Linux, Conda, Homebrew и MacPorts. Как правило, они направлены на улучшение поддержки тех случаев, которые не могут быть решены только средствами упаковки Python, например, интеграция с конкретной операционной системой или обеспечение совместимости с определенными версиями программ, не относящихся к Python.

source: This discussion attempts to explain how downstream packaging is usually done, and what additional challenges downstream packagers typically face. It aims to provide some optional guidelines that project maintainers may choose to follow which help make downstream packaging *significantly* easier (without imposing any major maintenance hassles on the upstream project). Note that this is not an all-or-nothing proposal — anything that upstream maintainers can do is useful, even if it's only a small part. Downstream maintainers are also willing to prepare patches to resolve these issues. Having these patches merged can be very helpful, since it removes the need for different downstreams to carry and keep rebasing the same patches, and the risk of applying inconsistent solutions to the same problem.
eo: Ĉi tiu diskuto provas klarigi, kiel malsuprula pakado kutime funkcias kaj kiajn problemojn alfrontas malsupraj pakantoj. Ĝi celas disponigi kelkajn laŭvolajn gvidnormojn por mastrumantoj de projektoj por *pliege* faciligi malsuprulan pakadon (sen grava malfaciligo de la suprula projekto). Notu, ke tio ne estas ĉioma-aŭ-nenioma – utilas io ajn, kion suprula mastrumanto povas fari, eĉ se ĝi estas nur malgranda parto. Malsuprulaj mastrumantoj ankaŭ volas prepari flikojn por solvi tiajn problemojn. Eĉ kelkaj el tiaj flikoj estas tre utilaj, ĉar diversaj malsupruloj ne plu bezonas alporti kaj rebazigi la samajn flikojn aŭ solvi la saman problemon multfoje.
ja: この議論では、ダウンストリームパッケージングが通常どのように行われるのか、および、ダウンストリームパッケージングが直面する追加的なチャレンジがどのようなものであるかを説明することを試みます。 (アップストリームプロジェクトを保守する上で何らかの大きな追加作業を招来しない範囲で) ダウンストリームパッケージングを *劇的に* 簡単なものにするような、プロジェクトの保守者が追随することを選択してもよいいくつかの選択可能なガイドラインを提供することを目指しています。これが全部採用するかまったく採用しないかという提案ではないことを銘記してください -- アップストリーム側の保守者が為し得ることは、たとえそれが小さな部分だけだったとしても、すべて役に立ちます。ダウンストリーム側の保守者もこれらの問題を解決するためのパッチを提供することに意欲的です。他のダウンストリーム群がパッチを作成してリベースし続ける必要を取り除くことや、同じ問題に対して一貫性のない解決策を適用するリスクを取り除くことができるので、このようなパッチをマージすることは非常に助けになります。
ru: В этом обсуждении мы попытаемся объяснить, как обычно выполняется последующая упаковка, и с какими дополнительными проблемами обычно сталкиваются разработчики последующей упаковки. Цель обсуждения - предоставить некоторые необязательные рекомендации, которым могут следовать сопровождающие проекта, чтобы облегчить *значительно* процесс последующей упаковки (не налагая при этом никаких серьезных проблем с обслуживанием на upstream-проект). Обратите внимание, что это не предложение "все или ничего" - все, что могут сделать сопровождающие upstream, будет полезно, даже если это лишь малая часть. Нисходящие сопровождающие также готовы подготовить патчи для решения этих проблем. Слияние этих патчей может быть очень полезным, так как это избавит разные нисходящие потоки от необходимости нести и постоянно переиздавать одни и те же патчи, а также от риска применения непоследовательных решений одной и той же проблемы.

source: Establishing a good relationship between software maintainers and downstream packagers can bring mutual benefits. Downstreams are often willing to share their experience, time and hardware to improve your package. They are sometimes in a better position to see how your package is used in practice, and to provide information about its relationships with other packages that would otherwise require significant effort to obtain. Packagers can often find bugs before your users hit them in production, provide bug reports of good quality, and supply patches whenever they can. For example, they are regularly active in ensuring the packages they redistribute are updated for any compatibility issues that arise when a new Python version is released.
eo: Bonaj rilatoj inter programomastrumantoj kaj malsupraj pakantoj povas helpi unu la aliajn. Malsupruloj ofte volonte donacas siajn sperton, tempon kaj aparatojn por plibonigi vian pakon. Ili fojfoje pli bone scias, kiel via pako uziĝas praktike kaj pri la rilatoj kun aliaj pakoj; ofte ne facilas akiri tiajn informojn alimaniere. Pakantoj ofte povas trovi cimon antaŭ ol la uzantoj trafus ĝin praktike; pakantoj bone raportas cimojn kaj disdonas flikaĵojn tiam ajn kiam eblas. Ekzemple, ili aktive certigas, ke la redistribuataj pakoj estas ĝisdatigitaj kontraŭ problemoj pri kongrueco, kiam nova versio de Python eldoniĝas.
ja: ソフトウェアの保守者達とダウンストリームのパッケージ作業者の間の良い関係を確立することは、相互に利益をもたらします。ダウンストリーム側は、しばしば、パッケージを改良するために彼らの経験・時間・ハードウェアを共有したいと望み、そうしなければ獲得するのに多大な労力を必要とする他パッケージとの関係について情報を提供したいと望んでいます。パッケージ作業者は、しばしば、プロダクションレベルになった後でユーザがそのバグを踏むよりも前に、高品質のバグレポートを提供し、可能な時ならいつでもパッチを供給します。例えば、彼らは、新しい Python のバージョンがリリースされた時に起きる互換性問題のいずれについても、彼らが再配布するパッケージがアップデートされていることを確実にすることに恒常的に活発です。
ru: Установление хороших отношений между разработчиками программного обеспечения и разработчиками пакетов может принести взаимную выгоду. Поставщики часто готовы поделиться своим опытом, временем и оборудованием для улучшения вашего пакета. Иногда они лучше видят, как ваш пакет используется на практике, и могут предоставить информацию о его связях с другими пакетами, получение которой в противном случае потребовало бы значительных усилий. Упаковщики часто могут найти ошибки до того, как ваши пользователи начнут их использовать в производстве, предоставляют отчеты об ошибках хорошего качества и поставляют исправления, когда это возможно. Например, они регулярно следят за тем, чтобы пакеты, которые они распространяют, обновлялись для решения проблем совместимости, возникающих при выходе новой версии Python.

source: Please note that downstream builds include not only binary redistribution, but also source builds done on user systems (in source-first distributions such as Gentoo Linux, for example).
eo: Bonvolu noti, ke malsuprulaj konstruj inkluzivas ne nur duuman redistribuadon sed ankaŭ konstruojn el fonto sur sistemo de uzanto (en fonto-centra distribuo kiel Gentoo Linux, ekzemple).
ja: ダウンストリームのビルドには、バイナリ形式での再配布だけでなく、 (例えば、Gentoo Linux のようなソースコードありきのディストロで) ユーザ側のシステムで行われるソースビルドも含まれることを銘記してください。
ru: Обратите внимание, что последующие сборки включают в себя не только распространение бинарных файлов, но и сборки исходного кода на пользовательских системах (в дистрибутивах с исходным кодом, таких как Gentoo Linux, например).

source: Why?
eo: Kial?
ja: なぜ？
ru: Почему?

source: Pyproject Metadata Key
eo: Pyproject-Metadatena Ŝlosilo
ja: Pyproject のメタデータキー
ru: Ключ метаданных Pyproject

source: :ref:`devpi`
ru: :ссылка:`devpi`

source: :ref:`simpleindex`
ru: : ссылка:`simpleindex

source: :ref:`pypiprivate`
ru: :ссылка:`pypiprivate`

source: :ref:`pypicloud`
ru: :ссылка:`pypicloud`

source: :ref:`pywharf`
ru: :ссылка:`pywharf`

source: :ref:`pip2pi`
ru: :ссылка:`pip2pi`

source: :ref:`bandersnatch`
ru: :ссылка:`bandersnatch`

source: :ref:`Flit`,
ru: :ссылка:`Flit`,

source: :doc:`nox <nox:index>`,
ru: : документ:`nox <nox: индекс>`,

source: :ref:`PDM`,
ru: :ссылка:`PDM`,

source: Setuptools
ru: Инструменты настройки

source: :gh:`GitHub <wolever/pip2pi>` | `PyPI <https://pypi.org/project/pip2pi/>`__
ru: :gh:`GitHub <волевой/pip2pi>` | `PyPI <https://pypi.org/project/pip2pi/>`__

source: :gh:`PEX <pantsbuild/pex#user-content-pex>` (Python EXecutable)
ru: :gh:`PEX <pantsbuild/pex#user-content-pex>` (исполняемый файл Python)

source: Name
eo: Nomo
pt_br: Nome
ru: Имя

source: Version
eo: Versio
pt_br: Versão
ru: Версия

source: Summary
ru: Краткое описание

source: ``os_name``
ja: ``OS の名称 <os_name>``
ru: ``ос_название``

source: ``sys_platform``
ru: ``системная платформа``

source: :py:func:`platform.python_implementation()`
ru: :py:func:`платформа.python_имплементация()`

source: :py:func:`platform.release()`
ru: :py:func:`платформа. релиз()`

source: ``python_version``
ru: ``python_версия``

source: ``python_full_version``
ru: ``python_полная_версия``

source: :py:func:`platform.python_version()`
ru: :py:func:`платформа. python_версия()`

source: :py:data:`sys.implementation.name <sys.implementation>`
ru: :py: данные:`sys.имплементация. название <sys.имплементация>`

source: The current standard is the future-proof :file:`manylinux_{x}_{y}` standard. It defines tags of the form :file:`manylinux_{x}_{y}_{arch}`, where ``x`` and ``y`` are glibc major and minor versions supported (e.g. ``manylinux_2_24_xxx`` should work on any distro using glibc 2.24+), and ``arch`` is the architecture, matching the value of :py:func:`sysconfig.get_platform()` on the system as in the "simple" form above.
eo: La aktuala normo estas la estontece sekura normo :file:`manylinux_{x}_{y}`. Ĝi difinas etikedojn de la formo :file:`manylinux_{x}_{y}_{arch}`, en kiu ``x`` kaj ``y`` estas la subtenataj maĵoraj kaj minoraj versioj de glibc (ekzemple ``manylinux_2_24_xxx`` funkciu sur ajna distribuo uzanta glibc 2.24+), kaj ``arch`` estas la arĥitekturo, egalante la valoron de :py:func:`sysconfig.get_platform()` sur la sistemo laŭ la ĉi-supra «simpla» formo.
ru: Текущий стандарт - это защищенный от будущего стандарт :file:`manylinux_{x}_{y}`. Он определяет теги вида :file:`manylinux_{x}_{y}_{arch}`, где ``x`` и ``y`` - поддерживаемые версии glibc major и minor (например, ``manylinux_2_24_xxx`` должен работать на любом дистрибутиве, использующем glibc 2.24+), а ``arch`` - архитектура, соответствующая значению :py:func:`sysconfig.get_platform()` на системе, как в "простой" форме выше.

source: macOS uses the ``macosx`` family of tags (the ``x`` suffix is a historical artefact of Apple's official macOS naming scheme). The schema for compatibility tags is :file:`macosx_{x}_{y}_{arch}`, indicating that the wheel is compatible with macOS ``x.y`` or later on the architecture ``arch``.
eo: macOS uzas la etikedo-familion ``macosx`` (la sufikso ``x`` estas pro la oficiala nomskemo de Apple). La skemo de etikedoj pri kongrueco estas :file:`macosx_{x}_{y}_{arch}`, indikante, ke la wheel kongruas kun macOS de versio ``x.y`` aŭ pli nova sur la arĥitekturo ``arch``.
ru: В macOS используется семейство тегов ``macosx`` (суффикс ``x`` является историческим артефактом официальной схемы именования macOS от Apple). Схема тегов совместимости - :file:`macosx_{x}_{y}_{arch}`, указывающая на то, что колесо совместимо с macOS ``x.y`` или более поздними версиями на архитектуре ``arch``.

source: The values of ``x`` and ``y`` correspond to the major and minor version number of the macOS release, respectively. They must both be positive integers, with the ``x`` value being ``>= 10``. The version number always includes a major *and* minor version, even if Apple's official version numbering only refers to the major value. For example, ``macosx_11_0_arm64`` indicates compatibility with macOS 11 or later.
eo: La valoroj de ``x`` kaj ``y`` respondas al la maĵora kaj minora versio-numeroj de macOS respektive. Ili ambaŭ devas esti pozitivaj entjeroj, kaj ``x`` devas esti ne malpli granda ol ``10``. La versio-numero ĉiam inkluzivas *kaj* maĵoran *kaj* minoran versiojn, eĉ se oficiala versio de Apple nur uzas la maĵoran numeron. Ekzemple, ``macosx_11_0_arm64`` indikas kongruecon kun macOS 11 aŭ pli nova.
ru: Значения ``x`` и ``y`` соответствуют мажорному и минорному номеру версии выпуска macOS, соответственно. Оба они должны быть положительными целыми числами, причем значение ``x`` должно быть ``>= 10``. Номер версии всегда включает в себя мажорную *и* минорную версии, даже если официальная нумерация версий Apple ссылается только на мажорное значение. Например, ``macosx_11_0_arm64`` указывает на совместимость с macOS 11 или более поздней версией.

source: macOS binaries can be compiled for a single architecture, or can include support for multiple architectures in the same binary (sometimes called "fat" binaries). To indicate support for a single architecture, the value of ``arch`` must match the value of :py:func:`platform.machine()` on the system. To indicate support multiple architectures, the ``arch`` tag should be an identifier from the following list that describes the set of supported architectures:
eo: Duumaĵo por macOS povas subteni aŭ nur unu arĥitekturon aŭ plurajn arĥitekturojn (per «grasa» duumaĵo). Por indiki subtenon de unu arĥitekturo, la valoro de ``arch`` devas egali la valoron de :py:func:`platform.machine()` sur la sistemo. Por indiki subtenon de pluraj arĥitekturoj, la etikedo ``arch`` estu identigilo el la jena listo de aroj de subtenataj arĥitekturoj:
ru: Двоичные файлы macOS могут быть скомпилированы для одной архитектуры, а могут включать поддержку нескольких архитектур в одном двоичном файле (иногда их называют "толстыми" двоичными файлами). Чтобы указать на поддержку одной архитектуры, значение ``arch`` должно совпадать со значением :py:func:`platform.machine()` в системе. Чтобы указать на поддержку нескольких архитектур, тег ``arch`` должен быть идентификатором из следующего списка, описывающего набор поддерживаемых архитектур:

source: Architectures supported
eo: Subtenataj arĥitekturoj
ru: Поддержка архитектуры

source: ``universal2``
ru: ``универсальный2``

source: ``universal``
ru: ``универсальный``

source: The minimum supported macOS version may also be constrained by architecture. For example, macOS 11 (Big Sur) was the first release to support arm64. These additional constraints are enforced transparently by the macOS compilation toolchain when building binaries that support multiple architectures.
eo: La minimuma subtenata versio de macOS ankaŭ povas esti limigita de la arĥitekturo. Ekzemple, macOS 11 (Big Sur) estis la unua versio subtenanta arm64. Tiaj limigoj estas aŭtomate devigitaj de la macOS-tradukilaro dum konstruado de duumaĵoj por pluraj arĥitekturoj.
ru: Минимальная поддерживаемая версия macOS также может быть ограничена архитектурой. Например, macOS 11 (Big Sur) была первой версией, поддерживающей arm64. Эти дополнительные ограничения прозрачно применяются инструментальной цепочкой компиляции macOS при сборке двоичных файлов, поддерживающих несколько архитектур.

source: Android uses the schema :file:`android_{apilevel}_{abi}`, indicating compatibility with the given Android API level or later, on the given ABI. For example, ``android_27_arm64_v8a`` indicates support for API level 27 or later, on ``arm64_v8a`` devices. Android makes no distinction between physical devices and emulated devices.
eo: Android uzas la skemon :file:`android_{apilevel}_{abi}`, indikantan kongruecon kun la donita API-nivelo de Android aŭ pli nova nivelo, sur la donita ABI. Ekzemple, ``android_27_arm64_v8a`` indikas subtenon por API-nivelo 27 aŭ pli nova, sur aparato ``arm64_v8a``. Android ne distingas inter reala aparato kaj imitilo.
ru: Android использует схему :file:`android_{apilevel}_{abi}`, указывающую на совместимость с данным уровнем API Android или более поздним, на данном ABI. Например, ``android_27_arm64_v8a`` указывает на поддержку уровня API 27 или более позднего, на устройствах ``arm64_v8a``. Android не делает различий между физическими и эмулируемыми устройствами.

source: The API level should be a positive integer. This is *not* the same thing as the user-facing Android version. For example, the release known as Android 12 (code named "Snow Cone") uses API level 31 or 32, depending on the specific Android version in use. Android's release documentation contains the `full list of Android versions and their corresponding API levels <https://developer.android.com/tools/releases/platforms>`__.
eo: La API-nivelo estu pozitiva entjero. Tio *ne* egalas la version de Android konata de la uzanto. Ekzemple, la eldono Android 12 (kodnome «Snow Cone») uzas la API-nivelon 31 aŭ 32, depende de la specifa versio de Android. La dokumentaro pri eldonoj de Android inkluzivas la `plenan liston de versioj de Android kaj la respondantaj API-niveloj <https://developer.android.com/tools/releases/platforms>`__.
ru: Уровень API должен быть целым положительным числом. Это *не* то же самое, что версия Android для пользователя. Например, релиз, известный как Android 12 (кодовое название "Snow Cone"), использует уровень API 31 или 32, в зависимости от конкретной используемой версии Android. Полный список версий Android и соответствующих им уровней API содержится в документации по релизам Android <https://developer.android.com/tools/releases/platforms>`__.

source: There are 4 `supported ABIs <https://developer.android.com/ndk/guides/abis>`__. Normalized according to the rules above, they are:
eo: Ekzistas kvar `subtenataj ABI-oj <https://developer.android.com/ndk/guides/abis>`__. Jen la ABI-oj normigitaj laŭ la ĉi-supraj reguloj:
ru: Существует 4 поддерживаемых ABI <https://developer.android.com/ndk/guides/abis>`__. Нормализованные в соответствии с правилами выше, они таковы:
