Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Implications of shared static state and subinterpreters
eo: Implicoj pri komuna statika stato kaj subinterpretiloj
ja: shared static state やサブインタプリタの影響
pt_br: Implicações do estado estático compartilhado e subinterpretadores
ru: Последствия общего статического состояния и субинтерпретаторов
ta: பகிரப்பட்ட நிலையான நிலை மற்றும் துணை விளக்கக்காரர்களின் தாக்கங்கள்

source: Implications of the GIL
eo: Implicoj de la Malloka Interpretila Seruro
ja: GIL の影響
pt_br: Implicações do GIL
ru: Последствия GIL
ta: கிலின் தாக்கங்கள்

source: Memory allocation APIs
eo: Memoro-asignaj API-oj
ja: メモリを割り当てる API 群
pt_br: APIs de alocação de memória
ru: API для распределения памяти
ta: நினைவக ஒதுக்கீடு பநிஇ கள்

source: ABI Compatibility
eo: ABI-Kongrueco
ja: ABI の互換性
pt_br: Compatibilidade da ABI
ru: Совместимость ABI
ta: ABI பொருந்தக்கூடிய தன்மை

source: The CPython C API does not guarantee ABI stability between minor releases (3.2, 3.3, 3.4, etc.). This means that, typically, if you build an extension module against one version of Python, it is only guaranteed to work with the same minor version of Python and not with any other minor versions.
eo: La C API de CPython ne garantias stabilecon de ABI inter minoraj eldonoj (3.2, 3.3, 3.4 ktp). Tio tipe signifas, ke se oni konstruas etendaĵo-modulon por unu versio de Python, do ĝi nur garantiite funkcias por la sama minora versio de Python kaj ne por aliaj minoraj versioj.
ja: CPython の C 言語 API は、マイナーリリース (3.2, 3.3, 3.4 等) 間の ABI の互換性を保証しません。これが意味するところは、典型的には、Python のあるバージョン向けに拡張モジュールをビルドした時にマイナーバージョンまで同じ Python での動作が保証されるだけであって、他のマイナーバージョンについては保証されないということです。
pt_br: A API C do CPython não garante a estabilidade da ABI entre versões secundárias (3.2, 3.3, 3.4, etc.). Isso significa que, normalmente, se você construir um módulo de extensão em uma versão do Python, é garantido que ele funcionará apenas com a mesma versão secundária do Python e não com quaisquer outras versões secundárias.
ru: CPython C API не гарантирует стабильность ABI между минорными версиями (3.2, 3.3, 3.4 и т.д.). Это означает, что, как правило, если вы собираете модуль расширения для одной версии Python, он гарантированно будет работать только с той же минорной версией Python, но не с любыми другими минорными версиями.
ta: சிறிய வெளியீடுகளுக்கு (3.2, 3.3, 3.4, முதலியன) இடையே பநிஇ நிலைத்தன்மைக்கு சிபிதான் சி பநிஇ பொறுப்பு அளிக்காது. இதன் பொருள், பொதுவாக, பைத்தானின் ஒரு பதிப்பிற்கு எதிராக நீட்டிப்பு தொகுதியை நீங்கள் உருவாக்கினால், பைத்தானின் அதே சிறிய பதிப்போடு வேலை செய்வது மட்டுமே பொறுப்பு அளிக்கப்படுகிறது, வேறு எந்த சிறிய பதிப்புகளுடனும் அல்ல.

source: Python 3.2 introduced the Limited API, with is a well-defined subset of Python's C API. The symbols needed for the Limited API form the "Stable ABI" which is guaranteed to be compatible across all Python 3.x versions. Wheels containing extensions built against the stable ABI use the ``abi3`` ABI tag, to reflect that they're compatible with all Python 3.x versions.
ja: Python 3.2 では、Python の C 言語 API のよく定義されたサブセットとして Limited API を導入しました。Limited API が必要とするシンボル群は、Python 3.x のすべてのバージョンを通じて互換性を保つことが保証された "Stable ABI" を形成しています。Stable ABI を使ってビルドされた拡張部分を含む Wheel は、Python 3.x のすべてのバージョンで互換性を保っていることを反映するために ``abi3`` という ABI タグを使用します。
pt_br: Python 3.2 introduziu a API Limitada ("Limited API"), que é um subconjunto bem definido da API C do Python. Os símbolos necessários para a API Limitada formam a "ABI estável", que é garantidamente compatível com todas as versões do Python 3.x. Wheels contendo extensões construídas na ABI estável usam a tag de ABI ``abi3``, para refletir que são compatíveis com todas as versões do Python 3.x.
ru: В Python 3.2 появился Limited API, который представляет собой четко определенное подмножество API Python на языке C. Символы, необходимые для Limited API, образуют "Стабильный ABI", который гарантированно совместим со всеми версиями Python 3.x. Колеса, содержащие расширения, созданные на основе стабильного ABI, используют тег ``abi3`` ABI, чтобы показать, что они совместимы со всеми версиями Python 3.x.
ta: பைதான் 3.2 வரையறுக்கப்பட்ட பநிஇ ஐ அறிமுகப்படுத்தியது, இது பைத்தானின் சி பநிஇ நன்கு வரையறுக்கப்பட்ட துணைக்குழு ஆகும். வரையறுக்கப்பட்ட பநிஇ க்கு தேவையான சின்னங்கள் "நிலையான ABI" ஐ உருவாக்குகின்றன, இது அனைத்து பைதான் 3.x பதிப்புகளிலும் இணக்கமாக இருக்கும் என்று பொறுப்பு அளிக்கப்படுகிறது. நிலையான ஏபிஐக்கு எதிராக கட்டப்பட்ட நீட்டிப்புகளைக் கொண்ட சக்கரங்கள் `` அபி 3`` பநிஇ குறிச்சொல்லைப் பயன்படுத்துகின்றன, அவை அனைத்து பைதான் 3. ஃச் பதிப்புகளுடன் பொருந்தக்கூடியவை என்பதை பிரதிபலிக்க.

source: CPython's :doc:`C API stability<python:c-api/stable>` page provides detailed information about the API / ABI stability guarantees, how to use the Limited API and the exact contents of the "Limited API".
eo: La paĝo de CPython pri :doc:`stabileco de C API <python:c-api/stable>` detalas informojn pri la garantioj de la stabileco de API kaj ABI, kiel uzi la Limigitan API, kaj la ekzakta enhavo de la «Limigita API».
ja: CPython の :doc:`C 言語 API の安定性 <python:c-api/stable>` のページには、 API/ABI の安定性保証、つまり、 Limited API をどのように使うのかや "Limited API" の正確な内容について詳しい情報があります。
pt_br: A página :doc:`Estabilidade da API C <python:c-api/stable>` do CPython fornece informações detalhadas sobre as garantias de estabilidade da API/ABI, como usar a API Limitada e o conteúdo exato da "API Limitada".
ru: Страница CPython :doc:`C API stability<python:c-api/stable>` содержит подробную информацию о гарантиях стабильности API / ABI, о том, как использовать Limited API и о точном содержании "Limited API".
ta: Cpythons: Doc: `C பநிஇ நிலைத்தன்மை <பைதான்: சி-ஏபிஐ / ச்டேபிள்>` பக்கம் பநிஇ / பநிஇ ச்திரத்தன்மை உத்தரவாதங்கள், வரையறுக்கப்பட்ட பநிஇ மற்றும் "வரையறுக்கப்பட்ட பநிஇ" இன் சரியான உள்ளடக்கங்களை எவ்வாறு பயன்படுத்துவது என்பது பற்றிய விரிவான தகவல்களை வழங்குகிறது.

source: Building binary extensions
eo: Konstrui duumajn etendaĵojn
ja: バイナリ拡張をビルドする
pt_br: Construindo extensões binárias
ru: Создание бинарных расширений
ta: பைனரி நீட்டிப்புகளை உருவாக்குதல்

source: FIXME: Cover the build-backends available for building extensions.
eo: FIXME: Diskuti konstruajn malfasadojn por konstrui etendaĵojn.
ja: FIXME: 拡張をビルドする際に利用可能なビルドバックエンドをカバーせよ。
pt_br: CORRIGIR: Cobrir os backends de construção disponíveis para construir extensões.
ru: FIXME: Покройте сборки-бэкенды, доступные для сборки расширений.
ta: Fixme: கட்டிட நீட்டிப்புகளுக்கு கிடைக்கக்கூடிய பில்ட்-பேக்கெண்டுகளை மறைக்கவும்.

source: Building extensions for multiple platforms
eo: Konstrui etendaĵojn por pluraj platformoj
ja: 複数のプラットフォーム向けに拡張モジュールをビルドする
pt_br: Construindo extensões para várias plataformas
ru: Создание расширений для нескольких платформ
ta: பல தளங்களுக்கான நீட்டிப்புகளை உருவாக்குதல்

source: If you plan to distribute your extension, you should provide :term:`wheels <Wheel>` for all the platforms you intend to support. These are usually built on continuous integration (CI) systems. There are tools to help you build highly redistributable binaries from CI; these include :ref:`cibuildwheel` and :ref:`multibuild`.
ja: あなたが自分の書いた拡張モジュールを配布するつもりがあるなら、あたながサポートしようと思うすべてのプラットフォーム向けに :term:`wheels <Wheel>` を準備するべきです。通常はこれらを継続的インテグレーション (CI) システム上でビルドします。:ref:`cibuildwheel` や :ref:`multibuild` のような CI から再配布が非常にやりやすいバイナリをビルドするのを補助するツールの存在が知られています。
pt_br: Se você planeja distribuir sua extensão, você deve fornecer :term:`wheels <Wheel>` para todas as plataformas que pretende oferecer suporte. Geralmente são construídos em sistemas de integração contínua (CI). Existem ferramentas para lhe ajudar a construir binários altamente redistribuíveis de CI; estes incluem :ref:`cibuildwheel` e :ref:`multibuild`.
ru: Если вы планируете распространять свое расширение, вам следует предоставить :term:`wheels <Wheel>` для всех платформ, которые вы собираетесь поддерживать. Обычно они создаются на основе систем непрерывной интеграции (CI). Существуют инструменты, которые помогут вам собрать перераспределяемые двоичные файлы из CI; к ним относятся :ref:`cibuildwheel` и :ref:`multibuild`.
ta: உங்கள் நீட்டிப்பை விநியோகிக்க நீங்கள் திட்டமிட்டால், நீங்கள் வழங்க வேண்டும்: கால: `சக்கரங்கள் <hewhel>` நீங்கள் ஆதரிக்க விரும்பும் அனைத்து தளங்களுக்கும். இவை பொதுவாக தொடர்ச்சியான ஒருங்கிணைப்பு (சிஐ) அமைப்புகளில் கட்டப்பட்டுள்ளன. தொஒ இலிருந்து அதிக மறுபகிர்வு செய்யக்கூடிய இருமங்களை உருவாக்க உதவும் கருவிகள் உள்ளன; இவை பின்வருவனவற்றை உள்ளடக்குகின்றன: ref: `cibuildwheel` மற்றும்: ref:` மல்டிபில்ட்`.

source: For most extensions, you will need to build wheels for all the platforms you intend to support. This means that the number of wheels you need to build is the product of::
eo: Por tipaj etendaĵoj, oni devas konstrui wheel-ojn por ĉiuj subtenataj platformoj. Tio signifas, ke la nombro de konstruendaj wheel-oj estas la jena produto::
ja: ほとんどの拡張部分向けに、すべてのサポートするつもりのあるプラットフォーム用の wheel をビルドする必要があるでしょう。これが意味するところは、ビルドする必要のある wheel 群の数が次のような掛け算になるだろうということです::
pt_br: Para a maioria das extensões, você precisará construir wheels para todas as plataformas que pretende suportar. Isso significa que o número de wheels que você precisa construir é o produto de::
ru: Для большинства расширений вам потребуется создать колеса для всех платформ, которые вы собираетесь поддерживать. Это означает, что количество колес, которые вам нужно построить, складывается из::
ta: பெரும்பாலான நீட்டிப்புகளுக்கு, நீங்கள் ஆதரிக்க விரும்பும் அனைத்து தளங்களுக்கும் சக்கரங்களை உருவாக்க வேண்டும். இதன் பொருள் நீங்கள் உருவாக்க வேண்டிய சக்கரங்களின் எண்ணிக்கை ::

source: Using CPython's :ref:`Stable ABI <cpython-stable-abi>` can help significantly reduce the number of wheels you need to provide, since a single wheel on a platform can be used with all Python minor versions; eliminating one dimension of the matrix. It also removes the need to generate new wheels for each new minor version of Python.
ja: CPython の :ref:`Stable ABI <cpython-stable-abi>` を使うことで、準備する必要のある wheel の数を大いに減らすことに役立つでしょう、というのは、あるプラットフォーム上の単一の wheel が Python のすべてのマイナーバージョンで使える; つまり、マトリクスの次元をひとつ削除することになるからです。さらに、新しいマイナーバージョンの Python が出現するたびに新たに wheel を生成する必要もなくなります。
pt_br: Usar a :ref:`ABI Estável <cpython-stable-abi>` do CPython pode ajudar a reduzir significativamente o número de wheels que você precisa fornecer, já que um único wheel em uma plataforma pode ser usada com todas as versões secundárias do Python; eliminando uma dimensão da matriz. Também elimina a necessidade de gerar novos wheels para cada nova versão secundária do Python.
ru: Использование CPython :ref:`Stable ABI <cpython-stable-abi>` может значительно сократить количество колес, которые вам нужно предоставить, так как одно колесо на платформе может использоваться со всеми минорными версиями Python, устраняя одно измерение матрицы. Это также избавляет от необходимости генерировать новые колеса для каждой новой минорной версии Python.
ta: Cpython ஐப் பயன்படுத்துதல்: ref: `நிலையான அபி <cpython-stable-abi>` நீங்கள் வழங்க வேண்டிய சக்கரங்களின் எண்ணிக்கையை கணிசமாகக் குறைக்க உதவும், ஏனெனில் ஒரு மேடையில் ஒரு சக்கரத்தை அனைத்து பைதான் சிறிய பதிப்புகளிலும் பயன்படுத்தலாம்; மேட்ரிக்சின் ஒரு பரிமாணத்தை நீக்குகிறது. பைத்தானின் ஒவ்வொரு புதிய சிறிய பதிப்பிற்கும் புதிய சக்கரங்களை உருவாக்க வேண்டிய அவசியத்தையும் இது நீக்குகிறது.

source: Binary extensions for Windows
eo: Duumaj etendaĵoj por Windows
ja: Windows 向けのバイナリ拡張
pt_br: Extensões binárias para Windows
ru: Двоичные расширения для Windows
ta: சாளரங்களுக்கான பைனரி நீட்டிப்புகள்

source: Before it is possible to build a binary extension, it is necessary to ensure that you have a suitable compiler available. On Windows, Visual C is used to build the official CPython interpreter, and should be used to build compatible binary extensions. To set up a build environment for binary extensions, install `Visual Studio Community Edition <https://visualstudio.microsoft.com/downloads/>`__ - any recent version is fine.
eo: Antaŭ ol konstrui duuman etendaĵon, oni devas havi taŭgan tradukilon. Sur Windows, la oficiala CPython-interpretilo estis konstruita per Visual C, kaj oni uzu ĝin por konstrui kongruan duuman etendaĵon. Por starigi konstruan medion por duuma etendaĵo, instalu `Visual Studio Community Edition <https://visualstudio.microsoft.com/downloads/>`__ – ajna lastatempa versio taŭgas.
ja: バイナリ拡張をビルドできるようになる前に、適切なコンパイラが利用できるようになっていることを保証しなければなりません。Windows 上でCPython インタプリタをビルドするのに Visual C が使われていますが、互換性のあるバイナリ拡張をビルドする時にも同じコンパイラを使うべきです。バイナリ拡張のためのビルド環境を構築するためには、 `Visual Studio コミュニティエディション <https://visualstudio.microsoft.com/downloads/>`__ をインストールしてください - 最近のバージョンならどれでも構いません。
pt_br: Antes que seja possível construir uma extensão binária, é necessário garantir que você tenha um compilador adequado disponível. No Windows, o Visual C é usado para construir o interpretador oficial do CPython e deve ser usado para construir extensões binárias compatíveis. Para configurar um ambiente de construção para extensões binárias, instale o `Visual Studio Community Edition <https://visualstudio.microsoft.com/downloads/>`__ -- qualquer versão recente já serve.
ru: Прежде чем приступить к созданию бинарного расширения, необходимо убедиться, что у вас есть подходящий компилятор. В Windows для сборки официального интерпретатора CPython используется Visual C, который следует использовать для сборки совместимых бинарных расширений. Чтобы создать среду сборки для бинарных расширений, установите `Visual Studio Community Edition <https://visualstudio.microsoft.com/downloads/>`__ - подойдет любая последняя версия.
ta: பைனரி நீட்டிப்பை உருவாக்குவதற்கு முன், உங்களிடம் பொருத்தமான தொகுப்பி கிடைப்பதை உறுதி செய்வது தேவை. சாளரங்களில், விசுவல் சி அதிகாரப்பூர்வ CPyThon மொழிபெயர்ப்பாளரை உருவாக்க பயன்படுகிறது, மேலும் இணக்கமான பைனரி நீட்டிப்புகளை உருவாக்க பயன்படுத்தப்பட வேண்டும். பைனரி நீட்டிப்புகளுக்கு ஒரு உருவாக்க சூழலை அமைக்க, `விசுவல் ச்டுடியோ சமூக பதிப்பை <https://visualstudio.microsoft.com/downloads/> __ __ - எந்த அண்மைக் கால பதிப்பும் நன்றாக உள்ளது.

source: One caveat: if you use Visual Studio 2019 or later, your extension will depend on an "extra" file, ``VCRUNTIME140_1.dll``, in addition to the ``VCRUNTIME140.dll`` that all previous versions back to 2015 depend on. This will add an extra requirement to using your extension on versions of CPython that do not include this extra file. To avoid this, you can add the compile-time argument ``/d2FH4-``. Recent versions of Python may include this file.
eo: Unu averto: se vi uzas Visual Studio 2019 aŭ pli novan, via etendaĵo dependos de «ekstra» dosiero, ``VCRUNTIME140_1.dll``, kune kun ``VCRUNTIME140.dll``, de kiu ĉiuj antaŭaj versioj ĝis 2015 dependas. Tio estas ekstra postulo por uzi vian etendaĵon kun versioj de CPython ne inkluzivanta la ekstran dosieron. Por eviti tion, vi povas aldoni la tradukilan argumenton ``/d2FH4-``. Novaj versioj de Python eble inkluzivas ĉi tiun dosieron.
ja: 注意: Visual Studio 2019 またはこれ以降のバージョンを使う場合には、あなたの拡張モジュールは、2015 までのそれ以前のバージョンで依存していた ``VCRUNTIME140.dll`` に加えて、"追加的な" ファイルである ``VCRUNTIME140_1.dll`` にも依存するでしょう。この追加のファイルを同梱していないバージョンの CPython 上であなたの拡張モジュールを使う場合には、要求事項が追加されることになります。コンパイル時に引数 ``/d2FH4`` を追加しておくことで、これを避けることができます。最近のバージョンの Python ならこのファイルを同梱しているかもしれません。
pt_br: Uma ressalva: se você usar o Visual Studio 2019 ou posterior, sua extensão dependerá de um arquivo "extra", ``VCRUNTIME140_1.dll``, além do ``VCRUNTIME140.dll`` que todas as versões anteriores de 2015 dependem sobre. Isso adicionará um requisito extra ao uso de sua extensão em versões do CPython que não incluem este arquivo extra. Para evitar isso, você pode adicionar o argumento de tempo de compilação ``/d2FH4-``. Versões recentes do Python podem incluir este arquivo.
ru: Одна оговорка: если вы используете Visual Studio 2019 или более позднюю версию, ваше расширение будет зависеть от "дополнительного" файла, ``VCRUNTIME140_1.dll``, в дополнение к ``VCRUNTIME140.dll``, от которого зависят все предыдущие версии, начиная с 2015 года. Это добавит дополнительные требования к использованию вашего расширения в версиях CPython, которые не включают этот дополнительный файл. Чтобы избежать этого, вы можете добавить аргумент времени компиляции ``/d2FH4-``. Последние версии Python могут включать этот файл.
ta: ஒரு எச்சரிக்கை: நீங்கள் விசுவல் ச்டுடியோ 2019 அல்லது அதற்குப் பிறகு பயன்படுத்தினால், உங்கள் நீட்டிப்பு ஒரு "கூடுதல்" கோப்பைப் பொறுத்தது, `` vcruntime140_1.dll``, `` vcruntime140.dll`` உடன் கூடுதலாக 2015 க்கு முந்தைய அனைத்து பதிப்புகளும் சார்ந்துள்ளது ஆன். இந்த கூடுதல் கோப்பை சேர்க்காத CPyThon இன் பதிப்புகளில் உங்கள் நீட்டிப்பைப் பயன்படுத்துவதற்கு இது கூடுதல் தேவையைச் சேர்க்கும். இதைத் தவிர்க்க, நீங்கள் தொகுக்கும் நேர வாதத்தை ``/d2fh4 -`` சேர்க்கலாம். பைத்தானின் அண்மைக் கால பதிப்புகளில் இந்த கோப்பை உள்ளடக்கியிருக்கலாம்.

source: Building for Python prior to 3.5 is discouraged, because older versions of Visual Studio are no longer available from Microsoft. If you do need to build for older versions, you can set ``DISTUTILS_USE_SDK=1`` and ``MSSdk=1`` to force a the currently activated version of MSVC to be found, and you should exercise care when designing your extension not to malloc/free memory across different libraries, avoid relying on changed data structures, and so on. Tools for generating extension modules usually avoid these things for you.
eo: Ni ne rekomendas konstruadon por versio de Python antaŭ 3.5, ĉar malnova versio de Visual Studio ne plu haveblas de Microsoft. Se oni devas konstrui por malnova versio, oni agordu ``DISTUTILS_USE_SDK=1`` kaj `MSSdk=1`` por uzi la aktuale aktivan version de MSVC, kaj oni zorge fasonu la etendaĵon ne uzante ``malloc``/``free`` el malsamaj bibliotekoj, evitante dependon de ŝanĝitaj datenstrukturoj ktp. Ilo por generado de etendaĵa modulo ofte aŭtomate evitas tion.
ja: Visual Studio の古いバージョンがもはや Microsoft 社から入手できないので、3.5より古いバージョンの Python 向けにビルドすることは推奨されません。どうしても古いバージョン向けにビルドする必要がある場合には、 ``DISTUTILS_USE_SDK=1`` および ``MSSdk=1`` をセットすることで現在も使用可能なバージョンの MSVC が見つかるようにすることと、あなたの拡張モジュールの中でライブラリを跨いでメモリを malloc/free することのないように設計を見直すこと、また、修正されたデータ構造に依存しないようにすることなどが必要です。拡張モジュールを生成するツール群は、通常はこのようなことが起こらないようにしてくれています。
pt_br: Não é recomendável construir para Python antes de 3.5, porque as versões anteriores do Visual Studio não estão mais disponíveis na Microsoft. Se você precisa construir para versões mais antigas, você pode definir ``DISTUTILS_USE_SDK=1`` and ``MSSdk=1`` para forçar uma versão atualmente ativada do MSVC a ser encontrada, e você deve ter cuidado ao projetar sua extensão não alocar/liberar memória em bibliotecas diferentes, evitar depender de estruturas de dados alteradas e assim por diante. Ferramentas para gerar módulos de extensão geralmente evitam essas coisas para você.
ru: Сборка для Python до версии 3.5 не рекомендуется, поскольку старые версии Visual Studio больше не поставляются компанией Microsoft. Если вам все же необходимо собирать для старых версий, вы можете установить ``DISTUTILS_USE_SDK=1`` и ``MSSdk=1`` для принудительного поиска текущей активированной версии MSVC, а также проявить осторожность при разработке расширения, чтобы не расшаривать/свобождать память в разных библиотеках, не полагаться на измененные структуры данных и так далее. Инструменты для генерации модулей расширения обычно позволяют избежать этих проблем.
ta: 3.5 க்கு முன்னர் பைத்தானைக் கட்டுவது ஊக்கமளிக்கிறது, ஏனெனில் விசுவல் ச்டுடியோவின் பழைய பதிப்புகள் மைக்ரோசாப்டிலிருந்து இனி கிடைக்காது. பழைய பதிப்புகளை நீங்கள் உருவாக்க வேண்டும் என்றால், நீங்கள் `` distutils_use_sdk = 1` மற்றும் `` mssdk = 1`` ஆகியவற்றை அமைக்கலாம், தற்போது செயல்படுத்தப்பட்ட MSVC இன் பதிப்பைக் கண்டுபிடிக்கும்படி கட்டாயப்படுத்தலாம், மேலும் உங்கள் நீட்டிப்பை வடிவமைக்கும்போது கவனிப்பைப் பயன்படுத்த வேண்டும் வெவ்வேறு நூலகங்களில் மல்லோக்/இலவச நினைவகத்திற்கு அல்ல, மாற்றப்பட்ட தரவு கட்டமைப்புகளை நம்புவதைத் தவிர்க்கவும், மற்றும் பல. நீட்டிப்பு தொகுதிகளை உருவாக்குவதற்கான கருவிகள் பொதுவாக உங்களுக்காக இந்த விசயங்களைத் தவிர்க்கின்றன.

source: Binary extensions for Linux
eo: Duumaj etendaĵoj por Linux
ja: Linux 向けのバイナリ拡張
pt_br: Extensões binárias para Linux
ru: Двоичные расширения для Linux
ta: லினக்சிற்கான பைனரி நீட்டிப்புகள்

source: Linux binaries must use a sufficiently old glibc to be compatible with older distributions. The `manylinux <https://github.com/pypa/manylinux>`_ Docker images provide a build environment with a glibc old enough to support most current Linux distributions on common architectures.
eo: Linux-duumaĵo devas uzi sufiĉe malnovan ``glibc`` por kongrueco kun malnovaj distribuoj. La Docker-diskokopio por `manylinux <https://github.com/pypa/manylinux>`_ estas konstrua medio kun ``glibc`` sufiĉe malnova por la plejmulto de aktualaj Linux-distribuoj sur oftaj arĥitekturoj.
ja: Linux のバイナリは、古い配布物と互換性を保つために十分に古い glibc を使わなければなりません。 `manylinux <https://github.com/pypa/manylinux>`_ の Docker イメージを使えば、よくあるアーキテクチャのほとんどの現行版 Linux 配布物をサポートするのに十分なほど古い glibc を伴ったビルド環境を準備できるでしょう。
pt_br: Os binários do Linux devem usar uma glibc suficientemente antiga para serem compatíveis com distribuições mais antigas. As imagens Docker do `manylinux <https://github.com/pypa/manylinux>`_ fornecem um ambiente de construção com uma glibc antiga o suficiente para oferecer suporte à maioria das distribuições Linux atuais em arquiteturas comuns.
ru: Для совместимости с более старыми дистрибутивами Linux двоичные файлы должны использовать достаточно старый glibc. Docker-образы `manylinux <https://github.com/pypa/manylinux>`_ предоставляют среду сборки с достаточно старой glibc для поддержки большинства современных дистрибутивов Linux на распространенных архитектурах.
ta: லினக்ச் பைனரிகள் பழைய விநியோகங்களுடன் இணக்கமாக இருக்க போதுமான பழைய GLIBC ஐப் பயன்படுத்த வேண்டும். `மேனிலினக்ச் <https://github.com/pypa/manylinux>` _ கப்பல்துறை படங்கள் பொதுவான கட்டமைப்புகளில் பெரும்பாலான தற்போதைய லினக்ச் விநியோகங்களை ஆதரிக்கும் அளவுக்கு ஒரு GLIBC உடன் உருவாக்கும் சூழலை வழங்குகின்றன.

source: Binary extensions for macOS
eo: Duumaj etendaĵoj por macOS
ja: macOS 向けのバイナリ拡張
pt_br: Extensões binárias para macOS
ru: Двоичные расширения для macOS
ta: MACOS க்கான பைனரி நீட்டிப்புகள்
