Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Ideally, support running your test suite via ``pytest``. pytest_ has many command-line arguments that are truly helpful to downstreams, such as the ability to conveniently deselect tests, rerun flaky tests (via pytest-rerunfailures_), add a timeout to prevent tests from hanging (via pytest-timeout_) or run tests in parallel (via pytest-xdist_). Note that test suites don't need to be *written* with ``pytest`` to be *executed* with ``pytest``: ``pytest`` is able to find and execute almost all test cases that are compatible with the standard library's ``unittest`` test discovery.
eo: Ideale, subtenu ruli testaron per ``pytest``. pytest_ havas multajn komandliniajn argumentojn utilegajn al malsupruloj, ekzemple la kapablojn facile malŝalti testojn, reruli malsukcesemajn testojn (per pytest-rerunfailures_), aŭtomate ĉesigi testojn post iom da tempo (per pytest-timeout_) aŭ ruli testojn paralele (per pytest-xdist_). Notu, ke oni povas *ruli* per ``pytest`` testaron ne *verkitan* per ``pytest``: ``pytest`` povas trovi kaj ruli preskaŭ ĉiajn testojn kongruajn kun la testo-trova meĥanismo de ``unittest`` en la norma biblioteko.
ja: 理想としては、テストスイートを ``pytest``を通じて走らせることをサポートしてください。 pytest_ は、テストを便利に非選択にしたり、当てにならないテストを (pytest-rerunfailures_を通じて) 再実行したり、テストがハングアップしてしまうのを防ぐためのタイムアウトを (pytest-timeout_ を通じて) 追加したり、 (pytest-xdist_ を通じて) テストを並行して走らせたり、といったダウンストリーム側に真に役立つ多くのコマンドライン引数を持っています。テストスイートが ``pytest`` と一緒に *書かれている* ことや ``pytest`` と一緒に *実行される* 必要はないことを覚えておいてください: ``pytest`` は、標準ライブラリの ``unittest`` テスト探索と互換性のあるほぼ全てのテストケースを探索して実行することができます。

source: Aim for stable releases
eo: Celi stabilajn eldonojn
ja: 安定版リリースの目的

source: putting a new version in the stable channel early,
eo: frue meti novan version en la stabilan kanalon,
ja: 新しいバージョンをステーブルチャンネルに早期に送り、

source: adding patches to the version currently published,
eo: fliki la aktualan eldonitan version,
ja: その時点で公開されているバージョンにパッチを追加し、

source: or even downgrading the stable channel to an earlier release.
eo: aŭ eĉ malĝisdatigi la stabilan kanalon al pli malnova eldono.
ja: あるいは、ステーブルチャンネルを以前のリリースへとダウングレードさえも行う。

source: Each of these options involves certain risks and a certain amount of work, and packagers needs to weigh them to determine the course of action.
eo: Ĉiu el tiuj opcioj havas riskojn kaj farendaĵojn. Pakanto devas pesi ilin por determini tion, kio oni faru.
ja: これらのオプションは、それぞれ、それなりのリスクとそれなりの作業量を伴うものであり、パッケージ作業者はアクションの方向性を決定するために重み付けを行う必要があります。

source: There are some things that upstreams can do to tailor their workflow to stable release channels. These actions often are beneficial to the package's users as well. Some specific suggestions are:
eo: Jen kelkaĵoj, kiujn supruloj povas fari, por ebligi stabilajn eldonkanalojn (tiaĵoj ofte utilas ankaŭ por la uzantoj de la pako):
ja: ステーブルリリースチャンネル向けのワークフローを調整するためにアップストリーム側ができることがいくつかあります。これらのアクションは、しばしば、パッケージのユーザにも恩恵を与えます。いくつかの具体的な示唆が続きます:

source: Adjust the release frequency to the rate of code changes. Packages that are released rarely often bring significant changes with every release, and a higher risk of accidental regressions.
eo: Adaptu la oftecon de eldonado al la rapido de kodŝanĝoj. Pako malofte eldonata povas enhavi po multaj ŝanĝoj por ĉiu eldono kaj tial pliigas la riskon de regresoj.
ja: リリースの頻度をコード変更の割合に適合させましょう。稀にしかリリースされないパッケージは、しばしば、毎回のリリースに巨大な変更を持ち込み、偶発的な手戻りのリスクを高めます。

source: Avoid mixing bug fixes and new features, if possible. In particular, if there are known bug fixes merged already, consider making a new release before merging feature branches.
eo: Evitu miksi cimriparojn kaj novajn funkciojn laŭeble. Aparte, se ekzistas konataj cimriparoj jam enmetitaj, konsideru novan eldonon antaŭ ol aldoni novajn funkciojn.
ja: 可能であれば、バグ修正と新機能を混ぜないようにしましょう。とりわけ、既知のバグ修正がすでにマージされているなら、機能ブランチをマージする前に新しいリリースを行うことを検討しましょう。

source: Consider making prereleases after major changes, to provide more testing opportunities for users and downstreams willing to opt-in.
eo: Konsideru antaŭeldonojn post gravaj ŝanĝoj, por disponigi pli da ŝancoj pri testado fare de tiuj uzantoj kaj malsupruloj, kiuj volontas.
ja: 大きな変更の後には、ユーザやダウンストリーム側が自発的に参加するような試験の機会をより多く提供するために、プレリリースを作ることを検討しましょう。

source: If your project is subject to very intense development, consider splitting one or more branches that include a more conservative subset of commits, and are released separately. For example, Django_ currently maintains three release branches in addition to main.
eo: Se la projekto estas rapidege evoluigata, konsideru, ĉu disfendi unu aŭ plurajn branĉojn, kiuj inkluzivas pli konservativan subaron de ^anĝoj kaj eldoniĝas aparte. Ekzemple, Django_ nuntempe havas tri branĉojn apud la ĉefbranĉo.
ja: プロジェクトが集中した開発を必要とするのであれば、より保守的なコミットだけを含むブランチを分岐させて、個別にリリースを行うことを検討しましょう。例えば、現状では、 Django_ は main ブランチに加えて３個のリリースブランチを維持しています。

source: Even if you don't wish to maintain additional branches permanently, consider making additional patch releases with minimal changes to the previous version, especially when a security vulnerability is discovered.
eo: Eĉ se vi ne deziras mastrumi pliajn branĉojn daŭre, pripensu pliajn flikajn eldonojn kun minimumaj ŝanĝoj al la antaŭa versio, aparte kiam malsekureco troviĝas.
ja: 追加のブランチを恒常的に維持していくことを望まない場合であってさえ、特にセキュリティ上の脆弱性が発見された時には、以前のバージョンに最低限の変更を加えたパッチリリースを追加することを検討しましょう。

source: Split your changes into focused commits that address one problem at a time, to make it easier to cherry-pick changes to earlier releases when necessary.
eo: Disdividu ŝanĝon en enfokusigitajn modifojn riparantajn po unu problemo, por faciligi elekti modifojn por pli fruaj eldonoj, se tio necesas.
ja: 必要となればそれ以前のリリース用にチェリーピッキングした変更を取り込みやすくなるように、変更は、ある時点でひとつの問題に対処することに焦点を当てたコミットに分割しましょう。

source: A :term:`Project` that is installed for use with a Python interpreter or :term:`Virtual Environment`, as described in the specification :ref:`recording-installed-packages`.
eo: :term:`Projekto <Project>` instalita por uzo kun Python-interpretilo aŭ :term:`Virtuala Medio <Virtual Environment>`, laŭ la normo :ref:`recording-installed-packages`.
ja: :ref:`recording-installed-packages` の仕様の中に記述されている、Python インタープリタまたは :term:`仮想環境 <Virtual Environment>` と一緒に使用するためにインストールされた :term:`プロジェクト <Project>` 。

source: :pep:`639` has specified the way to declare a project's license and paths to license files and other legally required information. This document aims to provide clear guidance how to migrate from the legacy to the standardized way of declaring licenses. Make sure your preferred build backend supports :pep:`639` before trying to apply the newer guidelines.
eo: :pep:`639` precizigis la manieron deklari la licencon de projekto kaj dosierlokojn de licencodosieroj kaj aliajn leĝe postulataj informoj. Ĉi tiu dokumento celas klarigi, kiel migri de la malnova maniero al la normigita maniero deklari licencojn. Certigu, ke via preferata konstrua malfasado subtenas :pep:`639`, antaŭ ol provi la novajn gvidnormojn.
ja: :pep:`639` では、プロジェクトの来船を宣言する方法やライセンスファイルへのパス、そして、その他の法的に要求される情報を仕様化しています。この説明文書は、レガシーなライセンス宣言から標準化されたそれへどのようにして移行するのかに関する明確なガイダンスを提供することを目的としています。より新しいガイダンスを適用しようと試みる前に、好みのビルドバックエンドが :pep:`639` をサポートしていることを確認してください。

source: ``license`` and ``license-files``
eo: ``license`` kaj ``license-files``

source: As per :pep:`639` licenses should be declared with two fields:
eo: Laŭ :pep:`639`, oni deklaru licencon per du kampoj:

source: ``license`` is an :term:`SPDX license expression <License Expression>` consisting of one or more :term:`license identifiers <License Identifier>`.
eo: ``license`` estas :term:`SPDX-licencesprimo <License Expression>` konsistanta el unu aŭ pluraj :term:`licencidentigiloj <License Identifier>`.

source: ``license-files`` is a list of license file glob patterns.
eo: ``license-files`` estas listo de licencodosieraj ``glob``-patroneoj.

source: A previous PEP had specified ``license`` to be a table with a ``file`` or a ``text`` key, this format is now deprecated. Most :term:`build backends<build backend>` now support the new format as shown in the following table.
eo: Antaŭa PEP specifis, ke ``license`` estu tabelo kun ŝlosilo ``file`` aŭ ``text``. Tiu formo estas nun evitinda. La plejparto de :term:`konstruaj malfasadoj<build backend>` nun subtenas la novan formon laŭ la jena tabelo.

source: build backend versions that introduced :pep:`639` support
eo: versioj de konstruaj malfasadoj eksubtenantaj :pep:`639`

source: The new format for ``license`` is a valid :term:`SPDX license expression <License Expression>` consisting of one or more :term:`license identifiers <License Identifier>`. The full license list is available at the `SPDX license list page <spdxlicenselist_>`_. The supported list version is 3.17 or any later compatible one.
eo: La nova formo de ``licence`` estas valida :term:`SPDX-licenco-esprimo <License Expression>` konstistanta el unu aŭ pluraj :term:`licenco-identigiloj <License Identifier>`. La plena listo de licencoj troviĝas ĉe `la retejo de SPDX <spdxlicenselist_>`_. La subtenataj versioj de la listo estas 3.17 aŭ pli novaj.

source: If you get a build error that ``license`` should be a dict/table, your build backend doesn't yet support the new format. See the `above section <license-and-license-files_>`_ for more context. The now deprecated format is `described in PEP 621 <https://peps.python.org/pep-0621/#license>`__.
eo: Se oni ricevas konstrueraron, ke`license`` estu vortaro/tabelo, via konstrua malfasado ankoraŭ ne subtenas la novan formon. Vidu la `ĉi-supran paragrafon <license-and-license-files_>`_ por pli da kunteksto. La nun evitinda formo estas `priskribita en PEP 621 <https://peps.python.org/pep-0621/#license>`__.

source: flit-core `does not yet <flit-issue-735_>`_ support WITH in SPDX license expressions.
eo: flit-core `ankoraŭ ne <flit-issue-735_>`_ subtenas WITH en SPDX-licencesprimoj.

source: Subdirectories in :file:`.dist-info/`
eo: Subdosierujoj en :file:`.dist-info/`

source: Subdirectory name
eo: Nomo de subdosierujo

source: PEP / Standard
eo: PEP / Normo

source: The :file:`.dist-info/sboms/` directory
eo: La dosierujo :file:`.dist-info/sboms/`

source: The ``build-details.json`` file is a standardized file format that provides build-specfic information of a Python installation, such as its version, extension ABI details, and other information that is specific to that particular build of Python.
eo: La dosiero ``build-detaloj.json`` estas norma formo pri konstruo-specifaj informoj de instalo de Python – kiel ekzemple la versio, detaloj pri la ABI de etendaĵo, kaj aliaj informoj specifaj al tiu konstruo de Python.

source: Starting from Python 3.14, a ``build-details.json`` file is installed in the platform-independent standard library directory (``stdlib``, e.g. ``/usr/lib/python3.14/build-details.json``).
eo: Ekde Python 3.14, dosiero ``build-details.json`` instaliĝas en la platformo-sendependa dosierujo de la norma biblioteko (``stdlib``, ekz. ``/usr/lib/python3.14/build-details.json``).

source: Please refer to the :ref:`latest version <build-details-v1.0>` for its specification.
eo: Bonvolu vidi la :ref:`plej novan version <build-details-v1.0>` por la specifo.

source: Changelog
eo: Protokolo de ŝanĝoj

source: Schema
eo: Skemo

source: Initial version, introduced by :pep:`739`.
eo: Unua versio, enkondukita de :pep:`739`.

source: *build-details.json — a static description file with build details of Python installations*
eo: *build-details.json – statika priskriba dosiero kun konstruaj detaloj de Python-instaloj*

source: type
eo: tipo

source: properties
eo: atributoj

source: Schema version.
eo: Versio de skemo.

source: This is a string following the format ``<MAJOR>.<MINOR>``, where ``<MAJOR>`` and ``<MINOR>`` are unpaded numbers and represent the **major** and **minor** components of the version. Versions may be arithmetically compared by intrepreting the version string as a decimal number.
eo: Jen teksto en la formo ``<MAĴORA>.<MINORA>``, en kiu ``<MAĴORA>`` kaj ``<MINORA>`` estas numeroj sen komencaj nuloj, reprezentantajn la komponantojn **major** kaj **minor** de la versio. Oni povas aritmetike kompari versiojn, interpretante la versio-tekston kiel decimalan frakcion kun decimala punkto.

source: For this specification version, this value is constant and **MUST** be ``1.0``.
eo: Por ĉi tiu versio de la normo, la valoro estas konstanta kaj **DEVAS** esti ``1.0``.

source: Future versions of this schema **MUST** use a higher version number. Future versions of this schema **MUST NOT** use the same **major** version component as other schema version unless its specification is deemed backwards-compatible with them — it can't change, or extend, any parts of the current specification in such a way as the semantics of the interpreted data differ, or that data valid under the new specification is invalid under the older specification, with the exception of additional properties (errors caused by ``additionalProperties``).
eo: Estontaj versioj de ĉi tiu skemo **DEVAS** uzi pli grandan versio-numeron. Estontaj versioj de ĉi tiu skemo **DEVAS NE** uzi la saman versio-komponanton **major** kiel alia skemo-versio, se la normo ne estas retrokontrua kun la alia skemo-version — ĝi ne rajtas modifi aŭ atendi ajnan parton de ĉi tiu normo tiel, ke la semantiko de la interpretitaj datenoj diferencas, aŭ se dateno valida laŭ la nova normo ne validas laŭ mal malnova normo, krom pliaj atributoj (eraroj kaŭzitaj de ``additionalProperties``).

source: Base prefix of the Python installation.
eo: Baza prefikso de la Python-instalo.

source: Either an absolute path, or a path relative to directory where this file is contained.
eo: Aŭ absoluta dosierloko, aŭ dosierloko relativa al la dosierujo, en kiu troviĝas ĉi tiu dosiero.

source: examples
eo: ekzemploj

source: The path to the Python interprer of the base installation.
eo: La dosierloko de la Python-interpretilo de la baza instalo.

source: Either an absolute path, or a path relative to ``base_prefix``.
eo: Aŭ absoluta dosierloko aŭ dosierloko relativa al ``base_prefix``.

source: This field **MUST** be present if the installation provides an interpreter executable.
eo: Ĉi tiu kampo **DEVAS** ekzisti, se la instalo provizas interpretilan ruleblaĵon.

source: System platform string.
eo: Teksto pri sistema platformo.

source: This field **SHOULD** be equivalent to ``sysconfig.get_platform()``.
eo: Ĉi tiu kampo **EKVIVALENTU** ``sysconfig.get_platform()``.

source: Object containing details related to the Python language specification.
eo: Objekto enhavanta detalojn pri la normo de la programlingvo Python.

source: String representation the Python language version — a version string consisting only of the *major* and *minor* components.
eo: Teksta prezento de la versio de la programlingvo Python – versio-signiĉeno konsistanta nur el la komponantoj *major* kaj *minor*.

source: This field **SHOULD** be equivalent to ``sysconfig.get_python_version()``.
eo: Ĉi tiu kampo **EKVIVALENTU** ``sysconfig.get_python_version()``.

source: Object in the format of :py:data:`sys.version_info`.
eo: Objekto en la formo de :py:data:`sys.version_info`.

source: This section **SHOULD** be equivalent to :py:data:`sys.version_info`.
eo: Ĉi tiu sekcio **EKVIVALENTU** :py:data:`sys.version_info`.

source: Object containing details related to Python implementation.
eo: Objekto enhavanta detalojn pri la realigo de Python.

source: This section **SHOULD** be equivalent to :py:data:`sys.implementation`. It follows specification defined in PEP 421, meaning that on top of the required keys, implementation-specific keys can also exist, but must be prefixed with an underscore.
eo: Ĉi tiu sekcio **EKVIVALENTU** :py:data:`sys.implementation`. Ĝi obeas la normon PEP 421: alivorte, krom la postulataj ŝlosiloj, ankaŭ realigo-specifaj ŝlosiloj povas ekzisti, se ili havas prefikson de substreko.

source: Lower-case name of the Python implementation.
eo: Minuskla nomo de la realigo de Python.

source: Object in the format of :py:data:`sys.version_info`, containing the implementation version.
eo: Objekto en la formo de :py:data:`sys.version_info`, enhavanta la version de la realigo.

source: Object containing details related to ABI.
eo: Objekto enhavanta detalojn pri la ABI.

source: Build configuration flags, used to calculate the extension suffix.
eo: Konstruadaj agordaj flagoj, por determini la etendaĵan sufikson.

source: The flags **MUST** be defined in the order they appear on the extension suffix.
eo: La flagoj **DEVAS** difiniĝi laŭ la ordo de apero en la etendaĵa sufikso.

source: Suffix used for extensions built against the current implementation version.
eo: Sufikso por etendaĵo uzanta la aktualan version de la realigo.

source: This field **MUST** be present if the Python implementation supports extensions, otherwise this entry will be missing.
eo: Ĉi tiu kampo **DEVAS** ekzisti, se la Python-realigo subtenas etendaĵon; se ne, ĉi tiu ero mankas.

source: Suffix used for extensions built against the stable ABI.
eo: Sufikso uzata por etendaĵoj uzantaj la stabilan ABI.

source: This field **MUST** be present if the Python implementation has a stable ABI extension suffix, otherwise this entry will be missing.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo provizas etendaĵosufikson por stabila ABI; se ne, ĉi tiu sekcio mankas.

source: Valid module suffixes grouped by type.
eo: Validaj modulaj sufiksoj grupigitaj laŭ tipo.

source: This section **MUST** be present if the Python installation supports importing external files, and it **SHOULD** be equivalent to the ``importlib.machinery.*_SUFFIXES`` attributes.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo subtenas importado de ektera dosiero, kaj ĝi **EKVIVALENTU** la atributojn ``importlib.machinery.*_SUFFIXES``.

source: Additionally, if a Python implementation provides extension kinds other than the ones listed on ``importlib.machinery`` module, they **MAY** add a sub-section for them.
eo: Plie, se Python-realigo subtenas specojn de etendaĵoj aliajn ol tiuj, kiuj troviĝas en la modulo ``importlib.machinery``, do subsekcioj por tiuj specoj **POVAS** ankaŭ ekzisti.

source: Object containing details related to the ``libpython`` library.
eo: Objekto enhavanta detalojn pri la biblioteko ``libpython``.

source: This section **MUST** by present if Python installation provides a ``libpython`` library, otherwise this section will be missing.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo provizas bibliotekon ``libpython``; se ne, ĉi tiu sekcio mankas.

source: The path to the dynamic ``libpython`` library.
eo: La dosierloko de la dinamika biblioteko ``libpython``.

source: This field **MUST** be present if the Python installation provides a dynamic ``libpython`` library, otherwise this entry will be missing.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo provizas dinamikan bibliotekon ``libpython``; se ne, ĉi tiu sekcio mankas.

source: The path to the dynamic ``libpython`` library for the stable ABI.
eo: La dosierloko de la dinamika biblioteko ``libpython`` por la stabila ABI.

source: This field **MUST** be present if the Python installation provides a dynamic ``libpython`` library targeting the Stable ABI, otherwise this entry will be missing.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo provizas dinamikan bibliotekon ``libpython`` por la Stabila ABI; se ne, ĉi tiu sekcio mankas.

source: If this key is present ``dynamic`` **MUST** also be set.
eo: Se ĉi tiu ŝlosilo ekzistas, ``dynamic`` **DEVAS** ankaŭ ekzisti.

source: The path to the static ``libpython`` library.
eo: La dosierloko de la statika biblioteko ``libpython``.

source: This field **MUST** be present if the Python installation provides a static ``libpython`` library, otherwise this entry will be missing.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo provizas statikan bibliotekon ``libpython``; se ne, ĉi tiu sekcio mankas.

source: Should extensions built against a dynamic ``libpython`` link to it?
eo: Ĉu etendaĵo konstruita por dinamika ``libpython`` bindiĝi al ĝi?

source: Object containing details related to the Python C API.
eo: Objekto enhavanta detalojn pri la C API de Python.

source: This section **MUST** be present if the Python implementation provides a C API, otherwise this section will be missing.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo provizas C API; se ne, ĉi tiu sekcio mankas.

source: The path to the C API headers.
eo: La dosierloko de la ĉapoj de la C API.

source: The path to the pkg-config definition files.
eo: La dosierloko de la difinodosieroj pkg-config.

source: This field **MUST** be present if the Python implementation provides pkg-config definition files, otherwise this section will be missing.
eo: Ĉi tiu sekcio **DEVAS** ekzisti, se la Python-instalo provizas difinodosierojn pkg-config; se ne, ĉi tiu sekcio mankas.

source: Object containing extra arbitrary data.
eo: Objekto enhavantan ekstrajn arbitrajn datenojn.

source: This is meant to be used as an escape-hatch, to include any relevant data that is not covered by this specification. Implementations may choose what data to provide in this section.
eo: Oni uzu tion por inkluzivi ĉian ajn gravan datenon ne menciitan en ĉi tiu nromo. Realigo povas elekti tiajn informojn, kiaj inkluziviĝos en ĉi tiu sekcio.

source: Text string that is a valid SPDX :term:`license expression <License Expression>`, as specified in :doc:`/specifications/license-expression`.
eo: Signoĉeno, kiu estas valida :term:`SPDX-licencesprimo <License Expression>` laŭ :doc:`/specifications/license-expression`.

source: ``glob`` patterns
eo: Patroneo ``glob``

source: Some PyPA specifications, e.g. :ref:`pyproject.toml's license-files <pyproject-toml-license-files>`, accept certain types of *glob patterns* to match a given string containing wildcards and character ranges against files and directories. This specification defines which patterns are acceptable and how they should be handled.
eo: Kelkaj normoj de PyPA, ekz. :ref:`license-files en pyproject.toml <pyproject-toml-license-files>`, akceptas *``glob``-patroneojn* – signoĉenojn enhavantan ĵokerojn kaj signo-intervalojn, kiujn oni povas kompari kun dosiernomoj kaj dosierlokoj. Ĉi tiu normo difinas la validecon de patroneoj kaj kiel oni pritraktu ilin.

source: Valid glob patterns
eo: Validaj patroneoj ``glob``

source: For PyPA purposes, a *valid glob pattern* MUST be a string matched against filesystem entries as specified below:
eo: Por la celoj de PyPA, *valida ``glob``-patroneo* DEVAS esti signoĉeno, kiun oni povas kompari kun eroj en dosiersistemo, laŭ la jena difino:

source: Path delimiters MUST be the forward slash character (``/``).
eo: Dosierloko-apartigilo DEVAS esti la suprenstreko (``/``).

source: Patterns always refer to *relative paths*, e.g., when used in :file:`pyproject.toml`, patterns should always be relative to the directory containing that file. Therefore the leading slash character MUST NOT be used.
eo: Patroneoj ankaŭ temas pri *relativaj dosierlokoj*. Ekzemple, en :file:`pyproject.toml`, patroneo estas relativa al la dosierujo enhavanta tiun dosieron. Tial, la komenca suprenstreko DEVAS NE ekzisti.

source: Any characters or character sequences not covered by this specification are invalid. Projects MUST NOT use such values. Tools consuming glob patterns SHOULD reject invalid values with an error.
eo: Ajna skribsigno aŭ sinsekvo de skribsignoj ne diskutataj de ĉi tiu specif ne validas. Projekto DEVAS NE uzi tian valoron. Ilo uzanta ``glob``-patroneojn MALAKCEPTU nevalidan valoron, sciigante pri eraro.

source: Tools consuming glob patterns:
eo: Iloj uzantaj ``glob``-patroneoj:

source: Examples of valid glob patterns:
eo: Ekzemploj de validaj ``glob``-patroneoj:
