Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Right: A maintainer uploads the file. Then the maintainer…
eo: Ĝuste: Mastrumanto alŝutas la dosieron. Poste la mastrumanto…
ja: 正：メンテナンス担当者がファイルをアップロードする。それから、メンテナンス担当者は…
pt_br: Certo: A maintainer uploads the file. Then the maintainer…
ru: Правильно: Сопровождающий загружает файл. Затем сопровождающий…
ta: வலது: ஒரு பராமரிப்பாளர் கோப்பை பதிவேற்றுகிறார். பின்னர் பராமரிப்பாளர்…

source: **Headings**
eo: **Titoloj de paragrafoj**
ja: **見出しの付け方**
pt_br: **Títulos**
ru: **Заголовки**
ta: ** தலைப்புகள் **

source: Write headings that use words the reader is searching for. A good way to do this is to have your heading complete an implied question. For example, a reader might want to know *How do I install MyLibrary?* so a good heading might be *Install MyLibrary*.
eo: Verku titolojn uzante tiujn vortojn, kiujn la leganto serĉas. Bona maniero fari tion estas kompletigi implicitan demandon. Ekzemple, leganto eble volas scii: *Kiel mi instalu MiaBiblioteko?* Tiel, bona ebla titolo estas *Instali MiaBiblioteko*.
ja: 見出しには読者が検索で使うような単語を使いましょう。質問の意図に答える形で見出しを書くのは良い方法です。読者が例えば *MyLibraryをインストールするにはどうすれば良いの？* ということを知りたいとすれば、適切な見出しとしては *MyLibraryをインストールするには* のようになるでしょう。
pt_br: Escreva títulos que usem palavras que o leitor esteja procurando. Uma boa maneira de fazer isso é fazer com que o cabeçalho responda a uma pergunta implícita. Por exemplo, um leitor pode querer saber *How do I install MyLibrary?*, de forma que um bom título pode ser *Install MyLibrary*.
ru: Пишите заголовки, в которых используются слова, которые читатель ищет. Хорошим способом сделать это является то, чтобы ваш заголовок завершал подразумеваемый вопрос. Например, читатель может захотеть узнать *Как установить MyLibrary?*, поэтому хорошим заголовком будет *Установить MyLibrary*.
ta: வாசகர் தேடும் சொற்களைப் பயன்படுத்தும் தலைப்புகளை எழுதுங்கள். இதைச் செய்வதற்கான ஒரு சிறந்த வழி, உங்கள் தலைப்பு மறைமுகமான கேள்வியை முடிக்க வேண்டும். எடுத்துக்காட்டாக, ஒரு வாசகர் தெரிந்து கொள்ள விரும்பலாம் *மைலிபரியை எவ்வாறு நிறுவுவது? *எனவே ஒரு நல்ல தலைப்பு *மைலிபரியை நிறுவலாம் *.

source: In section headings, use sentence case. In other words, write headings as you would write a typical sentence.
eo: En paragrafaj titoloj, uzu frazan usklon. Alivorte, skribu titolojn tiel, kiel vi skribus ordinaran frazon.
ja: 見出し部分では通常の文章のように大文字小文字を使いましょう。言い換えるなら、ごく普通の文を書く時のように見出しを書きましょう。
pt_br: Nos cabeçalhos das seções, use letras maiúsculas e minúsculas. Em outras palavras, escreva os cabeçalhos da mesma forma que escreveria uma frase típica.
ru: В заголовках разделов используйте падеж предложения. Другими словами, пишите заголовки так, как вы бы написали обычное предложение.
ta: பிரிவு தலைப்புகளில், வாக்கிய வழக்கைப் பயன்படுத்துங்கள். வேறு வார்த்தைகளில் கூறுவதானால், நீங்கள் ஒரு பொதுவான வாக்கியத்தை எழுதுவதால் தலைப்புகளை எழுதுங்கள்.

source: Wrong: Things You Should Know About Python
eo: Netaŭga: Sciindaĵoj Pri Python
ja: 誤：Pythonについてあなたが知っておくべき事柄 (訳註：日本語には大文字小文字の区別がないので誤例にならないのではないか)
pt_br: Errado: Things You Should Know About Python
ru: Неправильно: Всё, Что Вам Нужно Знать О Python'е
ta: தவறு: பைத்தானைப் பற்றி நீங்கள் தெரிந்து கொள்ள வேண்டிய விசயங்கள்

source: Right: Things you should know about Python
eo: Taŭga: Sciindaĵoj pri Python
ja: 正：Pythonについてあなたが知っておくべき事柄
pt_br: Certo: Things you should know about Python
ru: Правильно: Всё, что вам нужно знать о Python'е
ta: உரிமை: பைத்தானைப் பற்றி நீங்கள் தெரிந்து கொள்ள வேண்டிய விசயங்கள்

source: **Numbers**
eo: **Nombroj**
ja: **数値の書き方**
pt_br: **Números**
ru: **Числа**
ta: ** எண்கள் **

source: In body text, write numbers one through nine as words. For other numbers or numbers in tables, use numerals.
eo: En alineo, skribo la nombrojn unu ĝis naŭ kiel vortojn. Por aliaj nombroj aŭ nombroj en tabeloj, uzu ciferojn.
ja: 地の文では一から九までの数字を単語で書きましょう(訳註：日本語では漢数字にするよりもアラビア数字の方が適切かもしれません)。表の中ではアラビア数字で書きましょう。
pt_br: No corpo do texto, escreva os números de um a nove como palavras. Para outros números ou números nas tabelas, use numerais.
ru: В основном тексте пишите числа от 1 до 9 как слова. Для остальных чисел или чисел в таблицах используйте цифры.
ta: உடல் உரையில், எண்களை ஒன்பது முதல் சொற்களாக எழுதுங்கள். அட்டவணையில் உள்ள பிற எண்கள் அல்லது எண்களுக்கு, எண்களைப் பயன்படுத்துங்கள்.

source: Deploying Python applications
eo: Disponigi Python-programojn
ja: Pythonで書かれたアプリケーションを配置(deploy)する
pt_br: Fazendo deploy de aplicações Python
ru: Развёртывание приложений на Python'е
ta: பைதான் பயன்பாடுகளை வரிசைப்படுத்துதல்

source: Page Status
eo: Stato de la paĝo
ja: ページステイタス
pt_br: Status da página
ru: Статус страницы
ta: பக்க நிலை

source: Incomplete
eo: Nekompleta
ja: 未完了
pt_br: Incompleta
ru: Незавершено
ta: முழுமையற்ற

source: Last Reviewed
eo: Laste reviziita
ja: 最終査読日
pt_br: Última revisão
ru: Последняя проверка
ta: கடைசியாக மதிப்பாய்வு செய்யப்பட்டது

source: Overview
eo: Superrigardo
ja: 概要
pt_br: Visão geral
ru: Обзор
ta: கண்ணோட்டம்

source: Supporting multiple hardware platforms
eo: Subtenante plurajn aparatajn platformojn
ja: 複数のハードウェアプラットフォームをサポートする
pt_br: Oferecendo suporte a várias plataformas de hardware
ru: Поддержка нескольких аппаратных платформ
ta: பல வன்பொருள் தளங்களை ஆதரிக்கிறது

source: OS packaging & installers
eo: Pakado kaj instaliloj por mastrumaj sistemoj
ja: OSパッケージングとインストーラ
pt_br: Empacotamento de sistema operacional e instaladores
ru: Упаковка и инсталляторы ОС
ta: OS பேக்கேசிங் மற்றும் நிறுவிகள்

source: `Pynsist <https://pypi.org/project/pynsist>`__ is a tool that bundles Python programs together with the Python-interpreter into a single installer based on NSIS. In most cases, packaging only requires the user to choose a version of the Python-interpreter and declare the dependencies of the program. The tool downloads the specified Python-interpreter for Windows and packages it with all the dependencies in a single Windows-executable installer.
eo: `Pynsist <https://pypi.org/project/pynsist>`__ estas ilo faskiganta Python-programon kune kun la Python -interpretilo en unu instalilon uzantan NSIS. Plej ofte, pakado nur postulas elekti version de la Python-interpretilo kaj deklari la dependencojn de la programo. La ilo elŝutas la specifitan Python-interpretilon por Windows kaj pakas ĝin kune kun ĉiuj dependaĵoj en unu Windows-ruleblan instalilon.
ja: `Pynsist <https://pypi.org/project/pynsist>`__は、Pythonで書かれたプログラム群をNSISベースのPythonインタープリタ付きの単体インストーラにまとめるツールです。ほとんどの場合、パッケージング作業ではユーザがPythonインタープリタのバージョンを選択することとプログラムの依存関係を宣言することしか求められません。このツールは、指定されたWindows版のPythonインタープリタをダウンロードして、依存関係にあるすべてをWindows上で実行可能な単体インストーラにまとめます。
pt_br: `Pynsist <https://pypi.org/project/pynsist>`__ é uma ferramenta que agrupa programas Python junto com o interpretador Python em um único instalador baseado em NSIS. Na maioria dos casos, o empacotamento requer apenas que o usuário escolha uma versão do interpretador Python e declare as dependências do programa. A ferramenta baixa o interpretador Python especificado para Windows e o empacota com todas as dependências em um único instalador executável do Windows.
ru: `Pynsist <https://pypi.org/project/pynsist>`__ - это инструмент, который упаковывает программы на Python вместе с Python-интерпретатором в единый инсталлятор, основанный на NSIS. В большинстве случаев упаковка требует от пользователя только выбора версии Python-интерпретатора и объявления зависимостей программы. Утилита загружает указанный Python-интерпретатор для Windows и упаковывает его вместе со всеми зависимостями в единый Windows-исполняемый инсталлятор.
ta: `Pynsist <https://pypi.org/project/pynsist> ____ என்பது பைதான் நிரல்களை பைதான்-இன்டர்ச்பிரெட்டருடன் NSIS ஐ அடிப்படையாகக் கொண்ட ஒற்றை நிறுவியில் தொகுக்கும் ஒரு கருவியாகும். பெரும்பாலான சந்தர்ப்பங்களில், பேக்கேசிங் மட்டுமே பயனருக்கு பைதான்-இன்டர்ச்பிரீட்டரின் பதிப்பைத் தேர்வுசெய்து நிரலின் சார்புகளை அறிவிக்க வேண்டும். கருவி விண்டோசிற்கான குறிப்பிட்ட பைதான்-இடைக்காலத்தை பதிவிறக்கம் செய்து, விண்டோச்-செயல்படுத்தக்கூடிய நிறுவியில் அனைத்து சார்புகளையும் தொகுப்பாக மாற்றுகிறது.

source: The installed program can be started from a shortcut that the installer adds to the start-menu. It uses a Python interpreter installed within its application directory, independent of any other Python installation on the computer.
eo: La instalita programo estas lanĉebla per lanĉilo aldonita de la instalilo al la startmenuo. Ĝi uzas Python-interpretilon instalitan ene de ĝia programa dosierujo, sendependan de aliaj Python-instalaĵoj sur la komputilo.
ja: インストーラがスタートメニューに追加したショートカットから、インストールされたプログラムを起動することができます。プログラムは、そのアプリケーション用のディレクトリの中にインストールされたPythonインタープリタで同じコンピュータ内にある他のPythonからは独立したをものを使います。
pt_br: O programa instalado pode ser iniciado a partir de um atalho que o instalador adiciona ao menu iniciar. Ele usa um interpretador Python instalado em seu diretório de aplicação, independente de qualquer outra instalação Python no computador.
ru: Установленная программа может быть запущена из короткого пути, который установщик добавляет к start-menu. Он использует интерпретатор Python, установленный в его каталоге приложений, независимо от любой другой установки Python на компьютере.
ta: நிறுவப்பட்ட நிரலை தொடக்க-மெனுவில் நிறுவி சேர்க்கும் குறுக்குவழியில் இருந்து தொடங்கலாம். இது கணினியில் வேறு எந்த பைதான் நிறுவலிலிருந்தும் சுயாதீனமாக, அதன் பயன்பாட்டு கோப்பகத்தில் நிறுவப்பட்ட பைதான் மொழிபெயர்ப்பாளரைப் பயன்படுத்துகிறது.

source: A big advantage of Pynsist is that the Windows packages can be built on Linux. There are several examples for different kinds of programs (console, GUI) in the :any:`documentation <pynsist:index>`. The tool is released under the MIT-licence.
eo: Granda avantaĝo de Pynsist estas, ke la Windows-pakoj estas konstrueblaj sur Linux. Ekzistas pluraj ekzemploj por diversaj specoj de programoj (konzolaj, grafikfasadaj) en la :any:`dokumentaro <pynsist:index>`. La ilo estas sub la licenco MIT.
ja: Pynsistを使う大きな利点は、Windows用のパッケージをLinux上で作成することができるということです。 :any: `説明文書 <pynsist:index>` には異なる種類のプログラム(コンソール用やGUIを使うものなど)の例がいくつかあります。このツールはMITライセンスのもとに公開されています。
pt_br: Uma grande vantagem do Pynsist é que os pacotes do Windows podem ser construídos no Linux. Existem vários exemplos para diferentes tipos de programas (console, GUI) na :any:`documentação <pynsist:index>`. A ferramenta é lançada sob a licença do MIT.
ru: Большим преимуществом Pynsist является то, что пакеты Windows могут быть построены на Linux. Существует несколько примеров для различных видов программ (консоль, GUI) в :any:`documentation <pynsist:index>`. Инструмент выпущен под лицензией MIT.
ta: பைன்சிச்ட்டின் ஒரு பெரிய நன்மை என்னவென்றால், சாளரங்கள் தொகுப்புகளை லினக்சில் உருவாக்க முடியும். பல்வேறு வகையான நிரல்களுக்கு (கன்சோல், சி.யு.ஐ) பல எடுத்துக்காட்டுகள் உள்ளன: ஏதேனும்: `ஆவணங்கள் <pynsist: index>`. கருவி எம்ஐடி-உரிமத்தின் கீழ் வெளியிடப்படுகிறது.

source: Application bundles
eo: Aplikprogramaj faskoj
ja: アプリケーションバンドル
pt_br: Pacotes de aplicações
ru: Комплекты приложений
ta: பயன்பாட்டு மூட்டைகள்

source: `py2exe <https://pypi.org/project/py2exe/>`__ is a distutils extension which allows to build standalone Windows executable programs (32-bit and 64-bit) from Python scripts. Python versions included in the official development cycle are supported (refers to `Status of Python branches`__). py2exe can build console executables and windows (GUI) executables. Building windows services, and DLL/EXE COM servers might work but it is not actively supported. The distutils extension is released under the MIT-licence and Mozilla Public License 2.0.
eo: `py2exe <https://pypi.org/project/py2exe/>`__ estas etendaĵo de distutils, kiu ebligas konstrui memstarajn Windows-programojn (32-bitajn aŭ 64-bitajn) el Python-programoj. Versioj de Python inkluzivitaj en la oficiala evolua ciklo estas subtenata (vidu `Staton de la branĉoj de Python <Status of Python branches>`__). py2exe povas konstrui konzolajn programojn kaj fenestrajn (grafikfasadajn) programojn. Konstruado de servoj por Windows kaj servoj DLL/EXE COM eble funkcios, sed tio ne estas aktive subtenata. La etendaĵo de distutils estas disponebla sub la Licenco MIT kaj la Mozilla Public License 2.0.
ja: `py2exe <https://pypi.org/project/py2exe/>`__ はdistutilsの拡張パッケージで、Pythonのスクリプトから単独で動作するWindowsの実行プログラム(32ビット版または64ビット版)を作成することができます。公式の開発サイクルに含まれるバージョンのPythonがすべてサポートされています(`Pythonのブランチの状況 <Status of Python branches>`__を参照して下さい)。py2exeはコンソールで動作する実行可能ファイルも、Windowsの(GUIの)実行ファイルも作成することができます。WindowsサービスやDLL/EXE COMサーバを作成することもできるかもしれませんが、これらは活発にサポートされているとは言えません。distutilsの拡張パッケージは、MITライセンスとMozilla Publicライセンス2.0の下で公開されています。
pt_br: `py2exe <https://pypi.org/project/py2exe/>`__ é uma extensão do distutils que permite construir programas executáveis autônomos Windows (32 bits e 64 bits) a partir de scripts Python. Versões Python incluídas no ciclo de desenvolvimento oficial são suportadas (consulte `Status dos ramos do Python`__). py2exe pode construir executáveis de console e executáveis de janelas (GUI). A construção de serviços do Windows e servidores DLL/EXE COM podem funcionar, mas não são ativamente suportados. A extensão distutils é lançada sob a licença MIT e Mozilla Public License 2.0.
ru: <https://pypi.org/project/py2exe/>`__ Это расширение отключения, которое позволяет создавать автономные Windows исполняемые программы (32-битные и 64-битные) от Python. Python версии, включенные в официальный цикл разработки, поддерживаются (относится к `Status of Python branches`__). py2exe может создавать исполняемые консоли и исполняемые окна (GUI). Сервисы по строительству окон и серверы DLL/EXE COM могут работать, но они не поддерживаются активно. Расширение Distutils выпущено под лицензией MIT и публичной лицензией Mozilla 2.0.
ta: `py2exe <https://pypi.org/project/py2exe/> ____ என்பது ஒரு தொலைதூர நீட்டிப்பு ஆகும், இது பைத்தான் ச்கிரிப்ட்களிலிருந்து முழுமையான சாளரங்கள் இயங்கக்கூடிய நிரல்களை (32-பிட் மற்றும் 64-பிட்) உருவாக்க அனுமதிக்கிறது. உத்தியோகபூர்வ மேம்பாட்டு சுழற்சியில் சேர்க்கப்பட்டுள்ள பைதான் பதிப்புகள் ஆதரிக்கப்படுகின்றன (பைதான் கிளைகளின் நிலையை` என்பதைக் குறிக்கிறது). PY2EXE கன்சோல் இயங்கக்கூடிய மற்றும் சாளரங்கள் (GUI) இயங்கக்கூடியவற்றை உருவாக்க முடியும். சாளரங்கள் சேவைகளை உருவாக்குதல், மற்றும் டி.எல்.எல்/எக்ச்இ காம் சேவையகங்கள் வேலை செய்யக்கூடும், ஆனால் அது தீவிரமாக ஆதரிக்கப்படவில்லை. டிச்டிடில்ச் நீட்டிப்பு எம்ஐடி-உரிமம் மற்றும் மொசில்லா பொது உரிமம் 2.0 இன் கீழ் வெளியிடப்படுகிறது.

source: `py2app <https://pypi.org/project/py2app/>`__ is a Python setuptools command which will allow you to make standalone macOS application bundles and plugins from Python scripts. Note that py2app MUST be used on macOS to build applications, it cannot create Mac applications on other platforms. py2app is released under the MIT-license.
eo: `py2app <https://pypi.org/project/py2app/>`__ estas komando por Python setuptools, kiu ebligas fari aŭtonoman programfaskon aŭ kromprogramon por macOS el Python-programon. Notu, ke py2app DEVAS esti uzita sur macOS por konstrui; ĝi ne povas krei Mac-programojn sur aliaj platformoj. py2app uzas la licencon MIT.
ja: `py2app <https://pypi.org/project/py2app/>`__ はPythonのsetuptoolsのコマンドで、単独で動作するmacOSアプリケーションバンドルやプラグインをPythonスクリプトから作成することができます。アプリケーションを作成する時はmacOS上でpy2appを使わなければならず、他のプラットフォーム上ではMacアプリを作成することができない点に留意して下さい。py2appはMITライセンスの下で公開されています。
pt_br: `py2app <https://pypi.org/project/py2app/>`__ é um comando Python do setuptools que permitirá que você crie pacotes e plug-ins de aplicações autônomas para o macOS a partir de scripts Python. Observe que o py2app DEVE ser usado no macOS para criar aplicações; ele não pode criar aplicação do Mac em outras plataformas. py2app é lançado sob a licença MIT.
ru: `py2app <https://pypi.org/project/py2app/>`__ - это команда Python setuptools, которая позволит вам создавать автономные пакеты приложений и плагинов для macOS из скриптов Python. Обратите внимание, что py2app ДОЛЖЕН использоваться на macOS для создания приложений, он не может создавать Mac-приложения на других платформах. py2app выпускается под MIT-лицензией.
ta: `py2app <https://pypi.org/project/py2app/> ____ என்பது ஒரு பைதான் செட்டுப்டூல்ச் கட்டளை, இது பைதான் ச்கிரிப்ட்களிலிருந்து முழுமையான மேகோச் பயன்பாட்டு மூட்டைகள் மற்றும் செருகுநிரல்களை உருவாக்க உங்களை அனுமதிக்கும். பயன்பாடுகளை உருவாக்க மாகோ களில் PY2APP பயன்படுத்தப்பட வேண்டும் என்பதை நினைவில் கொள்க, இது மற்ற தளங்களில் MAC பயன்பாடுகளை உருவாக்க முடியாது. PY2APP MIT-LICENSE இன் கீழ் வெளியிடப்படுகிறது.

source: Unix (including Linux and macOS)
eo: Unikso (inkluzive de Linux kaj macOS)
ja: Unix (LinuxとmacOSを含む)
pt_br: Unix (incluindo Linux e macOS)
ru: Unix (включая Linux и macOS)
ta: யூனிக்ச் (லினக்ச் மற்றும் மேகோச் உட்பட)

source: pex
ta: பெக்ச்

source: `pex <https://pypi.org/project/pex/>`__ is a library for generating .pex (Python EXecutable) files which are executable Python environments in the spirit of virtualenvs. pex is an expansion upon the ideas outlined in :pep:`441` and makes the deployment of Python applications as simple as cp. pex files may even include multiple platform-specific Python distributions, meaning that a single pex file can be portable across Linux and macOS. pex is released under the Apache License 2.0.
eo: `pex <https://pypi.org/project/pex/>`__ estas biblioteko por generi .pex-dosieron (Python EXecutable), kiu estas rulebla Python-medio simile al virtualenv. pex estas plivastigo de la ideoj en :pep:`441` kaj igas la disponigon de Python-programojn tiel facila kiel cp. pex-dosiero povas eĉ inkluzivi plurajn platformspecifajn Python-distribuojn; tial, unu pex-dosiero povas esti portebla inter Linux kaj macOS. pex uzas la Apache-Licencon 2.0.
ja: `pex <https://pypi.org/project/pex/>`__ は、.pex (Python EXecutable)ファイル、つまり、virtualenvを利用した実行可能なPython環境を含んだファイルを生成するライブラリです。pexは :pep:`441` で概要が示されたアイデアに基づく拡張で、単純にファイルをコピーするだけでPythonアプリケーションを配置(デプロイ)することができるようにします。複数のプラットフォーム依存なPython配布物でもpexファイルに内包することができますので、単一のpexファイルがLinuxでもmacOSでも動作可能ということになります。pexはApacheライセンス2.0の下で公開されています。
pt_br: `pex <https://pypi.org/project/pex/>`__ é uma biblioteca para gerar arquivos .pex (Python EXecutáveis) que são ambientes Python executáveis no espírito de virtualenvs. pex é uma expansão das ideias descritas na :pep:`441` e torna a implantação de aplicações Python tão simples quanto o cp. Os arquivos pex podem até incluir várias distribuições específicas da plataforma Python, o que significa que um único arquivo pex pode ser portátil entre Linux e macOS. pex é lançado sob a licença Apache 2.0.
ru: pex <https://pypi.org/project/pex/>`__ - это библиотека для создания файлов .pex (Python EXecutable), которые являются исполняемыми окружениями Python в духе virtualenvs. pex является расширением идей, изложенных в :pep:`441`, и делает развертывание приложений Python таким же простым, как cp. Файлы pex могут даже включать несколько дистрибутивов Python, специфичных для конкретной платформы, что означает, что один файл pex может быть переносимым в Linux и macOS. pex выпущен в соответствии с Apache License 2.0.
ta: . PEX என்பது கோடிட்டுக் காட்டப்பட்டுள்ள கருத்துக்களின் விரிவாக்கமாகும்: PEP: `441` மற்றும் பைதான் பயன்பாடுகளை சிபி போல எளிமையாக பயன்படுத்துகிறது. PEX கோப்புகளில் பல இயங்குதள-குறிப்பிட்ட பைதான் விநியோகங்கள் கூட இருக்கலாம், அதாவது லினக்ச் மற்றும் மேகோச் முழுவதும் ஒற்றை PEX கோப்பு சிறியதாக இருக்கும். PEX அப்பாச்சி உரிமம் 2.0 இன் கீழ் வெளியிடப்பட்டது.

source: Configuration management
eo: Administrado de agordoj
ja: 設定管理
pt_br: Gerenciamento de configuração
ru: Управление конфигурацией
ta: உள்ளமைவு மேலாண்மை

source: Distribution package vs. import package
eo: Distribua pako kaj importa pako
ja: 配布パッケージ vs. インポートパッケージ
pt_br: Pacote de distribuição vs. pacote de importação
ru: Пакет распределения против пакета импорта
ta: விநியோக தொகுப்பு எதிராக இறக்குமதி தொகுப்பு

source: A number of different concepts are commonly referred to by the word "package". This page clarifies the differences between two distinct but related meanings in Python packaging, "distribution package" and "import package".
eo: La vorto «pako» signifas plurajn malsamajn konceptoj. Jen paĝo klariganta la diferencojn inter la du malsamaj sed rilataj signifoj je Python-pakado, «distribua pako» kaj «importa pako».
ja: 数多くの異なったコンセプトが同じ "パッケージ" の名で呼ばれています。このページでは、"配布パッケージ" と "インポートパッケージ" という、関連してはいるが全く異なる二つの Python のパッケージングの意味を明らかにします。
pt_br: Alguns conceitos diferentes são comumente referidos pela palavra "pacote". Esta página esclarece as diferenças entre dois significados distintos, mas relacionados no empacotamento do Python , "pacote de distribuição" e "pacote de importação".
ru: Словом "пакет" обычно обозначают несколько различных понятий. Эта страница объясняет различия между двумя разными, но связанными значениями в упаковке Python, "дистрибутивный пакет" и "пакет импорта".
ta: பல்வேறு கருத்துக்கள் பொதுவாக "தொகுப்பு" என்ற வார்த்தையால் குறிப்பிடப்படுகின்றன. பைதான் பேக்கேசிங், "விநியோக தொகுப்பு" மற்றும் "இறக்குமதி தொகுப்பு" ஆகியவற்றில் இரண்டு தனித்துவமான ஆனால் தொடர்புடைய அர்த்தங்களுக்கு இடையிலான வேறுபாடுகளை இந்த பக்கம் தெளிவுபடுத்துகிறது.

source: What's a distribution package?
eo: Kio estas distribua pako?
ja: 配布パッケージとは何でしょうか？
pt_br: O que é um pacote de distribuição?
ru: Что такое дистрибутивный пакет?
ta: விநியோக தொகுப்பு என்றால் என்ன?
