Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The first line says to install your project and any dependencies. The second line overrides the "bar" dependency, such that it's fulfilled from VCS, not PyPI.
eo: La unua linio instalas vian projekton kaj ĝiajn dependaĵojn. La dua linio anstataŭigas la dependecon sur «bar», uzante versikontrolan sistemon, ne PyPI.
ja: 最初の行ではあなたのプロジェクトとその依存先をインストールするように指示しています。２行目で、 "bar" についてPyPIではなくVCSから充当するようにと依存関係を上書きしています。
pt_br: A primeira linha diz para instalar seu projeto e todas as dependências. A segunda linha substitui a dependência "bar", de modo que seja preenchida a partir do VCS, não PyPI.
ru: В первой строке говорится об установке вашего проекта и всех зависимостей. Вторая строка переопределяет зависимость "bar" так, чтобы она выполнялась из VCS, а не из PyPI.
ta: உங்கள் திட்டத்தையும் எந்தவொரு சார்புகளையும் நிறுவ முதல் வரி கூறுகிறது. இரண்டாவது வரி "பார்" சார்புநிலையை மீறுகிறது, இது வி.சி.க்களிலிருந்து நிறைவேறும், இது பைபி அல்ல.

source: If, however, you want "bar" installed from a local directory in editable mode, the requirements file should look like this, with the local paths at the top of the file::
eo: Tamen, se vi volas instali «bar» el loka dosierujo en modifebla reĝimo, la postulo-dosiero estu jene, kun la lokaj dosierlokoj ĉe la supro de la dosiero::
ja: そうではなくて、 "bar" をローカルディレクトリから編集可能モードでインストールしたい場合には、 requirements ファイルの先頭にローカルのディレクトリパスを置いて次のようになるでしょう::
pt_br: Se, no entanto, você quiser "bar" instalado de um diretório local em modo editável, o arquivo de requisitos deve ser semelhante a este, com os caminhos locais no topo do arquivo::
ru: Если же вы хотите установить "Бар" из локальной директории в редактируемом режиме, файл требований должен выглядеть следующим образом, с локальными путями в верхней части файла::
ta: எவ்வாறாயினும், திருத்தக்கூடிய பயன்முறையில் ஒரு உள்ளக கோப்பகத்திலிருந்து நிறுவப்பட்ட "பார்" விரும்பினால், தேவைகள் கோப்பு இப்படி இருக்க வேண்டும், கோப்பின் மேலே உள்ள உள்ளக பாதைகள் ::

source: Otherwise, the dependency will be fulfilled from PyPI, due to the installation order of the requirements file. For more on requirements files, see the :ref:`Requirements File <pip:Requirements Files>` section in the pip docs. For more on VCS installs, see the :ref:`VCS Support <pip:VCS Support>` section of the pip docs.
ja: さもなければ requirements ファイルに書かれた順にインストールされてしまうので、依存先のパッケージが PyPI から充当されてしまいます。 requirements ファイルについてさらに詳しく知りたい場合は、 pipの解説文書の :ref:`Requirements ファイル <pip:Requirements Files>` の節を見てください。VCSからのインストールについては、同書の :ref:`VCSサポート <pip:VCS Support>` の節を見てください。
pt_br: Caso contrário, a dependência será resolvida pelo PyPI, devido à ordem de instalação do arquivo de requisitos. Para mais informações sobre os arquivos de requisitos, consulte a seção :ref:`Requirements File <pip:Requirements Files>` na documentação do pip. Para obter mais informações sobre as instalações de VCS, consulte a seção :ref:`VCS Support <pip:VCS Support>` da documentação do pip.
ru: В противном случае зависимость будет выполняться из PyPI, что обусловлено порядком установки файла требований. Подробнее о файлах требований смотрите раздел :ref:`Requirements File <pip:Requirements Files>` в документации pip. Подробнее о VCS-установках смотрите в разделе :ref:`VCS Support <pip:VCS Support>` документации pip.
ta: இல்லையெனில், தேவைகள் கோப்பின் நிறுவல் வரிசை காரணமாக, சார்பு பைபியிலிருந்து நிறைவேற்றப்படும். தேவைகள் கோப்புகளைப் பற்றி மேலும் அறிய, பார்க்க: ref: `தேவைகள் கோப்பு <PIP: தேவைகள் கோப்புகள்>` PIP டாக்சில் பிரிவு. வி.சி.எச் நிறுவல்களைப் பற்றி மேலும் அறிய, இதைக் காண்க: குறிப்பு: `வி.சி.எச் உதவி <பிஐபி: வி.சி.எச் ஆதரவு>` பிஐபி டாக்சின் பிரிவு.

source: Lastly, if you don't want to install any dependencies at all, you can run:
eo: Laste, se vi ne volas instali ajnan dependaĵon, rulu la jenon:
ja: 最後に、もし依存先パッケージは何もインストールしたくないのであれば、このようにします:
pt_br: Por último, se você não deseja instalar nenhuma dependência, pode executar:
ru: Наконец, если вы не хотите устанавливать никаких зависимостей, вы можете выполнить команду:
ta: கடைசியாக, நீங்கள் எந்த சார்புகளையும் நிறுவ விரும்பவில்லை என்றால், நீங்கள் இயக்கலாம்:

source: For more information, see the :doc:`Development Mode <setuptools:userguide/development_mode>` section of the :ref:`setuptools` docs.
eo: Por pli da informo, vidu la paragrafon :doc:`Evoluada Reĝimo <setuptools:userguide/development_mode>` de la dokumentaro de :ref:`setuptools`.
ja: さらに詳しいことを知りたい場合は、 :ref:`setuptools` 文書の :doc:`開発モード <setuptools:userguide/development_mode>` の 節を見てください。
pt_br: Para mais informações, veja a seção :doc:`Development Mode <setuptools:userguide/development_mode>` na documentação do :ref:`setuptools`.
ru: Для получения дополнительной информации см. раздел :doc:`Режим разработки <setuptools:userguide/development_mode>` в :ref:`setuptools` docs.
ta: மேலும் தகவலுக்கு,: DOC: `மேம்பாட்டு முறை <செட்டப்டூல்ச்: userguide/development_mode>` பிரிவு: ref: `setuptools` டாக்சைப் பார்க்கவும்.

source: Packaging your project
eo: Paki vian projekton
ja: プロジェクトをパッケージングする
pt_br: Empacotando seu projeto
ru: Упаковка вашего проекта
ta: உங்கள் திட்டத்தை பேக்கேசிங் செய்தல்

source: To have your project installable from a :term:`Package Index` like :term:`PyPI <Python Package Index (PyPI)>`, you'll need to create a :term:`Distribution <Distribution Package>` (aka ":term:`Package <Distribution Package>`") for your project.
eo: Por igi vian projekton instalebla ĉe :term:`Pakindekso <Package Index>` kiel :term:`PyPI <Python Package Index (PyPI)>`, vi kreu :term:`Distribuon <Distribution Package>` (ankaŭ konatan kiel «:term:`pakon <Distribution Package>`») por via projekto.
ja: あなたのプロジェクトを :term:`PyPI <Python Package Index (PyPI)>` のような :term:`パッケージインデックス <Package Index>` からインストールできるようにするには、 :term:`配布物 <Distribution Package>` (:term:`パッケージ <Distribution Package>`の名前でも知られる) を作成しなければならないでしょう。
pt_br: Para ter seu projeto instalável de um :term:`Índice de Pacotes` como o :term:`PyPI <Python Package Index (PyPI)>`, você precisará criar uma :term:`Distribuição <Distribution Package>` (também conhecida como ":term:`Pacote <Distribution Package>`") para seu projeto.
ru: Чтобы ваш проект можно было установить из индекса :term:`Package Index`, например :term:`PyPI <Python Package Index (PyPI)>`, вам нужно будет создать :term:`Distribution <Distribution Package>` (он же ":term:`Package <Distribution Package>`") для вашего проекта.
ta: உங்கள் திட்டத்தை ஒரு: கால: `தொகுப்பு குறியீட்டு` போன்றவற்றிலிருந்து நிறுவ முடியும்: கால:` பைபி <பைதான் தொகுப்பு குறியீட்டு (பைபி)> `, நீங்கள் ஒரு: காலத்தை உருவாக்க வேண்டும்:` விநியோக <விநியோக தொகுப்பு> `(அக்கா" : கால: `தொகுப்பு <விநியோக தொகுப்பு>` ") உங்கள் திட்டத்திற்கு.

source: Before you can build wheels and sdists for your project, you'll need to install the ``build`` package:
eo: Antaŭ ol konstrui wheel kaj fontan distribuon por via projekto, vi devas instali la pakon ``build``:
ja: あなたのプロジェクトでwheelsやsdistsをビルドする前に、 ``build`` パッケージをインストールする必要があります。
pt_br: Antes de compilar wheels e sdists para seu projeto, você precisará instalar o pacote ``build``:
ru: Прежде чем вы сможете построить колеса и диски для своего проекта, вам нужно будет установить пакет ``build``:
ta: உங்கள் திட்டத்திற்காக சக்கரங்கள் மற்றும் SDIST களை உருவாக்குவதற்கு முன், நீங்கள் `` பில்ட்`` தொகுப்பை நிறுவ வேண்டும்:

source: Source distributions
eo: Fontaj distribuoj
ja: ソースコード配布物
pt_br: Distribuições fontes
ru: Распространение в исходных кодах
ta: மூல வழங்கல்

source: Minimally, you should create a :term:`Source Distribution <Source Distribution (or "sdist")>`:
eo: Minimume, vi kreu :term:`Fontan Distribuon <Source Distribution (or "sdist")>`:
ja: 少なくとも、 :term:`ソースコード配布物 <Source Distribution (or "sdist")>` を作成するべきです:
pt_br: Minimamente, você deve criar uma :term:`Distribuição Fonte <Source Distribution (or "sdist")>`:
ru: Минимумом вы должны создать :термин:`Источник распределения <Источник распределения (или "сдист")>`:
ta: குறைந்தபட்சமாக, நீங்கள் ஒரு: காலத்தை உருவாக்க வேண்டும்: `மூல வழங்கல் <மூல வழங்கல் (அல்லது" SDIST ")>`:

source: A "source distribution" is unbuilt (i.e. it's not a :term:`Built Distribution`), and requires a build step when installed by pip. Even if the distribution is pure Python (i.e. contains no extensions), it still involves a build step to build out the installation metadata from :file:`setup.py` and/or :file:`setup.cfg`.
eo: «Fonta distribuo» ne estas kontruita (alivorte, ĝi ne estas :term:`Konstruita Distribuo <Built Distribution>`) kaj postulas paŝon de konstruado dum instalado per pip. Eĉ se la distribuo konsistas nur el Python (alivorte, etendaĵo mankas), konstruada paŝo necesas por konstrui la instalajn metadatenojn el :file:`setup.py` kaj/aŭ :file:`setup.cfg`.
ja: ソースコード配布物はビルドされていない (すなわち、 :term:`ビルド済み配布物 <Built Distribution>` ではない) ので、pip でインストールする際にビルドする段階が必要になります。配布物が純Python (つまり (訳注、多言語で書かれた) 拡張を含まない) であったとしても、 :file:`setup.py` や :file:`setup.cfg` からインストール用メタデータを取り出してビルドする段階を必要とするのです。
pt_br: Uma "distribuição fonte" é não construída (ou seja, não é uma :term:`Distribuição Construída`) e requer uma etapa de construção quando instalada pelo pip. Mesmo se a distribuição for puro Python (ou seja, não contém extensões), ainda envolve uma etapa de construção para construir os metadados de instalação de :file:`setup.py` e/ou :file:`setup.cfg`.
ru: Исходный дистрибутив" является несобранным (т.е. не является :term:`Built Distribution`) и требует шага сборки при установке с помощью pip. Даже если дистрибутив является чистым Python (т.е. не содержит расширений), он все равно требует сборки для создания метаданных установки из :file:`setup.py` и/или :file:`setup.cfg`.
ta: ஒரு "மூல வழங்கல்" கட்டமைக்கப்படாதது (அதாவது இது ஒரு: கால: `கட்டப்பட்ட விநியோகம்`), மேலும் பிஐபி நிறுவும் போது ஒரு கட்டம் படி தேவைப்படுகிறது. வழங்கல் தூய பைத்தான் என்றாலும் (அதாவது நீட்டிப்புகள் எதுவும் இல்லை), நிறுவல் மெட்டாடேட்டாவை உருவாக்குவதற்கான கட்டமைப்பை இது இன்னும் உள்ளடக்கியது: கோப்பு: `setup.py` மற்றும்/அல்லது: கோப்பு:` setup.cfg`.

source: Wheels
eo: Wheel
ru: Колёса
ta: சக்கரங்கள்

source: You should also create a wheel for your project. A wheel is a :term:`built package <Built Distribution>` that can be installed without needing to go through the "build" process. Installing wheels is substantially faster for the end user than installing from a source distribution.
eo: Vi ankaŭ kreu wheel por via projekto. Wheel estas :term:`konstruita pako <Built Distribution>` instalebla sen konstruado. Instalado de wheel estas multe pli rapida ol instalado de fonta distribuo.
ja: あなたのプロジェクトでは、wheelも作成するべきです。wheel は、インストールするのにビルド処理を行う必要がない :term:`ビルド済み配布物 <Built Distribution>` です。wheelを使えば、ソースコード配布物からのインストールに比べてエンドユーザにとって相当素早くインストールすることができます。
pt_br: Você também deve criar uma wheel para o seu projeto. Uma wheel é um :term:`pacote construído <Distribuição construída>` que pode ser instalado sem a necessidade de passar pelo processo de "construção". Instalar wheel é substancialmente mais rápido para o usuário final do que instalar a partir de uma distribuição original.
ru: Вы также должны создать колесо для своего проекта. Колесо - это :term:`сборка пакета <Сборка дистрибутива>`, который может быть установлен без необходимости проходить процесс "сборки". Установка колес значительно быстрее для конечного пользователя, чем установка из исходного дистрибутива.
ta: உங்கள் திட்டத்திற்கு ஒரு சக்கரத்தையும் உருவாக்க வேண்டும். ஒரு சக்கரம் ஒரு: சொல்: `கட்டப்பட்ட தொகுப்பு <கட்டப்பட்ட விநியோகம்>` இது "உருவாக்க" செயல்முறையின் வழியாக செல்ல வேண்டிய அவசியமின்றி நிறுவப்படலாம். மூல விநியோகத்திலிருந்து நிறுவுவதை விட சக்கரங்களை நிறுவுவது இறுதி பயனருக்கு கணிசமாக வேகமாக இருக்கும்.

source: If your project is pure Python then you'll be creating a :ref:`"Pure Python Wheel" (see section below) <Pure Python Wheels>`.
eo: Se via projekto estas pure Python-a, do vi kreos :ref:`«Pure Python-an Wheel» (vidu la ĉi-suban paragrafon) <Pure Python Wheels>`.
ja: あなたのプロジェクトが純Pythonなら、きっとあなたは:ref:`"純PythonのWheel" (後述) <Pure Python Wheels>`を作成することになるでしょう。
pt_br: Se o seu projeto for puro Python, você criará uma :ref:`"Wheel de Python Puro" (consulte a seção abaixo) <Pure Python Wheels>`.
ru: Если ваш проект является чистым Python, то вы будете создавать :ref: «Чистый Python Колесо» (см. раздел ниже) <Чистый Python Колеса>`.
ta: உங்கள் திட்டம் தூய பைதான் என்றால், நீங்கள் ஒரு: ref: `" தூய பைதான் சக்கரம் "(கீழே உள்ள பகுதியைக் காண்க) <தூய பைதான் சக்கரங்கள்>` உருவாக்குவீர்கள்.

source: If your project contains compiled extensions, then you'll be creating what's called a :ref:`*Platform Wheel* (see section below) <Platform Wheels>`.
eo: Se via projekto enhavas tradukitan etendaĵon, vi kreos la tiel nomatan :ref:`*Platforman Wheel* (vidu ĉi-suban paragrafon) <Platform Wheels>`.
ja: もしあなたのプロジェクトにコンパイル済の拡張が含まれているなら、 :ref:`*プラットフォーム Wheel* (後述) <Platform Wheels>` を作成することになるでしょう。
pt_br: Se o seu projeto contém extensões compiladas, então você criará o que é chamado de :ref:`*Wheel de Plataforma* (veja a seção abaixo) <Platform Wheels>`.
ru: Если ваш проект содержит компилированные расширения, то вы будете создавать то, что называется:ref:`*Platform Wheel* (см. раздел ниже) <Platform Wheels>`.
ta: உங்கள் திட்டத்தில் தொகுக்கப்பட்ட நீட்டிப்புகள் இருந்தால், நீங்கள் A: ref: `* இயங்குதள சக்கரம்* (கீழே உள்ள பகுதியைப் பார்க்கவும்) <இயங்குதள சக்கரங்கள்>` என்று அழைக்கப்படுவதை உருவாக்குவீர்கள்.

source: If your project also supports Python 2 *and* contains no C extensions, then you should create what's called a *Universal Wheel* by adding the following to your :file:`setup.cfg` file:
eo: Se via projekto ankaŭ subtenas Python 2 *kaj* ne enhavas C-etendaĵon, vi kreu *Universalan Wheel* aldonante la jenon al la dosiero :file:`setup.cfg`:
ja: あなたのプロジェクトが Python 2をさぽーとしていて、かつ、C言語拡張を含むのであれば、次のものをあなたの :file:`setup.cfg` ファイルに追加して *ユニバーサル Wheel* と呼ばれるものを作成するべきです:
pt_br: Se o seu projeto também tiver suporte a Python 2 *e* não contiver extensões C, você deve criar o que é chamado de *Wheel Universal* adicionando o seguinte ao seu arquivo :file:`setup.cfg`:
ru: Если ваш проект также поддерживает Python 2 *и* не содержит расширений C, то вам следует создать так называемое *универсальное колесо*, добавив следующее в файл :file:`setup.cfg`:
ta: உங்கள் திட்டம் பைதான் 2 * ஐ ஆதரிக்கிறது மற்றும் * சி நீட்டிப்புகளைக் கொண்டிருக்கவில்லை என்றால், உங்கள்: கோப்பு: `setup.cfg` கோப்பு: பின்வருவனவற்றைச் சேர்ப்பதன் மூலம் * யுனிவர்சல் வீல் * என்று அழைக்கப்படுவதை உருவாக்க வேண்டும்:

source: Only use this setting if your project does not have any C extensions *and* supports Python 2 and 3.
eo: Nur uzu tiun agordon, se via projekto ne havas iun ajn C-etendaĵon *kaj* subtenas Python 2 kaj 3.
ja: あなたのプロジェクトにC言語拡張がなく、かつ、Python 2 および3をサポートしている場合に限って、この設定を使ってください。
pt_br: Use esta configuração apenas se o seu projeto não tiver extensões C *e* tiver suporte ao Python 2 e 3.
ru: Используйте эту настройку только в том случае, если ваш проект не имеет расширений на языке C *и* поддерживает Python 2 и 3.
ta: உங்கள் திட்டத்திற்கு சி நீட்டிப்புகள் இல்லை என்றால் மட்டுமே இந்த அமைப்பைப் பயன்படுத்தவும் * மற்றும் * பைதான் 2 மற்றும் 3 ஐ ஆதரிக்கிறது.

source: Pure Python Wheels
eo: Pure Python-a Wheel
ja: 純Python Wheels
pt_br: Wheels de Puro Python
ru: Колёса чистого Python'а
ta: தூய பைதான் சக்கரங்கள்

source: *Pure Python Wheels* contain no compiled extensions, and therefore only require a single Python wheel.
eo: *Pure Python-a Wheel* enhavas neniu tradukitan etendaĵon kaj tial nur postulas unu Python-wheel.
ja: *純Python Wheels* は、コンパイル済拡張を含んでおらず、従って単独のPython wheelを要求するだけです。
pt_br: *Wheels de Python Puro* contêm nenhuma extensão compilada e, portanto, só exigem um único wheel Python.
ru: * Чистые Python колеса* не содержат компилированных расширений, и поэтому требуется только одно колесо Python.
ta: * தூய பைதான் சக்கரங்கள்* தொகுக்கப்பட்ட நீட்டிப்புகளைக் கொண்டிருக்கவில்லை, எனவே ஒரு பைதான் சக்கரம் மட்டுமே தேவைப்படுகிறது.

source: To build the wheel:
eo: Por konstrui la wheel:
ja: wheelをビルドするには:
pt_br: Para construir o wheel:
ru: Для построения колеса выполните:
ta: சக்கரத்தை உருவாக்க:

source: The ``wheel`` package will detect that the code is pure Python, and build a wheel that's named such that it's usable on any Python 3 installation. For details on the naming of wheel files, see :pep:`425`.
eo: La pako ``wheel`` detektos, ke la pako estas pure Python-a, kaj konstruos wheel nomitan tiel, ke ĝi estos uzebla sur ajna instalo de Python 3. Por pliaj detaloj pri la nomado de wheel-dosiero, vidu :pep:`425`.
ja: ``wheel`` パッケージは、ソースコードが純Pythonであることを検出して、Python 3 へのインストールであればどこでも使えるのでそのように名付けられたwheelをビルドします。wheelファイルの名称について詳しいことは :pep:`425` を見てください。
pt_br: O pacote ``wheel`` detectará que o código é puro Python, e construirá um wheel cujo nome pode ser usado em qualquer instalação do Python 3. Para obter detalhes sobre a nomenclatura de arquivos wheel, consulte :pep:`425`.
ru: Пакет ``wheel`` определит, что код - это чистый Python, и создаст колесо, названное так, чтобы его можно было использовать на любой установке Python 3. Подробнее об именовании файлов wheel смотрите в :pep:`425`.
ta: `` சக்கரம்`` தொகுப்பு குறியீடு தூய பைதான் என்பதைக் கண்டறிந்து, எந்த பைதான் 3 நிறுவலிலும் பயன்படுத்தக்கூடியதாக பெயரிடப்பட்ட ஒரு சக்கரத்தை உருவாக்குகிறது. சக்கர கோப்புகளின் பெயரிடுதல் குறித்த விவரங்களுக்கு, காண்க: PEP: `425`.

source: If you run ``build`` without ``--wheel`` or ``--sdist``, it will build both files for you; this is useful when you don't need multiple wheels.
eo: Se oni rulos ``build`` sen ``--wheel`` aŭ ``--sdist``, ĝi konstruos ambaŭ dosierojn; tio utilas, se vi ne bezonas plurajn wheel-ojn.
ja: ``--wheel`` か ``--sdist`` を付けずに ``build`` を実行すると、両方のファイルが作成されます; 複数のwheelファイルにしたくないときにはこれが便利です。
pt_br: Se você executar ``build`` sem ``--wheel`` ou ``--sdist``, ele irá construir os dois arquivos para você; isso é útil quando você não precisa de vários wheels.
ru: Если вы запустите ``build`` без ``--wheel`` или ``--sdist``, он соберет оба файла за вас; это полезно, когда вам не нужно несколько колес.
ta: ``-வீல்` அல்லது ``--ச்டிச்ட்` இல்லாமல் `` பில்ட்`` ஐ இயக்கினால், அது உங்களுக்காக இரண்டு கோப்புகளையும் உருவாக்கும்; உங்களுக்கு பல சக்கரங்கள் தேவையில்லை போது இது பயனுள்ளதாக இருக்கும்.

source: Platform Wheels
eo: Platformaj Wheel-oj
ja: プラットフォームWheels
pt_br: Wheels de Plataforma
ru: Платформо-зависимые колёса
ta: இயங்குதள சக்கரங்கள்

source: *Platform Wheels* are wheels that are specific to a certain platform like Linux, macOS, or Windows, usually due to containing compiled extensions.
eo: *Platforma Wheel* estas wheel specifa al iu platformo kiel Linux, macOS aŭ Windows, ordinare pro enhavo de tradukitaj etendaĵoj.
ja: *プラットフォームWheels* は、LinuxやmacOSあるいはWindowsのような特定のプラットフォーム向けのwheelで、大抵の場合は(訳注、特定のプラットフォーム向けにコンパイルされた)コンパイル済み拡張を含むためです。
pt_br: *Wheels de Plataforma* são wheels que são específicos para uma certa plataforma, como Linux, macOS ou Windows, geralmente em razão de conter extensões compiladas.
ru: *Платформенные колеса* - это колеса, которые специфичны для определенной платформы, например Linux, macOS или Windows, обычно из-за содержания скомпилированных расширений.
ta: * இயங்குதள சக்கரங்கள்* என்பது லினக்ச், மேகோச் அல்லது சாளரங்கள் போன்ற ஒரு குறிப்பிட்ட தளத்திற்கு குறிப்பிட்ட சக்கரங்கள், பொதுவாக தொகுக்கப்பட்ட நீட்டிப்புகளைக் கொண்டிருப்பதால்.

source: The ``wheel`` package will detect that the code is not pure Python, and build a wheel that's named such that it's only usable on the platform that it was built on. For details on the naming of wheel files, see :pep:`425`.
eo: La pako ``wheel`` detektos, ke la kodo ne konsistas sole el Python, kaj konstruos wheel nomitan tiel, ke ĝi estos nur uzebla sur la platformo, sur kiu ĝi estis konstruita. Por detaloj pri la nomado de wheel-dosiero, vidu :pep:`425`.
ja: ``wheel`` パッケージは、ソースコードが純Pythonで書かれていないと判断すると、ビルドされたプラットフォーム上でのみ利用可能であるように命名されたwheelを作成します。wheelファイルの命名規則については、 :pep:`425` を見てください。
pt_br: O pacote ``wheel`` detectará que o código não é puro Python e construirá um wheel cujo nome só pode ser usado na plataforma em que foi construído. Para obter detalhes sobre a nomenclatura de arquivos wheel, consulte :pep:`425`.
ru: Пакет ``wheel`` определит, что код не является чистым Python, и создаст колесо, названное так, что его можно использовать только на той платформе, на которой оно было создано. Подробнее об именовании файлов wheel смотрите в :pep:`425`.
ta: `` சக்கரம்`` தொகுப்பு குறியீடு தூய பைதான் அல்ல என்பதைக் கண்டறிந்து, அது கட்டப்பட்ட மேடையில் மட்டுமே பயன்படுத்தக்கூடியது என்று பெயரிடப்பட்ட ஒரு சக்கரத்தை உருவாக்குங்கள். சக்கர கோப்புகளின் பெயரிடுதல் குறித்த விவரங்களுக்கு, காண்க: PEP: `425`.

source: :term:`PyPI <Python Package Index (PyPI)>` currently supports uploads of platform wheels for Windows, macOS, and the multi-distro ``manylinux*`` ABI. Details of the latter are defined in :pep:`513`.
eo: :term:`PyPI <Python Package Index (PyPI)>` aktuale subtenas alŝutadon de platforma wheel por Windows, macOS, kaj la ABI ``manylinux*`` por pluraj distribuoj. :pep:`513` difinas la detalojn pri ``manylinux*``.
ja: 現在、 :term:`PyPI <<Python Package Index (PyPI)>` は、Windows向けとmacOS向け、そして複数のLinuxディストリビューションに対応した ``manylinux*`` のABI向けのプラットフォームWheelsをアップロードすることに対応しています。
pt_br: :term:`PyPI <Python Package Index (PyPI)>` oferece suporte atualmente a envios de wheels de plataforma do Windows, macOS e da ABI multidistro ``manylinux*``. Detalhes sobre o último estão definidos em :pep:`513`.
ru: :term:`PyPI <Python Package Index (PyPI)>` в настоящее время поддерживает загрузку платформенных колес для Windows, macOS и мульти-дистро ``manylinux*`` ABI. Подробности о последнем определены в :pep:`513`.
ta: . பிந்தைய விவரங்கள் வரையறுக்கப்பட்டுள்ளன: PEP: `513`.

source: Uploading your Project to PyPI
eo: Alŝuti Vian Projekton al PyPI
ja: プロジェクトをPyPIにアップロードする
pt_br: Enviando seu Projeto para PyPI
ru: Загрузка вашего проекта на PyPI
ta: உங்கள் திட்டத்தை PYPI இல் பதிவேற்றுகிறது

source: When you ran the command to create your distribution, a new directory ``dist/`` was created under your project's root directory. That's where you'll find your distribution file(s) to upload.
eo: Kiam vi rulis la komandon por krei vian distribuon, kreiĝis nova dosierujo ``dist/`` sub la radika dosierujo de via projekto. Tie vi troviĝas la alŝutota(j)n distribua(j)n dosiero(j)n.
ja: 配布物を作成するコマンドを走らせると、あなたのプロジェクトのルートディレクトリに ``dist/`` という新しいディレクトリが作成されます。ここに配布物のファイル(群)が置かれます。
pt_br: Quando você executou o comando para criar sua distribuição, um novo diretório ``dist/`` foi criado no diretório raiz do seu projeto. É onde você encontrará seus arquivos de distribuição para enviar.
ru: Когда вы выполнили команду создания дистрибутива, под корневым каталогом вашего проекта был создан новый каталог ``dist/``. Именно в ней вы найдете файл(ы) дистрибутива для загрузки.
ta: உங்கள் விநியோகத்தை உருவாக்க நீங்கள் கட்டளையை இயக்கும்போது, உங்கள் திட்டத்தின் ரூட் கோப்பகத்தின் கீழ் `` DIST/`` ஒரு புதிய அடைவு உருவாக்கப்பட்டது. பதிவேற்ற உங்கள் விநியோக கோப்பு (களை) காண்பீர்கள்.
