Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If the ``license-files`` key is present and is set to a value of an empty array, then tools MUST NOT include any license files and MUST NOT raise an error. If the ``license-files`` key is not defined, tools can decide how to handle license files. For example they can choose not to include any files or use their own logic to discover the appropriate files in the distribution.
eo: Se la ŝlosilo ``license-files`` ekzistas kaj ĝia valoro estas malplena listo, do ilo DEVAS NE inkluzivi ajanan licencan dosieron kaj DEVAS NE sciigi pri eraro. Se la ŝlosilon ``license-files`` ne estas difinita, ilo povas decidi pri la traktado de licencaj dosieroj. Ekzemple, ĝi povas simple ne inkluzivi ajanan dosieron, aŭ uzi sian propran logikon por trovi la taŭgajn dosierojn en la distribuo.
ru: Если ключ ``license-files`` присутствует и имеет значение пустого массива, то инструменты НЕ ДОЛЖНЫ включать никакие файлы лицензий и НЕ ДОЛЖНЫ выдавать ошибку. Если ключ ``license-files`` не определен, инструменты могут сами решать, как обращаться с файлами лицензий. Например, они могут не включать никаких файлов или использовать собственную логику для обнаружения соответствующих файлов в дистрибутиве.
ta: `` உரிம-கோப்புகள்`` விசை இருந்தால், வெற்று வரிசையின் மதிப்பாக அமைக்கப்பட்டால், கருவிகளில் எந்த உரிமக் கோப்புகளையும் கொண்டிருக்கக்கூடாது, பிழையை உயர்த்தக்கூடாது. `` உரிம-கோப்புகள்`` விசை வரையறுக்கப்படவில்லை எனில், உரிமக் கோப்புகளை எவ்வாறு கையாள்வது என்பதை கருவிகள் தீர்மானிக்க முடியும். எடுத்துக்காட்டாக, அவர்கள் எந்த கோப்புகளையும் சேர்க்க வேண்டாம் என்று தேர்வு செய்யலாம் அல்லது விநியோகத்தில் பொருத்தமான கோப்புகளைக் கண்டறிய தங்கள் சொந்த தர்க்கத்தைப் பயன்படுத்தலாம்.

source: TOML_ type: Array of inline tables with string keys and values
eo: Tipo de TOML_: Listo de tabeloj de signoĉenaj ŝlosiloj kaj valoroj
ja: TOML_ 型: 文字列のキー・バリュー組を伴ったインラインテーブルの配列
pt_br: Tipo TOML_: Vetor de tabelas em linha com strings de chaves e valores
ru: TOML_ type: Массив строчных таблиц со строковыми ключами и значениями
ta: TOML_ வகை: சரம் விசைகள் மற்றும் மதிப்புகளுடன் இன்லைன் அட்டவணைகளின் வரிசை

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Author <core-metadata-author>`, :ref:`Author-email <core-metadata-author-email>`, :ref:`Maintainer <core-metadata-maintainer>`, and :ref:`Maintainer-email <core-metadata-maintainer-email>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Author <core-metadata-author>`, :ref:`Author-email <core-metadata-author-email>`, :ref:`Maintainer <core-metadata-maintainer>`, kaj :ref:`Maintainer-email <core-metadata-maintainer-email>`
ja: 対応する :ref:`コアとなるメタデータ <core-metadata>` フィールド: :ref:`Author <core-metadata-author>` ・ :ref:`Author-email <core-metadata-author-email>` ・ :ref:`Maintainer <core-metadata-maintainer>` ・ :ref:`Maintainer-email <core-metadata-maintainer-email>`
pt_br: Campos correspondentes dos :ref:`metadados principais <core-metadata>`: :ref:`Author <core-metadata-author>`, :ref:`Author-email <core-metadata-author-email>`, :ref:`Maintainer <core-metadata-maintainer>` e :ref:`Maintainer-email <core-metadata-maintainer-email>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Author <core-metadata-author>`, :ref:`Author-email <core-metadata-author-email>`, :ref:`Maintainer <core-metadata-maintainer>`, и :ref:`Maintainer-email <core-metadata-maintainer-email>`
ta: தொடர்புடைய: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `ஆசிரியர் <கோர்-மெட்டாடேட்டா-ஆசிரியர்>`,: குறிப்பு: `ஆசிரியர்-எமெயில் <கோர்-மெட்டாடேட்டா-ஆசிரியர்-எமெயில்>`,: குறிப்பு: `பராமரிப்பாளர் <core-metadata-maintainer>`, மற்றும்: ref: `பராமரிப்பாளர்-எமெயில் <core-Metadata-Maintainer-email> `

source: The people or organizations considered to be the "authors" of the project. The exact meaning is open to interpretation — it may list the original or primary authors, current maintainers, or owners of the package.
eo: Homoj aŭ organizaĵoj rigardataj kiel la «aŭtoroj» de la projekto. La preciza signifo dependas de interpretad – ĝi povas listigi la originalajn aŭ ĉefajn verkintojn, aktualajn mastrumantojn, aŭ posedantojn de la pako.
ja: プロジェクトの "作者" であると考えられる人々ないし組織。正確な意味はさまざまに解釈可能です — 元々のまたは主要な作者でも構わないし、現在の保守者やパッケージのオーナでも構いません。
pt_br: As pessoas ou organizações consideradas "autoras" do projeto. O significado exato está aberto à interpretação -- pode listar os autores originais ou primários, mantenedores atuais ou proprietários do pacote.
ru: Люди или организации, считающиеся "авторами" проекта. Точное значение открыто для интерпретации - это может быть список оригинальных или основных авторов, текущих сопровождающих или владельцев пакета.
ta: திட்டத்தின் "ஆசிரியர்கள்" என்று கருதப்படும் நபர்கள் அல்லது அமைப்புகள். சரியான பொருள் விளக்கத்திற்கு திறந்திருக்கும் - இது அசல் அல்லது முதன்மை ஆசிரியர்கள், தற்போதைய பராமரிப்பாளர்கள் அல்லது தொகுப்பின் உரிமையாளர்களை பட்டியலிடலாம்.

source: The "maintainers" key is similar to "authors" in that its exact meaning is open to interpretation.
eo: La ŝlosilo ``maintainers`` similas al ``authors``: ĝia preciza signifo dependas de interpretado.
ja: "maintainers" キーは "authors" キーに似ていて、その正確な意味はさまざまに解釈可能です。
pt_br: A chave "maintainers" é semelhante a "authors" no sentido de que seu significado exato está aberto à interpretação.
ru: Ключ "maintainers" похож на "authors" тем, что его точное значение можно интерпретировать.
ta: "பராமரிப்பாளர்கள்" விசை "ஆசிரியர்களுக்கு" ஒத்ததாகும், அதன் சரியான பொருள் விளக்கத்திற்கு திறந்திருக்கும்.

source: These keys accept an array of tables with 2 keys: ``name`` and ``email``. Both values must be strings. The ``name`` value MUST be a valid email name (i.e. whatever can be put as a name, before an email, in :rfc:`822`) and not contain commas. The ``email`` value MUST be a valid email address. Both keys are optional, but at least one of the keys must be specified in the table.
eo: Tiuj ŝlosiloj akceptas liston de tabeloj kun du ŝlosiloj: ``name`` kaj ``email``. Ambaŭ valoroj estas tekstaj. La valoro de ``name`` DEVAS esti valida retpoŝta nomo (tiu, kiu povas servi kiel nomo antaŭ retpoŝta adreso en :rfc:`822`) kaj ne povas inkluzivi komon. La valoro de ``email`` DEVAS esti valida retpoŝta adreso. Ambaŭ ŝlosiloj estas ellaseblaj, sed la tabelo devas enhavi almenaŭ unu el la duo.
ja: これらのキーは、 ``name`` と ``email`` のふたつのキーを伴ったテーブルの配列を受け入れます。両方の値は文字列でなければなりません。 ``name`` の値は、電子メールアドレスにおける正当な名前 (すなわち、 :rfc:`822` における電子メールアドレスのアドレス部分に前置できる名前なら何でも可) で、コンマを含まないものでなければなりません。 ``email`` の値は、正当な電子メールアドレスでなければなりません。これらのキーは共に必須ではありませんが、少なくともいずれかのキーがテーブル内で指定されていなければなりません。
pt_br: Estas chaves aceitam um vetor de tabelas com 2 chaves: ``name`` e ``email``. Ambos os valores devem ser strings. O valor ``name`` DEVE ser um nome de e-mail válido (ou seja, o que quer que possa ser colocado como um nome, antes de um e-mail, em :rfc:`822`) e não conter vírgulas. O valor ``email`` DEVE ser um endereço de email válido. Ambas as chaves são opcionais, mas ao menos uma das chaves deve ser especificada na tabela.
ru: Эти ключи принимают массив таблиц с 2 ключами: ``имя`` и ``email``. Оба значения должны быть строками. Значение ``name`` ДОЛЖНО быть действительным именем электронной почты (т.е. тем, что может быть указано в качестве имени перед электронной почтой в :rfc:`822`) и не содержать запятых. Значение ``email`` ДОЛЖНО быть действительным адресом электронной почты. Оба ключа необязательны, но хотя бы один из них должен быть указан в таблице.
ta: இந்த விசைகள் 2 விசைகள் கொண்ட அட்டவணைகளின் வரிசையை ஏற்றுக்கொள்கின்றன: `` பெயர்`` மற்றும் `` மின்னஞ்சல்``. இரண்டு மதிப்புகளும் சரங்களாக இருக்க வேண்டும். `` பெயர்`` மதிப்பு செல்லுபடியாகும் மின்னஞ்சல் பெயராக இருக்க வேண்டும் (அதாவது ஒரு பெயராக, மின்னஞ்சலுக்கு முன், இல், இல்: rfc: `822`) மற்றும் காற்புள்ளிகள் இல்லை. `` மின்னஞ்சல்`` மதிப்பு சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும். இரண்டு விசைகளும் விருப்பமானவை, ஆனால் குறைந்தபட்சம் விசைகளில் ஒன்று அட்டவணையில் குறிப்பிடப்பட வேண்டும்.

source: Using the data to fill in :ref:`core metadata <core-metadata>` is as follows:
eo: La datenoj respondas al :ref:`kernaj metadatenoj <core-metadata>` jene:
ja: データを使って :ref:`コアとなるメタデータ <core-metadata>` に書き込むやり方は次の通りです:
pt_br: O uso dos dados para preencher :ref:`metadados principais <core-metadata>` deve ser feito da seguinte forma:
ru: Использование данных для заполнения :ref:`core metadata <core-metadata>` осуществляется следующим образом:
ta: நிரப்ப தரவைப் பயன்படுத்துதல்: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` பின்வருமாறு:

source: If only ``name`` is provided, the value goes in :ref:`Author <core-metadata-author>` or :ref:`Maintainer <core-metadata-maintainer>` as appropriate.
eo: Se nur ``name`` estas provizita, la valoro respondas al :ref:`Author <core-metadata-author>` aŭ :ref:`Maintainer <core-metadata-maintainer>` depende.
ja: ``name`` だけが与えられた場合には、その値を :ref:`Author <core-metadata-author>` なり :ref:`Maintainer <core-metadata-maintainer>` なりに書き込みます。
pt_br: Se somente ``name`` for fornecido, o valor vai em :ref:`Author <core-metadata-author>` ou :ref:`Maintainer <core-metadata-maintainer>` conforme apropriado.
ru: Если указано только ``имя``, значение помещается в :ref:`Author <core-metadata-author>` или :ref:`Maintainer <core-metadata-maintainer>` в зависимости от ситуации.
ta: `` பெயர்`` மட்டுமே வழங்கப்பட்டால், மதிப்பு: குறிப்பு: `ஆசிரியர் <கோர்-மெட்டாடேட்டா-ஆசிரியர்>` அல்லது: குறிப்பு: `பராமரிப்பாளர் <கோர்-மெட்டாடேட்டா-ஐன்டெய்னர்>` பொருத்தமானதாகும்.

source: If only ``email`` is provided, the value goes in :ref:`Author-email <core-metadata-author-email>` or :ref:`Maintainer-email <core-metadata-maintainer-email>` as appropriate.
eo: Se nur ``email`` estas provizita, la valoro respondas al :ref:`Author-email <core-metadata-author-email>` aŭ :ref:`Maintainer-email <core-metadata-maintainer-email>` depende.
ja: ``email`` だけの場合には、その値を :ref:`Author-email <core-metadata-author-email>` なり :ref:`Maintainer-email <core-metadata-maintainer-email>` なりに書き込みます。
pt_br: Se somente ``email`` é fornecido, o valor vai em :ref:`Author-email <core-metadata-author-email>` ou :ref:`Maintainer-email <core-metadata-maintainer-email>` conforme apropriado.
ru: Если указан только ``email``, значение помещается в :ref:`Author-email <core-metadata-author-email>` или :ref:`Maintainer-email <core-metadata-maintainer-email>` в зависимости от ситуации.
ta: `` மின்னஞ்சல்`` மட்டுமே வழங்கப்பட்டால், மதிப்பு உள்ளே செல்கிறது: குறிப்பு: `ஆசிரியர்-எமெயில் <கோர்-மெட்டாடேட்டா-ஆசிரியர்-எமெயில்>` அல்லது: குறிப்பு: `பராமரிப்பாளர்-எமெயில் <கோர்-மெட்டாடேட்டா-திருவிழா-எமெயில்>` என பொருத்தமானது.

source: If both ``email`` and ``name`` are provided, the value goes in :ref:`Author-email <core-metadata-author-email>` or :ref:`Maintainer-email <core-metadata-maintainer-email>` as appropriate, with the format ``{name} <{email}>``.
eo: Se kaj ``email`` kaj ``name`` estas provizitaj, la valoroj respondas al :ref:`Author-email <core-metadata-author-email>` aŭ :ref:`Maintainer-email <core-metadata-maintainer-email>` depende, en la formo ``{name} <{email}>``.
ja: ``email`` と ``name`` の両方が与えられた場合には、 ``{name} <{email}>`` のフォーマットで :ref:`Author-email <core-metadata-author-email>` なり :ref:`Maintainer-email <core-metadata-maintainer-email>` なりに書き込みます。
pt_br: Se ``email`` e ``name`` são fornecidos, o valor vai em :ref:`Author-email <core-metadata-author-email>` ou :ref:`Maintainer-email <core-metadata-maintainer-email>` conforme apropriado, com o formado ``{name} <{email}>``.
ru: Если указаны и ``email``, и ``name``, значение помещается в :ref:`Author-email <core-metadata-author-email>` или :ref:`Maintainer-email <core-metadata-maintainer-email>` в зависимости от ситуации, с форматом ``{name} <{email}>```.
ta: `` மின்னஞ்சல்`` மற்றும் `பெயர்`` இரண்டும் வழங்கப்பட்டால், மதிப்பு: ref:` ஆசிரியர்-எமெயில் <கோர்-மெட்டாடேட்டா-ஆசிரியர்-எமெயில்> `அல்லது: குறிப்பு:` பராமரிப்பாளர்-எமெயில் <கோர்-மெட்டாடேட்டா- `` {name} <{email}> `` வடிவத்துடன் பராமரிப்பாளர்-எமெயில்> `பொருத்தமானது.

source: Multiple values should be separated by commas.
eo: Oni apartigu plurajn valorojn per komoj.
ja: 複数の値がある場合はコンマで区切るべきです。
pt_br: Vários valores devem ser separados por vírgulas.
ru: Несколько значений должны быть разделены запятыми.
ta: பல மதிப்புகள் காற்புள்ளிகளால் பிரிக்கப்பட வேண்டும்.

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Keywords <core-metadata-keywords>`
eo: Respondas al la :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Keywords <core-metadata-keywords>`
ja: 対応する :ref:`コアとなるメタデータ <core-metadata>` フィールド: :ref:`Keywords <core-metadata-keywords`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Keywords <core-metadata-keywords>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Keywords <core-metadata-keywords>`
ta: தொடர்புடைய: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `முக்கிய வார்த்தைகள் <கோர்-மெட்டாடேட்டா-கீவேர்டுகள்>`

source: The keywords for the project.
eo: La ŝlosilvortoj pri la projekto.
ja: プロジェクトに関するキーワード。
pt_br: As palavras-chave do projeto.
ru: Ключевые слова для проекта.
ta: திட்டத்திற்கான முக்கிய வார்த்தைகள்.

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Classifier <core-metadata-classifier>`
eo: Respondas al la :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Classifier <core-metadata-classifier>`
ja: 対応する :ref:`コアとなるメタデータ <core-metadata>` フィールド: :ref:`Classifier <core-metadata-classifier>`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Classifier <core-metadata-classifier>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Classifier <core-metadata-classifier>`
ta: தொடர்புடைய: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `வகைப்படுத்தி <கோர்-மெட்டாடேட்டா-கிளாசிஃபையர்>`

source: Trove classifiers which apply to the project.
eo: Klasigiloj Trove rilataj al la projekto.
ja: プロジェクトに適合する Trove 分類子。
pt_br: Classificadores Trove que se aplicam ao projeto.
ru: Классификаторы Trove, применимые к проекту.
ta: திட்டத்திற்கு பொருந்தும் வகைப்படுத்திகள்.

source: The use of ``License ::`` classifiers is deprecated and tools MAY issue a warning informing users about that. Build tools MAY raise an error if both the ``license`` string value (translating to ``License-Expression`` metadata field) and the ``License ::`` classifiers are used.
eo: La uzado de klasigiloj ``License ::`` estas evitinda. Ilo POVAS averti uzantojn pri tio. Konstruilo POVAS sciigi pri eraro, se kaj la signoĉena valoro ``license`` (por la metadatena kampo ``License-Expression``) kaj klasigilo ``License ::`` estas uzataj.
ru: Использование классификаторов ``License ::`` устарело, и инструменты МОГУТ выдавать предупреждение, информирующее об этом пользователей. Инструменты сборки МОГУТ выдать ошибку, если используется как строковое значение ``license`` (перевод в поле метаданных ``License-Expression``), так и классификаторы ``License ::``.
ta: `` உரிமம் :: `` வகைப்படுத்திகள் நீக்கப்படுகின்றன, மேலும் கருவிகள் அதைப் பற்றி பயனர்களுக்கு தெரிவிக்கும் எச்சரிக்கையை வழங்கக்கூடும். `` உரிமம்` சரம் மதிப்பு (`` உரிமம்-வெளிப்பாடு`` மேனிலை தரவு புலத்திற்கு மொழிபெயர்க்கிறது) மற்றும் `` உரிமம் :: `` வகைப்படுத்திகள் பயன்படுத்தப்பட்டால் உருவாக்க கருவிகள் பிழையை எழுப்பக்கூடும்.

source: TOML_ type: table with keys and values of strings
eo: Tipo de TOML_: tabelo kun ŝlosiloj kaj valoroj signoĉenaj
ja: TOML_ 型: 文字列のキー・バリューを伴うテーブル
pt_br: Tipo TOML_: tabela com chaves e valores de strings
ru: Тип TOML_: таблица с ключами и значениями строк
ta: TOML_ வகை: சரங்களின் விசைகள் மற்றும் மதிப்புகள் கொண்ட அட்டவணை

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Project-URL <core-metadata-project-url>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Project-URL <core-metadata-project-url>`
ja: 対応する :ref:`コアとなるメタデータ <core-metadata>` フィールド: :ref:`Project-URL <core-metadata-project-url>`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Project-URL <core-metadata-project-url>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Project-URL <core-metadata-project-url>`
ta: தொடர்புடைய: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `திட்டம்-உர் <கோர்-மெட்டாடேட்டா-புரோசெக்ட்-உர்எல்>`

source: A table of URLs where the key is the URL label and the value is the URL itself. See :ref:`well-known-project-urls` for normalization rules and well-known rules when processing metadata for presentation.
eo: Tabelo de retadresoj, en kiu la ŝlosilo estas la retadresa etikedo kaj la valoro estas la retadreso mem. Vidu :ref:`well-known-project-urls` por reguloj pri normigado kaj prezentado de bone konataj metadatenoj.
ru: Таблица URL-адресов, где ключом является метка URL, а значением - сам URL. См. :ref:`well-known-project-urls` для правил нормализации и общеизвестных правил при обработке метаданных для представления.
ta: முகவரி களின் அட்டவணை முகவரி சிட்டை மற்றும் மதிப்பு முகவரி தானே. காண்க: குறிப்பு: விளக்கக்காட்சிக்கான மெட்டாடேட்டாவை செயலாக்கும்போது இயல்பாக்குதல் விதிகள் மற்றும் நன்கு அறியப்பட்ட விதிகளுக்கு `நன்கு அறியப்பட்ட-திட்ட-உர்எல்எச்`.

source: Entry points
eo: Enirpunktoj
ja: エントリポイント
pt_br: Pontos de entrada
ru: Точки входа
ta: நுழைவு புள்ளிகள்

source: TOML_ type: table (``[project.scripts]``, ``[project.gui-scripts]``, and ``[project.entry-points]``)
eo: Tipo de TOML_: tabelo (``[project.scripts]``, ``[project.gui-scripts]``, kaj ``[project.entry-points]``)
ja: TOML_ 型: table (``[project.scripts]`` ・ ``[project.gui-scripts]`` ・ ``[project.entry-points]``)
pt_br: Tipo TOML_: tabela (``[project.scripts]``, ``[project.gui-scripts]`` e ``[project.entry-points]``)
ru: Тип TOML_: таблица (``[project.scripts]``, ``[project.gui-scripts]``, и ``[project.entry-points]``)
ta: TOML_ வகை: அட்டவணை (`` [project.scripts] ``, `` [project.gui-scripts] ``, மற்றும் `` [project.entry- புள்ளிகள்] ``)

source: :ref:`Entry points specification <entry-points>`
eo: :ref:`Specifo pri enirpunktoj <entry-points>`
pt_br: :ref:`Especificação de pontos de entrada <entry-points>`
ru: :ref:`Спецификация точек входа <entry-points>`
ta: : Ref: `நுழைவு புள்ளிகள் விவரக்குறிப்பு <நுழைவு புள்ளிகள்>`

source: There are three tables related to entry points. The ``[project.scripts]`` table corresponds to the ``console_scripts`` group in the :ref:`entry points specification <entry-points>`. The key of the table is the name of the entry point and the value is the object reference.
eo: Ekzistas tri tabeloj pri enirpunktoj. La tabelo ``[project.scripts]`` respondas al la grupo ``console_scripts`` en :ref:`la normo pri enirpunktoj <entry-points>`. La ŝlosilo de la tabelo estas la nomo de la enirpunkto; la valoro estas la referenco al objekto.
ja: みっつのテーブルがエントリポイントに関係しています。 ``[project.scripts]`` テーブルは、 :ref:`エントリポイント仕様 <entry-points>` の中の ``console_scripts`` グループに対応しています。テーブル内のキーはエントリポイントの名前であり、値は参照されるオブジェクトです。
pt_br: Existem três tabelas relacionadas aos pontos de entrada. A tabela ``[project.scripts]`` corresponde ao grupo ``console_scripts`` na :ref:`especificação de pontos de entrada <entry-points>`. A chave da tabela é o nome do ponto de entrada e o valor é a referência do objeto.
ru: Существует три таблицы, связанные с точками входа. Таблица ``[project.scripts]`` соответствует группе ``console_scripts`` в :ref:`спецификации точек входа <entry-points>`. Ключом таблицы является имя точки входа, а значением - ссылка на объект.
ta: நுழைவு புள்ளிகள் தொடர்பான மூன்று அட்டவணைகள் உள்ளன. `` [Project.scripts] `` அட்டவணை `` Console_scripts`` குழுவிற்கு ஒத்திருக்கிறது: ref: `நுழைவு புள்ளிகள் விவரக்குறிப்பு <நுழைவு புள்ளிகள்>`. அட்டவணையின் விசை நுழைவு புள்ளியின் பெயர் மற்றும் மதிப்பு பொருள் குறிப்பு.

source: The ``[project.gui-scripts]`` table corresponds to the ``gui_scripts`` group in the :ref:`entry points specification <entry-points>`. Its format is the same as ``[project.scripts]``.
eo: La tabelo ``[project.gui-scripts]`` respondas al la grupo ``gui_scripts`` en :ref:`la specifo pri enirpunktoj <entry-points>`. Ĝia formo estas sama kiel ``[project.scripts]``.
ja: ``[project.gui-scripts]`` テーブルは、 :ref:`エントリポイント仕様 <entry-points>` の中の ``gui_scripts`` グループに対応します。そのフォーマットは ``[project.scripts]`` と同じです。
pt_br: A tabela ``[project.gui-scripts]`` corresponde ao grupo ``gui_scripts`` na :ref:`especificação de pontos de entrada <entry-points>`. Seu formato é o mesmo que ``[project.scripts]``.
ru: Таблица ``[project.gui-scripts]`` соответствует группе ``gui_scripts`` в спецификации точек входа <entry-points>`. Ее формат такой же, как и у ``[project.scripts]``.
ta: `` [Project.gui-scripts] `` அட்டவணை `` gui_scripts`` குழுவிற்கு ஒத்திருக்கிறது: ref: `நுழைவு புள்ளிகள் விவரக்குறிப்பு <நுழைவு புள்ளிகள்>`. அதன் வடிவம் `` [project.scripts] `` போன்றது.

source: The ``[project.entry-points]`` table is a collection of tables. Each sub-table's name is an entry point group. The key and value semantics are the same as ``[project.scripts]``. Users MUST NOT create nested sub-tables but instead keep the entry point groups to only one level deep.
eo: La tabelo ``[project.entry-points]`` estas tabelo da subtabeloj. La nomo de subtabelo estas enirpunktogrupo. La semantikoj de ŝlosiloj kaj valoroj estas la sama kiel la semantiko de ``[project.scripts]``. Uzanto DEVAS NE krei subsubtabelojn; la profundo de ingado de la enirpunktogrupoj estu nur unu nivelo.
ja: ``[project.entry-points]`` テーブルは、テーブルの集合体です。それぞれのサブテーブルの名前は、ひとつのエントリポイントグループです。キーと値の意味するところは ``[project.scripts]`` と同じです。ユーザはネストしたサブテーブルを作ってはならず、代わりにエントリポイントグループを１段階の深さに保つようにしなければなりません。
pt_br: A tabela ``[project.entry-points]`` é uma coleção de tabelas. O nome de cada subtabela é um grupo de pontos de entrada. A chave e a semântica do valor são iguais a ``[project.scripts]``. Os usuários NÃO DEVEM criar subtabelas aninhadas, mas sim manter os grupos de pontos de entrada em apenas um nível de profundidade.
ru: Таблица ``[project.entry-points]`` представляет собой набор таблиц. Имя каждой подтаблицы - это группа точек входа. Семантика ключей и значений такая же, как и в таблице ``[project.scripts]``. Пользователи НЕ ДОЛЖНЫ создавать вложенные подтаблицы, а должны ограничиваться группами точек входа только одного уровня.
ta: `` [Project.entry- புள்ளிகள்] `` அட்டவணை என்பது அட்டவணைகளின் தொகுப்பாகும். ஒவ்வொரு துணை அட்டவணையின் பெயரும் ஒரு நுழைவு புள்ளி குழு. விசை மற்றும் மதிப்பு சொற்பொருள் `` [project.scripts] `` போன்றவை. பயனர்கள் உள்ளமைக்கப்பட்ட துணை அட்டவணைகளை உருவாக்கக்கூடாது, மாறாக நுழைவு புள்ளி குழுக்களை ஒரே ஒரு நிலைக்கு மட்டுமே ஆழமாக வைத்திருக்க வேண்டும்.
