Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: ``venv`` will create a virtual Python installation in the ``.venv`` folder.
eo: ``venv`` kreos virtualan Python-instalon en la dosierujo ``.venv``.
ja: ``venv`` は仮想的な Python を ``.venv`` ディレクトリの中にインストールするでしょう。
pt_br: ``venv`` irá criar uma instalação virtual Python na pasta ``.venv``.
ru: ``venv`` создаст виртуальную установку Python в папке ``.venv``.
ta: `` .venv`` கோப்புறையில் ஒரு மெய்நிகர் பைதான் நிறுவலை உருவாக்கும் `` vev``.

source: You should exclude your virtual environment directory from your version control system using ``.gitignore`` or similar.
eo: Vi ekskluzivu vian virtualmedian dosierujon el via versikontrola sistemo per ``.gitignore`` aŭ io simila.
ja: 仮想環境のディレクトリは、 ``.gitignore`` やその類似物を使ってバージョン管理システムから除外しておくべきです。
pt_br: Você deve excluir seu diretório de ambiente virtual de seu sistema de controle de versão usando ``.gitignore`` ou similar.
ru: Вы должны исключить каталог виртуального окружения из системы контроля версий с помощью ``.gitignore`` или аналогичного инструмента.
ta: உங்கள் மெய்நிகர் சுற்றுச்சூழல் கோப்பகத்தை உங்கள் பதிப்பு கட்டுப்பாட்டு அமைப்பிலிருந்து `` .gitignore`` அல்லது அதற்கு ஒத்ததாக விலக்க வேண்டும்.

source: Activate a virtual environment
eo: Aktivigi virtualan medion
ja: 仮想環境を活性化する
pt_br: Ativar um ambiente virtual
ru: Активация виртуальной среды
ta: மெய்நிகர் சூழலை செயல்படுத்தவும்

source: Before you can start installing or using packages in your virtual environment you'll need to ``activate`` it. Activating a virtual environment will put the virtual environment-specific ``python`` and ``pip`` executables into your shell's ``PATH``.
eo: Antaŭ ol oni povas ekinstali aŭ ekuzi pakojn en sia virtuala medio, oni devas «aktivigi» ĝin. Aktivigado de virtuala medio metos ruleblaĵojn ``python`` kaj ``pip`` por la virtuala medio en la medivariablon ``PATH`` de la ŝelo.
ja: 仮想環境に (依存先の) パッケージをインストールして使用できるようにするには、まず *仮想環境* を ``activate`` しなければなりません。仮想環境を活性化すると、その仮想環境に特有の ``python`` と ``pip`` の実行ファイルがシェルの ``PATH`` 変数に追加されます。
pt_br: Antes de começar a instalar ou usar pacotes em seu ambiente virtual, você precisará ativá-lo, com ``activate``. Ativar um ambiente virtual colocará os executáveis ``python`` e ``pip`` específicos do ambiente virtual no ``PATH`` de seu shell.
ru: Прежде чем вы начнете устанавливать или использовать пакеты в виртуальной среде, ее нужно будет ``активировать``. Активация виртуальной среды поместит специфические для виртуальной среды исполняемые файлы ``python`` и ``pip`` в ``PATH`` вашей оболочки.
ta: உங்கள் மெய்நிகர் சூழலில் தொகுப்புகளை நிறுவவோ பயன்படுத்தவோ தொடங்குவதற்கு முன், நீங்கள் அதை `` செயல்படுத்த வேண்டும்`. ஒரு மெய்நிகர் சூழலைச் செயல்படுத்துவது மெய்நிகர் சூழல் சார்ந்த `` பைதான்`` மற்றும் `பிப்`` இயங்கக்கூடியவை உங்கள் செல்லின்` `பாதை`` செய்யும்.

source: To confirm the virtual environment is activated, check the location of your Python interpreter:
eo: Por konfirmi, ke la virtuala medio estas aktiva, kontrolu la lokon de via Python-interpretilo:
ja: 仮想環境が activate されたことを確認するには、 Python インタープリタの場所を確かめましょう:
pt_br: Para confirmar o ambiente virtual está ativado, verifique o local do seu interpretador Python:
ru: Чтобы убедиться, что виртуальная среда активирована, проверьте расположение вашего интерпретатора Python:
ta: மெய்நிகர் சூழல் செயல்படுத்தப்பட்டதை உறுதிப்படுத்த, உங்கள் பைதான் மொழிபெயர்ப்பாளரின் இருப்பிடத்தை சரிபார்க்கவும்:

source: While the virtual environment is active, the above command will output a filepath that includes the ``.venv`` directory, by ending with the following:
eo: Dum la virtuala medio aktivas, la ĉi-supra komando eligos dosierindikon inkluzivan la dosierujon ``.venv``, finiĝante jene:
ja: 仮想環境が active である間は、上記のコマンドは ``.venv`` ディレクトリを含むファイルパスを出力することでしょう、つまり以下のようになって終了します:
pt_br: Enquanto o ambiente virtual estiver ativo, o comando acima irá gerar um caminho de arquivo que inclui o diretório ``.venv``, terminando com o seguinte:
ru: Пока виртуальная среда активна, приведенная выше команда выведет путь к файлу, включающий каталог ``.venv``, заканчивающийся следующим образом:
ta: மெய்நிகர் சூழல் செயலில் இருக்கும்போது, மேற்கண்ட கட்டளை பின்வருவனவற்றுடன் முடிவடைவதன் மூலம் `` .venv`` கோப்பகத்தை உள்ளடக்கிய ஒரு கோப்பு இடத்தை வெளியிடும்:

source: While a virtual environment is activated, pip will install packages into that specific environment. This enables you to import and use packages in your Python application.
eo: Kiam virtuala medio estas aktiva, pip instalas pakojn en tiun medion. Tio permesas importi kaj uzi pakojn en sia Python-programo.
ja: 仮想環境が active である間は、pip はパッケージをその仮想環境内にインストールします。これによって、あなたの Python アプリケーションからそのパッケージをインポートして使用することができるようになります。
pt_br: Enquanto um ambiente virtual estiver ativado, pip instalará pacotes naquele ambiente específico. Isso permite que você importe e use pacotes em sua aplicação Python.
ru: Пока виртуальная среда активирована, pip будет устанавливать пакеты в эту среду. Это позволит вам импортировать и использовать пакеты в вашем приложении Python.
ta: ஒரு மெய்நிகர் சூழல் செயல்படுத்தப்படும் போது, பிஐபி அந்த குறிப்பிட்ட சூழலில் தொகுப்புகளை நிறுவும். இது உங்கள் பைதான் பயன்பாட்டில் தொகுப்புகளை இறக்குமதி செய்து பயன்படுத்த உதவுகிறது.

source: Deactivate a virtual environment
eo: Malaktivigi virtualan medion
ja: 仮想環境を非活性化 <deactivate> する
pt_br: Desativar um ambiente virtual
ru: Деактивация виртуальной среды
ta: மெய்நிகர் சூழலை செயலிழக்கச் செய்யுங்கள்

source: If you want to switch projects or leave your virtual environment, ``deactivate`` the environment:
eo: Se vi volas ŝanĝi projektojn aŭ lasi vian virtualan medion, ``malaktivigu`` la medion:
ja: プロジェクトを切り替えたい、あるいは、仮想環境から離脱したい時は、仮想環境を ``deactivate`` してください:
pt_br: Se você deseja trocar de projeto ou sair do seu ambiente virtual, desative o ambiente com ``deactivate``:
ru: Если вы хотите сменить проект или покинуть виртуальную среду, ``деактивируйте`` среду:
ta: நீங்கள் திட்டங்களை மாற்ற விரும்பினால் அல்லது உங்கள் மெய்நிகர் சூழலை விட்டு வெளியேற விரும்பினால், `` செயலிழக்கச் செய்யுங்கள்` சூழலை:

source: Closing your shell will deactivate the virtual environment. If you open a new shell window and want to use the virtual environment, reactivate it.
eo: Fermado de la ŝelo malaktivigos la virtualan medion. Se vi malfermas novan ŝelan fenestron kaj volas uzi la virtualan medion, reaktivigu ĝin.
ja: シェルを終了すれば、仮想環境を非活性化 <deactivate> することになるでしょう。もし、新しいシェル窓を開いて、そこで仮想環境を使いたい時は、再活性化 <reactivate> してください。
pt_br: Fechar seu shell desativará o ambiente virtual. Se você abrir uma nova janela do shell e quiser usar o ambiente virtual, reative-o.
ru: Закрытие оболочки приведет к деактивации виртуальной среды. Если вы откроете новое окно оболочки и захотите использовать виртуальную среду, активируйте ее снова.
ta: உங்கள் செல்லை மூடுவது மெய்நிகர் சூழலை செயலிழக்கச் செய்யும். நீங்கள் ஒரு புதிய செல் சாளரத்தைத் திறந்து மெய்நிகர் சூழலைப் பயன்படுத்த விரும்பினால், அதை மீண்டும் செயல்படுத்தவும்.

source: Reactivate a virtual environment
eo: Reaktivigi virtualan medion
ja: 仮想環境を再活性化 <reactivate> する
pt_br: Reativar um ambiente virtual
ru: Повторная активация виртуальной среды
ta: மெய்நிகர் சூழலை மீண்டும் செயல்படுத்தவும்

source: If you want to reactivate an existing virtual environment, follow the same instructions about activating a virtual environment. There's no need to create a new virtual environment.
eo: Se vi volas reaktivigi ekzistantan virtualan medion, sekvu la samajn instrukciojn pri aktivigado de virtuala medio. Ne necesas krei novan virtualan medion.
ja: 既存の仮想環境を活性化 <activate> したい場合は、仮想環境の活性化に関する上述のやり方に従ってください。新しい仮想環境を作成する必要はありません。
pt_br: Se você quiser reativar um ambiente virtual existente, siga as mesmas instruções sobre como ativar um ambiente virtual. Não há necessidade de criar um novo ambiente virtual.
ru: Если вы хотите повторно активировать существующую виртуальную среду, следуйте тем же инструкциям по активации виртуальной среды. Создавать новую виртуальную среду не нужно.
ta: ஏற்கனவே உள்ள மெய்நிகர் சூழலை மீண்டும் செயல்படுத்த விரும்பினால், மெய்நிகர் சூழலை செயல்படுத்துவது குறித்த அதே வழிமுறைகளைப் பின்பற்றவும். புதிய மெய்நிகர் சூழலை உருவாக்க வேண்டிய அவசியமில்லை.

source: :ref:`pip` is the reference Python package manager. It's used to install and update packages into a virtual environment.
eo: :ref:`pip` estas la referenca Python-pakadministrilo. Oni uzas ĝin por instali kaj ĝisdatigi pakojn en virtualan medion.
ja: :ref:`pip` は Python の参照モデルとなるパッケージマネージャです。仮想環境内でパッケージのインストールや更新に用いられます。
pt_br: :ref:`pip` é o gerenciador de pacotes de referência Python. É usado para instalar e atualizar pacotes. Ele é usado para instalar e atualizar pacotes em um ambiente virtual.
ru: :ref:`pip` - эталонный менеджер пакетов Python. Он используется для установки и обновления пакетов в виртуальной среде.
ta: : குறிப்பு: `பிப்` என்பது குறிப்பு பைதான் தொகுப்பு மேலாளர். தொகுப்புகளை மெய்நிகர் சூழலில் நிறுவவும் புதுப்பிக்கவும் இது பயன்படுகிறது.

source: The Python installers for macOS include pip. On Linux, you may have to install an additional package such as ``python3-pip``. You can make sure that pip is up-to-date by running:
eo: La Python-instalilo por macOS inkluzivas pip. Sur Linux, oni eble devas instali plian pakon kiel ``python3-pip``. Oni certigas la ĝisdatigitecon de pip rulante la jenon:
ja: MacOS 用の Python インストーラは pip を含んでいます。Linux では、 ``python3-pip`` のような追加のパッケージをインストールしなければならないかもしれません。以下のようにすると pip が最新版であることを確実にすることができます:
pt_br: Os instaladores de Python para macOS incluem pip. No Linux, você pode ter que instalar um pacote adicional como ``python3-pip``. Você pode ter certeza de que o pip está atualizado executando:
ru: Python установщики для macOS включают pip. На Linux вам, возможно, придется установить дополнительный пакет, такой как ``python3-pip``. Вы можете убедиться, что pip обновляется при запуске:
ta: MACOS க்கான பைதான் நிறுவிகளில் PIP அடங்கும். லினக்சில், `` பைதான் 3-பிப்`` போன்ற கூடுதல் தொகுப்பை நீங்கள் நிறுவ வேண்டியிருக்கும். இயங்குவதன் மூலம் பிஐபி புதுப்பித்த நிலையில் இருப்பதை நீங்கள் உறுதிப்படுத்திக் கொள்ளலாம்:

source: Afterwards, you should have the latest version of pip installed in your user site:
eo: Poste, vi estos instalinta la plej novan version de pip en vian lokon de uzanto:
ja: それから、ユーザサイトには最新版の pip がインストールされているはずです:
pt_br: Depois disso, você deve ter a versão mais recente do pip instalado em seu site de usuário:
ru: После этого на вашем пользовательском сайте должна быть установлена последняя версия pip:
ta: பின்னர், உங்கள் பயனர் தளத்தில் PIP இன் அண்மைக் கால பதிப்பை நிறுவ வேண்டும்:

source: The Python installers for Windows include pip. You can make sure that pip is up-to-date by running:
eo: La Python-instaliloj por Windows inkluzivas pip. Vi povas certigi ke pip estas ĝisdata rulante la jenon:
ja: Windows 用の Python インストーラは pip を含んでいます。以下のようにすると pip が最新版であることを確実にすることができます:
pt_br: Os instaladores do Python para Windows incluem pip. Você pode garantir que o pip está atualizado usando:
ru: Установщики Python для Windows включают pip. Вы можете убедиться, что pip обновлён до последней версии, запустив:
ta: விண்டோசிற்கான பைதான் நிறுவிகளில் பிஐபி அடங்கும். இயங்குவதன் மூலம் பிஐபி புதுப்பித்த நிலையில் இருப்பதை நீங்கள் உறுதிப்படுத்திக் கொள்ளலாம்:

source: Afterwards, you should have the latest version of pip:
eo: Poste, vi havos la plej novan version de pip:
ja: その後、pip が最新版になっているはずです:
pt_br: Depois disso, você deve ter a versão mais recente do pip:
ru: После этого у вас должна быть установлена последняя версия pip:
ta: பின்னர், PIP இன் அண்மைக் கால பதிப்பு உங்களிடம் இருக்க வேண்டும்:

source: Install packages using pip
eo: Instali pakojn per pip
ja: pip を使ってパッケージをインストールする
pt_br: Instalar pacotes usando pip
ru: Установка пакетов с помощью pip
ta: PIP ஐப் பயன்படுத்தி தொகுப்புகளை நிறுவவும்

source: When your virtual environment is activated, you can install packages. Use the ``pip install`` command to install packages.
eo: Kiam via virtuala medio estas aktivigita, vi povas instali pakojn. Uzu la komandon ``pip install`` por instali pakojn.
ja: 仮想環境が活性化状態にある時には、パッケージ群をインストールすることができます。パッケージをインストールするには ``pip install`` コマンドを使ってください。
pt_br: Quando seu ambiente virtual estiver ativado, você poderá instalar pacotes. Use o comando ``pip install`` para instalar pacotes.
ru: Когда ваша виртуальная среда активирована, вы можете устанавливать пакеты. Для установки пакетов используйте команду ``pip install``.
ta: உங்கள் மெய்நிகர் சூழல் செயல்படுத்தப்படும்போது, நீங்கள் தொகுப்புகளை நிறுவலாம். தொகுப்புகளை நிறுவ `` பிஐபி நிறுவல்` கட்டளையைப் பயன்படுத்தவும்.

source: Install a package
eo: Instali pakon
ja: パッケージをインストールする
pt_br: Instalar um pacote
ru: Установить пакет
ta: ஒரு தொகுப்பை நிறுவவும்

source: pip should download requests and all of its dependencies and install them:
eo: pip elŝutos requests kaj ĝiajn dependaĵojn kaj instalos ilin:
ja: pip が requests とその依存先パッケージをすべてダウンロードしてインストールするはずです:
pt_br: pip deve baixar solicitações e todas as suas dependências e instalá-los:
ru: pip должен загружать запросы и все его зависимости и устанавливать их:
ta: பிஐபி கோரிக்கைகள் மற்றும் அதன் அனைத்து சார்புகளையும் பதிவிறக்கம் செய்து அவற்றை நிறுவ வேண்டும்:

source: Install a specific package version
eo: Instali specifan version de pako
ja: 特定のバージョンのパッケージをインストールする
pt_br: Instalar uma versão específica do pacote
ru: Установить конкретную версию пакета
ta: ஒரு குறிப்பிட்ட தொகுப்பு பதிப்பை நிறுவவும்

source: pip allows you to specify which version of a package to install using :term:`version specifiers <Version Specifier>`. For example, to install a specific version of ``requests``:
eo: pip permesas al vi precizigi la instalotan version de pako per :term:`versio-specifilo <Version Specifier>`. Ekzemple, por instali specifan version de ``requests``:
ja: :term:`バージョン指定子 <VersionSpecifire>` を使えば、 pip でパッケージのバージョンを指定してインストールすることができます。例えば、 ``requests`` の特定のバージョンをインストールするなら:
pt_br: pip permite que você especifique qual versão de um pacote instalar usando :term:`especificadores de versão <Especificador de Versão>`. Por exemplo, para instalar uma versão específica do ``requests``:
ru: pip позволяет указать, какую версию пакета следует установить, используя :term:`определители версии <Определитель версии>`. Например, чтобы установить определенную версию пакета ``requests``:
ta: ஒரு தொகுப்பின் எந்த பதிப்பை நிறுவ வேண்டும் என்பதைக் குறிப்பிட PIP உங்களை அனுமதிக்கிறது: கால: `பதிப்பு விவரக்குறிப்புகள் <பதிப்பு விவரக்குறிப்பு>`. எடுத்துக்காட்டாக, `` கோரிக்கைகள்`` இன் குறிப்பிட்ட பதிப்பை நிறுவ:

source: To install the latest ``2.x`` release of requests:
eo: Por instali la plej novan version ``2.x`` de requests:
ja: requests の最新の ``2.x`` リリースをインストールするには:
pt_br: Para instalar a versão ``2.x`` mais recente do requests:
ru: Чтобы установить последний ``2.x`` выпуск requests:
ta: கோரிக்கைகளின் அண்மைக் கால `` 2.x`` வெளியீட்டை நிறுவ:

source: To install pre-release versions of packages, use the ``--pre`` flag:
eo: Por instali antaŭeldonan version de pako, uzu la flagon ``--pre``:
ja: ``--pre`` フラグを使ってパッケージのリリース前のバージョンをインストールするには:
pt_br: Para instalar versões de pré-lançamento de pacotes, use o sinalizador ``--pre``:
ru: Чтобы установить предварительные версии пакетов, используйте флаг ``--pre``:
ta: தொகுப்புகளின் முன் வெளியீட்டு பதிப்புகளை நிறுவ, `` --pre`` கொடியைப் பயன்படுத்தவும்:

source: Install extras
eo: Instali ekstraĵojn
ja: (パッケージの) extra 部分をインストールする
pt_br: Instalar extras
ru: Установка дополнительных
ta: கூடுதல் நிறுவவும்

source: Some packages have optional `extras`_. You can tell pip to install these by specifying the extra in brackets:
eo: Kelkaj pakoj havas nedevigajn `ekstraĵojn <extras>`_. Vi povas igi pip instali tiun specifante la ekstraĵon en rektaj krampoj:
ja: 必須ではない `extra`_ 部分を持つものがパッケージの中にはあります。extra の名前を角括弧([, ])の中に書くことで pip にインストールするように指示することができます。
pt_br: Alguns pacotes possuem `extras`_ opcionais. Você pode dizer ao pip para instalá-los especificando o extra entre colchetes:
ru: Некоторые пакеты содержат дополнительные `extras`_. Вы можете указать pip на их установку, указав в скобках дополнительное дополнение:
ta: சில தொகுப்புகளில் விருப்பமான `எக்ச்ட்ராச்`_ உள்ளது. அடைப்புக்குறிக்குள் கூடுதல் குறிப்பைக் குறிப்பிடுவதன் மூலம் இவற்றை நிறுவ பிப் சொல்லலாம்:

source: Install a package from source
eo: Instali pakon el fonto
ja: ソースコードからパッケージをインストールする
pt_br: Instalar um pacote a partir do código-fonte
ru: Установите пакет из исходного кода
ta: மூலத்திலிருந்து ஒரு தொகுப்பை நிறுவவும்

source: pip can install a package directly from its source code. For example, to install the source code in the ``google-auth`` directory:
eo: pip povas instali pakon rekte de la fontkodo. Ekzemple, por instali la fontkodon en la dosierujo ``google-auth``:
ja: pip は、ソースコードから直接にパッケージをインストールすることができます。例えば、 ``google-auth`` ディレクトリの中にあるソースコードをインストールするには:
pt_br: pip pode instalar um pacote diretamente de seu código-fonteseu. Por exemplo, você pode instalar o código-fonte no diretório ``google-auth``:
ru: pip может установить пакет непосредственно из его исходного кода. Например, чтобы установить исходный код в каталог ``google-auth``:
ta: பிஐபி அதன் மூலக் குறியீட்டிலிருந்து நேரடியாக ஒரு தொகுப்பை நிறுவ முடியும். எடுத்துக்காட்டாக, மூலக் குறியீட்டை `` Google-auth`` கோப்பகத்தில் நிறுவ:

source: Additionally, pip can install packages from source in :doc:`development mode <setuptools:userguide/development_mode>`, meaning that changes to the source directory will immediately affect the installed package without needing to re-install:
eo: Krome, pip povas instali pakojn el fonto en :doc:`evoluada reĝimo <setuptools:userguide/development_mode>`, tiel ke ŝanĝoj pri la fonta dosierujo tuje efektiviĝas por la instalita pako sen la bezono reinstali:
ja: さらに、 pip は :doc:`開発モード <setuptools:userguide/development_mode>` でソースコードからパッケージをインストールすることができます。つまり、ソースコードを修正すると、再インストールしなくても、すぐにインストール済みのパッケージに反映されます。
pt_br: Além disso, pip pode instalar pacotes do código-fonte no :doc:`modo de desenvolvimento <setuptools:userguide/development_mode>`, o que significa que as mudanças no diretório de código-fonte afetarão imediatamente o pacote instalado sem a necessidade de reinstalar:
ru: Кроме того, pip может устанавливать пакеты из исходного кода в :doc:`режиме разработки <setuptools:userguide/development_mode>`, что означает, что изменения в каталоге исходного кода немедленно повлияют на установленный пакет без необходимости повторной установки:
ta: கூடுதலாக, பிஐபி மூலத்திலிருந்து தொகுப்புகளை நிறுவலாம்: டிஓசி: `மேம்பாட்டு முறை <செட்டப்டூல்ச்: யூசர்சூட்/டெவலப்மென்ட்_மோட்>`, அதாவது மூல கோப்பகத்தில் மாற்றங்கள் மீண்டும் நிறுவத் தேவையில்லாமல் நிறுவப்பட்ட தொகுப்பை உடனடியாக பாதிக்கும்:

source: Install from version control systems
eo: Instali el versikontrola sistemo
ja: バージョン管理システムからインストールする
pt_br: Instalar a partir de sistemas de controle de versão
ru: Установка из систем контроля версий
ta: பதிப்பு கட்டுப்பாட்டு அமைப்புகளிலிருந்து நிறுவவும்

source: pip can install packages directly from their version control system. For example, you can install directly from a git repository:
eo: pip povas instali pakon rekte el versikontrola sistemo. Ekzemple, vi povas instali rekte el git-deponejo:
ja: pip は、バージョン管理システムから直接に、パッケージをインストールすることができます。例えば、git リポジトリから直接にインストールするには:
pt_br: pip pode instalar pacotes diretamente de seu sistema de controle de versão. Por exemplo, você pode instalar diretamente de um repositório git:
ru: pip может устанавливать пакеты непосредственно из их системы контроля версий. Например, вы можете установить пакет непосредственно из репозитория git:
ta: பிஐபி அவற்றின் பதிப்பு கட்டுப்பாட்டு அமைப்பிலிருந்து நேரடியாக தொகுப்புகளை நிறுவ முடியும். எடுத்துக்காட்டாக, நீங்கள் ஒரு அறிவிலி களஞ்சியத்திலிருந்து நேரடியாக நிறுவலாம்:

source: For more information on supported version control systems and syntax, see pip's documentation on :ref:`VCS Support <pip:VCS Support>`.
eo: Por pli da informoj pri subtenataj versikontrolaj sistemoj kaj sintakso, vidu la dokumentaron de pip pri :ref:`Subtenado de Versikontrola Sistemo <pip:VCS Support>`.
ja: サポートされているバージョン管理システムや文法について、詳しくは :ref:`VCS サポート <pip:VCS Support>` の pip の説明文書を見てください。
pt_br: Para mais informações sobre os sistemas de controle de versão suportados e sintaxe, consulte a documentação do pip em :ref:`Suporte VCS <pip:VCS Support>`.
ru: Дополнительную информацию о поддерживаемых системах контроля версий и синтаксисе см. в документации pip по :ref:`VCS Support <pip:VCS Support>`.
ta: ஆதரிக்கப்பட்ட பதிப்பு கட்டுப்பாட்டு அமைப்புகள் மற்றும் தொடரியல் பற்றிய கூடுதல் தகவலுக்கு, பைப்பின் ஆவணங்களைப் பார்க்கவும்: குறிப்பு: `வி.சி.எச் உதவி <பிஐபி: வி.சி.எச் ஆதரவு>`.

source: Install from local archives
eo: Instali el loka arĥivo
ja: ローカルアーカイブからインストールする
pt_br: Instalar a partir de arquivos locais
ru: Установка из локального архива
ta: உள்ளக காப்பகங்களிலிருந்து நிறுவவும்

source: If you have a local copy of a :term:`Distribution Package`'s archive (a zip, wheel, or tar file) you can install it directly with pip:
eo: Se oni havas lokan kopion de la arĥivo de :term:`Distribua Pako <Distribution Package>` (zip-arĥivo, wheel, aŭ tar-arĥivo), oni povas instali ĝin rekte per pip:
ja: もし :term:`配布パッケージ <Distribution Package>` のアーカイブ ( zip や wheel や tar ファイル) をローカルに持っているなら、 pip でそこから直接にインストールすることができます:
pt_br: Se você tiver uma cópia local de um arquivo do :term:`Pacote de Distribuição` (um arquivo zip, wheel ou tar), você pode instalá-lo diretamente com pip:
ru: Если у вас есть локальная копия архива :term:`Distribution Package` (файл zip, wheel или tar), вы можете установить его напрямую с помощью pip:
ta: உங்களிடம் ஒரு உள்ளக நகல் இருந்தால்: கால: `விநியோக தொகுப்பின் காப்பகம் (ஒரு சிப், சக்கரம் அல்லது தார் கோப்பு) அதை நேரடியாக PIP உடன் நிறுவலாம்:

source: If you have a directory containing archives of multiple packages, you can tell pip to look for packages there and not to use the :term:`Python Package Index (PyPI)` at all:
eo: Se vi havas dosierujon enhavantan arĥivojn de pluraj pakoj, oni povas igi pip serĉi pakojn tie kaj ne uzi la :term:`Python-Pakindekson <Python Package Index (PyPI)>`:
ja: 複数のパッケージのアーカイブを置いたディレクトリを pip に探索させるようにして、:term:`Python パッケージインデックス <Python Package Index (PyPI)>` を全く利用しないということも可能です:
pt_br: Se você tiver um diretório contendo arquivos de vários pacotes, você pode dizer ao pip para procurar por pacotes lá e não usar o :term:`Python Package Index (PyPI)` de forma alguma:
ru: Если у вас есть каталог, содержащий архивы нескольких пакетов, вы можете указать pip искать пакеты там и не использовать :term:`Python Package Index (PyPI)` вообще:
ta: பல தொகுப்புகளின் காப்பகங்களைக் கொண்ட ஒரு அடைவு உங்களிடம் இருந்தால், நீங்கள் அங்கு தொகுப்புகளைத் தேடும்படி பைப்பிடம் சொல்லலாம், மேலும் பயன்படுத்த வேண்டாம்: கால: `பைதான் தொகுப்பு குறியீட்டு (PYPI)`.

source: This is useful if you are installing packages on a system with limited connectivity or if you want to strictly control the origin of distribution packages.
eo: Tio utilas, se oni instalas pakon sur sistemo de limigita konektiteco aŭ se oni volas strikte kontroli la originon de distribuaj pakoj.
ja: この機能は、限定的なインターネット接続しか得られないシステムでパッケージをインストールする際や、配布物パッケージの出自を厳密に管理したい時には便利です。
pt_br: Isso é útil se você estiver instalando pacotes em um sistema com conectividade limitada ou se quiser controlar estritamente a origem dos pacotes de distribuição.
ru: Это полезно, если вы устанавливаете пакеты на систему с ограниченными возможностями подключения или хотите строго контролировать происхождение дистрибутивных пакетов.
ta: வரையறுக்கப்பட்ட இணைப்பு கொண்ட கணினியில் நீங்கள் தொகுப்புகளை நிறுவினால் அல்லது விநியோக தொகுப்புகளின் தோற்றத்தை கண்டிப்பாக கட்டுப்படுத்த விரும்பினால் இது பயனுள்ளதாக இருக்கும்.

source: Install from other package indexes
eo: Instali el aliaj pakindeksoj
ja: 他のインデックスサイトからインストールする
pt_br: Instalar a partir de outros índices de pacote
ru: Установка из других индексов пакетов
ta: பிற தொகுப்பு குறியீடுகளிலிருந்து நிறுவவும்
