Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: For example, Fedora and Debian (and their derivatives) both implement this split by using ``/usr/local`` for locally-installed packages and ``/usr`` for distro-installed packages. Fedora uses ``/usr/local/lib/python3.x/site-packages`` vs. ``/usr/lib/python3.x/site-packages``. (Debian uses ``/usr/local/lib/python3/dist-packages`` vs. ``/usr/lib/python3/dist-packages`` as an additional layer of separation from a locally-compiled Python interpreter: if you build and install upstream CPython in ``/usr/local/bin``, it will look at ``/usr/local/lib/python3/site-packages``, and Debian wishes to make sure that packages installed via the locally-built interpreter don't show up on ``sys.path`` for the distro interpreter.)
eo: Ekzemple, Fedora kaj Debian (kaj iliaj idoj) realigas tiun disigon uzante ``/usr/local`` por loke instalitaj pakoj kaj ``/usr`` por distribuo-instalitaj pakoj. Fedora uzas ``/usr/local/lib/python3.x/site-packages`` kontraste al ``/usr/lib/python3.x/site-packages``. (Debian uzas ``/usr/local/lib/python3/dist-packages`` kontraste al ``/usr/lib/python3/dist-packages`` kiel ekstra apartiga tavolo el loke tradukita Python-interpretilo: se oni konstruus kaj instalus CPython en ``/usr/local/bin``, ĝi serĉus ``/usr/local/lib/python3/site-packages``, kaj Debian volas certigi, ke pakoj instalitaj per la loke konstruita interpretilo ne ĉeestos en ``sys.path`` por la interpretilo de la distribuo.)
ja: 例えば、Fedora や Debian (およびその派生物) は共に、ローカルにインストールされたパッケージ用に ``/usr/local`` を使い、ディストロがインストールしたパッケージ用に ``/usr`` を用いることでこの分離を実装しています。Fedora では、 ``/usr/local/lib/python3.x/site-packages`` 対 ``/usr/lib/python3.x/site-packages`` です。 (Debian では ``/usr/local/lib/python3/dist-packages`` 対 ``/usr/lib/python3/dist-packages`` をローカルにコンパイルされた Python インタープリタ用にさらに分離して使っています: もしアップストリームの Python をビルドして ``/usr/local/bin`` にインストールしていれば、 ``/usr/local/lib/python3/site-packages`` を見るでしょうし、 Debian ではローカルにビルドされたインタープリタ経由でインストールされたパッケージがディストロ側のインタープリタ用の ``sys.path`` 上には出現しないことを確実にしようと願っています。)
ru: Например, Fedora и Debian (и их производные) реализуют это разделение, используя ``/usr/local`` для локально установленных пакетов и ``/usr`` для пакетов, установленных в дистрибутиве. Fedora использует ``/usr/local/lib/python3.x/site-packages`` против ``/usr/lib/python3.x/site-packages``. (Debian использует ``/usr/local/lib/python3/dist-packages`` против ``/usr/local/lib/python3/dist-packages``. ``/usr/lib/python3/dist-packages`` как дополнительный уровень отделения от локально скомпилированного интерпретатора Python: если вы собираете и устанавливаете CPython в ``/usr/local/bin``, он будет смотреть на ``/usr/local/lib/python3/site-packages``, а Debian хочет быть уверен, что пакеты, установленные через локально собранный интерпретатор, не появятся в ```sys.path`` для интерпретатора дистрибутива.)
ta: எடுத்துக்காட்டாக, ஃபெடோரா மற்றும் டெபியன் (மற்றும் அவற்றின் வழித்தோன்றல்கள்) இருவரும் உள்நாட்டில் நிறுவப்பட்ட தொகுப்புகளுக்கு ``/usr/local` மற்றும் டிச்ட்ரோ நிறுவப்பட்ட தொகுப்புகளுக்கு ``/usr`` ஆகியவற்றைப் பயன்படுத்தி இந்த பிளவுகளை செயல்படுத்துகிறார்கள். ஃபெடோரா ``/usr/local/lib/python3.x/site- பேக்கேச்கள்` `` `/usr/lib/python3.x/site-packages`` ஐப் பயன்படுத்துகிறது. . நீங்கள் ``/usr/local/bin`` இல் மேலோடை சிபிதானை உருவாக்கி நிறுவுகிறீர்கள், அது பார்க்கும் ``/usr/local/lib/python3/site-packages``, மற்றும் உள்நாட்டில் கட்டப்பட்ட மொழிபெயர்ப்பாளர் வழியாக நிறுவப்பட்ட தொகுப்புகள் டிச்ட்ரோ மொழிபெயர்ப்பாளருக்கு `` sys.path`` இல் காண்பிக்கப்படாது என்பதை உறுதிப்படுத்த டெபியன் விரும்புகிறார். )

source: Note that the ``/usr/local`` vs. ``/usr`` split is analogous to how the ``PATH`` environment variable typically includes ``/usr/local/bin:/usr/bin`` and non-distro software installs to ``/usr/local`` by default. This split is `recommended by the Filesystem Hierarchy Standard`__.
eo: Notu, ke la distingo inter ``/usr/local`` kaj ``/usr`` similas al la maniero, kiel la media variablo ``PATH`` tipe inkluzivas ``/usr/local/bin:/usr/bin``, kaj ekster-distribua programo tipe apriore instaliĝas al ``/usr/local``. Tiun distingon `rekomendas la Dosiersistema Hierarĥia Normo <recommended by the Filesystem Hierarchy Standard>`__.
ja: ``/usr/local`` 対 ``/usr`` の分離が、 ``PATH`` 環境変数が典型的に ``/usr/local/bin:/usr/bin`` を含んでいて、デフォルトで非ディストロのソフトウェアが ``/usr/local`` にインストールされることのアナロジーになっていることに注目してください。この分離は、 `推奨されるファイルシステム階層標準 <recommended by the Filesystem Hierarchy Standard>`__ です。
ru: Обратите внимание, что разделение ``/usr/local`` и ``/usr`` аналогично тому, как переменная окружения ``PATH`` обычно включает ``/usr/local/bin:/usr/bin``, а недистро-программы устанавливаются в ``/usr/local`` по умолчанию. Такое разделение ``рекомендовано Стандартом иерархии файловых систем``.
ta: ``/Usr/local` vs. ``/usr``` பிளவு `` பாதை`` சுற்றுச்சூழல் மாறுபாடு பொதுவாக ``/usr/local/bin:/usr/bin`` மற்றும் எவ்வாறு அடங்கும் என்பதற்கு ஒத்ததாக இருக்கிறது என்பதை நினைவில் கொள்க டிச்ட்ரோ அல்லாத மென்பொருள் இயல்பாக ``/usr/local`` க்கு நிறுவுகிறது. இந்த பிளவு `கோப்பு முறைமை வரிசைமுறை தரநிலையால் பரிந்துரைக்கப்படுகிறது`__.

source: There are two ways you could do this. One is, if you are building and packaging Python libraries directly (e.g., your packaging helpers unpack a wheel or call ``setup.py install``), arrange for those tools to use a directory that is not in a ``sysconfig`` scheme but is still on ``sys.path``.
ja: これを行うにはふたつの方法があります。ひとつは、Python ライブラリを直接にビルドしてパッケージしようとしている (例えば、使っているパッケージングヘルパーが wheel をアンパックするか、または、 ``setup.py install`` を呼び出す場合) 時に、 ``sys.path`` には含まれているけれども ``sysconfig`` スキームには入っていないようなディレクトリを使って実行するようにそれらツール群を調整することです。
ru: Это можно сделать двумя способами. Первый - если вы собираете и упаковываете библиотеки Python напрямую (например, ваши помощники по упаковке распаковывают колесо или вызывают ``setup.py install``), организуйте для этих инструментов использование каталога, который не входит в схему ``sysconfig``, но все еще находится в ``sys.path``.
ta: இதை நீங்கள் செய்ய இரண்டு வழிகள் உள்ளன. ஒன்று, நீங்கள் பைதான் நூலகங்களை நேரடியாக உருவாக்கி பேக்கேசிங் செய்தால் (எ.கா. `திட்டம் ஆனால் இன்னும்` `sys.bath`` இல் உள்ளது.

source: The other is to arrange for the default ``sysconfig`` scheme to change when running inside a package build versus when running on an installed system. The ``sysconfig`` customization hooks from bpo-43976_ should make this easy (once accepted and implemented): make your packaging tool set an environment variable or some other detectable configuration, and define a ``get_preferred_schemes`` function to return a different scheme when called from inside a package build. Then you can use ``pip install`` as part of your distro packaging.
eo: La alia estas aranĝi ŝanĝadon de la implicita skemo ``sysconfig`` dum konstruado de pako, kompare al rulado en instalita sistemo. La adapta meĥanismo de ``sysconfig`` el bpo-43976_ faciligos tion (kiam ĝi estas akceptita kaj realigita): via pakilo agordu median variablon aŭ alian detekteblaĵon, kaj difiun funkcion ``get_preferred_schemes`` liverantan alian skemon dum konstruado de pako. Poste oni povas simple uzi ``pip install`` kiel parto de la pakado de via distribuo.
ja: もうひとつは、パッケージのビルド中とインストール済みのシステムで実行する時とでデフォルトの ``sysconfig`` スキームを変えるように調整することです。 (アクセプトされ実装されればですが) bpo-43976_ からの ``sysconfig`` カスタマイズフック群がこれを容易にするでしょう: パッケージングツールに環境変数他のなんらかの検出可能な設定項目を設定させ、 ``get_preferred_schemes`` 関数がパッケージビルドの中から呼ばれた場合には異なるスキームを返すようにするのです。そうすれば、 ``pip install`` をディストロパッケージングの一部として使用できるようになります。
ru: Другой вариант - организовать изменение схемы ``sysconfig`` по умолчанию при запуске внутри сборки пакета по сравнению с запуском на установленной системе. Крючки настройки ``sysconfig`` из bpo-43976_ должны упростить эту задачу (после принятия и реализации): сделайте так, чтобы ваш инструмент упаковки устанавливал переменную окружения или какую-то другую определяемую конфигурацию, и определите функцию ``get_preferred_schemes``, чтобы она возвращала другую схему при вызове изнутри сборки пакета. Тогда вы сможете использовать ``pip install`` как часть упаковки вашего дистрибутива.
ta: மற்றொன்று, நிறுவப்பட்ட கணினியில் இயங்கும் போது ஒரு தொகுப்பு கட்டமைப்பிற்குள் இயங்கும்போது இயல்புநிலை `` சிச்கான்ஃபிக்`` திட்டத்தை மாற்ற ஏற்பாடு செய்ய வேண்டும். BPO-43976_ இலிருந்து `` sysconfig`` தனிப்பயனாக்குதல் கொக்கிகள் இதை எளிதாக்க வேண்டும் (ஒருமுறை ஏற்றுக்கொள்ளப்பட்டு செயல்படுத்தப்பட்டால்): உங்கள் பேக்கேசிங் கருவியை சூழல் மாறியை அமைக்கவும் அல்லது வேறு ஏதேனும் கண்டறியக்கூடிய உள்ளமைவை அமைக்கவும், மேலும் `` get_preferred_schemes`` செயல்பாட்டை வரையறுக்கவும் ஒரு தொகுப்பு கட்டமைப்பிற்குள் இருந்து அழைக்கும்போது திட்டம். உங்கள் டிச்ட்ரோ பேக்கேசிங்கின் ஒரு பகுதியாக `` பிஐபி நிறுவுதல்` ஐப் பயன்படுத்தலாம்.

source: We propose adding a ``--scheme=...`` option to instruct pip to run against a specific scheme. (See `Implementation Notes`_ below for how pip currently determines schemes.) Once that's available, for local testing and possibly for actual packaging, you would be able to run something like ``pip install --scheme=posix_distro`` to explicitly install a package into your distro's location (bypassing ``get_preferred_schemes``). One could also, if absolutely needed, use ``pip uninstall --scheme=posix_distro`` to use pip to remove packages from the system-managed directory.
eo: Ni proponas aldoni flagon ``--scheme=…`` por ruli pip kontraŭ iu specifa skemo. (Vidu `Notojn pri Realigo <Implementation Notes>`_ ĉi-subajn por priskribo pri kiel pip aktuale determinas skemon.) Post la disponigo de tiu flago, por loka testado kaj eble for reala pakado, oni povos ruli ion similan al ``pip install --scheme=posix_distro`` por ekspliciti instali pakon al la loko de la distribuo (ignorante ``get_preferred_schemes``). Oni povos ankaŭ, se tio absolute necesas, uzi ``pip uninstall --scheme=posix_distro`` por uzante pip malistali pakon el la sisteme mastrumata dosierujo.
ja: 我々は、 pip が指定されたスキームで走るように指示する ``--scheme=...`` オプションを追加することを提案します。(現在の pip がスキームを決定する方法については後述の `実装ノート <Implementation Notes>`_ を参照してください。) これが利用可能になり次第、ローカルのテストやおそらく実際のパッケージングで、 (``get_preferred_schemes`` をバイパスして) 明示的にディストロ側の場所へパッケージをインストールするために ``pip install --scheme=posix_distro`` のような形で実行することができるようになるでしょう。また、もし本当に必要であれば、 pip を使ってシステム側が管理するディレクトリからパッケージを削除するために ``pip uninstall --scheme=posix_distro`` を使うことさえできるでしょう。
ru: Мы предлагаем добавить опцию ``--scheme=...`` для указания pip запускаться по определенной схеме. (О том, как pip в настоящее время определяет схемы, см. ниже в разделе ``Примечания к реализации``.) Когда это будет доступно, для локального тестирования и, возможно, для реальной упаковки вы сможете запускать что-то вроде ``pip install --scheme=posix_distro`` для явной установки пакета в расположение вашего дистрибутива (в обход ``get_preferred_schemes``). Также, при крайней необходимости, можно использовать ``pip uninstall --scheme=posix_distro``, чтобы с помощью pip удалить пакеты из управляемого системой каталога.
ta: ஒரு குறிப்பிட்ட திட்டத்திற்கு எதிராக இயங்க PIP க்கு அறிவுறுத்துவதற்கான `` --scheme = ... `` விருப்பத்தை சேர்க்க நாங்கள் முன்மொழிகிறோம். . உங்கள் டிச்ட்ரோவின் இருப்பிடத்தில் ஒரு தொகுப்பை நிறுவவும் (`` get_prefered_schemes`` ஐத் தவிர்த்து). கணினி-நிர்வகிக்கப்பட்ட கோப்பகத்திலிருந்து தொகுப்புகளை அகற்ற PIP ஐப் பயன்படுத்த `` பிஐபி நிறுவல் நீக்குதல்-scheme = posix_distro`` ஐப் பயன்படுத்தலாம்.

source: To install packages with pip, you would also need to either suppress the ``EXTERNALLY-MANAGED`` marker file to allow pip to run or to override it on the command line. You may want to use the same means for suppressing the marker file in build chroots as you do in container images.
ja: pip でパッケージをインストールするには、 ``EXTERNALLY-MANAGED`` マーカーファイルを抑止して pip を実行できるようにするか、コマンドラインでオーバーライドするかのいずれかが必要です。コンテナイメージ内で作業している時は、ビルドのために chroot した環境においても同じ方法でマーカーファイルを抑止したくなるかもしれません。
ru: Чтобы установить пакеты с помощью pip, вам также потребуется либо подавить файл-маркер ``EXTERNALLY-MANAGED``, чтобы позволить pip запуститься, либо переопределить его в командной строке. Вы можете использовать те же средства для подавления маркерного файла в chroots сборки, что и в образах контейнеров.
ta: பிஐபி மூலம் தொகுப்புகளை நிறுவ, பிஐபி இயக்க அனுமதிக்க அல்லது கட்டளை வரியில் அதை மேலெழுத, `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` மார்க்கர் கோப்பை அடக்க வேண்டும். கொள்கலன் படங்களில் நீங்கள் செய்வது போல மார்க்கர் கோப்பை உருவாக்குவதற்கு அதே வழிமுறையை நீங்கள் பயன்படுத்த விரும்பலாம்.

source: The advantage of setting these up to be automatic (suppressing the marker file in your build environment and having ``get_preferred_schemes`` automatically return your distro's scheme) is that an unadorned ``pip install`` will work inside a package build, which generally means that an unmodified upstream build script that happens to internally call ``pip install`` will do the right thing. You can, of course, just ensure that your packaging process always calls ``pip install --scheme=posix_distro --break-system-packages``, which would work too.
eo: La avantaĝo de aŭtomatigo de tio (ignorante la markodosieron en la konstrua medio kaj igante``get_preferred_schemes`` aŭtomate liveri la skemon de via distribuo) estas, ke ordinara ``pip install`` funkcios dum konstruado de pako, tiel ke nemodifita konstruprogrameto far la originalaj aŭtoroj, kiu interne alvokas ``pip install``, ĝenerale taŭgos. Kompreneble, vi povus alternative simple certigi, ke via pakada procezo ĉiam alvoku ``pip install --scheme=posix_distro --break-system-packages``, kio ankaŭ sufiĉus.
ja: これらの設定 (ビルド環境ではマーカーファイルを抑止し、 ``get_preferred_schemes`` が自動的にディストロのスキームを返すようにすること) を自動で行うことのアドバンテージは、素のままの ``pip install`` であってもパッケージビルド内で動作することで、それは一般的にはアップストリームのビルドスクリプトで内部で偶々 ``pip install`` を呼ぶものでも修正なしで正しく動作するということです。もちろん、パッケージングプロセスが常に ``pip install --scheme=posix_distro --break-system-packages`` を呼び出すようにすることもできますし、それも動作します。
ru: Преимущество автоматической настройки (подавление файла-маркера в среде сборки и автоматическое возвращение ``get_preferred_schemes`` схемы вашего дистрибутива) заключается в том, что не украшенная ``pip install`` будет работать внутри сборки пакета, что в целом означает, что немодифицированный сценарий сборки upstream, который случайно вызовет ``pip install``, сделает все правильно. Конечно, вы можете просто убедиться, что ваш процесс упаковки всегда вызывает ``pip install --scheme=posix_distro --break-system-packages``, что тоже будет работать.
ta: இவற்றை தானாக அமைப்பதன் நன்மை (உங்கள் உருவாக்க சூழலில் மார்க்கர் கோப்பை அடக்குதல் மற்றும் `` get_prefered_schemes`` உங்கள் டிச்ட்ரோவின் திட்டத்தை தானாகவே திருப்பித் தருவது) என்பது ஒரு அலங்காரமற்ற `` பிஐபி நிறுவல்`` ஒரு தொகுப்பு கட்டமைப்பிற்குள் செயல்படும், இது பொதுவாக `` பிஐபி நிறுவுதல்`` உள்நாட்டில் அழைக்கப்படும் ஒரு மாற்றப்படாத மேலோடை உருவாக்க ச்கிரிப்ட் சரியானதைச் செய்யும். நிச்சயமாக, உங்கள் பேக்கேசிங் செயல்முறை எப்போதுமே `` பிஐபி நிறுவல் --சேம் = POSIX_DISTRO-பிரேக்-சிச்டம்-பேக்கேச்கள்`` என்று அழைப்பதை நீங்கள் உறுதிப்படுத்திக் கொள்ளலாம், அதுவும் வேலை செய்யும்.

source: The best approach here depends a lot on your distro's conventions and mechanisms for packaging.
eo: La plej bona maniero dependas multe de la konvencioj kaj meĥanismoj de via distribuo pri pakado.
ja: ここでの最善のアプローチは、ディストロの慣習やパッケージング機構に大きく依存します。
ru: Лучший подход здесь во многом зависит от конвенций и механизмов упаковки в вашем дистрибутиве.
ta: இங்கே சிறந்த அணுகுமுறை உங்கள் டிச்ட்ரோவின் மரபுகள் மற்றும் பேக்கேசிங்கிற்கான வழிமுறைகளைப் பொறுத்தது.

source: Similarly, the ``sysconfig`` paths that are not for importable Python code - that is, ``include``, ``platinclude``, ``scripts``, and ``data`` - should also have two variants, one for use by distro-packaged software and one for use for locally-installed software, and the distro should be set up such that both are usable. For instance, a typical FHS-compliant distro will use ``/usr/local/include`` for the default scheme's ``include`` and ``/usr/include`` for distro-packaged headers and place both on the compiler's search path, and it will use ``/usr/local/bin`` for the default scheme's ``scripts`` and ``/usr/bin`` for distro-packaged entry points and place both on ``$PATH``.
eo: Simile, la ``sysconfig``-dosierlokoj ne por importebla Python-kodo – t.e. ``include``, ``platinclude``, ``scripts`` kaj ``data`` – ankaŭ havu du variantojn, unu por programoj pakitaj de la distribuo, la alia por loke instalitaj programoj. La distribuo estu agordita tiel, ke ambaŭ estas uzeblaj. Ekzemple, ordinara distribuo observanta la Dosiersistemo-Hierarĥian Normon (FHS) uzas ``/usr/local/include`` por la ``include`` de la implicita skemo kaj ``/usr/include`` por ĉapoj pakitaj de la distribuo, kaj ambaŭ troviĝas en la serĉlisto de la tradukilo. Ĝi uzas ``/usr/local/bin`` por la ``scripts`` de la implicita skemo kaj ``/usr/bin`` por enirpunktoj pakitaj de la distribuo, kaj ambaŭ troviĝas en ``$PATH``.
ja: 同様に、 ``sysconfig`` パスでインポート可能な Python のコード向けのものではないもの - つまり、 ``include`` ・ ``platinclude`` ・ ``scripts`` ・ ``data`` - にもふたつの変種があって、ひとつはディストロ側でパッケージしたソフトウェア、もう一つはローカルにインストールされたソフトウェアですが、ディストロはこれらのどちらでも使用できるように設定されているべきです。例えば、典型的な FHS を遵守するディストロでは、 ``/usr/local/include`` をデフォルトのスキームの ``include`` 用に、 ``/usr/include`` をディストロ側でパッケージかしたヘッダファイル用に使って、両方をコンパイラのサーチパスに含めておくことになるでしょうし、また、 ``/usr/local/bin`` をデフォルトのスキームの ``scripts`` 用に、 ``/usr/bin`` をディストロ側のパッケージのエントリポイント用に使って、両方を ``$PATH`` に含めておくでしょう。
ru: Аналогично, пути ``sysconfig``, которые не предназначены для импортируемого кода Python - то есть ``include``, ``platinclude``, ``cripts`` и ``data`` - также должны иметь два варианта, один для использования в дистрибутиве, другой для локально установленного программного обеспечения, и дистрибутив должен быть настроен так, чтобы оба были пригодны для использования. Например, типичный FHS-совместимый дистрибутив будет использовать ``/usr/local/include`` для стандартной схемы ``include`` и ``/usr/include`` для упакованных в дистрибутив заголовков и помещать оба в путь поиска компилятора, а также будет использовать ``/usr/local/bin`` для стандартной схемы ``cripts`` и ``/usr/bin`` для упакованных в дистрибутив точек входа и помещать обе в ``$PATH``.
ta: இதேபோல், இறக்குமதி செய்யக்கூடிய பைதான் குறியீட்டிற்காக இல்லாத `` சிச்கான்ஃபிக்` பாதைகள் - அதாவது `` அடங்கும்``, `` பிளாட்டின்க்ளூட்``, `` ச்கிரிப்ட்கள்``, மற்றும் `` தரவு`` - இரண்டு வகைகளும் இருக்க வேண்டும் . உதாரணமாக, ஒரு பொதுவான FHS- இணக்கமான டிச்ட்ரோ இயல்புநிலை திட்டத்தின் `` ``` மற்றும்` `/usr/`` டிச்ட்ரோ-பேக்கேச் செய்யப்பட்ட தலைப்புகளுக்கு` `/usr/incllow`` ஐப் பயன்படுத்தும். தேடல் பாதையைத் தேடுங்கள், இது இயல்புநிலை திட்டத்தின் `` ச்கிரிப்ட்கள்`` மற்றும் ``/usr/bin`` டிச்ட்ரோ-தொகுக்கப்பட்ட நுழைவு புள்ளிகளுக்கு `` $ பாதை`` இரண்டையும் வைக்கவும்.

source: Implementation Notes
eo: Notoj pri Realigo
ja: 実装に関する覚書
ru: Примечания к реализации
ta: செயல்படுத்தல் குறிப்புகள்

source: This section is non-normative and contains notes relevant to both the specification and potential implementations.
eo: Jen nedeviga paragrafo enhavanta notojn pri la specifo kaj eblaj realigoj.
ja: この節は規範的なものではなく、仕様と潜在的な実装の両方に関連する覚え書きを含んでいます。
ru: Этот раздел не является нормативным и содержит примечания, относящиеся как к спецификации, так и к потенциальным реализациям.
ta: இந்த பிரிவு நெறிமுறையற்றது மற்றும் விவரக்குறிப்பு மற்றும் சாத்தியமான செயலாக்கங்கள் இரண்டிற்கும் தொடர்புடைய குறிப்புகளைக் கொண்டுள்ளது.

source: Currently (as of May 2021), pip does not directly expose a way to choose a target ``sysconfig`` scheme, but it has three ways of looking up schemes when installing:
eo: Aktuale (je Majo 2021), pip ne rekte eblias elektadon de cela ``sysconfig``-skemo, sed ĝi havas tri manierojn serĉi skemon dum instalado:
ja: 現在 (2021年5月時点) 、 pip はターゲットとなる ``sysconfig`` スキームを選択する方法を直接には外部に見せていませんが、インストールの際にルックアップする３個の方法があります:
ru: В настоящее время (по состоянию на май 2021 года) pip не предоставляет возможности напрямую выбрать целевую схему ``sysconfig``, но у него есть три способа поиска схем при установке:
ta: தற்போது (மே 2021 நிலவரப்படி), ஒரு இலக்கை `` சிச்கான்ஃபிக்`` திட்டத்தைத் தேர்ந்தெடுப்பதற்கான வழியை பிஐபி நேரடியாக அம்பலப்படுத்தவில்லை, ஆனால் நிறுவும் போது திட்டங்களைப் பார்ப்பதற்கான மூன்று வழிகள் உள்ளன:

source: ``pip install``
ta: `` பிஐபி நிறுவுதல்``

source: Calls ``sysconfig.get_default_scheme()``, which is usually (in upstream CPython and most current distros) the same as ``get_preferred_scheme('prefix')``.
eo: Alvokas ``sysconfig.get_default_scheme()``, kiu estas normale (en la apriora CPython kaj en la plejparto de distribuoj) sama kiel ``get_preferred_scheme('prefix')``.
ja: ``sysconfig.get_default_scheme()`` を呼び出す方法で、 (アップストリームの CPython や今使われているほとんどのディストロでは) 普通は ``get_preferred_scheme('prefix')`` と同じ結果になるもの。
ru: Вызывает ``sysconfig.get_default_scheme()``, который обычно (в upstream CPython и большинстве современных дистрибутивов) совпадает с ``get_preferred_scheme('prefix')``.
ta: `` Sysconfig.get_default_scheme () ``, இது வழக்கமாக (அப்ச்ட்ரீம் சிபிதான் மற்றும் பெரும்பாலான தற்போதைய டிச்ட்ரோக்களில்) `` get_prefered_scheme ('முன்னொட்டு') ``.

source: ``pip install --prefix=/some/path``
eo: ``pip install --prefix=/iu/loko``
ta: `` பிஐபி நிறுவுதல் -பிரெஃபிக்ச் =/சில/பாதை``

source: Calls ``sysconfig.get_preferred_scheme('prefix')``.
eo: Alvokas ``sysconfig.get_preferred_scheme('prefix')``.
ja: ``sysconfig.get_preferred_scheme('prefix')`` を呼び出す。
pt_br: Chame ``sysconfig.get_preferred_scheme('prefix')``.
ru: Вызывает ``sysconfig.get_preferred_scheme('prefix')``.
ta: `` Sysconfig.get_prefered_scheme ('முன்னொட்டு') ``.

source: ``pip install --user``
ta: `` பிஐபி நிறுவுதல் --user``

source: Calls ``sysconfig.get_preferred_scheme('user')``.
eo: Alvokas ``sysconfig.get_preferred_scheme('user')``.
ja: ``sysconfig.get_preferred_scheme('user')`` を呼び出す。
pt_br: Chame ``sysconfig.get_preferred_scheme('user')``.
ru: Вызывает ``sysconfig.get_preferred_scheme('user')``.
ta: `` Sysconfig.get_prefered_scheme ('பயனர்') ``.

source: Finally, ``pip install --target=/some/path`` writes directly to ``/some/path`` without looking up any schemes.
eo: Fine, ``pip install --target=/iu/loko`` skribas rekte al ``/iu/loko`` sen serĉado de ajna skemo.
ja: 最後に、 ``pip install --target=/some/path`` でスキームをルックアップすることなしに ``/some/path`` を書きます。
ru: Наконец, ``pip install --target=/some/path`` записывает непосредственно в ``/some/path`` без поиска каких-либо схем.
ta: இறுதியாக, `` பிஐபி நிறுவுதல் - -இலக்கு =/சில/பாதை`` எந்த திட்டங்களையும் பார்க்காமல் நேரடியாக ``/சில/பாதை`` க்கு எழுதுகிறது.
