Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: :py:func:`platform.machine()`
ru: :py:func:`платформа.машина()`
ta: : py: func: `platurm.machine ()`

source: ``platform_python_implementation``
ru: ``платформа_python_имплементация``
ta: `` platurm_python_implementation``

source: ``platform_release``
ru: ``платформа_выпуска``
ta: `` PLATURM_REELEASE``

source: ``platform_system``
ru: ``платформа_системы``
ta: `` இயங்குதள_ அமைப்பு``

source: :py:func:`platform.system()`
ru: :py:func:`платформа.система()`
ta: : py: func: `platurm.system ()`

source: ``Linux``, ``Windows``, ``Java``
ta: `` லினக்ச்``, `` விண்டோச்``, `` சாவா``

source: ``platform_version``
ru: ``платформа_версия``
ta: `` PLATER_VERSION``

source: :py:func:`platform.version()`
ru: :py:func:`платформа.версия()`
ta: : py: func: `platurm.version ()`

source: ``#1 SMP Fri Apr 25 13:07:35 EDT 2014`` ``Java HotSpot(TM) 64-Bit Server VM, 25.51-b03, Oracle Corporation`` ``Darwin Kernel Version 14.5.0: Wed Jul 29 02:18:53 PDT 2015; root:xnu-2782.40.9~2/RELEASE_X86_64``
ta: ``#1 SMP FRI APR 25 13:07:35 EDT 2014` `` `` சாவா ஆட்ச்பாட் (டி.எம்) 64-பிட் சர்வர் வி.எம். 02:18:53 PDT 2015; ரூட்: xnu-2782.40.9 ~ 2/reulation_x86_64``

source: ``implementation_name``
ru: ``имя_реализации``
ta: `` செயல்படுத்தல்_பெயர்``

source: ``implementation_version``
ru: ``Версия_реализации``
ta: `` செயல்படுத்தல்_்வெர்சன்``

source: see definition below
eo: vidu la difinon ĉi-sube
ja: 下方の定義を見てください
pt_br: veja a definição abaixo
ru: смотрите определение ниже
ta: கீழே உள்ள வரையறையைக் காண்க

source: ``extra``
ru: ``экстра``
ta: `` கூடுதல்``

source: An error except when defined by the context interpreting the specification.
eo: Eraro, se ne ekzistas kunteksto interpretanta la specifon.
ja: 仕様を通訳する文脈で定義された場合を除くエラー。
pt_br: Um erro, exceto quando definido pelo contexto que interpreta a especificação.
ru: Ошибка, за исключением случаев, когда она определена контекстом, интерпретирующим спецификацию.
ta: விவரக்குறிப்பை விளக்கும் சூழலால் வரையறுக்கப்படும்போது தவிர பிழை.

source: The ``implementation_version`` marker variable is derived from :py:data:`sys.implementation.version <sys.implementation>`:
eo: La marka variablo ``implementation_version`` devenas de :py:data:`sys.implementation.version <sys.implementation>`:
ja: ``implementation_version`` マーカ変数は、 :py:data:`sys.implementation.version <sys.implementation>` から派生したものです :
ru: Маркерная переменная ``имплементация_версия`` получена из :py: данные:`sys.имплементация.версия <sys.имплементация>`:
ta: `` செயல்படுத்தல்_்வெர்சன்`` மார்க்கர் மாறி இதிலிருந்து பெறப்பட்டது: py: தரவு: `sys.implementation.version <sys.implementation>`:

source: This environment markers section, initially defined through :pep:`508`, supersedes the environment markers section in :pep:`345`.
eo: Tiu paragrafo de media marko, origine difinita per :pep:`508`, eksvalidigas la paragrafon pri media marko en :pep:`345`.
ja: この環境マーカの節は、当初は :pep:`508` を通して定義されましたが、 :pep:`345` における環境マーカの節を置き換えます。
pt_br: Esta seção de marcadores de ambiente, inicialmente definida na :pep:`508`, substitui a seção de marcadores de ambiente na :pep:`345`.
ru: Этот раздел маркеров окружения, первоначально определенный через :pep:`508`, заменяет раздел маркеров окружения в :pep:`345`.
ta: இந்த சுற்றுச்சூழல் குறிப்பான்கள் பிரிவு, ஆரம்பத்தில் வரையறுக்கப்பட்டுள்ளது: PEP: `508`, சுற்றுச்சூழல் குறிப்பான்கள் பிரிவை மீறுகிறது: PEP:` 345`.

source: Complete Grammar
eo: Kompleta Gramatiko
ja: 完全な文法
pt_br: Gramática completa
ru: Полная грамматика
ta: முழுமையான இலக்கணம்

source: The complete parsley grammar::
eo: La kompleta gramatiko por parseley::
ja: 完全な parsley 文法::
pt_br: A gramática completa do persley ::
ru: Полная грамматика петрушки::
ta: முழுமையான வோக்கோசு இலக்கணம் ::

source: A test program - if the grammar is in a string ``grammar``:
eo: Testa programo – se la gramatiko estas en signoĉeno ``grammar``:
ja: テストプログラム - もし ``grammar`` 文字列内に文法があれば:
ru: Тестовая программа - если грамматика находится в строке ``grammar``:
ta: ஒரு சோதனை நிரல் - இலக்கணம் ஒரு சரத்தில் இருந்தால் `` இலக்கணம்``:

source: November 2015: This specification was approved through :pep:`508`.
eo: Novembro 2015: Ĉi tiu specifo estis aprobita per :pep:`508`.
ja: 2015年11月: :pep:`508` を通じてこの仕様が承認されました。
ru: Ноябрь 2015 г: Эта спецификация была одобрена через :pep:`508`.
ta: நவம்பர் 2015: இந்த விவரக்குறிப்பு அங்கீகரிக்கப்பட்டது: PEP: `508`.

source: July 2019: The definition of ``python_version`` was `changed <python-version-change_>`_ from ``platform.python_version()[:3]`` to ``'.'.join(platform.python_version_tuple()[:2])``, to accommodate potential future versions of Python with 2-digit major and minor versions (e.g. 3.10). [#future_versions]_
eo: Julio 2019: La difino de ``python_version`` `ŝanĝiĝis <python-version-change_>`_ de ``platform.python_version()[:3]`` al ``'.'.join(platform.python_version_tuple()[:2])``, por estontaj versioj de Python kun du-ciferaj maĵoraj kaj minoraj versioj (ekz. 3.10). [#future_versions]_
ja: 2019年6月: ``python_version`` の定義は、Python の将来のバージョンが二桁のメジャーバージョンやマイナーバージョンを持つ場合 (例えば 3.10) でもそれを収容できるように、 ``platform.python_version()[:3]`` から ``'.'.join(platform.python_version_tuple()[:2])`` へ `変更されました <python-version-change_>`_ 。 [#future_versions]_
ru: Июль 2019: Определение ``python_version`` было ``изменено <python-version-change_>`` с ``platform.python_version()[:3]`` на ``'.'.join(platform.python_version_tuple()[:2])``, чтобы учесть потенциальные будущие версии Python с двузначными мажорными и минорными версиями (например, 3.10). [#future_versions]_
ta: சூலை 2019: `` python_version`` இன் வரையறை `மாற்றப்பட்டது <பைதான்-பதிப்பு-சேஞ்ச்_>` `_` `தளத்திலிருந்து. ) [: 2]) ``, 2 இலக்க பெரிய மற்றும் சிறிய பதிப்புகளுடன் பைத்தானின் எதிர்கால பதிப்புகளுக்கு இடமளிக்க (எ.கா. 3.10). [#future_versions] _

source: June 2024: The definition of ``version_many`` was changed to allow trailing commas, matching with the behavior of the Python implementation that has been in use since late 2022.
eo: Junio 2024: La difino de ``version_many`` estis ŝanĝita por permesi lastan komon, konforme al la Python-realigo uzata ekde malfrua 2022.
ru: Июнь 2024 года: Определение ``версии_малого`` было изменено, чтобы разрешить запятые в конце, что соответствует поведению реализации Python, которая используется с конца 2022 года.
ta: சூன் 2024: 2022 ஆம் ஆண்டின் பிற்பகுதியிலிருந்து பயன்பாட்டில் உள்ள பைதான் அமலாக்கத்தின் நடத்தையுடன் பொருந்தக்கூடிய, `` பதிப்பு_மனி`` இன் வரையறை மாற்றப்பட்டது.

source: pip, the recommended installer for Python packages (http://pip.readthedocs.org/en/stable/)
eo: pip, la rekomendata instalilo por Python-pakoj (http://pip.readthedocs.org/en/stable/)
ja: Python のパッケージをインストールする際に推奨されるツールである pip (http://pip.readthedocs.org/en/stable/)
pt_br: pip, o instalador recomendado para pacotes Python (http://pip.readthedocs.org/en/stable/)
ru: pip, рекомендуемая программа установки пакетов Python (http://pip.readthedocs.org/en/stable/)
ta: PIP, பைதான் தொகுப்புகளுக்கான பரிந்துரைக்கப்பட்ட நிறுவி (http://pip.readthedocs.org/en/stable/)

source: The parsley PEG library. (https://pypi.python.org/pypi/parsley/)
eo: La sintaksanaliza biblioteko parsley. (https://pypi.python.org/pypi/parsley/)
ja: parsley PEG ライブラリ。 (https://pypi.python.org/pypi/parsley/)
pt_br: A biblioteca de PEG do parsley. (https://pypi.python.org/pypi/parsley/)
ru: Библиотека PEG Петрушка. (https://pypi.python.org/pypi/parsley/)
ta: வோக்கோசு பெக் நூலகம். (https://pypi.python.org/pypi/parsly/)

source: Future Python versions might be problematic with the definition of Environment Marker Variable ``python_version`` (https://github.com/python/peps/issues/560)
eo: Estontaj versioj de Python povas esti problemaj pri la difino de la Media Marka Variablo ``python_version`` (https://github.com/python/peps/issues/560)
ja: Python の将来のバージョンでは、環境マーカ変数の ``python_version`` の定義が問題をはらむかもしれません。 (https://github.com/python/peps/issues/560)
pt_br: Versões futuras do Python podem ser problemáticas com a definição da variável do marcador de ambiente ``python_version`` (https://github.com/python/peps/issues/560)
ru: В будущих версиях Python могут возникнуть проблемы с определением маркерной переменной среды ``python_version`` (https://github.com/python/peps/issues/560)
ta: சுற்றுச்சூழல் மார்க்கர் மாறியின் வரையறையுடன் எதிர்கால பைதான் பதிப்புகள் சிக்கலாக இருக்கலாம் `` பைதான்_்வெர்சன்`` (https://github.com/python/peps/issues/560)

source: Recording the Direct URL Origin of installed distributions
eo: Registri la Rektan Retadresan Originon de instalita distribuo
ja: インストールされた配布物の配布元へ直接アクセスする URL を記録する
pt_br: Gravando a Origem da URL Direta de distribuições instaladas
ru: Запись прямого URL-адреса происхождения установленных дистрибутивов
ta: நிறுவப்பட்ட விநியோகங்களின் நேரடி முகவரி தோற்றத்தை பதிவு செய்தல்

source: This document specifies a :file:`direct_url.json` file in the ``*.dist-info`` directory of an installed distribution, to record the Direct URL Origin of the distribution. The general structure and usage of ``*.dist-info`` directories is described in :ref:`recording-installed-packages`.
eo: Ĉi tiu dokumento specifas dosieron :file:`direct_url.json` en la dosierujo ``*.dist-info`` de instalita distribuo por registri la rektan retadresan originon de la distribuo. La ĝenerala strukturo kaj uzado de dosierujoj ``*.dist-info`` troviĝas en :ref:`recording-installed-packages`.
ja: この説明文書では、インストール済みの配布物の `*.dist-info` ディレクトリにある :file:`direct_url.json` ファイルによって配布物の配布元へ直接アクセスする URL を記録する方法を指定します。 ``*.dist-info`` ディレクトリの一般的な構造と使用方法は、 :ref:`インストール済みパッケージを記録する <recording-installed-packages>` に記述されています。
pt_br: Este documento especifica um arquivo :file:`direct_url.json` no diretório ``*.dist-info`` de uma distribuição instalada, para registrar a origem da URL direta da distribuição. A estrutura geral e uso de diretórios ``*.dist-info`` é descrita em :ref:`recording-installed-packages`.
ru: Этот документ определяет файл :file:`direct_url.json` в директории ``*.dist-info`` установленного дистрибутива для записи прямого URL Origin дистрибутива. Общая структура и использование директорий ``*.dist-info`` описаны в :ref:`recording-installed-packages``.
ta: இந்த ஆவணம் ஒரு: கோப்பு: ``*. டிச்ட்-இன்ஃபோ`` ஒரு நிறுவப்பட்ட விநியோகத்தின் கோப்பகத்தில் `டைரக்ட்_ஆர்ல்.சோன்` கோப்பைக் குறிப்பிடுகிறது, விநியோகத்தின் நேரடி முகவரி தோற்றத்தை பதிவு செய்ய. ``*.Dist-info`` கோப்பகங்களின் பொதுவான கட்டமைப்பும் பயன்பாடும் இதில் விவரிக்கப்பட்டுள்ளது: ref: `பதிவு-நிறுவப்பட்ட-தொகுப்புகள்`.

source: The :file:`direct_url.json` file MUST be created in the :file:`*.dist-info` directory by installers when installing a distribution from a requirement specifying a direct URL reference (including a VCS URL).
eo: La dosiero :file:`direct_url.json` DEVAS esti kreita en la dosierujo :file:`*.dist-info` far instalilo dum instalado de distribuo per postulo specifanta rektan retadresan referencon (inkluzive de versikontrolsistema retadreso).
ja: :file:`direct_url.json` ファイルは、要求事項が指定するダイレクト (VCS の URL を含む) 参照 URL からインストールしている時に、インストーラによって :file:`*.dist-info` ディレクトリに生成されなければなりません。
pt_br: O arquivo :file:`direct_url.json` DEVE ser criado no diretório :file:`*.dist-info` pelos instaladores ao instalar uma distribuição a partir de um requisito especificando uma referência de URL direta (incluindo uma URL de VCS).
ru: Файл :file:`direct_url.json` ДОЛЖЕН создаваться в каталоге :file:`*.dist-info` установщиками при установке дистрибутива из требования, указывающего прямую URL-ссылку (включая VCS URL).
ta: தி: கோப்பு: `direct_url.json` கோப்பு உருவாக்கப்பட வேண்டும்: கோப்பு:`*. டிச்ட்-இன்ஃபோ` கோப்பகத்தை நிறுவிகள் மூலம் நேரடி முகவரி குறிப்பைக் குறிப்பிடும் தேவையிலிருந்து ஒரு விநியோகத்தை நிறுவும் போது (வி.சி.எச் முகவரி உட்பட).

source: This file MUST NOT be created when installing a distribution from an other type of requirement (i.e. name plus version specifier).
eo: Tiu dosiero DEVAS NE kreiĝi dum instalado de distribuo el alia speco de postulo (ekz. nomo plus versio-specifilo).
ja: 他のタイプの要求事項 (すなわち、名前とバージョン指定子) から配布物をインストールする際には、このファイルを生成してはなりません。
pt_br: Este arquivo NÃO DEVE ser criado ao instalar uma distribuição de outro tipo de requisito (ou seja, nome mais especificador de versão).
ru: Этот файл НЕ ДОЛЖЕН создаваться при установке дистрибутива из требований другого типа (т.е. имя плюс спецификатор версии).
ta: வேறு வகை தேவையிலிருந்து (அதாவது பெயர் பிளச் பதிப்பு விவரக்குறிப்பு) ஒரு விநியோகத்தை நிறுவும் போது இந்த கோப்பு உருவாக்கப்படக்கூடாது.

source: This JSON file MUST be a UTF-8 encoded, :rfc:`8259` compliant, serialization of the :doc:`direct-url-data-structure`.
eo: Ĉi tiu JSON-dosiero DEVAS esti UTF-8-kodita seriigo de :doc:`direct-url-data-structure` kongrua kun :rfc:`8259`.
ja: この JSON ファイルは、 :rfc:`8259` に準拠するように UTF-8 で符号化されていなければならず、シリアル化の方法は :doc:`direct-url-data-structure` でなければなりません。
pt_br: Este arquivo JSON DEVE ser codificado em UTF-8, compatível com :rfc:`8259`, serialização da :doc:`direct-url-data-structure`.
ru: Этот JSON-файл ДОЛЖЕН быть кодировкой UTF-8, :rfc:`8259` совместимой с сериализацией :doc:`direct-url-data-structure`.
ta: இந்த சாதொபொகு கோப்பு ஒரு UTF-8 குறியாக்கப்பட்டதாக இருக்க வேண்டும்,: RFC: `8259` இணக்கமான, சீரியலைசேசன்: DOC:` நேரடி-உர்எல்-தரவு-கட்டமைப்பு`.

source: When the requested URL has the file:// scheme and points to a local directory that happens to contain a VCS checkout, installers MUST NOT attempt to infer any VCS information and therefore MUST NOT output any VCS related information (such as ``vcs_info``) in :file:`direct_url.json`.
ja: 要求された URL が file:// スキームであって VCS からチェックアウトしたものを含むローカルディレクトリを指し示している場合には、インストーラはいかなる VCS 情報をも推定してはならず、従って、いかなる (``vcs_info`` のような) VCS 関連情報をも :file:`direct_url.json` に出力してはなりません。
pt_br: Quando a URL solicitada tem o esquema file:// e aponta para um diretório local que contém um checkout VCS, os instaladores NÃO DEVEM tentar inferir nenhuma informação VCS e, portanto, NÃO DEVEM emitir nenhuma informação relacionada ao VCS (como ``vcs_info``) in :file:`direct_url.json`.
ru: Если запрашиваемый URL имеет схему file:// и указывает на локальный каталог, который содержит VCS checkout, программы установки НЕ ДОЛЖНЫ пытаться вывести какую-либо VCS информацию и, следовательно, НЕ ДОЛЖНЫ выводить какую-либо связанную с VCS информацию (например, ``vcs_info``) в :file:`direct_url.json``.
ta: கோரப்பட்ட முகவரி இல் கோப்பு: // திட்டம் மற்றும் வி.சி.எச் புதுப்பித்தலைக் கொண்டிருக்கும் உள்ளக கோப்பகத்தை சுட்டிக்காட்டும்போது, நிறுவிகள் எந்த வி.சி.எச் தகவலையும் ஊகிக்க முயற்சிக்கக்கூடாது, எனவே எந்த வி.சி.எச் தொடர்பான தகவல்களையும் வெளியிடக்கூடாது (போன்றவை `VCS_INFO` `) இல்: கோப்பு:` direct_url.json`.

source: As a general rule, installers should as much as possible preserve the information that was provided in the requested URL when generating :file:`direct_url.json`. For example user:password environment variables should be preserved and ``requested_revision`` should reflect the revision that was provided in the requested URL as faithfully as possible. This information is however *enriched* with more precise data, such as ``commit_id``.
ja: 一般的な規則として、 :file:`direct_url.json` を生成する際には、インストーラは可能な限り要求された URL に含まれる情報を保存するべきです。例えば、 user:password を環境変数から読み込むなら環境変数を参照するような URL として保存されるべきであり、 ``requested_revision`` は要求された URL の中に出現するものを極力そのまま反映するべきです。しかしながら、この情報は (``commit_id`` のような) もっと精密なデータを使って *精製* されます。
pt_br: Como regra geral, os instaladores devem, tanto quanto possível, preservar as informações fornecidas na URL solicitada ao gerar :file:`direct_url.json`. Por exemplo, as variáveis de ambiente usuário:senha devem ser preservadas e ``required_revision`` deve refletir a revisão que foi fornecida na URL solicitada o mais fielmente possível. No entanto, essas informações são *enriquecidas* com dados mais precisos, como ``commit_id``.
ru: Как правило, программы установки должны по возможности сохранять информацию, которая была предоставлена в запрошенном URL при генерации :file:`direct_url.json`. Например, переменные окружения user:password должны быть сохранены, а ``запрашиваемая_ревизия`` должна как можно точнее отражать ревизию, указанную в запрошенном URL. Однако эта информация может быть *обогащена* более точными данными, такими как ``commit_id``.
ta: ஒரு பொதுவான விதியாக, நிறுவிகள் உருவாக்கும் போது கோரப்பட்ட முகவரி இல் வழங்கப்பட்ட தகவல்களை முடிந்தவரை பாதுகாக்க வேண்டும்: கோப்பு: `direct_url.json`. எடுத்துக்காட்டாக பயனர்: கடவுச்சொல் சூழல் மாறிகள் பாதுகாக்கப்பட வேண்டும், மேலும் கோரப்பட்ட முகவரி இல் வழங்கப்பட்ட திருத்தத்தை முடிந்தவரை உண்மையாகவே `` கோரப்பட்ட_ரெவிசன்`` பிரதிபலிக்க வேண்டும். எவ்வாறாயினும், `` கமிட்_ஐடி`` போன்ற துல்லியமான தரவுகளுடன் இந்த செய்தி * செறிவூட்டப்படுகிறது.

source: Example pip commands and their effect on direct_url.json
eo: Ekzemplaj komandoj de pip kaj ĝiaj efikoj sur direct_url.json
ja: pip コマンドの例と direct_url.json に与える影響
pt_br: Exemplo de comandos pip e seus efeitos em direct_url.json
ru: Примеры команд pip и их влияние на direct_url.json
ta: எடுத்துக்காட்டு பிஐபி கட்டளைகள் மற்றும் அவற்றின் விளைவு டைரக்ட்_ஆர்ல்.சோன்

source: Commands that generate a ``direct_url.json``:
eo: Komandoj generantaj ``direct_url.json``:
ja: ``direct_url.json`` を生成するコマンド:
pt_br: Comandos que geram um ``direct_url.json``:
ru: Команды, генерирующие файл ``direct_url.json``:
ta: ஒரு `` sydread_url.json`` ஐ உருவாக்கும் கட்டளைகள்:

source: ``pip install "app @ git+https://example.com/repo/app.git#subdirectory=setup"``
ta: `` பிஐபி நிறுவவும்

source: ``pip install --editable "app @ git+https://example.com/repo/app.git#subdirectory=setup"`` (in which case, ``url`` will be the local directory where the git repository has been cloned to, and ``dir_info`` will be present with ``"editable": true`` and no ``vcs_info`` will be set)
eo: ``pip install --editable "app @ git+https://example.com/repo/app.git#subdirectory=setup"`` (en kiu ``url`` estos la loka dosierujo, al kiu la git-deponejo estas klonita, kaj ``dir_info`` ĉeestos kun ``"editable": true`` kaj sen ajna ``vcs_info``)
ja: ``pip install --editable "app @ git+https://example.com/repo/app.git#subdirectory=setup"`` (この場合、 ``url`` は git リポジトリのクローン先のローカルディレクトリになり、 ``dir_info`` は ``"editable": true`` という形で存在し、 ``vcs_info`` は設定されないということになるでしょう)
pt_br: ``pip install --editable "app @ git+https://example.com/repo/app.git#subdirectory=setup"`` (caso em que, ``url`` será o diretório local para o qual o repositório git foi clonado e ``dir_info`` estará presente com ``"editable": true`` e nenhum ``vcs_info`` será definido)
ru: ``pip install --editable "app @ git+https://example.com/repo/app.git#subdirectory=setup"`` (в этом случае ``url`` будет локальным каталогом, в который был клонирован git-репозиторий, а ``dir_info`` будет присутствовать с ``"editable": true`` и не будет установлено ``vcs_info``)
ta: `` பிஐபி நிறுவுதல் -பொருத்தப்பட்ட "பயன்பாடு @ git+https: //example.com/repo/app.git#subdirectory=setup" `` (இந்த விசயத்தில், `` url`` உள்ளக கோப்பகமாக இருக்கும் களஞ்சியம் நகலி செய்யப்பட்டுள்ளது, மற்றும் `` dir_info`` `` திருத்தக்கூடியது ": உண்மை`` மற்றும் இல்லை `` vcs_info`` அமைக்கப்படும்)

source: Commands that *do not* generate a ``direct_url.json``
eo: Komandoj *ne* generantaj ``direct_url.json``
ja: ``direct_url.json`` を *生成しない* コマンド
pt_br: Comandos que *não* geram um ``direct_url.json``
ru: Команды, которые *не* генерируют ``direct_url.json``
ta: * `` Direct_url.json`` ஐ உருவாக்காத * கட்டளைகள்

source: March 2020: This specification was approved through :pep:`610`.
eo: Marto 2020: Ĉi tiu specifo estis aprobita per :pep:`610`.
ja: 2020年3月: :pep:`610` を通じてこの仕様が承認されました。
ru: Март 2020 года: Эта спецификация была одобрена через :pep:`610`.
ta: மார்ச் 2020: இந்த விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `610`.

source: Direct URL Data Structure
eo: Datenstrukturo de Rekta Retadreso
ja: ダイレクト URL データ構造 <Direct URL Data Structure>
pt_br: Estrutura de dados de URL direta
ru: Структура данных прямого URL
ta: நேரடி முகவரி தரவு அமைப்பு

source: This document specifies a JSON-serializable abstract data structure that can represent URLs to python projects and distribution artifacts such as VCS source trees, local source trees, source distributions and wheels.
eo: Jen dokumento specifanta JSON-seriigeblan abstraktan datenstrukturon, kiu prezentas retadreson al Python-projekto aŭ distribuan artefakton kiel versikontrolsistema fontarbo, loka fontarbo, fonta distribuo kaj wheel.
ja: この説明文書では、python プロジェクトや VCS 上のソースツリーやローカルのソースツリーやソースコード配布物や wheel ファイルのような配布物アーティファクトに対してURLを表現することを可能とする、 JSON のシリアル化抽象データ構造の仕様を定義します。
pt_br: Este documento especifica uma estrutura de dados abstrata serializável em JSON que pode representar URLs para projetos python e artefatos de distribuição, como árvores de fonte VCS, árvores de fonte local, distribuições fonte e wheels.
ru: Этот документ определяет JSON-сериализуемую абстрактную структуру данных, которая может представлять URL-адреса проектов python и артефактов распространения, таких как деревья исходных текстов VCS, локальные деревья исходных текстов, дистрибутивы исходных текстов и колеса.
ta: இந்த ஆவணம் ஒரு JSON-Serializable சுருக்க தரவு கட்டமைப்பைக் குறிப்பிடுகிறது, இது பைதான் திட்டங்களுக்கான முகவரி களைக் குறிக்கும் மற்றும் வி.சி.எச் மூல மரங்கள், உள்ளக மூல மரங்கள், மூல வழங்கல் மற்றும் சக்கரங்கள் போன்ற விநியோக கலைப்பொருட்கள்.

source: At time of writing, it is not formally specified how to merge the parts of this data structure into a single URL that can be passed to tools. A common representation is the pip URL format (`VCS Support <pip-vcs-support_>`_), other examples are provided in the :ref:`Version specifier specification <version-specifiers>`.
eo: Je la tempo de verkado, ne ekzistas formala normo pri kunigado de la partoj de ĉi tiu datenstrukturo en unu retadreson transdoneblan al ilo. Ofta prezento estas la retadresa formo pip (`VCS Support <pip-vcs-support_>`_); aliaj ekzemploj troviĝas en la :ref:`Normo pri versio-specifiloj <version-specifiers>`.
ja: 本稿執筆時点では、ツール群に渡せるようにこのデータ構造の各部分を単一の URL にまとめる方法については公式には指定されていません。よく見られる表現形式は pip URL フォーマット (`VCS サポート <pip-vcs-support_>`_) で、他の例が :ref:`バージョン指定子仕様 <version-specifiers>` の中で提供されています。
ru: На момент написания статьи формально не определено, как объединить части этой структуры данных в единый URL, который можно передавать инструментам. Общим представлением является формат URL pip (`VCS Support <pip-vcs-support_>`_), другие примеры приведены в : ссылка:`Спецификация спецификатора версии <версия-спецификаторы>`.
ta: எழுதும் நேரத்தில், இந்த தரவு கட்டமைப்பின் பகுதிகளை ஒரு முகவரி ஆக எவ்வாறு ஒன்றிணைப்பது என்பது முறையாக குறிப்பிடப்படவில்லை, அவை கருவிகளுக்கு அனுப்பப்படலாம். ஒரு பொதுவான பிரதிநிதித்துவம் PIP முகவரி வடிவம் (`VCS உதவி <PIP-VCS-support_>` _), பிற எடுத்துக்காட்டுகள்: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>`.

source: The Direct URL Data Structure MUST be a dictionary, serializable to JSON according to :rfc:`8259`.
eo: La Datenstrukturo de Rekta Retadreso DEVAS esti vortaro seriigebla al JSON laŭ :rfc:`8259`.
ja: 直接 URL データ構造は辞書でなければならず、 :rfc:`8259` に従って JSON にシリアライズできなければなりません。
pt_br: A estrutura de dados da URL direta DEVE ser um dicionário serializável para JSON de acordo com :rfc:`8259`.
ru: Структура данных прямого URL ДОЛЖНА представлять собой словарь, сериализуемый в JSON в соответствии с :rfc:`8259`.
ta: நேரடி முகவரி தரவு அமைப்பு ஒரு அகராதியாக இருக்க வேண்டும், இதன் படி சாதொபொகு க்கு வரிசைப்படுத்தக்கூடியது: RFC: `8259`.
