Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Traditionally, :ref:`setuptools` projects providing Python code that is semantically compatible with both Python 2 and Python 3, produce :term:`wheels <Wheel>` that have a ``py2.py3`` tag in their names. When dropping support for Python 2, it is important not to forget to change this tag to just ``py3``. It is often configured within :file:`setup.cfg` under the ``[bdist_wheel]`` section by setting ``universal = 1``.
eo: Tradicie, projekto uzanta :ref:`setuptools`, kies Python-kodo semantike kongruas kun kaj Python 2 kaj Python 3, havas :term:`wheel <Wheel>`, kies nomo inkluzivas la sufikson ``py2.py3``. Kiam oni ĉesigas subtenon de Python 2, gravas ŝanĝi tiun etikedon al simple ``py3``. Tio estas ofte agordita en :file:`setup.cfg` sub la sekcio ``[bdist_wheel]`` kiel ``universal=1``.
ja: 伝統的には、Python 2 と Python 3 の両方に文法的な互換性のある Python ソースコードを提供する :ref:`setuptools` プロジェクトは、 ``py2.py3`` というタグをその名前の中に持つ :term:`wheels <Wheel>` を生成します。 Python 2 へのサポートをやめる時には、このタグをただの ``py3`` に変更するのを忘れないことが重要です。これは、しばしば、 :file:`setup.cfg` の中の ``[bdist_wheel]`` セクションで ``universal=1`` として設定されています。
ru: Традиционно проекты :ref:`setuptools`, предоставляющие код на Python, семантически совместимый как с Python 2, так и с Python 3, создают :term:`wheels <Wheel>`, в именах которых присутствует тег ``py2.py3``. При отказе от поддержки Python 2 важно не забыть изменить этот тег на просто ``py3``. Часто его настраивают в :file:`setup.cfg` в разделе ``[bdist_wheel]``, установив ``universal = 1``.
ta: பாரம்பரியமாக, குறிப்பு: பைதான் 2 மற்றும் பைதான் 3 ஆகிய இரண்டிலும் சொற்பொருளாக இணக்கமான பைதான் குறியீட்டை வழங்கும் `செட்ப்டூல்ச்` திட்டங்கள், உற்பத்தி: கால: `சக்கரங்கள் <சக்கர>` அவற்றின் பெயர்களில் `` py2.py3`` குறிச்சொல்லைக் கொண்டுள்ளன. பைதான் 2 க்கான ஆதரவை கைவிடும்போது, இந்த குறிச்சொல்லை `` py3`` ஆக மாற்ற மறக்காமல் இருப்பது முதன்மை. இது பெரும்பாலும் உள்ளே கட்டமைக்கப்பட்டுள்ளது: கோப்பு: `` [bdist_wheel] `` பிரிவின் கீழ் `` `யுனிவர்சல் = 1``.

source: If you use this method, either remove this option or section, or explicitly set ``universal`` to ``0``:
eo: Se vi uzas tiun metodon, aŭ forigu tiun opcion aŭ sekcion, aŭ eksplicite agordu ``universal`` kiel ``0``:
ja: このメソッドを使うのであれば、このオプションないしセクションを削除するか、または、明示的に ``universal`` を ``0`` に設定してください。
pt_br: Se você usar este método, remova esta opção ou seção, ou defina explicitamente ``universal`` como ``0``:
ru: Если вы используете этот метод, либо удалите эту опцию или секцию, либо явно установите ``universal`` в ``0``:
ta: இந்த முறையைப் பயன்படுத்தினால், இந்த விருப்பம் அல்லது பகுதியை அகற்று, அல்லது வெளிப்படையாக `` யுனிவர்சல்`` ஐ `0`` என அமைக்கவும்:

source: Regarding :ref:`deprecated <setup-py-deprecated>` direct ``setup.py`` invocations, passing the ``--universal`` flag on the command line could override this setting.
eo: Pri :ref:`evitinda <setup-py-deprecated>` rekta alvoko de ``setup.py``, uzado de la komandlinia flago ``--universal`` povas igi tiun agordon ignorata.
ja: ``setup.py`` から直接に呼び出すことは :ref:`非推奨 <setup-py-deprecated>` になっていて、コマンドラインで ``--universal`` フラグを渡すことでこの設定を上書きできるでしょう。
ru: Что касается :ref:`deprecated <setup-py-deprecated>` прямых вызовов ``setup.py``, передача флага ``--universal`` в командной строке может отменить эту настройку.
ta: தொடர்புடையது: குறிப்பு: `நீக்கப்பட்ட <setup-py-deprecated>` நேரடி `` setup.py`` அழைப்பிதழ்கள், கட்டளை வரியில் `` --niversal`` கொடியைக் கடந்து செல்வது இந்த அமைப்பை மீறக்கூடும்.

source: Defining the Python version required
eo: Difini la postulatan version de Python
ja: 要求する Python のバージョンを定義する
pt_br: Definindo a versão Python exigida
ru: Определение требуемой версии Python'а
ta: தேவையான பைதான் பதிப்பை வரையறுத்தல்

source: 1. Install twine
eo: 1. Instalu twine
ja: 1. twine のインストール
ru: 1. Установить шпагат
ta: 1. கயிறு நிறுவவும்

source: Ensure that you have twine available at its latest version. Steps:
eo: Certigu, ke vi havas la plej novan version de twine, jene:
ja: twine の最新版が利用可能であることを確実にしておきましょう。やり方は:
ru: Убедитесь, что у вас есть шпагат последней версии. Шаги:
ta: அதன் அண்மைக் கால பதிப்பில் உங்களிடம் கயிறு கிடைக்கிறது என்பதை உறுதிப்படுத்தவும். படிகள்:

source: 2. Specify the version ranges for supported Python distributions
eo: 2. Specifu la versian intervalon de subtenataj versioj de Python
ja: 2. サポートする Python 配布物のバージョンの範囲を指定する
pt_br: 2. Especifique os intervalos de versão para distribuições Python suportadas
ru: 2. Укажите диапазоны версий поддерживаемых дистрибутивов Python'а
ta: 2. ஆதரிக்கப்பட்ட பைதான் விநியோகங்களுக்கான பதிப்பு வரம்புகளைக் குறிப்பிடவும்

source: Set the version ranges declaring which Python distributions are supported within your project's :file:`pyproject.toml`. The :ref:`requires-python` configuration field corresponds to the :ref:`Requires-Python <core-metadata-requires-python>` core metadata field:
eo: Deklaru la gamon de versioj de Python subtenataj en la dosiero :file:`pyproject.toml` de via projekto. La agorda kampo :ref:`requires-python` respondas al la kerna metadatena kampo :ref:`Requires-Python <core-metadata-requires-python>`:
ja: プロジェクトがどのバージョンの Python 配布物をサポートしているかを宣言するバージョンレンジ <version range> を :file:`pyproject.toml` 内に設定しましょう。 :ref:`requires-python` 設定フィールドは、 :ref:`Requires-Python <core-metadata-requires-python>` コアメタデータに対応しています:
ru: Устанавливает диапазоны версий, объявляющие, какие дистрибутивы Python поддерживаются в :file:`pyproject.toml` вашего проекта. Поле конфигурации :ref:`requires-python` соответствует полю метаданных ядра :ref:`Requires-Python <core-metadata-requires-python>`:
ta: உங்கள் திட்டத்திற்குள் எந்த பைதான் விநியோகங்கள் ஆதரிக்கப்படுகின்றன என்பதை அறிவிக்கும் பதிப்பு வரம்புகளை அமைக்கவும்: கோப்பு: `pyproject.toml`. தி: ரெஃப்: `-பைதான் தேவை. உள்ளமைவு புலம் இதற்கு ஒத்திருக்கிறது: ref:`-பைதான் தேவை <கோர்-மெட்டாடேட்டா-வேண்டுகோள்-பைதான்> `கோர் மேனிலை தரவு புலம்:

source: You can specify version ranges and exclusion rules (complying with the :ref:`version-specifiers` specification), such as at least Python 3.9. Or, at least Python 3.7 and beyond, skipping the 3.7.0 and 3.7.1 point releases:
eo: Oni povas specifi intervalojn de versioj kaj ekskluzivotajn versiojn (laŭ la normo :ref:`version-specifiers`), ekzemple «minimume Python 3.9» aŭ «minimume Python 3.7, sed ne 3.7.0 nek 3.7.1»:
ja: 「少なくとも Python 3.9」のような、バージョンの範囲や除外のルールを指定することができます。あるいは、「少なくとも Python 3.7 かそれ以上、しかし、 3.7.0 と 3.7.1 を除く」というポイントリリース:
ru: Вы можете указать диапазон версий и правила исключения (в соответствии со спецификацией :ref:`version-specifiers`), например, не ниже Python 3.9. Или, по крайней мере, Python 3.7 и далее, пропуская точечные выпуски 3.7.0 и 3.7.1:
ta: குறைந்தபட்சம் பைதான் 3.9 போன்ற பதிப்பு வரம்புகள் மற்றும் விலக்கு விதிகளை நீங்கள் குறிப்பிடலாம் (குறிப்பு: re: `பதிப்பு-விவரிப்பாளர்கள்` விவரக்குறிப்பு). அல்லது, குறைந்தபட்சம் பைதான் 3.7 மற்றும் அதற்கு அப்பால், 3.7.0 மற்றும் 3.7.1 புள்ளி வெளியீடுகளைத் தவிர்த்து:

source: If using the :ref:`setuptools` build backend, consult the `dependency-management`_ documentation for more options.
eo: Se oni uzas la konstruan malfasadon :ref:`setuptools`, oni konsultu la dokumentaron `dependency-management`_ por pliaj opcioj.
ja: :ref:`setuptools` ビルドバックエンドを使っているなら、もっと詳しいことは `dependency-management`_ 説明文書に当たってみてください。
ru: Если вы используете бэкенд сборки :ref:`setuptools`, обратитесь к документации `dependency-management`_ за дополнительными опциями.
ta: பயன்படுத்தினால்: ref: `setuptools` பின்தளத்தில் உருவாக்குங்கள், மேலும் விருப்பங்களுக்கு` சார்பு-மேலாண்மை`_ ஆவணங்களை அணுகவும்.

source: Avoid adding upper bounds to the version ranges, e. g. ``">= 3.8, < 3.10"``. Doing so can cause different errors and version conflicts. See the `discourse-discussion`_ for more information.
eo: Evitu supran limon de versia gamo, ekz. ``">= 3.8, < 3.10"``. Tio povas kaŭzi diversajn erarojn kaj versio-konfliktojn. Vidu `diskuton ĉe Discourse <discourse-discussion>`_ por pliaj informoj.
ja: 例えば ``">=3.8, < 3.10"`` のようにバージョン範囲に上限を加えることを避けましょう。そうすることで別のエラーやバージョンコンフリクトを引き起こすかもしれません。もっと詳しくは、 `discourse-discussion`_ を見てください。
ru: Избегайте добавления верхних границ к диапазонам версий, например, ``">= 3.8, < 3.10"``. Это может привести к различным ошибкам и конфликтам версий. Дополнительную информацию см. в `discourse-discussion`_.
ta: பதிப்பு வரம்புகளுக்கு மேல் எல்லையைச் சேர்ப்பதைத் தவிர்க்கவும், இ. g. `` "> = 3.8, <3.10" ``. அவ்வாறு செய்வது வெவ்வேறு பிழைகள் மற்றும் பதிப்பு மோதல்களை ஏற்படுத்தும். மேலும் தகவலுக்கு `சொற்பொழிவு-விவாதத்தை`_ ஐப் பார்க்கவும்.

source: 3. Validating the Metadata before publishing
eo: 3. Kontrolu la validecon de la Metadatenoj antaŭ eldonado
ja: 3. 公開の前にメタデータを検証する
pt_br: 3. Validando o Metadata antes de publicar
ru: 3. Перед публикацией проверьте метаданные
ta: 3. வெளியீட்டிற்கு முன் மெட்டாடேட்டாவை சரிபார்க்கிறது

source: Within a Python source package (the zip or the tar-gz file you download) is a text file called PKG-INFO.
eo: En fonta pako de Python (la zip-arĥivo aŭ tar.gz-arĥivo elŝutita de vi) troviĝas teksta dosiero nomita PKG-INFO.
ja: Python のソースコードパッケージ (あなたがダウンロードしたzipファイルやtar.gzファイル) の中には、PKG-INFO という名前のテキストファイルがあります。
pt_br: Dentro de um pacote fonte Python (o arquivo zip ou tar-gz que você baixou) está um arquivo de texto chamado PKG-INFO.
ru: Внутри исходного пакета Python (zip- или tar-gz-файла, который вы скачиваете) находится текстовый файл PKG-INFO.
ta: பைதான் மூல தொகுப்புக்குள் (நீங்கள் பதிவிறக்கும் சிப் அல்லது தார்-சிஇசட் கோப்பு) என்பது பி.கே.சி-இன்ஃபோ எனப்படும் உரை கோப்பு.

source: This file is generated by the :term:`build backend <Build Backend>` when it generates the source package. The file contains a set of keys and values, the list of keys is part of the PyPA standard metadata format.
eo: Tiu dosiero estas generita de la :term:`konstrua malfasado <Build Backend>` dum generado de la fonta pako. La dosiero enhavas parojn de ŝlosiloj kaj valoroj; la listo de ŝlosiloj estas parto de la norma metadatena formo de PyPA.
ja: このファイルは、ソースコードパッケージを生成するときに、 :term:`ビルドバックエンド <Build Backend>` によって生成されます。このファイルには、一連のキーと値を含んでいて、キーのリストは PyPA 標準メタデータフォーマットの一部です。
ru: Этот файл генерируется :term:`build backend <Build Backend>` при создании исходного пакета. Файл содержит набор ключей и значений, список ключей является частью стандартного формата метаданных PyPA.
ta: இந்த கோப்பு உருவாக்கப்படுகிறது: கால: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>` இது மூல தொகுப்பை உருவாக்கும் போது. கோப்பில் விசைகள் மற்றும் மதிப்புகள் உள்ளன, விசைகளின் பட்டியல் PYPA நிலையான மேனிலை தரவு வடிவமைப்பின் ஒரு பகுதியாகும்.

source: You can see the contents of the generated file like this:
eo: Oni povas vidi la enhavon de la generita dosiero jene:
ja: 生成されたファイルの内容はこのようになっています:
pt_br: Você pode ver o conteúdo do arquivo gerado assim:
ru: Вы можете увидеть содержимое сгенерированного файла следующим образом:
ta: இது போன்ற உருவாக்கப்பட்ட கோப்பின் உள்ளடக்கங்களை நீங்கள் காணலாம்:

source: Validate that the following is in place, before publishing the package:
eo: Konfirmu, ke la jenaj kondiĉoj estas plenumitaj, antaŭ ol eldoni la pakon:
ja: パッケージを公開する前に、以下のことが適切かどうかを検証してください。
pt_br: Valide que o seguinte está no lugar, antes de publicar o pacote:
ru: Перед публикацией пакета убедитесь, что все перечисленное ниже на месте:
ta: தொகுப்பை வெளியிடுவதற்கு முன்பு பின்வருபவை உள்ளன என்பதை சரிபார்க்கவும்:

source: If you have upgraded correctly, the ``Metadata-Version`` value should be 1.2 or higher.
eo: Se vi ĝisdatigis ĝuste, la valoro de ``Metadata-Version`` estu 1.2 aŭ pli alta.
ja: アップグレードが正しく終われば、 ``Metadata-Version`` の値が 1.2 かそれ以上になっているはずです。
ru: Если вы выполнили обновление правильно, значение ``Metadata-Version`` должно быть 1.2 или выше.
ta: நீங்கள் சரியாக மேம்படுத்தப்பட்டிருந்தால், `` மெட்டாடேட்டா-பதிப்பு`` மதிப்பு 1.2 அல்லது அதற்கு மேற்பட்டதாக இருக்க வேண்டும்.

source: The ``Requires-Python`` field is set and matches your specification in the configuration file.
eo: La kampo ``Requires-Python`` ekzistu kaj kongruu kun via specifo en la agorda dosiero.
ja: ``Requires-Python`` フィールドが設定されていて、設定ファイルで指定したものに一致しているはずです。
ru: Поле ``Requires-Python`` установлено и соответствует вашей спецификации в файле конфигурации.
ta: `` தேவைப்படுகிறது-பைதான்` `புலம் அமைக்கப்பட்டு, உங்கள் விவரக்குறிப்பை உள்ளமைவு கோப்பில் பொருத்துகிறது.

source: 4. Publishing the package
eo: 4. Eldonu la pakon
ja: 4. パッケージを公開する
ru: 4. Публикация пакета
ta: 4. தொகுப்பை வெளியிடுதல்

source: Proceed as suggested in :ref:`Uploading your Project to PyPI`.
eo: Daŭrigu laŭ la paragrafo :ref:`Alŝuti Vian Projekton al PyPI <Uploading your Project to PyPI>`.
ja: :ref:`プロジェクトを PyPI にアップロードする <Uploading your Project to PyPI>` で示唆されたように進めましょう。
ru: Действуйте, как указано в :ref:`Uploading your Project to PyPI`.
ta: பரிந்துரைத்தபடி தொடரவும்: ref: `உங்கள் திட்டத்தை பைபிக்கு பதிவேற்றுதல்`.

source: Dropping a Python version
eo: Malsubteni version de Python
ja: Python のバージョンをサポートから外す
ru: Отказ от версии Python
ta: பைதான் பதிப்பை கைவிடுதல்

source: In principle, at least metadata support for Python versions should be kept as long as possible, because once that has been dropped, people still depending on a version will be forced to downgrade. If however supporting a specific version becomes a blocker for a new feature or other issues occur, the metadata ``Requires-Python`` should be amended. Of course this also depends on whether the project needs to be stable and well-covered for a wider range of users.
ja: 人々がまだ依存しているバージョンが一旦ドロップされればダウングレードせざるを得なくなるので、原則として、 Python のバージョンに対するメタデータのサポートは可能な限り長く保たれるべきです。しかしながら、特定のバージョンをサポートすることが、新しい機能の阻害要因になるとか、他の問題が起きるとかする場合は、メタデータの ``Requires-Python`` は修正されるべきです。もちろん、これは、プロジェクトが安定的で広範囲のユーザをよくカバーするか否かにも依存します。
ru: В принципе, по крайней мере, поддержка версий Python в метаданных должна сохраняться как можно дольше, потому что после отказа от неё люди, всё ещё зависящие от версии, будут вынуждены перейти на новую версию. Если же поддержка конкретной версии становится препятствием для новых возможностей или возникают другие проблемы, метаданные ``Requires-Python`` должны быть изменены. Конечно, это также зависит от того, должен ли проект быть стабильным и хорошо покрытым для более широкого круга пользователей.
ta: கொள்கையளவில், பைதான் பதிப்புகளுக்கான குறைந்தபட்சம் மேனிலை தரவு ஆதரவை முடிந்தவரை வைக்க வேண்டும், ஏனென்றால் அது கைவிடப்பட்டவுடன், ஒரு பதிப்பைப் பொறுத்து மக்கள் இன்னும் தரமிறக்க வேண்டிய கட்டாயத்தில் இருப்பார்கள். இருப்பினும் ஒரு குறிப்பிட்ட பதிப்பை ஆதரிப்பது ஒரு புதிய அம்சத்திற்கான தடுப்பாளராக மாறினால் அல்லது பிற சிக்கல்கள் ஏற்பட்டால், மேனிலை தரவு `` தேவைப்படுகிறது-பைதான்` `திருத்தம் செய்யப்பட வேண்டும். நிச்சயமாக இது ஒரு பரந்த அளவிலான பயனர்களுக்கு இந்த திட்டம் நிலையானதாகவும் நன்கு மூடப்பட்டதாகவும் இருக்க வேண்டுமா என்பதையும் பொறுத்தது.

source: Each version compatibility change should have its own release.
eo: Ĉiu versio-kongrueca ŝanĝo havu sian propran eldonon.
ja: バージョン互換性の変更は、それぞれ、それ自身のリリースを持つべきです。
ru: Каждое изменение совместимости версий должно иметь свой собственный релиз.
ta: ஒவ்வொரு பதிப்பு பொருந்தக்கூடிய மாற்றமும் அதன் சொந்த வெளியீட்டைக் கொண்டிருக்க வேண்டும்.

source: When dropping a Python version, it might also be rewarding to upgrade the project's code syntax generally, apart from updating the versions used in visible places (like the testing environment). Tools like pyupgrade_ or `ruff <https://docs.astral.sh/ruff/linter/>`_ can automate some of this work.
ja: Python バージョン (のサポート) を落とす時は、使われているバージョン群を (テスト用の環境のような) 目にみえる場所に使用するように更新することと同様に、プロジェクトのソースコードのシンタックスを全般的に更新することが値打ちのあるものになるかもしれません。 pyupgrade_ や `ruff <https://docs.astral.sh/ruff/linter/>`_ のようなツール類が、この作業の幾らかを自動化してくれるでしょう。
ru: При отказе от версии Python может быть полезно обновить синтаксис кода проекта в целом, помимо обновления версий, используемых в видимых местах (например, в тестовой среде). Такие инструменты, как pyupgrade_ или `ruff <https://docs.astral.sh/ruff/linter/>`_, могут автоматизировать часть этой работы.
ta: பைதான் பதிப்பைக் கைவிடும்போது, புலப்படும் இடங்களில் (சோதனைச் சூழல் போன்றவை) பயன்படுத்தப்படும் பதிப்புகளைப் புதுப்பிப்பதைத் தவிர, திட்டத்தின் குறியீடு தொடரியல் பொதுவாக மேம்படுத்தவும் இது பலனளிக்கும். Pyupgrade_ அல்லது `Ruff <https://docs.astral.sh/ruff/linter/> _ _ இந்த வேலைகளில் சிலவற்றை தானியக்கமாக்கலாம்.

source: Support for the Metadata 1.2 specification has been added in Pip 9.0.
eo: Subteno por la specifo Metadatenoj 1.2 estis aldonita al Pip 9.0.
ja: メタデータ仕様 1.2 へのサポートは Pip 9.0 で追加されました。
ru: В Pip 9.0 добавлена поддержка спецификации Metadata 1.2.
ta: மேனிலை தரவு 1.2 விவரக்குறிப்புக்கான உதவி PIP 9.0 இல் சேர்க்கப்பட்டுள்ளது.

source: Hosting your own simple repository
eo: Gastigi vian propran simplan deponejon
ja: あなた自身の単純なリポジトリをホストする
pt_br: Hospedando seu próprio repositório simples
ru: Создание собственного простого хранилища
ta: உங்கள் சொந்த எளிய களஞ்சியத்தை புரவலன் செய்தல்

source: If you wish to host your own simple repository [1]_, you can either use a software package like :doc:`devpi <devpi:index>` or you can simply create the proper directory structure and use any web server that can serve static files and generate an autoindex.
eo: Se oni volas gastigi sian propran simplan deponejon [1]_, oni aŭ uzu programon kiel :doc:`devpi <devpi:index>`, aŭ oni povas simple kreu la ĝustan dosierujan strukturon kaj uzu ajnan retservilon kapablan servi statikajn dosierojn kaj generi aŭtomatan indekson.
ja: あなた自身の単純なリポジトリ [1]_ をホストしたいのであれば、 :doc:`devpi <devpi:index>` のようなソフトウェアパッケージを使うこともできますし、単に web サーバ上に適切なディレクトリを作成して静的ファイルを提供し自動でインデックスを生成させることも可能です。
pt_br: Se você deseja hospedar seu próprio repositório simples [1]_, você pode usar um pacote de software como :doc:`devpi <devpi:index>` ou você pode simplesmente criar a estrutura de diretório apropriada e usar qualquer servidor web que pode servir arquivos estáticos e gerar um autoindex.
ru: Если вы хотите разместить свой собственный простой репозиторий [1]_, вы можете использовать пакет программного обеспечения, например:doc:`devpi <devpi:index>` или вы можете просто создать правильную структуру каталога и использовать любой веб-сервер, который может обслуживать статические файлы и генерировать автоиндекс.
ta: உங்கள் சொந்த எளிய களஞ்சியத்தை புரவலன் செய்ய விரும்பினால் [1] _, நீங்கள் போன்ற ஒரு மென்பொருள் தொகுப்பைப் பயன்படுத்தலாம்: டாக்: `டெவிபி <டெவிபிஐ: குறியீட்டு>` அல்லது சரியான அடைவு கட்டமைப்பை உருவாக்கி பணி செய்யக்கூடிய எந்த வலை சேவையகத்தையும் பயன்படுத்தலாம் நிலையான கோப்புகள் மற்றும் ஒரு ஆட்டோஇண்டெக்சை உருவாக்குகின்றன.

source: In either case, since you'll be hosting a repository that is likely not in your user's default repositories, you should instruct them in your project's description to configure their installer appropriately. For example with pip:
eo: En ambaŭ kazoj, ĉar vi gastigas deponejon, kiu verŝajne ne estas inter la aprioraj deponejoj de la uzanto, vi instruu la uzanton agordi sian instalilon taŭge. Ekzemple, per pip:
ja: どちらの場合でも、ユーザとしての既定のリポジトリではない場所をあなたのリポジトリにしようとしているのでしょうから、あなたのプロジェクトの説明にインストーラを適切に設定するように指図しておくべきでしょう。例えば pip なら:
pt_br: Em ambos os casos, como você hospedará um repositório que provavelmente não está nos repositórios padrão do usuário, você deve instruí-los na descrição do seu projeto para configurar o instalador apropriadamente. Por exemplo, com pip:
ru: В любом случае, поскольку вы будете размещать репозитории, которые, вероятно, не находятся в хранилищах по умолчанию вашего пользователя, вы должны инструктировать их в описании вашего проекта, чтобы настроить их установщик соответствующим образом. Например, с pip:
ta: இரண்டிலும், உங்கள் பயனரின் இயல்புநிலை களஞ்சியங்களில் இல்லாத ஒரு களஞ்சியத்தை நீங்கள் புரவலன் செய்வதால், அவற்றின் நிறுவியை சரியான முறையில் உள்ளமைக்க உங்கள் திட்டத்தின் விளக்கத்தில் அவர்களுக்கு அறிவுறுத்த வேண்டும். உதாரணமாக PIP உடன்:

source: In addition, it is **highly** recommended that you serve your repository with valid HTTPS. At this time, the security of your user's installations depends on all repositories using a valid HTTPS setup.
eo: Krome, ni **rekomendegas**, ke la deponejo uzu validan HTTPS. Nuntempe la sekureco de la instaloj de la uzanto dependas de la valida HTTPS de ĉiuj deponejoj.
ja: 加えて、あなたのリポジトリを公開する場合はHTTPSで公開することが強く推奨されます。この時、ユーザがあなたのパッケージをインストールする際のセキュリティは、すべてのリポジトリが適切なHTTPS設定であるか否かに依存します。
pt_br: Além disso, é **altamente** recomendado que você sirva seu repositório com HTTPS válido. Neste momento, a segurança das instalações do seu usuário depende de todos os repositórios usando uma configuração válida do HTTPS.
ru: Кроме того, **высоко** рекомендуется, чтобы вы служили своему репозиторию с действительным HTTPS. В настоящее время безопасность установок вашего пользователя зависит от всех репозиториев, использующих действительную настройку HTTP.
ta: கூடுதலாக, செல்லுபடியாகும் HTTPS உடன் உங்கள் களஞ்சியத்தை வழங்க நீங்கள் ** மிகவும் ** பரிந்துரைக்கப்படுகிறது. இந்த நேரத்தில், உங்கள் பயனரின் நிறுவல்களின் பாதுகாப்பு செல்லுபடியாகும் HTTPS அமைப்பைப் பயன்படுத்தி அனைத்து களஞ்சியங்களையும் சார்ந்துள்ளது.

source: "Manual" repository
eo: «Malaŭtomata» deponejo
ja: "手動"リポジトリ
pt_br: Repositório "manual"
ru: Хранилище "Руководство"
ta: "கையேடு" களஞ்சியம்

source: The directory layout is fairly simple, within a root directory you need to create a directory for each project. This directory should be the :ref:`normalized name <name-normalization>` of the project. Within each of these directories simply place each of the downloadable files. If you have the projects "Foo" (with the versions 1.0 and 2.0) and "bar" (with the version 0.1) You should end up with a structure that looks like::
eo: La dosieruja aranĝo estas simpla. En radika dosierujo, oni kreu po unu dosierujo por ĉiu projekto. La dosierujo devas esti la :ref:`normigita nomo <name-normalization>` de la projekto. En ĉiu projekto, oni metu ĉiujn elŝuteblajn dosierojn. Se oni havus la projektojn «Foo» (kun versioj 1.0 kaj 2.0) kaj «bar» (kun la versio 0.1), oni havus la jenan dosierujan strukturon::
ja: ディレクトリ構造は極めて単純で、ルートディレクトリ内に各プロジェクトを納めたディレクトリを作成する必要があります。このディレクトリは、プロジェクトの :ref:`標準化された名前 <name-normalization>` になっているべきです。各プロジェクトのディレクトリには、それぞれダウンロード可能なファイルを置くだけです。"Foo" というプロジェクト (のバージョン 1.0 と 2.0) と "bar" というプロジェクト (のバージョン 0.1) があるなら、ディレクトリ構造はこんなふうになるでしょう::
pt_br: O layout do diretório é bastante simples, dentro de um diretório raiz você precisa criar um diretório para cada projeto. Este diretório deve ser o :ref:`nome normalizado <name-normalization>` do projeto. Em cada um desses diretórios, basta colocar cada um dos arquivos para download. Se você tem os projetos "Foo" (com as versões 1.0 e 2.0) e "bar" (com a versão 0.1), você deve acabar com uma estrutura parecida com::
ru: Схема каталогов довольно проста: в корневом каталоге необходимо создать каталог для каждого проекта. Этот каталог должен быть :ref:`нормализованным именем <имя-нормализация>` проекта. Внутри каждой из этих директорий просто разместите все загружаемые файлы. Если у вас есть проекты "Foo" (с версиями 1.0 и 2.0) и "bar" (с версией 0.1), то в итоге у вас должна получиться структура, которая выглядит следующим образом::
ta: அடைவு தளவமைப்பு மிகவும் எளிமையானது, ஒரு ரூட் கோப்பகத்திற்குள் நீங்கள் ஒவ்வொரு திட்டத்திற்கும் ஒரு கோப்பகத்தை உருவாக்க வேண்டும். இந்த அடைவு பின்வருமாறு: ref: `இயல்பாக்கப்பட்ட பெயர் <பெயர்-இயல்பாக்கம்>` திட்டத்தின். இந்த ஒவ்வொரு கோப்பகத்திலும் தரவிறக்கம் செய்யக்கூடிய ஒவ்வொரு கோப்புகளையும் வைக்கவும். உங்களிடம் "ஃபூ" (பதிப்புகள் 1.0 மற்றும் 2.0) மற்றும் "பார்" (பதிப்பு 0.1 உடன்) திட்டங்கள் இருந்தால், நீங்கள் ஒரு கட்டமைப்போடு முடிவடையும் ::
