Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: A valid SPDX short-form license identifier, originally specified in :pep:`639`. This includes all valid SPDX identifiers and the custom ``LicenseRef-[idstring]`` strings conforming to the SPDX specification. Examples: ``MIT``, ``GPL-3.0-only``, ``LicenseRef-My-Custom-License``
eo: Valida mallongforma licenco-identigilo de SPDX, originale specifita en :pep:`639`. Tio inkluzivas ĉiujn validajn SPDX-identigilojn kaj la proprajn signoĉenojn ``LicenseRef-[identigilo]`` konformajn al la normo SPDX. Ekzemple: ``MIT``, ``GPL-3.0-only``, ``LicenseRef-Mia-Propra-Licenco``
ja: 元々は :pep:`639` で仕様化された、正当な SPDX の短縮形式のライセンス識別子。これには、すべての正当な SPDX 識別子と、 SPDX 仕様を満足するカスタムの ``LicenseRef-[idstring]`` 文字列が含まれます。例: ``MIT`` ・ ``GPL-3.0-only`` ・ ``LicenseRef-My-Custom-License``
ru: Действительный идентификатор короткой формы лицензии SPDX, первоначально указанный в :pep:`639`. Сюда входят все действительные идентификаторы SPDX и пользовательские строки ``LicenseRef-[idstring]``, соответствующие спецификации SPDX. Примеры: ``MIT``, ``GPL-3.0-only``, ``LicenseRef-My-Custom-License``
ta: செல்லுபடியாகும் SPDX குறுகிய வடிவ உரிம அடையாளங்காட்டி, முதலில் குறிப்பிடப்பட்டுள்ளது: PEP: `639`. இதில் அனைத்து செல்லுபடியாகும் SPDX அடையாளங்காட்டிகள் மற்றும் தனிப்பயன் `` LicuenSeref- [idstring] `` SPDX விவரக்குறிப்புக்கு இணங்க சரங்கள் ஆகியவை அடங்கும். எடுத்துக்காட்டுகள்: `` mit``, `` gpl -3.0-lonly``, `` licenseref-my-custom-license``

source: Module
eo: Modulo
ja: モジュール
pt_br: Módulo
ru: Модуль
ta: தொகுதி

source: The basic unit of code reusability in Python, existing in one of two types: :term:`Pure Module`, or :term:`Extension Module`.
eo: La baza unuo de reuzebla kodo en Python, en unu el la du jenaj tipoj: :term:`Pura Modulo <Pure Module>` aŭ :term:`Etendaĵa Modulo <Extension Module>`.
ja: Pythonにおけるソースコード再利用の基本的な単位で、 :term:`Pure Module`か :term:`Extension Module`の二つのタイプのうちのいずれか。
pt_br: A unidade básica de reutilização de código em Python, existindo em um dos dois tipos: :term:`Módulo Puro` ou :term:`Módulo de Extensão`.
ru: Базовая единица многократного использования кода в Python, существующая в одном из двух типов: :термин: «чистый модуль» или :термин: «модуль расширения».
ta: பைத்தானில் குறியீடு மறுபயன்பாட்டின் அடிப்படை அலகு, இரண்டு வகைகளில் ஒன்றில் உள்ளது :: கால: `தூய தொகுதி`, அல்லது: கால:` நீட்டிப்பு தொகுதி`.

source: Package Index
eo: Pakindekso
ja: パッケージインデックス
pt_br: Índice de Pacotes
ru: Индекс пакета
ta: தொகுப்பு அட்டவணை

source: A repository of distributions with a web interface to automate :term:`package <Distribution Package>` discovery and consumption.
eo: Deponejo de distribuoj kun TTT-fasado por aŭtomatigi serĉadon kaj uzadon de :term:`pakoj <Distribution Package>`.
ja: :term:`パッケージ <Distribution Package>`の発見・消費(訳註、意訳になるが検索・ダウンロードが適切か)を自動化するwebインターフェイスを伴った配布物のリポジトリ。
pt_br: Um repositório de distribuições com uma interface web para automatizar descoberta e consumo de :term:`pacotes <Distribution Package>`.
ru: Репозиторий дистрибутивов с веб-интерфейсом для автоматизации :term:`package <Distribution Package>` обнаружения и потребления.
ta: தானியங்குபடுத்த ஒரு வலை இடைமுகத்துடன் விநியோகங்களின் களஞ்சியம்: சொல்: `தொகுப்பு <விநியோக தொகுப்பு>` கண்டுபிடிப்பு மற்றும் நுகர்வு.

source: Per Project Index
eo: Unu-Projekta Indekso
ja: プロジェクト単位の索引
pt_br: Índice Por Projeto
ru: Индекс на проект
ta: திட்டக் குறியீட்டிற்கு

source: A private or other non-canonical :term:`Package Index` indicated by a specific :term:`Project` as the index preferred or required to resolve dependencies of that project.
eo: Privata aŭ alia nekanona :term:`Pakindekso <Package Index>` indikita de specifa :term:`Projekto <Project>` kiel la indekso preferata aŭ postulata por solvi dependecojn de tiu projekto.
ja: ある :term:`プロジェクト <Project>`が嗜好するか要求する依存関係を解決するために、:term:`プロジェクト <Project>`の単位で示された仲間内または非公式の :term:`パッケージ索引 <Package Index>`。
pt_br: Um :term:`Índice de Pacotes` privado ou outro não canônico indicado por um :term:`Projeto` específico como o índice preferido ou necessário para resolver dependências desse projeto.
ru: Частный или иной неканонический:термин: «Индекс пакетов», обозначенный конкретным:термин: «проект» как индекс, предпочтительный или необходимый для решения зависимостей этого проекта.
ta: ஒரு தனியார் அல்லது பிற நியதி அல்லாத: கால: `தொகுப்பு குறியீட்டு` ஒரு குறிப்பிட்ட: கால: கால:` திட்டம்` அந்த திட்டத்தின் சார்புகளைத் தீர்க்க குறியீடாக அல்லது தேவைப்படுகிறது.

source: Project
eo: Projekto
ja: プロジェクト
pt_br: Projeto
ru: Проект
ta: திட்டம்

source: A library, framework, script, plugin, application, or collection of data or other resources, or some combination thereof that is intended to be packaged into a :term:`Distribution <Distribution Package>`.
eo: Biblioteko, kadro, programeto, kromprogramo, aplikprogramo, datenaro aŭ alia resurso, aŭ iu kombinaĵo de tiuj, pakotaj en :term:`Distribuon <Distribution Package>`.
ja: ライブラリ、フレームワーク、スクリプト、プラグイン、アプリケーション、ないし一連のデータもしくはその他のリソース、または、これらの組み合わせで :term:`配布物 <Distribution Package>`として意図的にパッケージされたもの。
pt_br: Uma biblioteca, estrutura, script, plugin, aplicação ou coleção de dados ou outros recursos, ou alguma combinação dos mesmos que se destina a ser empacotado em uma :term:`Distribuição <Distribution Package>`.
ru: Библиотека, структура, сценарий, плагин, приложение или сбор данных или других ресурсов, или определенная их комбинация, которая должна быть упакована в :term:`Distribution <Distribution Package>`.
ta: ஒரு நூலகம், கட்டமைப்பு, ச்கிரிப்ட், சொருகி, பயன்பாடு அல்லது தரவு அல்லது பிற வளங்களின் சேகரிப்பு அல்லது அதன் சில கலவையானது A: கால: `விநியோக <விநியோக தொகுப்பு>` இல் தொகுக்கப்பட வேண்டும்.

source: Since most projects create :term:`Distributions <Distribution Package>` using either :pep:`518` ``build-system``, :ref:`distutils` or :ref:`setuptools`, another practical way to define projects currently is something that contains a :term:`pyproject.toml`, :term:`setup.py`, or :term:`setup.cfg` file at the root of the project source directory.
eo: Ĉar la plejparto de projektoj kreas :term:`Distribuojn <Distribution Package>` per aŭ ``build-system`` de :pep:`518`, aŭ :ref:`distutils`, aŭ :ref:`setuptools`, alia aktuala praktika difino de projekto estas iu enhavanta dosieron :term:`pyproject.toml`, :term:`setup.py`, aŭ :term:`setup.cfg` ĉe la radiko de la projekta fonta dosierujo.
ja: ほとんどのプロジェクトで :pep:`518` ``build-system``として :ref:`distutils`か :ref:`setuptools`を用いて :term:`配布物 <Distribution Package>`を作成しますので、現時点でプロジェクトを定義するもうひとつの実践的な方法は、プロジェクトのソースコードの一番上のディレクトリに :term:`pyproject.toml`や :term:`setup.py`または :term:`setup.cfg`のファイルを含む何ものかというものです。
pt_br: Como a maioria dos projetos cria :term:`Distribuições <Distribution Package>` usando ``build-system`` da :pep:`518`, :ref:`distutils` ou :ref:`setuptools`, outra maneira prática de definir projetos atualmente é algo que contém um arquivo :term:`pyproject.toml`, :term:`setup.py` ou :term:`setup.cfg` na raiz do diretório fonte do projeto.
ru: Поскольку большинство проектов создают :term:`Distributions <Дистрибутивный пакет>`, используя либо :pep:`518` `build-system`, :ref:`distutils` или :ref:`setuptools`, другим практичным способом определения проектов в настоящее время является то, что содержит :term:`pyproject.toml`, :term:`setup.py` или :term:`setup.cfg` файл в корне исходного каталога проекта.
ta: பெரும்பாலான திட்டங்கள் உருவாகின்றன: கால: `விநியோகம் <விநியோக தொகுப்பு>` ஒன்றைப் பயன்படுத்துதல்: PEP: `518`` `` பில்ட்-சிச்டம்``,: குறிப்பு: `தொலைதூரங்கள்` அல்லது: ref:` setuptools`, திட்டங்களை வரையறுக்க மற்றொரு நடைமுறை வழி தற்போது ஒரு: கால: `pyproject.toml`,: கால:` setup.py`, அல்லது: கால: `setup.cfg` கோப்பு திட்ட மூல கோப்பகத்தில் உள்ள ஒன்று.

source: Python projects must have unique names, which are registered on :term:`PyPI <Python Package Index (PyPI)>`. Each project will then contain one or more :term:`Releases <Release>`, and each release may comprise one or more :term:`distributions <Distribution Package>`.
eo: Python-projekto devas havi unikan nomon, registritan ĉe :term:`PyPI <Python Package Index (PyPI)>`. Ĉiu projekto enhavas unu aŭ plurajn :term:`Eldonojn <Release>`, kaj ĉiu eldono konsistas el unu aŭ pluraj :term:`distribuoj <Distribution Package>`.
ja: Pythonにおけるプロジェクトは、 :term:`PyPI <Python Package Index (PyPI)>`に登録される一意の名前を持っていなければなりません。そして、プロジェクトはそれぞれひとつまたはより多くの :term:`リリース <Release>`を含んでいて、各リリースはひとつまたはより多くの :term:`配布物 <Distribution Package>`を内包しています。
pt_br: Projetos Python devem ter nomes únicos, que são registrados no :term:`PyPI <Python Package Index (PyPI)>`. Cada projeto conterá então um ou mais :term:`Lançamentos <Release>`, e cada lançamento pode incluir uma ou mais :term:`distribuições <Distribution Package>`.
ru: Проекты Python должны иметь уникальные имена, которые регистрируются в :term:`PyPI <Python Package Index (PyPI)>`. Каждый проект будет содержать один или несколько :term:`Releases <Release>`, а каждый релиз может состоять из одного или нескольких :term:`distributions <Distribution Package>`.
ta: பைதான் திட்டங்களில் தனித்துவமான பெயர்கள் இருக்க வேண்டும், அவை பதிவு செய்யப்பட்டுள்ளன: கால: `பைபி <பைதான் தொகுப்பு குறியீட்டு (பைபி)>`. ஒவ்வொரு திட்டத்திலும் ஒன்று அல்லது அதற்கு மேற்பட்டவை இருக்கும்: கால: `வெளியீடுகள் <வெளியீடு>`, மேலும் ஒவ்வொரு வெளியீட்டிலும் ஒன்று அல்லது அதற்கு மேற்பட்டவை இருக்கலாம்: சொல்: `விநியோகம் <விநியோக தொகுப்பு>`.

source: Note that there is a strong convention to name a project after the name of the package that is imported to run that project. However, this doesn't have to hold true. It's possible to install a distribution from the project 'foo' and have it provide a package importable only as 'bar'.
eo: Notu, ke ekzistas forta konvencio nomi projekton laŭ la nomo de la pako importebla por ruli tiun projekton. Tamen, tio ne necesas. Eblas instali distribuon de projekto «foo», kiu provizas pakon importeblan nur kiel «bar».
ja: そのプロジェクトを稼働させるためにインポートされるパッケージの名前に因んでプロジェクトに名前をつけるのが普通であるという強い慣習があることを覚えておいてください。しかしながら、常にそうしなければならないわけではありません。「なんとか」というプロジェクトから配布物をインストールしていながらも、「かんとか」(訳註、「なんとか」とは無関係の別の名前の例)という名前でのみインポート可能なパッケージを提供することは可能です。
pt_br: Observe que há uma forte convenção para dar o nome do projeto ao pacote que é importado para executar esse projeto. No entanto, isso não é obrigatório. É possível instalar uma distribuição do projeto "foo" e fazer com que ele forneça um pacote importável apenas como "bar".
ru: Обратите внимание, что существует строгое правило называть проект по имени пакета, который импортируется для запуска этого проекта. Однако это не обязательно так. Можно установить дистрибутив из проекта 'foo' и получить от него пакет, импортируемый только как 'bar'.
ta: அந்த திட்டத்தை இயக்க இறக்குமதி செய்யப்பட்ட தொகுப்பின் பெயருக்குப் பிறகு ஒரு திட்டத்திற்கு பெயரிட ஒரு வலுவான மாநாடு உள்ளது என்பதை நினைவில் கொள்க. இருப்பினும், இது உண்மையாக இருக்க வேண்டியதில்லை. 'ஃபூ' திட்டத்திலிருந்து ஒரு விநியோகத்தை நிறுவ முடியும், மேலும் இது ஒரு தொகுப்பை 'பார்' என்று மட்டுமே இறக்குமதி செய்ய வேண்டும்.

source: Project Root Directory
eo: Projekta Radika Dosierujo
ja: プロジェクトのルートディレクトリ
ru: Корневой каталог проекта
ta: திட்ட ரூட் அடைவு

source: The filesystem directory in which a :term:`Project`'s :term:`source tree <Project Source Tree>` is located.
eo: La dosiersistema dosierujo, en kiu troviĝas la term:`fontarbo <Project Source Tree>` de :term:`projekto <Project>`.
ja: :term:`プロジェクト <Project>` の :term:`ソースコードツリー <Project Source Tree>` が位置するファイルシステム上のディレクトリ。
ru: Каталог файловой системы, в котором находится : термин:`Проект` :термин:`дерево источников <Дерево источников проекта>`.
ta: கோப்பு முறைமை அடைவு இதில் A: கால: `திட்டம்` கள்: கால:` மூல மரம் <திட்ட மூல மரம்> `அமைந்துள்ளது.

source: Project Source Tree
eo: Projekta Fontarbo
ja: プロジェクトソースコードツリー
ru: Дерево источников проекта
ta: திட்ட மூல மரம்

source: The on-disk format of a :term:`Project` used for development, containing its raw source code before being packaged into a :term:`Source Distribution <Source Distribution (or "sdist")>` or :term:`Built Distribution`.
eo: La surdiska formo de :term:`Projekto <Project>` uzata por evoluigado, enhavanta la krudan fontkodon antaŭ pakado en :term:`Fontan Distribuon <Source Distribution (or "sdist")>` aŭ :term:`Konstruitan Distribuon <Built Distribution>`.
ja: :term:`ソースコード配布物 <Source Distribution (or "sdist")>` や :term:`ビルド済配布物 <Built Distribution>` にパッケージされる前の生のソースコードを含んだ、開発に使われる :term:`プロジェクト <Project>` のディスク上でのフォーマット。
ru: Дисковый формат : термин:`Проект`, используемый для разработки, содержащий его исходный код перед упаковкой в :термин:`Источник дистрибутива <Источник дистрибутива (или "sdist")>` или :термин:`Созданный дистрибутив`.
ta: A இன் ஆன்-வட்டு வடிவம்: கால: `திட்டம்` அபிவிருத்திக்குப் பயன்படுத்தப்படுகிறது, அதன் மூல மூலக் குறியீட்டைக் கொண்டிருப்பதற்கு முன்பு அதன் மூல மூலக் குறியீட்டைக் கொண்டுள்ளது: கால:` மூல வழங்கல் <மூல வழங்கல் (அல்லது "SDIST")> `அல்லது: கால:` கட்டப்பட்டது விநியோகம்`.

source: Project Source Metadata
eo: Projektaj Fontaj Metadatenoj
ja: プロジェクトソースのメタデータ
ru: Исходные метаданные проекта
ta: திட்ட மூல மேனிலை தரவு

source: Metadata defined by the package author in a :term:`Project`'s :term:`source tree <Project Source Tree>`, to be transformed into :term:`Core Metadata field`\s in the :term:`Built Metadata` by the project's :term:`build backend <Build Backend>`. Can be written as :term:`Pyproject Metadata`, or in a tool-specific format (under the ``[tool]`` table in ``pyproject.toml``, or in a tool's own configuration file).
ja: :term:`プロジェクト <Project>` の :term:`ソースコードツリー <Project Source Tree>` 内でパッケージ作者が定義したメタデータで、プロジェクトの :term:`ビルドバックエンド <Build Backend>` が :term:`ビルド済メタデータ <Built Metadata>` 内の :term:`コアとなるメタデータのフィールド <Core Metadata Field` へ変換するもの。 :term:`Pyproject のメタデータ <Pyproject Metadata>` の形か、ツール特有のフォーマット (``pyproject.toml`` 内の ``[tool]`` テーブル、または、ツール独自の設定ファイル) で書くことができます。
ru: Метаданные, определенные автором пакета в : термин:`Проект` в :термин:`дерево источников <Дерево источников проекта>`, которые должны быть преобразованы в :термин:`поля основных метаданных`\ в :термин:`Строенные метаданные` бэкендом проекта :термин:`бэкенд сборки <Бэкенд сборки>`. Может быть записана как : термин:`Метаданные Пайпроекта`, или в специфическом для инструмента формате (в таблице ``[ Инструмент]`` в ``pyproject.toml``, или в собственном конфигурационном файле инструмента).
ta: ஒரு: கால: `திட்டம்` கள்: கால:` மூல மரம் <திட்ட மூல மரம்> `, மாற்றப்பட வேண்டும்: கால: கால:` கோர் மேனிலை தரவு புலம்` \ கள்: `கட்டப்பட்டவை திட்டத்தின் மூலம் மெட்டாடேட்டா: கால: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>`. இவ்வாறு எழுதலாம்: கால: `பைபிரெக்ட் மெட்டாடேட்டா`, அல்லது கருவி-குறிப்பிட்ட வடிவத்தில் (` `[கருவி]` `` pyproject.toml`` அல்லது ஒரு கருவியின் சொந்த உள்ளமைவு கோப்பில்) `` அட்டவணையின் கீழ்).

source: Pure Module
eo: Pura Modulo
ja: 純粋なモジュール
pt_br: Módulo Puro
ru: Чистый модуль
ta: தூய தொகுதி

source: A :term:`Module` written in Python and contained in a single ``.py`` file (and possibly associated ``.pyc`` and/or ``.pyo`` files).
eo: :term:`Modulo <Module>` verkita en Python kaj en unu dosiero ``.py`` (kaj eble asociitaj dosieroj ``.pyc`` kaj/aŭ ``.pyo``).
ja: Pythonで書かれていて単一の``.py``ファイル(とおそらくは対応する``.pyc``ファイルや``.pyo``ファイル)に収められた :term:`モジュール <Module>`。
pt_br: Um :term:`Módulo` escrito em Python e contido em um único arquivo ``.py`` (e possivelmente arquivos ``.pyc`` e/ou ``.pyo`` associados).
ru: Модуль, написанный на языке Python и содержащийся в одном файле ``.py`` (и, возможно, связанных с ним файлах ``.pyc`` и/или ``.pyo``).
ta: ஒரு: கால: `தொகுதி` பைத்தானில் எழுதப்பட்டு ஒற்றை` .py`` கோப்பில் (மற்றும் தொடர்புடைய `` .பிசி`` மற்றும்/அல்லது `` .பியோ` கோப்புகள்) உள்ளன.

source: Pyproject Metadata
eo: Pyproject-Metadatenoj
ja: Pyproject のメタデータ
ru: Метаданные Pyproject
ta: Pyproject மேனிலை தரவு

source: The :term:`Project Source Metadata` format defined by the :ref:`declaring-project-metadata` specification and originally introduced in :pep:`621`, stored as :term:`Pyproject Metadata Key`\s under the ``[project]`` table of a :term:`pyproject.toml` file. Notably, *not* a tool-specific source metadata format under the ``[tool]`` table in ``pyproject.toml``.
ja: ref:`プロジェクトのメタデータを宣言する <declaring-project-metadata>` の仕様で定義されており、 :pep:`621` で初めて登場した :term:`プロジェクトソースのメタデータ <Project Source Metadata>` のフォーマットで、 :term:`pyproject.toml` ファイルの ``[project]`` テーブルの下の :term:`プロジェクトソースのメタデータ <Project Source Metadata>` として格納されるもの。 ``pyproject.toml`` 内の ``[tool]`` テーブルの下にあるツール特有のソースメタデータでは *ない* ということに注意。
ru: Формат исходных метаданных проекта, определенный спецификацией :ref:`декларирования метаданных проекта` и первоначально представленный в :pep:`621`, хранящийся как : термин:`Пайпроект Метаданные Ключ`\ в таблице ``[ проект]`` файла : термин:`pyproject.toml`. Примечательно, что *не* специфический для инструмента формат метаданных источника в таблице ``[ инструмент]`` в файле ``pyproject.toml``.
ta: தி: கால: `திட்ட மூல மெட்டாடேட்டா` வடிவம் வரையறுக்கப்பட்டுள்ளது: ref:` அறிவித்தல்-திட்ட-மெட்டாடேட்டா` விவரக்குறிப்பை அறிவித்தல் மற்றும் முதலில் அறிமுகப்படுத்தப்பட்டது: PEP: `621`, இவ்வாறு சேமிக்கப்படுகிறது:` பைபிரெக்ட் மேனிலை தரவு கீ` \ கள் `கீழ் `[திட்டம்]` `ஒரு அட்டவணை: கால:` pyproject.toml` கோப்பு. குறிப்பிடத்தக்க வகையில், `` pyproject.toml`` இல் `` [கருவி] `` அட்டவணையின் கீழ் ஒரு கருவி-குறிப்பிட்ட மூல மேனிலை தரவு வடிவமைப்பை * அல்ல.

source: A top-level TOML key in the ``[project]`` table in ``pyproject.toml``; part of the :term:`Pyproject Metadata`. Notably, distinct from a :term:`Core Metadata Field`.
eo: Supranivela TOML-ŝlosilo en la tabelo ``[project]`` en ``pyproject.toml``; parto de la :term:`Pyproject-Metadatenoj <Pyproject Metadata>`. Notindas, ke ĝi ne estas :term:`Kerna Metadatena Kampo <Core Metadata Field>`.
ja: ``pyproject.toml`` 内の ``[project]`` テーブルの中にあるトップレベルの TOML キー; :term:`Pyproject のメタデータ <Pyproject Metadata>` の一部。 :term:`コアとなるメタデータのフィールド <Core Metadata Field` とは異なる点に注意。
ru: TOML-ключ верхнего уровня в таблице ``[[проект]`` в файле ``pyproject.toml``; часть : термин:``Метаданные пайпроекта``. Отличается от : термин:`Поле основных метаданных`.
ta: `` திட்ட] `` `` pyproject.toml`` இல் ஒரு உயர்மட்ட டாம்ல் விசை; இதன் ஒரு பகுதி: கால: `பைபிரொசெக்ட் மெட்டாடேட்டா`. குறிப்பிடத்தக்க வகையில், A இலிருந்து வேறுபட்டது: கால: `கோர் மேனிலை தரவு புலம்`.

source: Pyproject Metadata Subkey
eo: Pyproject-Metadatena Subŝlosilo
ja: Pyproject のメタデータサブキー
ru: Подключите метаданные Pyproject
ta: Pyproject மேனிலை தரவு சப்ச்கி

source: A second-level TOML key under a table-valued :term:`Pyproject Metadata Key`.
eo: Duanivela TOML-ŝlosilo sub tabelo-valora :term:`Pyproject-Metadatena Ŝlosilo <Pyproject Metadata Key>`.
ja: :term:`Pyproject メタデータのキー <Pyproject Metadata Key>` のテーブルの値の下にある第２層の TOML キー。
ru: Ключ TOML второго уровня под табличным значением : термин:`Пайпроект Ключ Метаданных`.
ta: அட்டவணை மதிப்பீட்டின் கீழ் இரண்டாவது நிலை டாம்ல் விசை: கால: `பைபிரெக்ட் மேனிலை தரவு கீ`.

source: Python Packaging Authority (PyPA)
eo: Python-Pakada Aŭtoritato (PyPA)
ja: Pythonパッケージングオーソリティ(PyPA)
ru: Python Управление по упаковке (PyPA)
ta: பைதான் பேக்கேசிங் ஆணையம் (பைபா)

source: PyPA is a working group that maintains many of the relevant projects in Python packaging. They maintain a site at :doc:`pypa.io <pypa:index>`, host projects on `GitHub <https://github.com/pypa>`_ and `Bitbucket <https://bitbucket.org/pypa>`_, and discuss issues on the `distutils-sig mailing list <https://mail.python.org/mailman3/lists/distutils-sig.python.org/>`_ and `the Python Discourse forum <https://discuss.python.org/c/packaging>`__.
eo: PyPA estas laborgrupo mastrumanta multajn projektojn pri pakado de Python. Ĝia retejo estas :doc:`pypa.io <pypa:index>`. Ĝi gastigas projektojn ĉe `GitHub <https://github.com/pypa>`_ kaj `Bitbucket <https://bitbucket.org/pypa>`_ kaj diskutas problemojn ĉe `la dissendolisto distutils-sig <https://mail.python.org/mailman3/lists/distutils-sig.python.org/>`_ kaj `la forumo Discourse por Python <https://discuss.python.org/c/packaging>`__.
ja: PyPAは、Pythonのパッケージングに関係する多くのプロジェクトを維持管理する作業グループです。その活動の一環として :doc:`papa.io <pypa:index>` を維持管理しており、 `GitHub <https://github.com/pypa>`_ と `Bitbucket <https://bitbucket.org/pypa>`_ に関連プロジェクトを置くとともに、 `distutils-sig メーリングリスト <https://mail.python.org/mailman3/lists/distutils-sig.python.org/>`_ と `Python談話フォーラム <https://discuss.python.org/c/packaging>`__ で議論を進めています。
pt_br: PyPA é um grupo de trabalho que mantém muitos dos projetos relevantes em pacotes Python. Eles mantêm um site em :doc:`pypa.io <pypa:index>`, hospedam projetos no `GitHub <https://github.com/pypa>`_ e `Bitbucket <https://bitbucket.org/pypa>`_, e discutem questões na `lista de discussão distutils-sig <https://mail.python.org/mailman3/lists/distutils-sig.python.org/>`_ e `o fórum Discourse do Python <https://discuss.python.org/c/packaging>`__.
ru: PyPA - это рабочая группа, которая поддерживает множество соответствующих проектов по упаковке Python. Они поддерживают сайт по адресу :doc:`pypa.io <pypa:index>`, размещают проекты на `GitHub <https://github.com/pypa>`_ и `Bitbucket <https://bitbucket.org/pypa>`_, а также обсуждают проблемы в списке рассылки `distutils-sig <https://mail.python.org/mailman3/lists/distutils-sig.python.org/>`_ и на форуме Python Discourse <https://discuss.python.org/c/packaging>`__.
ta: பைபா என்பது பைதான் பேக்கேசிங்கில் தொடர்புடைய பல திட்டங்களை பராமரிக்கும் ஒரு பணிக்குழு ஆகும். அவர்கள் ஒரு தளத்தை பராமரிக்கின்றனர்: doc: `pypa.io <pypa: index>`, `github <https://github.com/pypa>` _ மற்றும் `பிட்பக்கெட் <https://bitbucket.org/pypa > `_, மற்றும்` டிச்டிடில்ச்-சிக் அஞ்சல் பட்டியலில் உள்ள சிக்கல்களைப் பற்றி விவாதிக்கவும் //discuss.python.org/c/packaging>`__.

source: Python Package Index (PyPI)
eo: Python-Pakindekso (PyPI)
ja: Pythonパッケージインデックス (PyPI)
ru: Индекс пакетов Python (PyPI)
ta: பைதான் தொகுப்பு அட்டவணை (PYPI)

source: `PyPI <https://pypi.org>`_ is the default :term:`Package Index` for the Python community. It is open to all Python developers to consume and distribute their distributions.
eo: `PyPI <https://pypi.org>`_ estas la ĉefa :term:`pakindekso <Package Index>` por la Python-komunumo. Ĉiu Python-programisto povas uzi ĝin por uzi kaj distribui siajn distribuojn.
ja: `PyPI <https://pypi.org>`_ は、Pythonコミュニティにとってデフォルトの :term:`Package Index`です。ここから配布物を取り出し、また、配布するためにすべてのPython開発者に開かれています。
pt_br: `PyPI <https://pypi.org>`_ é o :term:`Índice de Pacotes` padrão para a comunidade Python. Está aberto a todos os desenvolvedores Python para consumir e distribuir suas distribuições.
ru: `PyPI <https://pypi.org>`_ является стандартным :term:`Package Index` для сообщества Python. Он открыт для всех разработчиков Python для потребления и распространения их дистрибутивов.
ta: `Pypi <https://pypi.org>` _ என்பது இயல்புநிலை: சொல்: பைதான் சமூகத்திற்கான `தொகுப்பு குறியீடு`. அனைத்து பைதான் டெவலப்பர்களுக்கும் அவர்களின் விநியோகங்களை உட்கொள்வதற்கும் விநியோகிப்பதற்கும் இது திறந்திருக்கும்.
