Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: A distribution package is a piece of software that you can install. Most of the time, this is synonymous with "project". When you type ``pip install pkg``, or when you write ``dependencies = ["pkg"]`` in your ``pyproject.toml``, ``pkg`` is the name of a distribution package. When you search or browse the PyPI_, the most widely known centralized source for installing Python libraries and tools, what you see is a list of distribution packages. Alternatively, the term "distribution package" can be used to refer to a specific file that contains a certain version of a project.
eo: Distribua pako estas instalebla peco da programaro. Plej ofte, tio estas sinonima al «projekto». Kiam vi tajpas ``pip install pako``, aŭ kiam vi skribas ``dependencies = ["pako"]`` en via ``pyproject.toml``, ``pako`` estas la nomo de distribua pako. Kiam vi serĉas aŭ foliumas PyPI_, la plej vaste konata fonto por instali Python-bibliotekojn kaj ilojn, vi vidas liston da distribuaj pakoj. Alternative, la termino «distribua pako» povas signifi specifan dosieron enhavantan specifan version de projekto.
ja: 配布パッケージとは、インストール可能な一片のソフトウェアです。ほとんどの場合、これは "プロジェクト <project>" と同義です。 ``pip install pkg`` とタイプする時、あるいは、 ``pyproject.toml`` に ``dependencies = ["pkg"]`` と書く時、 ``pkg`` のところには配布パッケージの名前を書きます。Python のライブラリやツール類の集約された源として最も広く知られている PyPI_ で検索したり閲覧する時、あなたが目にするものは配布パッケージのリストです。あるいは、"配布パッケージ" という言葉があるプロジェクトの特定のバージョンを内包した特定のファイルのことを指す場合もあります。
pt_br: Um pacote de distribuição é um software que você pode instalar. Na maioria das vezes, isso é sinônimo de "projeto". Quando você digita ``pip install pkg``, ou quando você escreve ``dependencies = ["pkg"]`` em seu ``pyproject.toml``, ``pkg`` é o nome de um pacote de distribuição. Quando você pesquisa ou navega no PyPI_, a fonte centralizada mais conhecida para instalar Python bibliotecas e ferramentas, o que você vê é uma lista de pacotes de distribuição. Alternativamente, o termo "pacote de distribuição" pode ser usado para se referir a um arquivo específico que contém uma determinada versão de um projeto.
ru: Дистрибутив - это часть программного обеспечения, которую вы можете установить. В большинстве случаев это синоним слова "проект". Когда вы набираете ``pip install pkg``, или когда вы пишете ``dependencies = ["pkg"]`` в вашем ``pyproject.toml``, ``pkg`` - это имя дистрибутивного пакета. Когда вы ищете или просматриваете PyPI_, наиболее известный централизованный источник для установки библиотек и инструментов Python, вы видите список дистрибутивных пакетов. Кроме того, термин "дистрибутивный пакет" может использоваться для обозначения конкретного файла, содержащего определенную версию проекта.
ta: விநியோக தொகுப்பு என்பது நீங்கள் நிறுவக்கூடிய மென்பொருளின் ஒரு பகுதி. பெரும்பாலான நேரங்களில், இது "திட்டத்திற்கு" ஒத்ததாகும். நீங்கள் `` பிஐபி நிறுவவும் pkg`` அல்லது உங்கள் `` pyproject.toml`` இல் `` சார்புகள் = ["pkg"] `` `` pkg`` ஒரு விநியோக தொகுப்பின் பெயர். பைதான் நூலகங்கள் மற்றும் கருவிகளை நிறுவுவதற்கான மிகவும் பரவலாக அறியப்பட்ட மையப்படுத்தப்பட்ட மூலமான PYPI_ ஐ நீங்கள் தேடும்போது அல்லது உலாவும்போது, நீங்கள் பார்ப்பது விநியோக தொகுப்புகளின் பட்டியல். மாற்றாக, ஒரு திட்டத்தின் ஒரு குறிப்பிட்ட பதிப்பைக் கொண்ட ஒரு குறிப்பிட்ட கோப்பைக் குறிக்க "விநியோக தொகுப்பு" என்ற சொல் பயன்படுத்தப்படலாம்.

source: Note that in the Linux world, a "distribution package", most commonly abbreviated as "distro package" or just "package", is something provided by the system package manager of the `Linux distribution <distro_>`_, which is a different meaning.
eo: Notu, ke en la mondo de Linux, «distribua pako» aŭ simple «pako» estas io provizata de la sistema pakadministrilo de la `Linux-distribuo <distro_>`_, kio estas alia signifo.
ja: Linux の世界では、 "配布パッケージ <distribution package>" が "ディストロパッケージ <distro package>" か単に "パッケージ <package>" と短縮形で呼ばれることが通常であり、 `Linux ディストリビューション <distro_>`_ のシステムパッケージ管理者によって提供される何かのことであって、異なる意味で使われているということは意識しておいてください。
pt_br: Note que no mundo Linux, um "pacote de distribuição", mais comumente abreviado como "pacote de distro" (em inglês, *distro package*) ou apenas "pacote", é algo fornecido pelo gerenciador de pacotes do sistema da "distribuição Linux <distro_>`_, que é um significado diferente.
ru: Обратите внимание, что в мире Linux "дистрибутивный пакет", чаще всего сокращаемый как "дистропакет" или просто "пакет", - это нечто, предоставляемое системным менеджером пакетов дистрибутива <distro_>`_, что имеет другое значение.
ta: லினக்ச் உலகில், ஒரு "விநியோக தொகுப்பு", பொதுவாக "டிச்ட்ரோ தொகுப்பு" அல்லது "தொகுப்பு" என சுருக்கமாக, `லினக்ச் விநியோக <stisho_>` _ இன் கணினி தொகுப்பு மேலாளரால் வழங்கப்பட்ட ஒன்று என்பதை நினைவில் கொள்க, இது வேறு பொருள்.

source: What's an import package?
eo: Kio estas importa pako?
ja: パッケージをインポートする、とは何でしょうか？
pt_br: O que é um pacote de importação?
ru: Что такое пакет импорта?
ta: இறக்குமதி தொகுப்பு என்றால் என்ன?

source: An import package is a Python module. Thus, when you write ``import pkg`` or ``from pkg import func`` in your Python code, ``pkg`` is the name of an import package. More precisely, import packages are special Python modules that can contain submodules. For example, the ``numpy`` package contains modules like ``numpy.linalg`` and ``numpy.fft``. Usually, an import package is a directory on the file system, containing modules as ``.py`` files and subpackages as subdirectories.
eo: Importa pako estas Python-modulo. Tiel, kiam vi skribas ``import pako`` aŭ ``from pako import funk`` en via Python-kodo, ``pako`` estas la nomo de importa pako. Pli precize, importa pako estas speciala Python-modulo, kiu povas enhavi submodulojn. Ekzemple, la pako ``numpy`` enhavas modulojn kiel ``numpy.linalg`` kaj ``numpy.fft``. Ordinare, importa pako estas dosierujo en la dosiersistemo, enhavanta modulojn kiel ``.py``-dosierojn kaj subpakojn kiel subdosierujojn.
ja: インポートパッケージは Python モジュールです。したがって、 Python コードに ``import pkg`` もしくは ``from pkg import func`` と書く時、``pkg`` の部分はインポートパッケージの名称です。より精確には、インポートパッケージは、サブモジュールを内包することができる特別な Python モジュールです。通常は、インポートパッケージはファイルシステム上のディレクトリであって、モジュールを ``.py`` の形で含み、サブパッケージをサブディレクトリの形で含むものです。
pt_br: Um pacote de importação é um módulo Python. Assim, quando você escreve ``import pkg`` ou ``from pkg import func`` em seu código Python, ``pkg`` é o nome de um pacote de importação. Mais precisamente, os pacotes de importação são módulos especiais Python que podem conter submódulos. Por exemplo, o pacote ``numpy`` contém módulos como ``numpy.linalg`` e ``numpy.fft``. Normalmente, um pacote de importação é um diretório no sistema de arquivos, contendo módulos como arquivos ``.py`` e subpacotes como subdiretórios.
ru: Импортный пакет - это модуль Python. Таким образом, когда вы пишете ``import pkg`` или ``from pkg import func`` в вашем коде Python, ``pkg`` - это имя пакета импорта. Точнее, импортные пакеты - это специальные модули Python, которые могут содержать подмодули. Например, пакет ``numpy`` содержит такие модули, как ``numpy.linalg`` и ``numpy.fft``. Обычно пакет импорта представляет собой каталог в файловой системе, содержащий модули в виде файлов ``.py`` и подпакеты в виде подкаталогов.
ta: இறக்குமதி தொகுப்பு ஒரு பைதான் தொகுதி. ஆகவே, உங்கள் பைதான் குறியீட்டில் பி.கே.சி இறக்குமதி ஃபன்சி` இலிருந்து `` இறக்குமதி pkg`` அல்லது `` எழுதும்போது, `` pkg`` என்பது இறக்குமதி தொகுப்பின் பெயர். இன்னும் துல்லியமாக, இறக்குமதி தொகுப்புகள் சிறப்பு பைதான் தொகுதிகள் ஆகும், அவை சப்மோடூல்களைக் கொண்டிருக்கலாம். எடுத்துக்காட்டாக, `` Numpy`` தொகுப்பில் `` numpy.linalg`` மற்றும் `` numpy.fft`` போன்ற தொகுதிகள் உள்ளன. வழக்கமாக, ஒரு இறக்குமதி தொகுப்பு என்பது கோப்பு முறைமையில் ஒரு கோப்பகமாகும், இதில் `` .பீ`` கோப்புகள் மற்றும் துணை பேக்கேச்கள் துணை அடைப்புகளாக தொகுதிகள் உள்ளன.

source: You can use an import package as soon as you have installed a distribution package that provides it.
eo: Vi povas uzi importan pakon tuj, kiam vi instalis distribuan pakon provizanta ĝin.
ja: インポートパッケージを提供する配布パッケージをインストールするや否や、インポートパッケージを使用することができます。
pt_br: Você pode usar um pacote de importação assim que tiver instalado um pacote de distribuição que o fornece.
ru: Вы можете использовать пакет импорта, как только установите дистрибутив, который его предоставляет.
ta: இறக்குமதி தொகுப்பை நீங்கள் வழங்கும் விநியோக தொகுப்பை நிறுவியவுடன் பயன்படுத்தலாம்.

source: What are the links between distribution packages and import packages?
eo: Kiel ligiĝas distribuaj pakoj kaj importaj pakoj?
ja: 配布パッケージとインポートパッケージの間の繋がりとは何でしょうか？
pt_br: Quais são as conexões entre pacotes de distribuição e pacotes de importação?
ru: Какие связи существуют между дистрибутивными и импортными пакетами?
ta: விநியோக தொகுப்புகள் மற்றும் இறக்குமதி தொகுப்புகளுக்கு இடையிலான இணைப்புகள் என்ன?

source: Most of the time, a distribution package provides one single import package (or non-package module), with a matching name. For example, ``pip install numpy`` lets you ``import numpy``.
eo: Plej ofte, distribua pako provizas nur unu importan pakon (aŭ ne-pakan modulon), kun la sama nomo. Ekzemple, ``pip install numpy`` ebligas vin skribi ``import numpy``.
ja: ほとんどの場合、配布パッケージはあるひとつのインポートパッケージ (またはパッケージではないモジュール) を対応する名称で提供します。例えば、 ``pip install numpy`` を行えば ``import numpy`` として使うことができます。
pt_br: Na maioria das vezes, um pacote de distribuição fornece um único pacote de importação (ou módulo de não embalagem), com um nome correspondente. Por exemplo, ``pip install numpy`` permite que você importe usando ``import numpy``.
ru: Чаще всего дистрибутив предоставляет один единственный импортный пакет (или непакетный модуль) с соответствующим именем. Например, ``pip install numpy`` позволяет вам ``импортировать numpy``.
ta: பெரும்பாலான நேரங்களில், ஒரு விநியோக தொகுப்பு ஒரு ஒற்றை இறக்குமதி தொகுப்பை (அல்லது பேக்கேச் அல்லாத தொகுதி), பொருந்தக்கூடிய பெயருடன் வழங்குகிறது. எடுத்துக்காட்டாக, `` பிஐபி நிறுவுதல் எண் `` உங்களை `` இறக்குமதி numpy`` உங்களை அனுமதிக்கிறது.

source: However, this is only a convention. PyPI and other package indices *do not enforce any relationship* between the name of a distribution package and the import packages it provides. (A consequence of this is that you cannot blindly install the PyPI package ``foo`` if you see ``import foo``; this may install an unintended, and potentially even malicious package.)
eo: Tamen, tio estas nur konvencia. PyPI kaj aliaj pakindeksoj *ne devigas ajnan rilaton* inter la nomo de distribua pako kaj la importaj pakoj provizataj de ĝi. (Tial, vi ne simple instalu la PyPI-pakon ``pako``, se vi vidas ``import pako``; tio eble instalos neintencitan aŭ eĉ malican pakon.)
ja: しかしながら、これは単なる慣習です。PyPI や他のパッケージインデックスでは、配布パッケージとそれが提供するインポートパッケージの名称の間に *なんらかの関係性を強制することはしません* 。 (このことの帰結として、 ``import foo`` を見たからと言って盲目的に PyPI のパッケージ ``foo`` をインストールすることはできません; これは意図しないか、あるいは潜在的には悪意のあるパッケージをインストールしてしまうことになりかねません。)
pt_br: No entanto, esta é apenas uma convenção. PyPI e outros índices de pacotes *não impõe nenhuma relação* entre o nome de um pacote de distribuição e os pacotes de importação que ele fornece. (Uma consequência disso é que você não pode instalar cegamente o pacote PyPI ``foo`` se você vir ``import foo``; isso pode instalar um pacote não intencional, e potencialmente até mesmo malicioso.)
ru: Однако это лишь условность. PyPI и другие указатели пакетов *не обеспечивают никакой связи* между именем дистрибутивного пакета и пакетами импорта, которые он предоставляет. (Следствием этого является то, что вы не можете вслепую установить пакет PyPI ``foo``, если вы видите ``import foo``; это может привести к установке непреднамеренного и потенциально даже вредоносного пакета)
ta: இருப்பினும், இது ஒரு மாநாடு மட்டுமே. PYPI மற்றும் பிற தொகுப்பு குறியீடுகள் * விநியோக தொகுப்பின் பெயர் மற்றும் அது வழங்கும் இறக்குமதி தொகுப்புகளுக்கு இடையில் எந்த உறவையும் செயல்படுத்த வேண்டாம். .

source: A distribution package could provide an import package with a different name. An example of this is the popular Pillow_ library for image processing. Its distribution package name is ``Pillow``, but it provides the import package ``PIL``. This is for historical reasons: Pillow started as a fork of the PIL library, thus it kept the import name ``PIL`` so that existing PIL users could switch to Pillow with little effort. More generally, a fork of an existing library is a common reason for differing names between the distribution package and the import package.
eo: Distribua pako povas provizi importan pakon de alia nomo. Ekzemple, konsideru la popularan bibliotekon Pillow_ por pritraktado de bildoj. La nomo de ĝia distribua pako estas ``Pillow``, sed ĝi provizas la importan pakon ``PIL``. Tio estas pro historiaj kialoj: Pillow komenciĝis kiel forko de la biblioteko PIL kaj retenis la importan nomon ``PIL``, por ke ekzistantaj uzantoj de PIL povas ekuzi Pillow senŝanĝe. Pli ĝenerale, forkado de ekzistanta biblioteko estas ofta kialo por malsamaj nomoj inter la distribua pako kaj la importa pako.
ja: 配布パッケージは、異なる名称でインポートパッケージを提供することが可能です。この例としては、画像処理分野で人気のある Pillow_ です。配布パッケージの名称は ``Pillow`` ですが、インポートパッケージとしては ``PIL`` を提供しています。これには歴史的な理由があります: Pillow は PIL ライブラリのフォークとして始まり、PIL の既存のユーザがあまり手間をかけずに Pillow に移行できるようにインポート名称の ``PIL`` を使い続けたのです。もっと一般的にいうと、配布パッケージとインポートパッケージの間で異なる名称を使う時のよくある理由が既存のライブラリからのフォークなのです。
pt_br: Um pacote de distribuição pode fornecer um pacote de importação com um nome diferente. Um exemplo disso é a popular biblioteca Pillow_ para processamento de imagens. Seu nome do pacote de distribuição é ``Pillow``, mas fornece o pacote de importação ``PIL``. Isto é por razões históricas: Pillow começou como um fork da biblioteca PIL, assim manteve o nome de importação ``PIL`` para que os usuários PIL existentes pudessem mudar para o Pillow com pouco esforço. Mais geralmente, um fork de uma biblioteca existente é uma razão comum para diferentes nomes entre o pacote de distribuição e o pacote de importação.
ru: Дистрибутив может предоставлять пакет импорта с другим именем. Примером может служить популярная библиотека Pillow_ для обработки изображений. Имя ее дистрибутивного пакета - ``Pillow``, но она предоставляет пакет импорта ``PIL``. Это объясняется историческими причинами: Pillow начиналась как форк библиотеки PIL, поэтому она сохранила имя импорта ``PIL``, чтобы существующие пользователи PIL могли перейти на Pillow без особых усилий. В целом, форк существующей библиотеки - это распространенная причина различия имен в дистрибутивном и импортном пакетах.
ta: ஒரு விநியோக தொகுப்பு வேறு பெயருடன் இறக்குமதி தொகுப்பை வழங்க முடியும். பட செயலாக்கத்திற்கான பிரபலமான தலையணை_ நூலகம் இதற்கு ஒரு எடுத்துக்காட்டு. அதன் விநியோக தொகுப்பு பெயர் `` தலையணை``, ஆனால் இது இறக்குமதி தொகுப்பை `` pil`` வழங்குகிறது. இது வரலாற்று காரணங்களுக்காக: தலையணை PIL நூலகத்தின் ஒரு முட்கரண்டியாகத் தொடங்கியது, இதனால் இது இறக்குமதி பெயரை `` pil`` உடன் வைத்திருந்தது, இதனால் தற்போதுள்ள PIL பயனர்கள் சிறிய முயற்சியுடன் தலையணைக்கு மாற முடியும். மிகவும் பொதுவாக, தற்போதுள்ள நூலகத்தின் முட்கரண்டி விநியோக தொகுப்பு மற்றும் இறக்குமதி தொகுப்புக்கு இடையில் மாறுபட்ட பெயர்களுக்கு ஒரு பொதுவான காரணம்.

source: On a given package index (like PyPI), distribution package names must be unique. On the other hand, import packages have no such requirement. Import packages with the same name can be provided by several distribution packages. Again, forks are a common reason for this.
eo: En iu pakindekso (kiel PyPI), la nomoj de distribuaj pakoj devas esti unikaj. Tamen, neniu simila devo ekzistas por la nomoj de importaj pakoj. Pluraj distribuaj pakoj povas provizi importajn pakojn de la sama nomo. Forkado estas ofta kialo pri tio.
ja: (PyPI のような) あるパッケージインデックス内では、配布パッケージの名称は一意でなければなりません。他方で、インポートパッケージにはそのような要求事項はありません。同じ名称のインポートパッケージが複数の配布パッケージから提供されるということも可能です。繰り返しますが、これのよくある理由はフォークです。
pt_br: Em um determinado índice de pacotes (como PyPI), nomes de pacotes de distribuição devem ser únicos. Por outro lado, os pacotes de importação não têm tal exigência. Os pacotes de importação com o mesmo nome podem ser fornecidos por vários pacotes de distribuição. Novamente, forks são uma razão comum para isso.
ru: В определенном индексе пакетов (например, в PyPI) имена дистрибутивных пакетов должны быть уникальными. С другой стороны, импортные пакеты не имеют такого требования. Импортные пакеты с одним и тем же именем могут предоставляться несколькими дистрибутивными пакетами. Опять же, частой причиной этого являются форки.
ta: கொடுக்கப்பட்ட தொகுப்பு குறியீட்டில் (PYPI போன்றது), விநியோக தொகுப்பு பெயர்கள் தனித்துவமாக இருக்க வேண்டும். மறுபுறம், இறக்குமதி தொகுப்புகளுக்கு அத்தகைய தேவை இல்லை. அதே பெயருடன் இறக்குமதி தொகுப்புகளை பல விநியோக தொகுப்புகள் வழங்கலாம். மீண்டும், ஃபோர்க்ச் இதற்கு ஒரு பொதுவான காரணம்.

source: Conversely, a distribution package can provide several import packages, although this is less common. An example is the attrs_ distribution package, which provides both an ``attrs`` import package with a newer API, and an ``attr`` import package with an older but supported API.
eo: Male, distribua pako povas provizi plurajn importajn pakojn, kvankam tio maloftas. Ekzemple, la distribua pako attrs_ provizas kaj importan pakon ``attrs`` de pli nova API kaj importan pakon ``attr`` de pli malnova sed subtenata API.
ja: 一方で、あまり見かけませんが、配布パッケージは複数のインポートパッケージを提供することができます。その例は attrs_ 配布パッケージで、より新しい API を持つ ``attrs`` インポートパッケージと、旧来のものだがサポートされている API を持つ ``attr`` の両方を提供します。
pt_br: Por outro lado, um pacote de distribuição pode fornecer vários pacotes de importação, embora isso seja menos comum. Um exemplo é o pacote de distribuição attrs_, que fornece um pacote de importação ``attrs`` com uma API mais recente, e um pacote de importação ``attr`` com uma API mais antiga, mas suportada.
ru: И наоборот, дистрибутивный пакет может предоставлять несколько пакетов импорта, хотя это встречается реже. Примером может служить дистрибутивный пакет attrs_, который предоставляет как пакет импорта ``attrs`` с более новым API, так и пакет импорта ``attr`` со старым, но поддерживаемым API.
ta: மாறாக, ஒரு விநியோக தொகுப்பு பல இறக்குமதி தொகுப்புகளை வழங்க முடியும், இருப்பினும் இது குறைவாகவே காணப்படுகிறது. ஒரு எடுத்துக்காட்டு ATTRS_ விநியோக தொகுப்பு, இது ஒரு புதிய பநிஇ உடன் `` attrs`` இறக்குமதி தொகுப்பு இரண்டையும் வழங்குகிறது, மேலும் பழைய ஆனால் ஆதரிக்கப்பட்ட பநிஇ உடன் `` attr`` இறக்குமதி தொகுப்பு.

source: How do distribution package names and import package names compare?
eo: Kiel komparas nomo de distribua pako kaj nomo de importa pako?
ja: 配布パッケージの名称とインポートパッケージの名称は、どのように比較されるのでしょうか？
pt_br: Qual a comparação de nomes de pacotes de distribuição e de nomes de pacotes de importação?
ru: Как соотносятся имена дистрибутивных и импортных пакетов?
ta: விநியோக தொகுப்பு பெயர்கள் மற்றும் இறக்குமதி தொகுப்பு பெயர்கள் எவ்வாறு ஒப்பிடுகின்றன?

source: Import packages should have valid Python identifiers as their name (the :ref:`exact rules <python:identifiers>` are found in the Python documentation) [#non-identifier-mod-name]_. In particular, they use underscores ``_`` as word separator and they are case-sensitive.
eo: La nomo de importa pako devas esti validan identigilon de Python (la :ref:`precizaj reguloj <python:identifiers>` troviĝas en la dokumentaro de Python) [#non-identifier-mod-name]_. Speciale, ĝi uzas substrekojn ``_`` kiel vortapartigilojn kaj estas usklecdistinga.
ja: インポートパッケージは、その名称として正当な Python 識別子 (Python の説明文書の中に :ref:`exact rules <python:identifiers>` が見つかるでしょう) [#non-identifier-mod-name]_ を持っているべきです。特に、単語間の区切りにアンダースコア ``_`` を使い、また、大文字小文字を区別します。
pt_br: Os pacotes de importação devem ter identificadores válidos do Python como seu nome (as :ref:`regras exatas <python:identifiers>` são encontradas na documentação do Python) [#non-identifier-mod-name]_. Em particular, eles usam sublinhado ``_`` como separador de palavras e eles são sensíveis a casos.
ru: Импортируемые пакеты должны иметь в качестве имени корректные идентификаторы Python (точные правила <python:identifiers>` можно найти в документации Python) [#non-identifier-mod-name]_. В частности, они используют подчеркивание ``_`` в качестве разделителя слов и чувствительны к регистру.
ta: இறக்குமதி தொகுப்புகளில் செல்லுபடியாகும் பைதான் அடையாளங்காட்டிகள் அவற்றின் பெயராக இருக்க வேண்டும் (தி: ரெஃப்: `சரியான விதிகள் <பைதான்: அடையாளங்காட்டிகள்>` பைதான் ஆவணத்தில் காணப்படுகின்றன) [#அடையாளங்காட்டி அல்லாத-மோட்-பெயர்] _. குறிப்பாக, அவர்கள் அடிக்குறிப்புகளை `` _`` என்ற சொல் பிரிப்பானாகப் பயன்படுத்துகிறார்கள், மேலும் அவை வழக்கு உணர்திறன் கொண்டவை.

source: On the other hand, distribution packages can use hyphens ``-`` or underscores ``_``. They can also contain dots ``.``, which is sometimes used for packaging a subpackage of a :ref:`namespace package <packaging-namespace-packages>`. For most purposes, they are insensitive to case and to ``-`` vs. ``_`` differences, e.g., ``pip install Awesome_Package`` is the same as ``pip install awesome-package`` (the precise rules are given in the :ref:`name normalization specification <name-normalization>`).
eo: Aliflanke, nomo de distribua pako povas enhavi streketon ``-`` aŭ substrekon ``_`` kaj ankaŭ povas enhavi punkton ``.``, kiu estas kelkfoje uzata por paki subpakon de :ref:`nomspaca pako <packaging-namespace-packages>`. Por plej multaj celoj, ĝi estas usklecoblinda kaj al la diferenco inter ``-`` kaj ``_``. Ekzemple, ``pip install Bonega_Pako`` estas sama kiel ``pip install bonega-pako`` (la precizaj reguloj troviĝas en la :ref:`specifo pri normigo de nomoj <name-normalization>`).
ja: 他方で、配布パッケージはハイフン ``-`` でもアンダースコア ``_`` でも使うことができます。また、 :ref:`名前空間パッケージ <packaging-namespace-packages>` のサブパッケージをパッケージングするために使われることがあるドット ``.`` を含むこともできます。ほとんどの目的においては、大文字小文字や ``-`` 対 ``_`` の違いをを区別せず、例えば、 ``pip install Awesome_Package`` と ``pip install awesome-package`` は同じものです (詳細な規則は :ref:`名前正規化仕様 <name-normalization>` にあります) 。
pt_br: Por outro lado, os pacotes de distribuição podem usar hífenes ``-`` ou sublinhados ``_``. Eles também podem conter pontos ``.``, que às vezes é usado para empacotar um subpacote de um :ref:`pacote de espaço de nomes <packaging-namespace-packages>`. Para a maioria dos fins, eles não diferenciam letras maiúsculas de minúsculas nem ``-`` de ``_``. Por exemplo, ``pip install Awesome_Package`` é o mesmo que ``pip install awesome-package`` (as regras precisas são dadas na :ref:`especificação de normalização de nome <name-normalization>`).
ru: С другой стороны, распределительные пакеты могут использовать дефисы ``-`` или подчеркивает ``_``. Они также могут содержать точки ``.``, которые иногда используются для упаковки подпаковки :ref:`namespace package <packaging-namespace-packages>`. Для большинства целей они нечувствительны к делу и к ``-`` против ``_`` различий, например, ``pip установить Awesome_Package`` - это то же самое, что ``pip установить потрясающий пакет`` (точные правила даны в :ref:`name normalization Спецификация <name-нормализация>`).
ta: மறுபுறம், விநியோக தொகுப்புகள் ஐபன்களைப் பயன்படுத்தலாம் `` -`` அல்லது `` _`` ஐ அடிக்கோடிட்டுக் காட்டலாம். அவை `` .`` புள்ளிகளையும் கொண்டிருக்கலாம், இது சில நேரங்களில் ஒரு துணைப் பேக்கேசை பேக்கேசிங் செய்யப் பயன்படுகிறது: ref: `பெயர்வெளி தொகுப்பு <பேக்கேசிங்-பெயர்ச்பேச்-பேக்கேச்கள்>`. பெரும்பாலான நோக்கங்களுக்காக, அவை வழக்குக்கு உணர்ச்சியற்றவை மற்றும் `` -` எதிராக `` _`` வேறுபாடுகள், எ.கா. விதிகள் கொடுக்கப்பட்டுள்ளன: ref: `பெயர் இயல்பாக்கம் விவரக்குறிப்பு <பெயர்-இயல்பாக்கம்>`).
