Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Finally, it's time to upload your package to the Python Package Index!
eo: Finfine, vi pretas alŝuti vian pakon al Python Package Index!
ja: ついにあなたのパッケージを Python パッケージインデックスへアップロードする時が来ました！
pt_br: Finalmente, é hora de enviar seu pacote para o Índice de Pacotes do Python!
ru: Наконец, пришло время загрузить ваш пакет в Python Package Index!
ta: இறுதியாக, உங்கள் தொகுப்பை பைதான் தொகுப்பு குறியீட்டில் பதிவேற்ற வேண்டிய நேரம் இது!

source: The first thing you'll need to do is register an account on TestPyPI, which is a separate instance of the package index intended for testing and experimentation. It's great for things like this tutorial where we don't necessarily want to upload to the real index. To register an account, go to https://test.pypi.org/account/register/ and complete the steps on that page. You will also need to verify your email address before you're able to upload any packages. For more details, see :doc:`/guides/using-testpypi`.
eo: Unue, vi registru vin ĉe Prova PyPI, kiu estas aparta servilo de la pakindekso por testado kaj eksperimentado. Ĝi estas bonega por lerniloj, kie oni ne volas alŝuti al la reala indekso. Por registri vin, vizitu https://test.pypi.org/account/register/ kaj plenumu la paŝojn sur tiu paĝo. Vi ankaŭ devas konfirmi vian retpoŝtan adreson antaŭ ol alŝutade pako. Por pli da detaloj, vidu :doc:`/guides/using-testpypi`.
ja: 最初に実行しなければならないことは、試験や実験の場となることを意図してパッケージインデックスとは別のインスタンスとして立てられたインスタンスである TestPyPI にアカウントを登録することです。このチュートリアルのように、必ずしも実際のインデックスにアップロードしたいと思わない場合には、 (TestPI は) 最適です。アカウントを登録するためには、 https://test.pypi.org/account/register/ へ行って、そのページにあるステップを完了してください。パッケージをアップロードできるようになる前に、あなたの電子メールアドレスを検証することも必要になるでしょう。もっと詳しいことが知りたければ、 :doc:`/guides/using-testpypi` を見てください。
pt_br: A primeira coisa que você precisa fazer é registrar uma conta no Test PyPI, que é uma instância separada do índice do pacote destinada a teste e experimentação. É ótimo para coisas como este tutorial, em que não queremos necessariamente enviar para o índice real. Para registrar uma conta, vá em https://test.pypi.org/account/register/ e conclua as etapas nessa página. Você também precisará verificar seu endereço de e-mail antes de enviar qualquer pacote. Para mais detalhes, veja :doc:`/guides/using-testpypi`.
ru: Первое, что вам нужно сделать, это зарегистрировать аккаунт на TestPyPI, который представляет собой отдельный экземпляр индекса пакетов, предназначенный для тестирования и экспериментов. Он отлично подходит для таких вещей, как этот учебник, где мы не обязательно хотим загружать в настоящий индекс. Чтобы зарегистрировать учетную запись, перейдите по адресу https://test.pypi.org/account/register/ и выполните все шаги на этой странице. Вам также потребуется подтвердить свой адрес электронной почты, прежде чем вы сможете загружать пакеты. Более подробную информацию можно найти в :doc:`/guides/using-testpypi`.
ta: நீங்கள் செய்ய வேண்டிய முதல் சேதி, டெச்ட்பைட்டில் ஒரு கணக்கைப் பதிவுசெய்வதுதான், இது சோதனை மற்றும் பரிசோதனைக்கு நோக்கம் கொண்ட தொகுப்பு குறியீட்டின் தனி நிகழ்வு ஆகும். இந்த டுடோரியல் போன்ற விசயங்களுக்கு இது சிறந்தது, அங்கு நாம் உண்மையான குறியீட்டில் பதிவேற்ற விரும்பவில்லை. கணக்கைப் பதிவுசெய்ய, https://test.pypi.org/account/register/ க்குச் சென்று அந்தப் பக்கத்தில் உள்ள படிகளை முடிக்கவும். நீங்கள் எந்த தொகுப்புகளையும் பதிவேற்றுவதற்கு முன்பு உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க வேண்டும். மேலும் விவரங்களுக்கு, காண்க: DOC: `/வழிகாட்டிகள்/பயன்படுத்துதல்-டெச்ட்பைப்பைப் பயன்படுத்துதல்`.

source: To securely upload your project, you'll need a PyPI `API token`_. Create one at https://test.pypi.org/manage/account/#api-tokens, setting the "Scope" to "Entire account". **Don't close the page until you have copied and saved the token — you won't see that token again.**
eo: Por sekure alŝuti vian projekton, vi bezonas `API-ĵetonon ĉe PyPI <API token>`_. Kreu ĝin ĉe https://test.pypi.org/manage/account/#api-tokens, kun la «Amplekso» estanta «Tuta konto». **Ne fermu la paĝon antaŭ ol vi kopiis kaj konservis la ĵetonon — vi ne povos revidi tiun ĵetonon.**
ja: あなたのプロジェクトを安全にアップロードするためには、 PyPI `API トークン`_ が必要になるでしょう。 https://test.pypi.org/manage/account/#api-tokens で、 "スコープ" として "アカウント全体" を指定して、ひとつ作成してください。 **トークンをコピーして保存するまで、ページを閉じないでください — トークンは二度と表示されません。**
pt_br: Para enviar seu projeto com segurança, você precisará de um `token de API`_ do PyPI. Crie um em https://test.pypi.org/manage/account/#api-tokens, definindo o "Escopo" como "Toda a conta". **Não feche a página antes de copiar e salvar o token -- você não verá o token novamente.**
ru: Чтобы безопасно загрузить свой проект, вам понадобится токен PyPI `API token`_. Создайте его на сайте https://test.pypi.org/manage/account/#api-tokens, установив для параметра "Область действия" значение "Весь аккаунт". **Не закрывайте страницу, пока не скопируете и не сохраните токен - больше вы его не увидите**
ta: உங்கள் திட்டத்தை பாதுகாப்பாக பதிவேற்ற, உங்களுக்கு ஒரு பைபி `ஏபிஐ டோக்கன்`_ தேவை. Https://test.pypi.org/manage/account/#api-tokens இல் ஒன்றை உருவாக்கவும், "நோக்கம்" ஐ "முழு கணக்கு" ஆகவும் அமைக்கவும். ** நீங்கள் கிள்ளாக்கை நகலெடுத்து சேமிக்கும் வரை பக்கத்தை மூட வேண்டாம் - அந்த கிள்ளாக்கை நீங்கள் மீண்டும் பார்க்க மாட்டீர்கள். **

source: Now that you are registered, you can use :ref:`twine` to upload the distribution packages. You'll need to install Twine:
eo: Post registrado, vi povas uzi :ref:`twine` por alŝuti la distribuajn pakojn. Vi devas instali Twine:
ja: ユーザ登録が済んだら、 :ref:`twine` で配布物パッケージをアップロードすることができます。Twine のインストールが必要ならこのようにしてください:
pt_br: Agora que você está registrado, você pode usar :ref:`twine` para enviar os pacotes de distribuição. Você precisará instalar o Twine:
ru: Теперь, когда вы зарегистрированы, вы можете использовать :ref:`twine` для загрузки дистрибутива. Вам нужно будет установить Twine:
ta: இப்போது நீங்கள் பதிவுசெய்துள்ளீர்கள், நீங்கள் பயன்படுத்தலாம்: Ref: `ட்வைன்` விநியோக தொகுப்புகளை பதிவேற்ற. நீங்கள் கயிறு நிறுவ வேண்டும்:

source: Once installed, run Twine to upload all of the archives under :file:`dist`:
eo: Post instalo, rulu Twine por alŝuti ĉiujn arĥivojn en :file:`dist`:
ja: インストールできたら、 :file:`dist` ディレクトリ内にあるアーカイブファイルをすべてアップロードしてください:
pt_br: Uma vez instalado, execute o Twine para enviar de todos os arquivos em :file:`dist`:
ru: После установки запустите Twine, чтобы загрузить все архивы в папку :file:`dist`:
ta: நிறுவப்பட்டதும், காப்பகங்கள் அனைத்தையும் பதிவேற்ற கயிறு இயக்கவும்: கோப்பு: `DIST`:

source: You will be prompted for an API token. Use the token value, including the ``pypi-`` prefix. Note that the input will be hidden, so be sure to paste correctly.
eo: Vi estos petata pri API-ĵetono. Tajpu la ĵetonan valoron inkluzive de la prefikso ``pypi-``. Notu, ke la enigaĵo estos kaŝita; tial certigu, ke vi algluos ĝuste.
ta: பநிஇ டோக்கனுக்கு நீங்கள் கேட்கப்படுவீர்கள். `` பைபி-`` முன்னொட்டு உட்பட கிள்ளாக்கு மதிப்பைப் பயன்படுத்தவும். உள்ளீடு மறைக்கப்படும் என்பதை நினைவில் கொள்க, எனவே சரியாக ஒட்டவும்.

source: After the command completes, you should see output similar to this:
eo: Post la fino de la komando, vi vidos eligaĵon similan al la jeno:
ja: コマンド実行完了後、これに似た出力を見ることになるでしょう:
pt_br: Depois que o comando for concluído, você deverá ver uma saída semelhante a esta:
ru: После выполнения команды вы должны увидеть вывод, похожий на этот:
ta: கட்டளை முடிந்ததும், இதைப் போன்ற வெளியீட்டை நீங்கள் காண வேண்டும்:

source: Once uploaded, your package should be viewable on TestPyPI; for example: ``https://test.pypi.org/project/example_package_YOUR_USERNAME_HERE``.
eo: Post alŝuto, via pako estos videbla ĉe TestPyPI; ekzemple: ``https://test.pypi.org/project/example_package_VIA_SALUTNOMO_ĈI_TIE``.
ja: あなたのパッケージをアップロードしたら、 TestPyPI 上で閲覧できるようになります; 例えば: ``https://test.pypi.org/project/example_package_YOUR_USERNAME_HERE`` 。
pt_br: Depois de enviado, seu pacote pode ser visto no Test PyPI; por exemplo: ``https://test.pypi.org/project/example_package_YOUR_USERNAME_HERE``.
ru: После загрузки ваш пакет должен быть доступен для просмотра на TestPyPI; например: ``https://test.pypi.org/project/example_package_YOUR_USERNAME_HERE``.
ta: பதிவேற்றியதும், உங்கள் தொகுப்பு டெச்ட்பைப்பில் பார்க்கப்பட வேண்டும்; எடுத்துக்காட்டாக: `` https: // test.pypi.org/project/example_package_your_username_here``.

source: Installing your newly uploaded package
eo: Instali vian nove alŝutitan pakon
ja: 新しくアップロードしたあなたのパッケージをインストールする
pt_br: Instalando seu pacote recém-enviado
ru: Установка нового загруженного пакета
ta: புதிதாக பதிவேற்றிய உங்கள் தொகுப்பை நிறுவுதல்

source: You can use :ref:`pip` to install your package and verify that it works. Create a :ref:`virtual environment <Creating and using Virtual Environments>` and install your package from TestPyPI:
eo: Vi povas uzi :ref:`pip` por instali vian pakon kaj konfirmi, ĉu ĝi funkcias. Kreu :ref:`virtualan medion <Creating and using Virtual Environments>`, kaj instalu vian pakon el TestPyPI:
ja: :ref:`pip` を使えば、あなたのパッケージをインストールして動作を検証することができます。 :ref:`仮想環境 <Creating and using Virtual Environments>` を作成して、 TestPyPI からあなたのパッケージをインストールしましょう:
pt_br: Você pode usar o :ref:`pip` para instalar seu pacote e verificar se ele funciona. Crie um :ref:`ambiente virtual <Creating and using Virtual Environments>` e instale seu pacote a partir do Test PyPI:
ru: Вы можете использовать :ref:`pip` для установки вашего пакета и проверки его работоспособности. Создайте :ref:`виртуальную среду <Создание и использование виртуальных сред>` и установите свой пакет из TestPyPI:
ta: நீங்கள் பயன்படுத்தலாம்: ref: `பிப்` உங்கள் தொகுப்பை நிறுவவும், அது செயல்படுகிறதா என்பதை சரிபார்க்கவும். ஒரு: ref: `மெய்நிகர் சூழல் <மெய்நிகர் சூழல்களை உருவாக்குதல் மற்றும் பயன்படுத்துதல்>` மற்றும் டெச்ட்பைட்டிலிருந்து உங்கள் தொகுப்பை நிறுவவும்:

source: Make sure to specify your username in the package name!
eo: Certigu, ke vi indikas vian salutnomon en la nomo de la pako!
ja: パッケージ名の中にあなたのユーザ名を指定するのをお忘れなく！
pt_br: Certifique-se de especificar seu nome de usuário no nome do pacote!
ru: Обязательно укажите свое имя пользователя в названии пакета!
ta: உங்கள் பயனர்பெயரை தொகுப்பு பெயரில் குறிப்பிடுவதை உறுதிசெய்க!

source: pip should install the package from TestPyPI and the output should look something like this:
eo: pip instalos la pakon el TestPyPI, kaj la eligaĵo aspektu jene:
ja: pip でパッケージを TestPyPI からインストールできるはずで、その出力は何か次のようなものに見えるでしょう:
pt_br: pip deve instalar o pacote de Test PyPI e a saída deve ser semelhante a esta:
ru: pip должен установить пакет из TestPyPI, и результат должен выглядеть примерно так:
ta: PIP டெச்ட்பைட்டிலிருந்து தொகுப்பை நிறுவ வேண்டும், வெளியீடு இதுபோன்றதாக இருக்க வேண்டும்:

source: This example uses ``--index-url`` flag to specify TestPyPI instead of live PyPI. Additionally, it specifies ``--no-deps``. Since TestPyPI doesn't have the same packages as the live PyPI, it's possible that attempting to install dependencies may fail or install something unexpected. While our example package doesn't have any dependencies, it's a good practice to avoid installing dependencies when using TestPyPI.
eo: Tiu ekzemplo uzas la flagon ``--index-url`` por specifi la Provan PyPI anstataŭ la vera PyPI. Krome ĝi uzas la flagon ``--no-deps``. Ĉar Prova PyPI ne havas la samajn pakojn kiel PyPI, eblas, ke provado instali dependaĵojn povas malsukcesi aŭ estigi ion neatenditan. Kvankam nia ekzempla pako ne havas dependecon, estas bone averti instaladon de dependaĵojn por Prova PyPI.
ja: この例では ``--index-url`` フラグを使って本番環境である PyPI の代わりに TestPyPI を指定しています。さらに、 ``--no-deps`` も指定しています。 TestPyPI には本番環境である PyPI と同じだけのパッケージが存在しないので、依存先となるパッケージを同時にインストールしようとしても、失敗するか、または、期待していたものとは異なる何かをインストールしてしまう恐れがあります。我々の例として使っているパッケージには依存先がないので、 TestPyPI を使う時には依存先をインストールしないように指定しておくことは良いやり方です。
pt_br: Este exemplo usa o sinalizador ``--index-url`` para especificar Test PyPI em vez do PyPI real. Além disso, ele especifica ``--no-deps``. Como o Test PyPI não tem os mesmos pacotes que o PyPI real, é possível que a tentativa de instalação de dependências falhe ou instale algo inesperado. Embora nosso pacote de exemplo não tenha nenhuma dependência, é uma boa prática evitar instalar dependências ao usar o Test PyPI.
ru: В этом примере используется флаг ``--index-url``, чтобы указать TestPyPI вместо живого PyPI. Кроме того, в нем указано ``no-deps``. Так как TestPyPI не содержит тех же пакетов, что и живой PyPI, возможно, что попытка установить зависимости может закончиться неудачей или установить что-то неожиданное. Хотя наш пример не имеет зависимостей, рекомендуется избегать установки зависимостей при использовании TestPyPI.
ta: இந்த எடுத்துக்காட்டு நேரடி பைபிக்கு பதிலாக டெச்ட்பை குறிப்பிட `` --index-url`` கொடியைப் பயன்படுத்துகிறது. கூடுதலாக, இது `` --no-deps`` ஐக் குறிப்பிடுகிறது. டெச்ட்பிபிக்கு லைவ் பைபியின் அதே தொகுப்புகள் இல்லை என்பதால், சார்புகளை நிறுவ முயற்சிப்பது தோல்வியடையக்கூடும் அல்லது எதிர்பாராத ஒன்றை நிறுவக்கூடும். எங்கள் எடுத்துக்காட்டு தொகுப்புக்கு எந்தவிதமான சார்புநிலைகளும் இல்லை என்றாலும், டெச்ட்பைப்பைப் பயன்படுத்தும் போது சார்புகளை நிறுவுவதைத் தவிர்ப்பது ஒரு நல்ல நடைமுறை.

source: You can test that it was installed correctly by importing the package. Make sure you're still in your virtual environment, then run Python:
eo: Importante la pakon, vi povas kontroli, ĉu ĝi estis instalita ĝuste. Certigu, ke vi ankoraŭ estas en via virtuala medio, kaj rulu la jenan Python-kodon:
ja: パッケージをインポートしてみることで、正しくインストールされたかどうかを試験することができます。まだ仮想環境内にいることを確認してから Python を走らせましょう:
pt_br: Você pode testar se ele foi instalado corretamente importando o pacote. Certifique-se de que ainda está em seu ambiente virtual e execute o Python:
ru: Вы можете проверить, что он был установлен правильно, импортировав пакет. Убедитесь, что вы все еще находитесь в виртуальной среде, а затем запустите Python:
ta: தொகுப்பை இறக்குமதி செய்வதன் மூலம் அது சரியாக நிறுவப்பட்டது என்பதை நீங்கள் சோதிக்கலாம். நீங்கள் இன்னும் உங்கள் மெய்நிகர் சூழலில் இருக்கிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், பின்னர் பைத்தானை இயக்கவும்:

source: and import the package:
eo: kaj importu la pakon:
ja: そして、パッケージをインポートしましょう:
pt_br: e importe o pacote:
ru: и импортировать пакет:
ta: மற்றும் தொகுப்பை இறக்குமதி செய்யுங்கள்:

source: **Congratulations, you've packaged and distributed a Python project!** ✨ 🍰 ✨
eo: **Gratulon, vi pakis kaj distribuis Python-projekton!** ✨ 🍰 ✨
ja: **おめでとうございます、あなたは Python のプロジェクトをパッケージングし、配布することができました！** ✨ 🍰 ✨
pt_br: **Parabéns, você empacotou e distribuiu um projeto Python!** ✨ 🍰 ✨
ru: **Поздравляем, вы упаковали и распространили проект на Python!** ✨ 🍰 ✨
ta: ** வாழ்த்துக்கள், நீங்கள் ஒரு பைதான் திட்டத்தை தொகுத்து விநியோகித்திருக்கிறீர்கள்! ** ✨ ✨

source: Keep in mind that this tutorial showed you how to upload your package to Test PyPI, which isn't a permanent storage. The Test system occasionally deletes packages and accounts. It is best to use TestPyPI for testing and experiments like this tutorial.
eo: Notu, ke ĉi tiu lernilo klarigis al vi kiel alŝuti vian pakon al Prova PyPI, kiu ne estas permanenta konservejo. La Prova sistemo fojfoje forviŝas pakojn kaj kontojn. Oni uzu Provan PyPI nur por testado kaj eksperimentado kiel en ĉi tiu lernilo.
ja: このチュートリアルではあなたのパッケージを Test PyPI に、つまり永続的なストレージではないところにアップロードする方法について示したということを忘れないでください。テストシステムは、時折パッケージやアカウントを削除します。 Test PyPI は、このチュートリアルのような試行や実験のために使うのがベストです。
pt_br: Lembre-se de que este tutorial mostrou como enviar o seu pacote para Test PyPI, que não é um armazenamento permanente. O sistema de teste ocasionalmente exclui pacotes e contas. É melhor usar Test PyPI para testes e experimentos como este tutorial.
ru: Помните, что в этом руководстве показано, как загрузить ваш пакет на Test PyPI, который не является постоянным хранилищем. Система Test время от времени удаляет пакеты и аккаунты. Лучше всего использовать TestPyPI для тестирования и экспериментов, подобных этому руководству.
ta: பைபியை சோதிக்க உங்கள் தொகுப்பை எவ்வாறு பதிவேற்றுவது என்பதை இந்த பயிற்சி உங்களுக்குக் காட்டியது என்பதை நினைவில் கொள்ளுங்கள், இது நிரந்தர சேமிப்பு அல்ல. சோதனை அமைப்பு எப்போதாவது தொகுப்புகள் மற்றும் கணக்குகளை நீக்குகிறது. இந்த டுடோரியல் போன்ற சோதனை மற்றும் சோதனைகளுக்கு டெச்ட்பிபியைப் பயன்படுத்துவது சிறந்தது.

source: When you are ready to upload a real package to the Python Package Index you can do much the same as you did in this tutorial, but with these important differences:
eo: Kiam vi pretas alŝuti veran pakon al la Python-Pakindekso, vi povas fari pli-malpli same kiel ĉi tiu lernilo, krom la jenaj gravaj diferencoj:
ja: 実際のパッケージを Python パッケージインデックスへアップロードする準備ができたら、このチュートリアルでやったのと概ね同じことをやれば大丈夫ですが、次のような重要な違いがあります:
pt_br: Quando estiver pronto para carregar um pacote real para o Índice de Pacotes do Python, você pode fazer quase o mesmo que fez neste tutorial, mas com estas diferenças importantes:
ru: Когда вы будете готовы загрузить реальный пакет в Python Package Index, вы можете сделать все то же самое, что и в этом уроке, но с важными отличиями:
ta: பைதான் தொகுப்பு குறியீட்டில் ஒரு உண்மையான தொகுப்பை பதிவேற்ற நீங்கள் தயாராக இருக்கும்போது, இந்த டுடோரியலில் நீங்கள் செய்ததைப் போலவே நீங்கள் செய்ய முடியும், ஆனால் இந்த முக்கியமான வேறுபாடுகளுடன்:

source: Choose a memorable and unique name for your package. You don't have to append your username as you did in the tutorial, but you can't use an existing name.
eo: Elektu memorindan kaj unikan nomon por via pako. Vi ne devas postmeti vian salutnomon kiel en la lernilo, sed vi ne povas uzi ekzistantan nomon.
ja: あなたのパッケージ用に覚えやすくて独特な名前を付けましょう。チュートリアルでやったようにあなたのユーザ名を追記する必要はありませんが、既存の名前は使えません。
pt_br: Escolha um nome único e memorável para o seu pacote. Você não precisa acrescentar seu nome de usuário como fez no tutorial, mas você não pode usar um nome existente.
ru: Выберите запоминающееся и уникальное имя для своего пакета. Не обязательно добавлять имя пользователя, как это было в учебнике, но нельзя использовать существующее имя.
ta: உங்கள் தொகுப்புக்கு மறக்கமுடியாத மற்றும் தனித்துவமான பெயரைத் தேர்வுசெய்க. டுடோரியலில் நீங்கள் செய்ததைப் போல உங்கள் பயனர்பெயரை நீங்கள் சேர்க்க வேண்டியதில்லை, ஆனால் நீங்கள் ஏற்கனவே உள்ள பெயரைப் பயன்படுத்த முடியாது.

source: Register an account on https://pypi.org - note that these are two separate servers and the login details from the test server are not shared with the main server.
eo: Registru konton ĉe https://pypi.org – notu, ke tiuj du estas apartaj serviloj; la akreditiloj ne estas komunaj inter ili.
ja: https://pypi.org でアカウントを登録しましょう - これらはふたつの相異なるサーバであって、テストサーバ側のログイン情報はメインサーバに共有されてはいません。
pt_br: Registre uma conta em https://pypi.org -- observe que esses são dois servidores separados e os detalhes de login do servidor de teste não são compartilhados com o servidor principal.
ru: Зарегистрируйте учетную запись на https://pypi.org - обратите внимание, что это два отдельных сервера и данные для входа с тестового сервера не передаются на основной сервер.
ta: ஒரு கணக்கை https://pypi.org இல் பதிவுசெய்க - இவை இரண்டு தனித்தனி சேவையகங்கள் மற்றும் சோதனை சேவையகத்திலிருந்து உள்நுழைவு விவரங்கள் முதன்மையான சேவையகத்துடன் பகிரப்படவில்லை என்பதை நினைவில் கொள்க.

source: Use ``twine upload dist/*`` to upload your package and enter your credentials for the account you registered on the real PyPI. Now that you're uploading the package in production, you don't need to specify ``--repository``; the package will upload to https://pypi.org/ by default.
eo: Uzu ``twine upload dist/*`` por alŝuti vian pakon. Tajpu la akreditilon por la konto ĉe la vera PyPI. Ĉar vi estas alŝutanta al la reala pakindekso, vi ne devas uzi la flagon ``--repository``; la pako estos implicite alŝutita al https://pypi.org/.
ja: あなたのパッケージをアップロードするのに ``twine upload dist/*`` を使い、本番環境の PyPI で登録したアカウントの認証情報を入力しましょう。今回は出荷状態のパッケージをアップロードしようとしているので、 ``--repository`` を指定する必要はありません; 指定しないことでパッケージはデフォルトの https://pypi.org/ へアップロードされるでしょう。
pt_br: Use ``twine upload dist/*`` para enviar seu pacote e insira suas credenciais para a conta que você registrou no PyPI real. Agora que você está enviando o pacote em produção, você não precisa especificar ``--repository``; o pacote será enviado para https://pypi.org/ por padrão.
ru: Используйте ``twine upload dist/*`` для загрузки пакета и введите свои учетные данные для аккаунта, который вы зарегистрировали на настоящем PyPI. Теперь, когда вы загружаете пакет в production, вам не нужно указывать ``--репозиторий``; пакет будет загружен на https://pypi.org/ по умолчанию.
ta: உங்கள் தொகுப்பைப் பதிவேற்றவும் `` `ட்வைன் பதிவேற்றவும் DIST/*` `பயன்படுத்தவும் மற்றும் உண்மையான PYPI இல் நீங்கள் பதிவுசெய்த கணக்கிற்கான உங்கள் சான்றுகளை உள்ளிடவும். இப்போது நீங்கள் தயாரிப்பில் தொகுப்பை பதிவேற்றுகிறீர்கள், நீங்கள் `` --repository`` ஐ குறிப்பிட தேவையில்லை; தொகுப்பு முன்னிருப்பாக https://pypi.org/ இல் பதிவேற்றும்.

source: Install your package from the real PyPI using ``python3 -m pip install [your-package]``.
eo: Instalu vian pakon el la vera PyPI per ``python3 -m pip install [your-package]``.
ja: ``python3 -m pip install [your-package`` を使って、あなたのパッケージを本番環境の PyPI からインストールしましょう。
pt_br: Instale seu pacote a partir do PyPI real usando ``python3 -m pip install [seu-pacote]``.
ru: Установите свой пакет из настоящего PyPI с помощью ``python3 -m pip install [your-package]``.
ta: `` பைதான் 3 -எம் பிஐபி நிறுவுதல் [உங்கள் தொகுப்பாக] `` ஆகியவற்றைப் பயன்படுத்தி உண்மையான பைபியிலிருந்து உங்கள் தொகுப்பை நிறுவவும்.

source: At this point if you want to read more on packaging Python libraries here are some things you can do:
eo: Nun, se vi volas legi pli pri pakado de Python-bibliotekoj, jen kelkaj legindaĵoj:
ja: ここまで読み進めてきて、もっと Python でのパッケージングについて読みたいのであれば、次のようなものがあります:
pt_br: Neste ponto, se você quiser ler mais sobre o empacotamento de bibliotecas Python, aqui estão algumas coisas que você pode fazer:
ru: На этом этапе, если вы хотите прочитать больше об упаковке библиотек Python, вот некоторые вещи, которые вы можете сделать:
ta: இந்த கட்டத்தில் பைதான் நூலகங்களை பேக்கேசிங் பற்றி மேலும் படிக்க விரும்பினால் இங்கே நீங்கள் செய்யக்கூடிய சில விசயங்கள் உள்ளன:

source: Read about advanced configuration for your chosen build backend: `Hatchling <hatchling-config_>`_, :doc:`setuptools <setuptools:userguide/pyproject_config>`, :doc:`Flit <flit:pyproject_toml>`, `PDM <pdm-config_>`_.
eo: Legu pri altnivela agordado de via konstrua malfasado: `Hatchling <hatchling-config_>`_, :doc:`setuptools <setuptools:userguide/pyproject_config>`, :doc:`Flit <flit:pyproject_toml>`, `PDM <pdm-config_>`_.
ja: 選択したビルドバックエンドの先進的な設定については、`Hatchling <hatchling-config_>`_ ・ :doc:`setuptools <setuptools:userguide/pyproject_config>` ・ :doc:`Flit <flit:pyproject_toml>` ・ `PDM <pdm-config_>`_ を読んでください。
ru: Прочитайте о расширенной конфигурации для выбранного вами бэкенда сборки: `Hatchling <hatchling-config_>`_, :doc:`setuptools <setuptools:userguide/pyproject_config>`, :doc:`Flit <flit:pyproject_toml>`, `PDM <pdm-config_>`_.
ta: நீங்கள் தேர்ந்தெடுக்கப்பட்ட கட்டமைப்பிற்கான மேம்பட்ட உள்ளமைவைப் பற்றி படியுங்கள்: `அட்ச்லிங் <அட்ச்லிங்-கான்ஃபிக்_>` _,: டாக்: `செட்டப்டூல்ச் <செட்டுப்டூல்ச்: யூசர்சூட்/பைபிரோசெக்ட்_கான்ஃபிக்>`,: டாக்: `ஃபிளிட் <ஃப்ளிட்: பி.டி.எம்.
