Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The only keys required to be statically defined are:
eo: Jen tiuj ŝlosiloj, kiuj devas esti statike difinitaj:
ja: 必ず静的に定義しなければならない必須のキーは次の通り:
pt_br: As únicas chaves que precisam ser definidos estaticamente são:
ru: Единственными ключами, которые должны быть определены статически, являются:
ta: சட்டப்பூர்வமாக வரையறுக்கப்பட வேண்டிய ஒரே விசைகள்:

source: The keys which are required but may be specified *either* statically or listed as dynamic are:
eo: Jen la devigaj ŝlosiloj specifeblaj *aŭ* statike *aŭ* dinamike:
ja: 必須フィールドだが、静的に指定しても動的に指定しても *いずれでも構わない* キーは以下の通り:
pt_br: As chaves que são obrigatórias, mas podem ser especificadas estaticamente *ou* listadas como dinâmicas são:
ru: Ключи, которые являются обязательными, но могут быть указаны либо статически, либо как динамические, следующие:
ta: தேவைப்படும் ஆனால் குறிப்பிடக்கூடிய விசைகள் * நிலையானவை அல்லது மாறும் என பட்டியலிடப்பட்டுள்ளன:

source: All other keys are considered optional and may be specified statically, listed as dynamic, or left unspecified.
eo: Ĉiuj aliaj ŝlosiloj estas nedevigaj kaj povas esti specifitaj statike, specifitaj dinamike, aŭ nespecifitaj.
ja: 他の全てのキーは必須ではないものと解釈され、これらは静的に指定しても動的にリストしても未指定のままにしていても構いません。
pt_br: Todas as outras chaves são consideradas opcionais e podem ser especificadas estaticamente, listadas como dinâmicas ou não especificadas.
ru: Все остальные ключи считаются необязательными и могут быть указаны статически, перечислены как динамические или не указаны.
ta: மற்ற எல்லா விசைகளும் விருப்பமானதாகக் கருதப்படுகின்றன, மேலும் அவை நிலையான முறையில் குறிப்பிடப்படலாம், மாறும் என பட்டியலிடப்பட்டிருக்கலாம் அல்லது குறிப்பிடப்படாதவை.

source: The complete list of keys allowed in the ``[project]`` table are:
eo: Jen la plena listo de ŝlosiloj permesataj en la tabelo ``[project]``:
ja: ``[project]`` テーブルで許容されるキーの完全なリストは次のとおりです:
pt_br: A lista completa de chaves permitidas na tabela ``[project]`` são:
ru: Полный список ключей, допустимых в таблице ``[project]``, таков:
ta: `` [திட்ட] `` அட்டவணையில் அனுமதிக்கப்பட்ட விசைகளின் முழுமையான பட்டியல்:

source: ``authors``
ja: ``著者 <authors>``
ru: ``авторы``
ta: `` ஆசிரியர்கள்``

source: ``dependencies``
ja: ``依存関係 <dependencies``
ru: ``зависимости``
ta: `` சார்புகள்``

source: ``dynamic``
ru: ``динамический``
ta: `` டைனமிக்``

source: ``entry-points``
ru: ``точки входа``
ta: `` நுழைவு புள்ளிகள்``

source: ``gui-scripts``
ja: ``gui スクリプト <gui-scripts>``
ru: ``gui-скрипт``
ta: `` குய்-ச்கிரிப்ட்ச்``

source: ``maintainers``
ja: ``保守者 <maintainers>``
ru: ``мастера``
ta: `` பராமரிப்பாளர்கள்``

source: ``optional-dependencies``
ru: ``опциональные зависимости``
ta: `` விருப்ப-சார்புநிலைகள்``

source: TOML_ type: string
eo: Tipo de TOML_: signoĉeno
ja: TOML_ 型: 文字列
pt_br: Tipo TOML_: string
ru: Тип TOML_: строка
ta: TOML_ வகை: சரம்

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Name <core-metadata-name>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Name <core-metadata-name>`
ja: :ref:`コアとなるメタデータ <core-metadata>` フィールドに対応する: :ref:`名前 <core-metadata-name>` フィールド
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Name <core-metadata-name>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Name <core-metadata-name>`
ta: தொடர்புடைய: குறிப்பு: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `பெயர் <கோர்-மெட்டாடேட்டா-பெயர்>`

source: The name of the project.
eo: La nomo de la projekto.
ja: プロジェクトの名前。
pt_br: O nome do projeto.
ru: Название проекта.
ta: திட்டத்தின் பெயர்.

source: Tools SHOULD :ref:`normalize <name-normalization>` this name, as soon as it is read for internal consistency.
eo: Ilo :ref:`NORMIGU <name-normalization>` ĉi tiun nomon tuj post legado por interna kohereco.
ja: 内部的な一貫性を保つために、ツール側では読み取ったらすぐに、この名前を :ref:`正規化 <name-normalization>` するべきです。
pt_br: As ferramentas DEVEM :ref:`normalizar <name-normalization>` este nome, conforme especificado por :pep:`503`, assim que for lido para consistência interna.
ru: Инструменты ДОЛЖНЫ :ref:`нормализовать <имя-нормализация>` это имя, как только оно будет прочитано для внутренней согласованности.
ta: கருவிகள் செய்ய வேண்டும்: குறிப்பு: `இயல்பான <பெயர்-இயல்பாக்கம்>` இந்த பெயர் உள் நிலைத்தன்மைக்கு படித்தவுடன்.

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Version <core-metadata-version>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Version <core-metadata-version>`
ja: :ref:`コアとなるメタデータ <core-metadata>` に対応する: :ref:`バージョン <core-metadata-version>`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Version <core-metadata-version>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Version <core-metadata-version>`
ta: தொடர்புடைய: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `பதிப்பு <கோர்-மெட்டாடேட்டா-பதிப்பு>`

source: The version of the project, as defined in the :ref:`Version specifier specification <version-specifiers>`.
eo: La versio de la projekto laŭ :ref:`la specifo pri versispecifiloj <version-specifiers>`.
ja: :ref:`バージョン指定子仕様 <version-specifiers>` で定義されるものとしての、プロジェクトのバージョン。
pt_br: A versão do projeto, conforme definido na :ref:`especificação de especificadores de versão <version-specifiers>`.
ru: Версия проекта, как определено в спецификации спецификатора версии <version-specifiers>`.
ta: திட்டத்தின் பதிப்பு, இல் வரையறுக்கப்பட்டுள்ளது: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>`.

source: Users SHOULD prefer to specify already-normalized versions.
eo: Uzantoj *PREFERU* specifi jam normigitajn versiojn.
ja: ユーザは正規化済みのバージョンを指定するようにするべきです。
pt_br: Os usuários DEVEM preferir especificar versões já normalizadas.
ru: Пользователи ДОЛЖНЫ предпочитать указывать уже нормализованные версии.
ta: ஏற்கனவே இயல்பாக்கப்பட்ட பதிப்புகளைக் குறிப்பிட பயனர்கள் விரும்ப வேண்டும்.

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Summary <core-metadata-summary>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Summary <core-metadata-summary>`
ja: :ref:`コアとなるメタデータ <core-metadata>` フィールドに対応する: :ref:`要約 <core-metadata-summary>`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Summary <core-metadata-summary>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Summary <core-metadata-summary>`
ta: தொடர்புடையது: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `சுருக்கம் <கோர்-மெட்டாடேட்டா-சுருக்கம்>`

source: The summary description of the project in one line. Tools MAY error if this includes multiple lines.
eo: La resuma priskribo pri la projekto en unu linio. Ilo POVAS sciigi eraron, se ĝi inkluzivas plurajn liniojn.
ja: １行で書かれたプロジェクトに関する説明の要約。これが複数行に渡る場合には、ツールはエラーを発生させても構いません。
ru: Краткое описание проекта в одной строке. Инструменты MAY ошибаются, если оно включает несколько строк.
ta: திட்டத்தின் சுருக்க விளக்கம் ஒரு வரியில். இதில் பல வரிகள் இருந்தால் கருவிகள் பிழையாக இருக்கலாம்.

source: TOML_ type: string or table
eo: Tipo de TOML_: signoĉeno aŭ tabelo
ja: TOML_ 型: 文字列またはテーブル
pt_br: Tipo TOML_: string ou tabela
ru: Тип TOML_: строка или таблица
ta: TOML_ வகை: சரம் அல்லது அட்டவணை

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Description <core-metadata-description>` and :ref:`Description-Content-Type <core-metadata-description-content-type>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Description <core-metadata-description>` kaj :ref:`Description-Content-Type <core-metadata-description-content-type>`
ja: 対応する `コアとなるメタデータ <core-metadata>` フィールド: :ref:`Description <core-metadata-description>` and :ref:`Description-Content-Type <core-metadata-description-content-type>`
pt_br: Campos correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Description <core-metadata-description>` e :ref:`Description-Content-Type <core-metadata-description-content-type>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Description <core-metadata-description>` и :ref:`Description-Content-Type <core-metadata-description-content-type>`
ta: தொடர்புடைய: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `விளக்கம் <கோர்-மெட்டாடேட்டா-விளக்கப்படம்>` மற்றும்: குறிப்பு: `விளக்கம்-கண்டி-வகை <கோர்-மெட்டாடேட்டா-விளக்கமளிப்பு-வகை>`

source: The full description of the project (i.e. the README).
eo: La plena priskribo de la projekto (t.e. la README).
ja: プロジェクトの説明全体 (すなわち README)。
pt_br: A descrição completa do projeto (isto é, o README).
ru: Полное описание проекта (то есть README).
ta: திட்டத்தின் முழு விளக்கம் (அதாவது README).

source: The key accepts either a string or a table. If it is a string then it is a path relative to ``pyproject.toml`` to a text file containing the full description. Tools MUST assume the file's encoding is UTF-8. If the file path ends in a case-insensitive ``.md`` suffix, then tools MUST assume the content-type is ``text/markdown``. If the file path ends in a case-insensitive ``.rst``, then tools MUST assume the content-type is ``text/x-rst``. If a tool recognizes more extensions than this PEP, they MAY infer the content-type for the user without specifying this key as ``dynamic``. For all unrecognized suffixes when a content-type is not provided, tools MUST raise an error.
eo: La ŝlosilo akceptas aŭ signoĉenon aŭ tabelon. Se ĝi estas signoĉeno, do ĝi estas dosierloko relativa de ``pyproject.toml`` al teksta dosiero enhavanta la plenan priskribon. Ilo DEVAS supozi, ke la dosiero estas kodita je UTF-8. Se la dosierloko finiĝas per usklecoblinda sufikso ``.rst``, do ilo DEVAS supozi, ke la enhavtipo estas ``text/markdown``. Se la dosierloko finiĝas usklecoblinde per ``.rst``, do ilo DEVAS supozi, ke la enhavtipo estas ``text/x-rst``. Se ilo rekonas pli da sufiksoj ol ĉi tiu PEP, ĝi POVAS inferenci la enhavtipon por la uzanto sen precizigado de tiu ŝlosilo kiel ``dynamic``. Por ĉia nerekonebla sufikso, kiam enhavtipo ne estas disponigita, ilo DEVAS sciigi pri eraro.
ja: このキーは文字列かテーブルを受け付けます。もし文字列なら、完全な説明を含むテキストファイルの位置を ``pyproject.toml`` からの相対パスで示したものです。ツールの側ではこのファイルが UTF-8 でエンコードされているものと想定しなければなりません。ファイルパスが大文字小文字を問わず ``.md`` 拡張子で終わっている場合は、ツールはそのファイルの content-type が ``text/markdown`` であるものと仮定しなければなりません。ファイルパスが大文字小文字を問わず ``.rst`` で終わっている場合は、ツールは content-type が ``text/x-rst`` であるものと仮定しなければなりません。この PEP で指定するよりも多くの拡張子をツールが認識するなら、そのようなツールは、このキーを ``dynamic`` であると指定していなくても、ユーザのために content-type を推測しても構いません。content-type が与えられていない場合には、全ての認識できない拡張子についてツールはエラーを発生させなければなりません。
pt_br: A chave aceita uma string ou uma tabela. Se for uma string, então é um caminho relativo ao ``pyproject.toml`` para um arquivo texto contendo a descrição completa. As ferramentas DEVEM presumir que a codificação do arquivo é UTF-8. Se o caminho do arquivo termina com um sufixo ``.md``, ou sua versão em caixa alta, então as ferramentas DEVEM presumir que o tipo de conteúdo é ``text/markdown``. Se o caminho do arquivo termina em ``.rst``, então as ferramentas DEVEM presumir que o tipo de conteúdo é ``text/x-rst``. Se uma ferramenta reconhece mais extensões do que esta PEP, elas podem inferir o tipo de conteúdo para o usuário sem especificar esta chave como ``dynamic``. Para todos os sufixos não reconhecidos quando um tipo de conteúdo não é fornecido, as ferramentas DEVEM levantar um erro.
ru: Ключ принимает значение либо строки, либо таблицы. Если это строка, то это путь относительно ``pyproject.toml`` к текстовому файлу, содержащему полное описание. Инструменты ДОЛЖНЫ считать, что кодировка файла - UTF-8. Если путь к файлу заканчивается суффиксом ``.md`` без учета регистра, то инструменты ДОЛЖНЫ считать, что тип содержимого - ``text/markdown``. Если путь к файлу заканчивается суффиксом ``.rst``, то инструменты ДОЛЖНЫ считать, что тип содержимого - ``text/x-rst``. Если инструмент распознает больше расширений, чем этот PEP, он МОЖЕТ определить тип содержимого для пользователя, не указывая этот ключ как ``динамический``. Для всех нераспознанных суффиксов, когда тип содержимого не указан, инструменты ДОЛЖНЫ выдавать ошибку.
ta: விசை ஒரு சரம் அல்லது அட்டவணையை ஏற்றுக்கொள்கிறது. இது ஒரு சரம் என்றால், அது முழு விளக்கத்தைக் கொண்ட உரை கோப்புடன் `` pyproject.toml`` உடன் தொடர்புடைய பாதையாகும். கோப்புகளின் குறியாக்கம் UTF-8 என்று கருவிகள் கருத வேண்டும். கோப்பு பாதை ஒரு வழக்கு-உணர்திறன் `.md`` பின்னொட்டில் முடிவடைந்தால், கருவிகள் உள்ளடக்க வகை` `உரை/மார்க் டவுன்`` என்று கருத வேண்டும். கோப்பு பாதை ஒரு வழக்கு-உணர்வற்ற `` .rst`` இல் முடிவடைந்தால், கருவிகள் உள்ளடக்க வகை `` உரை/x-rst`` என்று கருத வேண்டும். இந்த PEP ஐ விட ஒரு கருவி அதிக நீட்டிப்புகளை அங்கீகரித்தால், இந்த விசையை `` டைனமிக்`` என்று குறிப்பிடாமல் பயனருக்கான உள்ளடக்க வகையை அவை ஊகிக்கக்கூடும். அடையாளம் காணப்படாத அனைத்து பின்னொட்டுகளுக்கும் உள்ளடக்க வகை வழங்கப்படாதபோது, கருவிகள் பிழையை உயர்த்த வேண்டும்.

source: The ``readme`` key may also take a table. The ``file`` key has a string value representing a path relative to ``pyproject.toml`` to a file containing the full description. The ``text`` key has a string value which is the full description. These keys are mutually-exclusive, thus tools MUST raise an error if the metadata specifies both keys.
ja: ``readme`` キーはその値がテーブルでも構いません。 ``file`` キーは、完全な説明を含むファイルへの ``pyproject.toml`` ファイルからの相対パスを表現する文字列を値として持ちます。 ``text`` キーは、完全な説明そのものである文字列を値に持ちます。これらのキーは排他的にいずれかひとつしか使えないので、もしメタデータがこれら両方のキーを同時に指定していたらツールはエラーを発生させなければなりません。
pt_br: A chave ``readme`` também pode receber uma tabela. A chave ``file`` tem um valor string que representa um caminho relativo a ``pyproject.toml`` para um arquivo contendo a descrição completa. A chave ``text`` tem um valor de string que é a descrição completa. Essas chaves são mutuamente exclusivas, portanto, as ferramentas DEVEM levantar um erro se os metadados especificarem ambas as chaves.
ru: Ключ ``readme`` также может принимать вид таблицы. Ключ ``file`` имеет строковое значение, представляющее собой путь относительно ``pyproject.toml`` к файлу, содержащему полное описание. Ключ ``text`` имеет строковое значение, которое является полным описанием. Эти ключи являются взаимоисключающими, поэтому инструменты ДОЛЖНЫ выдавать ошибку, если в метаданных указаны оба ключа.
ta: `` ReadMe`` விசையும் ஒரு அட்டவணையை எடுக்கலாம். `` கோப்பு`` விசையானது முழு விளக்கத்தைக் கொண்ட ஒரு கோப்பிற்கு `` pyproject.toml`` உடன் தொடர்புடைய பாதையை குறிக்கும் சரம் மதிப்பைக் கொண்டுள்ளது. `` உரை`` விசையில் ஒரு சரம் மதிப்பு உள்ளது, இது முழு விளக்கமாகும். இந்த விசைகள் இருவழி பிரத்தியேகமானவை, இதனால் மேனிலை தரவு இரண்டு விசைகளையும் குறிப்பிடினால் கருவிகள் பிழையை எழுப்ப வேண்டும்.

source: A table specified in the ``readme`` key also has a ``content-type`` key which takes a string specifying the content-type of the full description. A tool MUST raise an error if the metadata does not specify this key in the table. If the metadata does not specify the ``charset`` parameter, then it is assumed to be UTF-8. Tools MAY support other encodings if they choose to. Tools MAY support alternative content-types which they can transform to a content-type as supported by the :ref:`core metadata <core-metadata>`. Otherwise tools MUST raise an error for unsupported content-types.
eo: Tabelo specifita en la ŝlosilo ``readme`` ankaŭ havas ŝlosilon ``content-type`` prenantan signoĉenon de la enhavtipo de la plena priskribo. Ilo DEVAS sciigi pri eraro, se la metadatenoj ne specifas tiun ŝlosilon en la tabelo. Se la metadatenoj ne specifas la parametron ``charset``, oni supozas, ke ĝi estas UTF-8. Ilo POVAS subteni alternativajn enhavtipojn transformeblajn al enhavtipo subtenata de la :ref:`kernaj metadatenoj <core-metadata>`. Alikaze ilo DEVAS sciigi pri eraro por nesubtenataj enhavtipoj.
ja: ``readme`` キーに指定されたテーブルには、完全な説明の content-type を指定する文字列を値とする ``content-type`` キーも含まれています。メタデータがこのキーをテーブルの中で指定していない場合には、ツールはエラーを発生させなければなりません。メタデータで ``charset`` パラメータが指定されていない場合には、 UTF-8 であるものと想定されます。ツールは各ツールが独自に選択した他のエンコーディングをサポートしても構いません。 :ref:`コアとなるメタデータ <core-metadata>` によってサポートされている content-type に変換することができるのであれば、ツールはそのような代替 content-type をサポートしても構いません。そうでなければ、ツールはサポートしていない content-type に対してエラーを発生させなければなりません。
pt_br: Uma tabela especificada na chave ``readme`` também possui uma chave ``content-type`` que recebe uma string especificando o tipo de conteúdo da descrição completa. Uma ferramenta DEVE levantar um erro se os metadados não especificarem esse campo na tabela. Se os metadados não especificarem o parâmetro ``charset``, será considerado UTF-8. As ferramentas PODEM oferecer suporte a outras codificações, se assim o desejarem. As ferramentas PODEM oferecer suporte a tipos de conteúdo alternativos que podem transformar em um tipo de conteúdo conforme suportado pelos :ref:`metadados principais <core-metadata>`. Caso contrário, as ferramentas DEVEM levantar um erro para tipos de conteúdo não suportados.
ru: Таблица, указанная в ключе ``readme'', также имеет ключ ``content-type'', который принимает строку, определяющую тип содержимого полного описания. Инструмент ДОЛЖЕН выдать ошибку, если метаданные не указывают этот ключ в таблице. Если в метаданных не указан параметр ``charset'', то предполагается, что это UTF-8. Инструменты МОГУТ поддерживать другие кодировки по своему усмотрению. Инструменты МОГУТ поддерживать альтернативные типы содержимого, которые они могут преобразовать в тип содержимого, поддерживаемый :ref:`core metadata <core-metadata>`. В противном случае инструменты ДОЛЖНЫ выдавать ошибку о неподдерживаемых типах содержимого.
ta: `` ReadMe`` விசையில் குறிப்பிடப்பட்டுள்ள அட்டவணையில் `` உள்ளடக்க-வகை`` விசையும் உள்ளது, இது முழு விளக்கத்தின் உள்ளடக்க வகையைக் குறிப்பிடும் ஒரு சரத்தை எடுக்கும். மேனிலை தரவு இந்த விசையை அட்டவணையில் குறிப்பிடவில்லை என்றால் ஒரு கருவி பிழையை உயர்த்த வேண்டும். மேனிலை தரவு `` சார்செட்`` அளவுருவைக் குறிப்பிடவில்லை என்றால், அது யுடிஎஃப் -8 என்று கருதப்படுகிறது. கருவிகள் பிற குறியாக்கங்களை தேர்வு செய்தால் ஆதரிக்கலாம். கருவிகள் மாற்று உள்ளடக்க வகைகளை ஆதரிக்கலாம், அவை உள்ளடக்க வகைக்கு மாற்றக்கூடியவை: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>`. இல்லையெனில் கருவிகள் ஆதரிக்கப்படாத உள்ளடக்க வகைகளுக்கு பிழையை எழுப்ப வேண்டும்.

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Requires-Python <core-metadata-requires-python>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Requires-Python <core-metadata-requires-python>`
ja: :ref:`コアとなるメタデータ <core-metadata>` フィールドに対応する: :ref:`Requires-Python <core-metadata-requires-python>`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Requires-Python <core-metadata-requires-python>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Requires-Python <core-metadata-requires-python>`
ta: தொடர்புடையது: குறிப்பு: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `-பைதான் <கோர்-மெட்டாடேட்டா-வேண்டுகோள்-பைதான்>` தேவை

source: The Python version requirements of the project.
eo: La postuloj de la projekto pri versioj de Python.
ja: プロジェクトが要求する Python のバージョン。
pt_br: Os requisitos de versão do Python do projeto.
ru: Требования к версии Python для проекта.
ta: திட்டத்தின் பைதான் பதிப்பு தேவைகள்.

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`License-Expression <core-metadata-license-expression>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`License-Expression <core-metadata-license-expression>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`License-Expression <core-metadata-license-expression>`.
ta: தொடர்புடைய: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `உரிம-வெளிப்பாடு <கோர்-மெட்டாடேட்டா-லிசென்ச்-எக்ச்பிரசன்>`

source: TOML_ type: array of strings
eo: Tipo de TOML_: listo de signoĉenoj
ja: TOML_ 型: 文字列の配列
pt_br: Tipo TOML_: vetor de strings
ru: Тип TOML_: массив строк
ta: டாம்_ வகை: சரங்களின் வரிசை

source: An array specifying paths in the project source tree relative to the project root directory (i.e. directory containing :file:`pyproject.toml` or legacy project configuration files, e.g. :file:`setup.py`, :file:`setup.cfg`, etc.) to file(s) containing licenses and other legal notices to be distributed with the package.
ru: Массив, указывающий пути в дереве исходных текстов проекта относительно корневого каталога проекта (т.е. каталога, содержащего :file:`pyproject.toml` или унаследованные файлы конфигурации проекта, например :file:`setup.py`, :file:`setup.cfg` и т.д.) к файлу(ам) с лицензиями и другими юридическими уведомлениями, которые будут распространяться вместе с пакетом.
ta: திட்ட ரூட் கோப்பகத்துடன் தொடர்புடைய திட்ட மூல மரத்தில் உள்ள பாதைகளைக் குறிப்பிடும் ஒரு வரிசை (அதாவது அடைவு: கோப்பு: `pyproject.toml` அல்லது மரபு திட்ட உள்ளமைவு கோப்புகள், எ.கா.: கோப்பு:` setup.py`,: `setup.cfg `, முதலியன) தொகுப்புடன் விநியோகிக்கப்பட வேண்டிய உரிமங்கள் மற்றும் பிற சட்ட அறிவிப்புகளைக் கொண்ட (கள்).

source: Tools MUST assume that license file content is valid UTF-8 encoded text, and SHOULD validate this and raise an error if it is not.
eo: Ilo DEVAS supozi, ke la enhavo de licenco-dosiero estas valida UTF-8-kodita teksto, kaj KONTROLU la validecon kaj SCIIGU eraron, se ĝi ne validas.
ru: Инструменты ДОЛЖНЫ предполагать, что содержимое файла лицензии является правильным текстом в кодировке UTF-8, и ДОЛЖНЫ проверять его и выдавать ошибку, если это не так.
ta: உரிமக் கோப்பு உள்ளடக்கம் செல்லுபடியாகும் UTF-8 குறியிடப்பட்ட உரை என்று கருவிகள் கருத வேண்டும், மேலும் இதைச் சரிபார்த்து, இல்லையென்றால் பிழையை உயர்த்த வேண்டும்.

source: Build tools:
eo: Konstruiloj:
ru: Сборка инструментов:
ta: கருவிகளை உருவாக்கு:

source: MUST include all files matched by a listed pattern in all distribution archives.
eo: DEVAS inkluzivi ĉiujn dosierojn kongruajn al enlistigita patroneo en ĉiuj distribuaj arĥivoj.
ru: ОБЯЗАТЕЛЬНО включите все файлы, соответствующие перечисленному шаблону, во все архивы дистрибутива.
ta: அனைத்து விநியோக காப்பகங்களிலும் பட்டியலிடப்பட்ட வடிவத்தால் பொருந்தக்கூடிய அனைத்து கோப்புகளையும் சேர்க்க வேண்டும்.

source: MUST list each matched file path under a License-File field in the Core Metadata.
eo: DEVAS enlistigi ĉiun kongruan dosierlokon sub kampo ``License-File`` en la Kernaj Metadatenoj.
ru: ДОЛЖЕН перечислить каждый совпадающий путь к файлу в поле License-File в основных метаданных.
ta: பொருந்திய ஒவ்வொரு கோப்பு பாதையும் கோர் மெட்டாடேட்டாவில் உரிம-கோப்பு புலத்தின் கீழ் பட்டியலிட வேண்டும்.
