Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: These files are only created when you run the command to create your distribution. This means that any time you change the source of your project or the configuration in your :file:`setup.py` file, you will need to rebuild these files again before you can distribute the changes to PyPI.
ja: これらのファイルは、配布物作成のコマンドを走らせたときにだけ作成されます。ということは、プロジェクトのソースコードや :file:`setup.py` の中の設定を変更したときにはいつでも、PyPIへ送る前に配布物のファイルを再作成する必要があるということです。
pt_br: Esses arquivos são criados apenas quando você executa o comando para criar sua distribuição. Isso significa que a qualquer momento que você alterar a fonte do seu projeto ou a configuração no arquivo :file:`setup.py`, você precisará reconstruir esses arquivos novamente antes de distribuir as alterações para PyPI.
ru: Эти файлы создаются только тогда, когда вы выполняете команду создания дистрибутива. Это означает, что при любом изменении исходного кода проекта или конфигурации в файле :file:`setup.py` вам нужно будет заново создать эти файлы, прежде чем вы сможете распространить изменения в PyPI.
ta: உங்கள் விநியோகத்தை உருவாக்க கட்டளையை இயக்கும்போது மட்டுமே இந்த கோப்புகள் உருவாக்கப்படுகின்றன. இதன் பொருள் என்னவென்றால், உங்கள் திட்டத்தின் மூலத்தையோ அல்லது உங்கள்: கோப்பு: `setup.py` கோப்பிலோ எந்த நேரத்திலும் நீங்கள் மாற்றும்போது, நீங்கள் பைபிக்கு மாற்றங்களை விநியோகிப்பதற்கு முன்பு இந்த கோப்புகளை மீண்டும் கட்டியெழுப்ப வேண்டும்.

source: Before releasing on main PyPI repo, you might prefer training with the `PyPI test site <https://test.pypi.org/>`_ which is cleaned on a semi regular basis. See :ref:`using-test-pypi` on how to setup your configuration in order to use it.
eo: Antaŭ ol eldoni al la ĉefdeponejo PyPI, vi eble volas ekzerci vin per la `Prova PyPI <https://test.pypi.org>`_, kiu fojfoje forviŝiĝas. Vidu :ref:`using-test-pypi` pri la agordoj por uzi ĝin.
ja: PyPIの主リポジトリでリリースをする前に、半定期的に消去される `PyPI 試験サイト <https://test.pypi.org/>`_ で練習する方が良いかもしれません。どのように設定すれば試験サイトを使えるかについては、 :ref:`using-test-pypi` を見てください。
pt_br: Antes de lançar no repositório principal do PyPI, você pode preferir treinar com o `site de teste do PyPI <https://test.pypi.org/>`_ que é redefinido em uma base semirregular. Veja :ref:`using-test-pypi` sobre como definir sua configuração para usá-lo.
ru: Перед выпуском на основной PyPI-репо, вы можете предпочесть тренировку на `PyPI test site <https://test.pypi.org/>`_, который чистится на полурегулярной основе. Смотрите :ref:`using-test-pypi` о том, как настроить свою конфигурацию для его использования.
ta: மெயின் பைபி ரெப்போவில் வெளியிடுவதற்கு முன், நீங்கள் `PYPI சோதனை தளத்துடன் பயிற்சியை விரும்பலாம் <https://test.pypi.org/>` _ இது அரை வழக்கமான அடிப்படையில் தூய்மை செய்யப்படுகிறது. காண்க: குறிப்பு: `உங்கள் உள்ளமைவைப் பயன்படுத்துவதற்காக அதை எவ்வாறு அமைப்பது என்பது குறித்து-டெச்ட்-பைபியைப் பயன்படுத்துதல்.

source: In other resources you may encounter references to using ``python setup.py register`` and ``python setup.py upload``. These methods of registering and uploading a package are **strongly discouraged** as it may use a plaintext HTTP or unverified HTTPS connection on some Python versions, allowing your username and password to be intercepted during transmission.
eo: Aliaj dokumentoj kelkfoje mencias uzi ``python setup.py register`` kaj ``python setup.py upload``. Tiuj manieroj de registrado kaj alŝutado de pako estas **malrekomendegata**, ĉar ili uzas neĉifritan HTTP-konekton aŭ nekonfirmitan HTTPS-konekton sur kelkaj versioj de Python, permesante ŝtelado de viaj salutnomo kaj pasvorto dum transsendado.
ja: 他のリソースでは、 ``python setup.py register`` と ``python setup.py upload`` に遭遇するかもしれません。これらのメソッドはパッケージを登録ないしアップロードするものですが、 いくつかのバージョンのPythonで使うと平文のHTTPか検証しないHTTPSを用いるのであなたのユーザ名とパスワードが 通信経路上で横取りされる恐れがあって **強く非推奨** の状態になっています。
pt_br: Em outros recursos, você pode encontrar referências ao uso de ``python setup.py register`` e ``python setup.py upload``. Esses métodos de registro e envio de um pacote são **fortemente desencorajados**, pois podem usar uma conexão HTTP de texto simples ou HTTPS não verificada em algumas versões Python, permitindo que seu nome de usuário e senha sejam interceptados durante a transmissão.
ru: На других ресурсах вы можете встретить упоминания об использовании ``python setup.py register`` и ``python setup.py upload``. Эти методы регистрации и загрузки пакетов **настоятельно не рекомендуются**, поскольку в некоторых версиях Python они могут использовать HTTP-соединение с открытым текстом или непроверенное HTTPS-соединение, что позволяет перехватить ваши имя пользователя и пароль во время передачи.
ta: பிற ஆதாரங்களில் `` பைதான் செட்அப். ஒரு தொகுப்பை பதிவுசெய்தல் மற்றும் பதிவேற்றுவதற்கான இந்த முறைகள் ** சில பைதான் பதிப்புகளில் ஒரு எளிய உரை HTTP அல்லது சரிபார்க்கப்படாத HTTPS இணைப்பைப் பயன்படுத்துவதால், உங்கள் பயனர்பெயர் மற்றும் கடவுச்சொல்லை பரிமாற்றத்தின் போது தடுத்து நிறுத்த அனுமதிக்கிறது.

source: The reStructuredText parser used on PyPI is **not** Sphinx! Furthermore, to ensure safety of all users, certain kinds of URLs and directives are forbidden or stripped out (e.g., the ``.. raw::`` directive). **Before** trying to upload your distribution, you should check to see if your brief / long descriptions provided in :file:`setup.py` are valid. You can do this by running :std:doc:`twine check <index>` on your package files:
eo: La sintaksanalizilo por restructuredText uzata ĉe PyPI **ne** estas Sphinx! Krome, por sekureco de ĉiuj uzantoj, kelkaj retadresoj kaj direktivoj estas malpermesataj aŭ forigitaj (ekzemple, la direktivo ``.. raw::``). **Antaŭ** ol alŝuti la distribuon, oni kontrolu, ĉu la mallonga kaj longa priskriboj en :file:`setup.py` validas. Oni faras tion rulante :std:doc:`twine check <index>` pri la pakaj dosieroj:
ja: PyPIで使っている reStructuredText パーサは Sphinx **ではありません！** その上、全ユーザの安全を確保するためにある種の URL やディレクティブ(例えば ``.. raw::`` ディレクティブ)は禁止されていたり削除されたりしています。あなたの配布物をアップロードしてみる **前に** :file:`setup.py` の中の brief/long description が文法的に妥当かどうかを確かめるべきです。あなたのパッケージのファイル群に対して :std:doc:`twine check <index>` を走らせれば、それを確かめることができます。
pt_br: O analisador de reStructuredText usado no PyPI **não é** Sphinx! Além disso, para garantir a segurança de todos os usuários, certos tipos de URLs e diretivas são proibidos ou removidos (por exemplo, a diretiva ``.. raw::``). **Antes** de tentar enviar sua distribuição, você deve verificar se suas descrições breves/longas fornecidas no :file:`setup.py` são válidas. Você pode fazer isso executando :std:doc:`twine check <index>` em todos arquivos do seu pacote:
ru: Парсер reStructuredText, используемый на PyPI, - это **не** Sphinx! Кроме того, для обеспечения безопасности всех пользователей, некоторые виды URL и директив запрещены или удалены (например, директива ``...raw::``). **Перед тем, как** попытаться загрузить свой дистрибутив, вы должны проверить, действительны ли ваши краткие/длинные описания, указанные в :file:`setup.py`. Это можно сделать, выполнив :std:doc:`twine check <index>` для файлов вашего пакета:
ta: PYPI இல் பயன்படுத்தப்படும் மறுசீரமைப்பு டெக்ச்ட் பாகுபடுத்தி ** அல்ல ** sphinx! மேலும், அனைத்து பயனர்களின் பாதுகாப்பையும் உறுதிப்படுத்த, சில வகையான முகவரி கள் மற்றும் வழிமுறைகள் தடைசெய்யப்பட்டுள்ளன அல்லது அகற்றப்படுகின்றன (எ.கா., `` .. மூல :: `` உத்தரவு). ** முன் ** உங்கள் விநியோகத்தை பதிவேற்ற முயற்சிக்கும் முன், உங்கள் சுருக்கமான / நீண்ட விளக்கங்கள் வழங்கப்பட்டதா என்பதை நீங்கள் சரிபார்க்க வேண்டும்: கோப்பு: `setup.py` செல்லுபடியாகும். இயங்குவதன் மூலம் இதைச் செய்யலாம்: எச்.டி.டி: டிஓசி: `உங்கள் தொகுப்பு கோப்புகளில்` ட்வைன் செக் <குறியீட்டு> `:

source: Create an account
eo: Krei konton
ja: アカウントを作成する
pt_br: Criar uma conta
ru: Создание учётной записи
ta: ஒரு கணக்கை உருவாக்கவும்

source: First, you need a :term:`PyPI <Python Package Index (PyPI)>` user account. You can create an account `using the form on the PyPI website <https://pypi.org/account/register/>`_.
eo: Unue, necesas konto ĉe :term:`PyPI <Python Package Index (PyPI)>`. Vi povas krei konton `per formularo ĉe la retejo de PyPI <https://pypi.org/account/register/>`_.
ja: まず、 :term:`PyPI <Python Package Index (PyPI)>` のユーザアカウントが必要です。 `PyPIウェブサイトにあるフォームを使えば <https://pypi.org/account/register/>`_ アカウントを作成することができます。
pt_br: Primeiro, você precisa de uma conta de usuário do :term:`PyPI <Python Package Index (PyPI)>`. Você pode criar uma conta `usando o formulário no site do PyPI <https://pypi.org/account/register/>`_.
ru: Во-первых, вам нужна учетная запись пользователя :term:`PyPI <Python Package Index (PyPI)>`. Вы можете создать учетную запись, используя форму на сайте PyPI <https://pypi.org/account/register/>`_.
ta: முதலில், உங்களுக்கு ஒரு: சொல் தேவை: `பைபி <பைதான் தொகுப்பு அட்டவணை (பைபி)>` பயனர் கணக்கு. PYPI வலைத்தளமான <https://pypi.org/account/register/> _ _ இல் படிவத்தைப் பயன்படுத்தி ஒரு கணக்கை உருவாக்கலாம்.

source: Now you'll create a PyPI `API token`_ so you will be able to securely upload your project.
eo: Nun vi kreos `API-ĵetonon <API token>`_ por PyPI, tiel ke vi povos sekure alŝuti vian projekton.
ja: 次に PyPI の `API トークン`_ を作成して、プロジェクトを安全にアップロードできるようにしましょう。
pt_br: Agora você criará um `token de API`_ do PyPI para que possa enviar o seu projeto com segurança.
ru: Теперь вы создадите токен PyPI `API token`_, чтобы иметь возможность безопасно загружать свой проект.
ta: இப்போது நீங்கள் ஒரு பைபி `ஏபிஐ டோக்கன்`_ ஐ உருவாக்குவீர்கள், எனவே உங்கள் திட்டத்தை பாதுகாப்பாக பதிவேற்ற முடியும்.

source: Go to https://pypi.org/manage/account/#api-tokens and create a new `API token`_; don't limit its scope to a particular project, since you are creating a new project.
eo: Iru al https://pypi.org/manage/account/#api-tokens kaj kreu novan `API-ĵetonon <API token>`_; ne limigu ĝian rajton al iu projekto, ĉar vi estas kreanta novan projekton.
ja: https://pypi.org/manage/account/#api-tokens and create へ行って、新しい `API トークン`_ を作成してください; これから新しいプロジェクトを作成するわけですから、スコープを特定のプロジェクトに限定しないようにしてください。
pt_br: Acesse https://pypi.org/manage/account/#api-tokens e crie um novo `token de API`_; não limite seu escopo a um projeto específico, já que você está criando um novo projeto.
ru: Перейдите на https://pypi.org/manage/account/#api-tokens и создайте новый `API-токен`_; не ограничивайте его область действия конкретным проектом, поскольку вы создаете новый проект.
ta: Https://pypi.org/manage/account/#api-tokens க்குச் சென்று புதிய `API டோக்கன்`_ ஐ உருவாக்கவும்; நீங்கள் ஒரு புதிய திட்டத்தை உருவாக்குவதால், ஒரு குறிப்பிட்ட திட்டத்திற்கு அதன் நோக்கத்தை மட்டுப்படுத்த வேண்டாம்.

source: **Don't close the page until you have copied and saved the token — you won't see that token again.**
eo: **Ne fermu la paĝon, ĝis vi kopiis kaj konservis la ĵetonon – vi ne vidos tiun ĵetonon denove.**
ja: **トークンをコピーして保存するまではページを閉じないでください -- トークンは二度と表示されることがありません。**
pt_br: **Não feche a página antes de copiar e salvar o token -- você não verá o token novamente.**
ru: **Не закрывайте страницу, пока не скопируете и не сохраните токен - больше вы его не увидите**
ta: ** நீங்கள் கிள்ளாக்கை நகலெடுத்து சேமிக்கும் வரை பக்கத்தை மூட வேண்டாம் - அந்த கிள்ளாக்கை நீங்கள் மீண்டும் பார்க்க மாட்டீர்கள். **

source: To avoid having to copy and paste the token every time you upload, you can create a :file:`$HOME/.pypirc` file:
eo: Se vi ne volas kopii kaj alglui la ĵetonon ĉiun fojon dum alŝutado, vi povas krei dosieron :file:`$HOME/.pypirc`:
ja: :file:`$HOME/.pypirc` ファイルを作っておくことで、アップロードするたびにトークンをコピー・ペーストする手間を省くことができます。
pt_br: Para evitar ter que copiar e colar o token toda vez que você enviar, você pode criar um arquivo :file:`$HOME/.pypirc`:
ru: Чтобы не копировать и не вставлять токен при каждой загрузке, вы можете создать файл :file:`$HOME/.pypirc`:
ta: நீங்கள் பதிவேற்றும் ஒவ்வொரு முறையும் கிள்ளாக்கை நகலெடுத்து ஒட்ட வேண்டும் என்பதைத் தவிர்க்க, நீங்கள் ஒரு: கோப்பு: `$ home/.pypirc` கோப்பு:

source: **Be aware that this stores your token in plaintext.**
eo: **Averto: tio senĉifre tenas vian ĵetonon.**
ja: **このファイルにはトークンが平文で保存されていることに注意してください。**
pt_br: **Esteja ciente de que isso armazena seu token em texto simples.**
ru: **Помните, что при этом ваш токен хранится в открытом виде**
ta: ** இது உங்கள் கிள்ளாக்கை எளிய உரையை சேமிக்கிறது என்பதை அறிந்து கொள்ளுங்கள். **

source: For more details, see the :ref:`specification <pypirc>` for :file:`.pypirc`.
eo: Por pliaj detaloj, vidu la :ref:`specifon <pypirc>` pri :file:`.pypirc`.
ja: :file:`.pypirc` についてさらに詳しく知りたい場合は :ref:`specification <pypirc>` を見てください。
pt_br: Para mais detalhes, veja a :ref:`especificação <pypirc>` do :file:`.pypirc`.
ru: Более подробную информацию см. в :ref:`спецификации <pypirc>` для :file:`.pypirc`.
ta: மேலும் விவரங்களுக்கு, இதைக் காண்க: ref: `விவரக்குறிப்பு <Pypirc>` க்கு: கோப்பு: `.பைர்க்`.

source: Upload your distributions
eo: Alŝuti viajn distribuojn
ja: 配布物をアップロードする
pt_br: Enviar suas distribuições
ru: Загрузите свои дистрибутивы
ta: உங்கள் விநியோகங்களை பதிவேற்றவும்

source: Once you have an account you can upload your distributions to :term:`PyPI <Python Package Index (PyPI)>` using :ref:`twine`.
eo: Post kiam vi kreis vian konton, vi rajtas alŝuti viajn distribuojn al :term:`PyPI <Python Package Index (PyPI)>` per :ref:`twine`.
ja: アカウントが入手できれば、 :ref:`twine` を使ってあなたの配布物を :term:`PyPI <Python Package Index (PyPI)>` へアップロードすることができます。
pt_br: Assim que tiver uma conta, você pode enviar suas distribuições para o :term:`PyPI <Python Package Index (PyPI)>` usando :ref:`twine`.
ru: После создания учетной записи вы можете загружать свои дистрибутивы в :term:`PyPI <Python Package Index (PyPI)>`, используя :ref:`twine`.
ta: உங்களிடம் ஒரு கணக்கு கிடைத்ததும் உங்கள் விநியோகங்களை பதிவேற்றலாம்: கால: `பைபி <பைதான் தொகுப்பு குறியீட்டு (பைபி)>` பயன்படுத்துதல்: குறிப்பு: `ட்வைன்`.

source: The process for uploading a release is the same regardless of whether or not the project already exists on PyPI - if it doesn't exist yet, it will be automatically created when the first release is uploaded.
eo: La procedo por alŝutado de eldono estas sama, ĉu aŭ ne la projekto jam ekzistas ĉe PyPI. Se ĝi ankoraŭ ne ekzistas, ĝi estas aŭtomate kreota dum alŝutado de la unua eldono.
ja: リリースをアップロードする手続きは、そのプロジェクトがPyPIに既に存在していても存在していなくても同じです - もしまだ存在していなければ、最初にリリースがアップロードされたときに自動的に作成されます。
pt_br: O processo de envio de uma versão é o mesmo, independentemente de o projeto já existir ou não no PyPI -- se ainda não existir, será criado automaticamente quando a primeira versão for carregada.
ru: Процесс загрузки релиза одинаков вне зависимости от того, существует ли уже проект на PyPI - если его еще нет, он будет автоматически создан при загрузке первого релиза.
ta: ஒரு வெளியீட்டைப் பதிவேற்றுவதற்கான செயல்முறை PYPI இல் ஏற்கனவே உள்ளதா இல்லையா என்பதைப் பொருட்படுத்தாமல் - அது இன்னும் இல்லை என்றால், முதல் வெளியீடு பதிவேற்றப்படும்போது அது தானாகவே உருவாக்கப்படும்.

source: For the second and subsequent releases, PyPI only requires that the version number of the new release differ from any previous releases.
eo: Por la dua kaj sekvaj eldonoj, PyPI nur postulas, ke la versia numero de la nova eldono diferencu de ajnaj antaŭaj versioj.
ja: ２回目やそれ以降のリリースで PyPI が要求するのは、新しいリリースのバージョン番号が先行するすべてのリリースとは異なるものであることだけです。
pt_br: Para a segunda versão e as subsequentes, PyPI requer apenas que o número da versão da nova versão seja diferente de todas as versões anteriores.
ru: Для второго и последующих релизов PyPI требует только, чтобы номер версии нового релиза отличался от всех предыдущих релизов.
ta: இரண்டாவது மற்றும் அடுத்தடுத்த வெளியீடுகளுக்கு, புதிய வெளியீட்டின் பதிப்பு எண் முந்தைய வெளியீடுகளிலிருந்து வேறுபட வேண்டும் என்று PYPI தேவைப்படுகிறது.

source: You can see if your package has successfully uploaded by navigating to the URL ``https://pypi.org/project/<sampleproject>`` where ``sampleproject`` is the name of your project that you uploaded. It may take a minute or two for your project to appear on the site.
eo: Oni povas kontroli, ĉu pako estis sukcese alŝutita, vizitante la retadreson ``https://pypi.org/project/<ekzemplo>``, en kiu ``<ekzemplo>`` estas la nomo de la alŝutita projekto. Eble oni devas atendi unu minuton aŭ du.
ja: ``sampleproject`` のところをアップロードしているプロジェクトの名前に置き換えるとして、 ``https://pypi.org/project/<sampleproject>`` に誘導されれば、あなたのパッケージのアップロードは成功です。あなたのプロジェクトがサイト上に表示されるまでには1,2分の時間がかかるかもしれません。
pt_br: Você pode ver se o seu pacote foi enviado com sucesso navegando para a URL ``https://pypi.org/project/<projetoexemplo>`` onde ``projetoexemplo`` é o nome do seu projeto que você enviou. O seu projeto pode demorar um ou dois minutos para aparecer no site.
ru: Вы можете убедиться, что ваш пакет успешно загружен, перейдя по URL-адресу ``https://pypi.org/project/<sampleproject>``, где ``sampleproject`` - это имя загруженного вами проекта. Возможно, потребуется минута или две, чтобы ваш проект появился на сайте.
ta: `` Https://pypi.org/project/ <amphalproject> `` `` `shampeproject`` என்பது நீங்கள் பதிவேற்றிய உங்கள் திட்டத்தின் பெயர். உங்கள் திட்டம் தளத்தில் தோன்றுவதற்கு ஒரு மணித்துளி அல்லது இரண்டு நேரம் ஆகலாம்.

source: Depending on your platform, this may require root or Administrator access. :ref:`pip` is currently considering changing this by `making user installs the default behavior <https://github.com/pypa/pip/issues/1668>`_.
eo: Depende de la platformo, tio eble postulas rajtojn de ĉefuzanto aŭ Administranto. :ref:`pip` estas konsideranta ŝanĝi tion, `igante instalon por uzanto la implicita konduto <https://github.com/pypa/pip/issues/1668>`_.
ja: あなたのプラットフォームに依りますが、これにはrootまたはAdministratorの権限でアクセスしなければならないかもしれません。 :ref:`pip` は現在、 `一般ユーザでのインストールを規定動作にする案 <https://github.com/pypa/2pip/issues/1668>`_ にあるように、この部分の変更を検討しています。
pt_br: Dependendo da sua plataforma, isso pode exigir acesso de root ou de administrador. :ref:`pip` está atualmente considerando mudar isso `tornando as instalações de usuário o comportamento padrão <https://github.com/pypa/pip/issues/1668>`_.
ru: В зависимости от вашей платформы, для этого может потребоваться доступ root или администратора. :ref:`pip` в настоящее время рассматривает возможность изменить это, сделав пользовательскую установку поведением по умолчанию <https://github.com/pypa/pip/issues/1668>`_.
ta: உங்கள் தளத்தைப் பொறுத்து, இதற்கு ரூட் அல்லது நிர்வாகி அணுகல் தேவைப்படலாம். .

source: Dropping support for older Python versions
eo: Malsubteni malnovajn versiojn de Python
ja: 古いバージョンのPython へのサポートをやめる
pt_br: Descartando suporte para versões mais antigas do Python
ru: Удаление поддержки старых версий Python'а
ta: பழைய பைதான் பதிப்புகளுக்கான ஆதரவை கைவிடுதல்

source: The ability to drop support for older Python versions is enabled by the standard :ref:`core-metadata` 1.2 specification via the :ref:`"Requires-Python" <core-metadata-requires-python>` attribute.
eo: La kapablo ekmalsubteni malnovajn versioj de Python estiĝis per la atributo :ref:`«Requires-Python» <core-metadata-requires-python>` en la norma specifo :ref:`core-metadata` 1.2.
ja: 古いバージョンのPythonへのサポートを取りやめる能力については、標準的な :ref:`core-metadata` 1.2 仕様の :ref:`Requires-Python <core-metadata-requires-python>` アトリビュートで有効化されています。
ru: Возможность отказаться от поддержки старых версий Python предусмотрена стандартной спецификацией :ref:`core-metadata` 1.2 с помощью атрибута :ref:`"Requires-Python" <core-metadata-requires-python>`.
ta: பழைய பைதான் பதிப்புகளுக்கான ஆதரவை கைவிடுவதற்கான திறன் தரநிலையால் இயக்கப்பட்டது: குறிப்பு: `கோர்-மெட்டாடேட்டா` 1.2 விவரக்குறிப்பு வழியாக: ref:` "-பைதான் தேவை" <கோர்-மெட்டாடேட்டா-வேண்டுகோள்-பைதான்> `பண்புக்கூறு.

source: Metadata 1.2+ installers, such as Pip, will adhere to this specification by matching the current Python runtime and comparing it with the required version in the package metadata. If they do not match, it will attempt to install the last package distribution that supported that Python runtime.
eo: Instalilo subtenanta la normon Metadatenoj 1.2+ obeas tiun specifon kontrolante, ĉu la aktuala Python-versio kongruas kun la postulata versio en la pakaj metadatenoj. Se ĝi ne kongruos, ĝi provos instali la lastan pakan distribuon subtenantan tiun Python-version.
ja: Pip のような Metadata 1.2+ のインストーラは、動作中の Python ランタイムのバージョンとパッケージのメタデータで要求されているバージョンを比較突合することで、この仕様を遵守しようとします。もし両者が一致しなければ、その Python ランタイムでサポートされているパッケージ配布物の中で最新のものをインストールしようと試みます。
ru: Установщики с метаданными 1.2+, такие как Pip, будут придерживаться этой спецификации, определяя текущую среду выполнения Python и сравнивая ее с требуемой версией в метаданных пакета. Если они не совпадают, то будет предпринята попытка установить последний дистрибутив пакета, который поддерживал эту среду выполнения Python.
ta: PIP போன்ற மேனிலை தரவு 1.2+ நிறுவிகள், தற்போதைய பைதான் இயக்க நேரத்துடன் பொருந்துவதன் மூலமும், தொகுப்பு மெட்டாடேட்டாவில் தேவையான பதிப்போடு ஒப்பிடுவதன் மூலமும் இந்த விவரக்குறிப்பைக் கடைப்பிடிக்கும். அவை பொருந்தவில்லை என்றால், அந்த பைதான் இயக்க நேரத்தை ஆதரிக்கும் கடைசி தொகுப்பு விநியோகத்தை நிறுவ முயற்சிக்கும்.

source: This mechanism can be used to drop support for older Python versions, by amending the ``Requires-Python`` attribute in the package metadata.
eo: Tiu meĥanismo povas esti uzata por ĉesigi subtenon por malnovaj versioj de Python, modifante la atributon ``Requires-Python`` en la pakaj metadatenoj.
ja: パッケージのメタデータにある ``Requires-Python`` 属性を修正することで、古いバージョンの Python へのサポートを削除するのにこのメカニズムを利用することができます。
ru: Этот механизм можно использовать для отказа от поддержки старых версий Python, изменив атрибут ``Requires-Python`` в метаданных пакета.
ta: பழைய பைதான் பதிப்புகளுக்கான ஆதரவை கைவிட இந்த வழிமுறை பயன்படுத்தப்படலாம், தொகுப்பு மெட்டாடேட்டாவில் ``-பைதான் `பண்புக்கூறு தேவைகள்.

source: Requirements
eo: Postuloj
ja: 要求事項
pt_br: Requisitos
ru: Требования
ta: தேவைகள்

source: This workflow requires that the user installing the package uses Pip [#]_, or another installer that supports the Metadata 1.2 specification.
eo: Tiu laborfluo postulas, ke la uzanto instalanta la pakon uzu Pip [#]_ aŭ alian instalilon subtenantan la specifon Metadatenoj 1.2.
ja: このワークフローは、パッケージをインストールしようとするユーザが Pip か、または、Metadata 1.2 の仕様を満足する別のインストーラを使うことを要求します。
ru: Этот рабочий процесс требует, чтобы пользователь, устанавливающий пакет, использовал Pip [#]_ или другую программу установки, поддерживающую спецификацию Metadata 1.2.
ta: தொகுப்பை நிறுவும் பயனர் பிஐபி [#] _ அல்லது மேனிலை தரவு 1.2 விவரக்குறிப்பை ஆதரிக்கும் மற்றொரு நிறுவியைப் பயன்படுத்த வேண்டும்.

source: Dealing with the universal wheels
eo: Pritrakti universalan wheel
ja: universal wheelsの取り扱い
pt_br: Lidando com os wheels universais
ru: Работа с универсальными колесами
ta: உலகளாவிய சக்கரங்களுடன் கையாள்வது
