Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If RECORD.p7s is used, it must contain a detached S/MIME format signature of RECORD.
eo: Se RECORD.p7s estas uzata, ĝi devas enhavi malligitan S/MIME-forman subskribon de RECORD.
ja: RECORD.p7s を使う場合は、このファイルに RECORD ファイルに関する分離型の S/MIME 署名を入れておかなければなりません。
pt_br: Se RECORD.p7s for usado, ele deve conter uma assinatura de formato S/MIME separada de RECORD.
ru: Если используется файл RECORD.p7s, он должен содержать отделенную подпись RECORD в формате S/MIME.
ta: Record.P7S பயன்படுத்தப்பட்டால், அதில் பதிவின் பிரிக்கப்பட்ட S/MIME வடிவமைப்பு கையொப்பம் இருக்க வேண்டும்.

source: A wheel installer is not required to understand digital signatures but MUST verify the hashes in RECORD against the extracted file contents. When the installer checks file hashes against RECORD, a separate signature checker only needs to establish that RECORD matches the signature.
eo: Instalilo de wheel ne devas kompreni ciferecan subskribon sed DEVAS kompari la haketaĵojn en ``RECORD`` al la enhavoj de la maldensigitaj dosieroj. Kiam instalilo komparas la dosierajn haketaĵojn kaj ``RECORD``, aparta subskribo-kontrolilo devas nur kontroli, ĉu ``RECORD`` kongruas kun la subskribo.
ja: wheel インストーラはデジタル署名を理解することを要求されてはいませんが、 RECORD ファイル内のハッシュ値が展開されたファイル内容に対して妥当であることを検証しなければなりません。インストーラが RECORD ファイルに対するハッシュ値を確認する際には、別途用意された署名検証プログラムは RECORD ファイルが署名に対して妥当であることだけを確認すれば十分です。
pt_br: Um instalador de wheel não precisa entender as assinaturas digitais, mas DEVE verificar os hashes em RECORD em relação ao conteúdo do arquivo extraído. Quando o instalador verifica os hashes do arquivo em relação ao RECORD, um verificador de assinatura separado só precisa estabelecer se RECORD corresponde à assinatura.
ru: Программа установки колеса не обязана понимать цифровые подписи, но ДОЛЖНА проверять хэши в RECORD по содержимому извлеченного файла. Когда программа установки сверяет хэши файлов с RECORD, отдельному средству проверки подписи достаточно убедиться, что RECORD соответствует подписи.
ta: டிசிட்டல் கையொப்பங்களைப் புரிந்து கொள்ள ஒரு சக்கர நிறுவி தேவையில்லை, ஆனால் பிரித்தெடுக்கப்பட்ட கோப்பு உள்ளடக்கங்களுக்கு எதிராக பதிவில் உள்ள ஆச்களை சரிபார்க்க வேண்டும். நிறுவி கோப்பு ஆச்களை பதிவுக்கு எதிராக சரிபார்க்கும்போது, ஒரு தனி கையொப்பச் சரிபார்ப்பு கையொப்பத்துடன் பொருந்துகிறது என்பதை மட்டுமே நிறுவ வேண்டும்.

source: See
eo: Vidu
ja: 以下を参照のこと
pt_br: Veja
ru: Смотрите
ta: பார்க்க

source: FAQ
eo: Oftaj demandoj
ru: ЧаВо
ta: கேள்விகள்

source: Wheel defines a .data directory. Should I put all my data there?
eo: Wheel difinas dosierujon .data. Ĉu mi metu ĉiom da miaj datenoj tien?
ja: Wheel は .data ディレクトリを定義します。すべてのデータをそこに入れるべきでしょうか？
pt_br: Wheel define um diretório .data. Devo colocar todos os meus dados lá?
ru: Wheel определяет каталог .data. Должен ли я поместить туда все свои данные?
ta: சக்கரம் ஒரு .டேட்டா கோப்பகத்தை வரையறுக்கிறது. எனது எல்லா தரவையும் நான் அங்கு வைக்க வேண்டுமா?

source: This specification does not have an opinion on how you should organize your code. The .data directory is just a place for any files that are not normally installed inside ``site-packages`` or on the PYTHONPATH. In other words, you may continue to use ``pkgutil.get_data(package, resource)`` even though *those* files will usually not be distributed in *wheel's* ``.data`` directory.
eo: Ĉi tiu normo ne havas opinion pri kiel oni organizu sian kodon. La dosierujo ``.data`` estas nur loko por tiuj dosieroj, kiuj ordinare ne instaliĝas en ``site-packages`` aŭ en ``PYTHONPATH``. Alivorte, oni rajtas daŭre uzi ``pkgutil.get_data(pako, risurso)``, eĉ se *tiuj* dosieroj ordinare ne distribuiĝas en la dosierujo ``.data`` de wheel.
ja: この仕様では、あなたがあなたのソースコードをどのように組織立てて置くべきかについては特に意見を表明していません。 .data ディレクトリは、 ``site-packages`` 内や PYTHONPATH 内に通常ならインストールされない全てのファイルを置く場所というだけのことです。換言すれば、 *そのような* ファイル群が通常なら *wheel の* ``.data`` ディレクトリに置く形で配布されない時でさえも、 ``pkgutil.get_data(package, resource)`` を使い続けても構わないのです。
pt_br: Esta especificação não tem uma opinião sobre como você deve organizar seu código. O diretório .data é apenas um lugar para quaisquer arquivos que não são normalmente instalados dentro de ``site-packages`` ou no PYTHONPATH. Em outras palavras, você pode continuar a usar ``pkgutil.get_data(package, resource)`` ainda que *esses* arquivos normalmente não sejam distribuídos no diretório ``.data`` do *wheel*.
ru: Эта спецификация не имеет своего мнения о том, как вы должны организовывать свой код. Каталог .data - это просто место для любых файлов, которые обычно не устанавливаются в ``сайт-пакеты`` или в PYTHONPATH. Другими словами, вы можете продолжать использовать ``pkgutil.get_data(package, resource)``, даже если *эти* файлы обычно не будут распространяться в директории *wheel'а* ``.data``.
ta: உங்கள் குறியீட்டை எவ்வாறு ஒழுங்கமைக்க வேண்டும் என்பது குறித்து இந்த விவரக்குறிப்புக்கு ஒரு கருத்து இல்லை. .Data அடைவு என்பது பொதுவாக `` தள-பேக்கேச்கள்`` அல்லது பைதன்பாத்தில் நிறுவப்படாத எந்த கோப்புகளுக்கும் ஒரு இடம். வேறு வார்த்தைகளில் கூறுவதானால், நீங்கள் தொடர்ந்து `` pkgutil.get_data (தொகுப்பு, வளம்) `` அந்த * கோப்புகள் வழக்கமாக * சக்கரத்தின் * `` .data`` கோப்பகத்தில் விநியோகிக்கப்படாது என்றாலும் தொடர்ந்து பயன்படுத்தலாம்.

source: Why does wheel include attached signatures?
eo: Kial wheel inkluzivas alkroĉitajn subskribojn?
ja: なぜ wheel は添付された署名を持つのか？
pt_br: Por que o wheel inclui assinaturas anexadas?
ru: Почему колесо включает в себя прикрепленные подписи?
ta: வீல் ஏன் இணைக்கப்பட்ட கையொப்பங்களை உள்ளடக்கியது?

source: Attached signatures are more convenient than detached signatures because they travel with the archive. Since only the individual files are signed, the archive can be recompressed without invalidating the signature or individual files can be verified without having to download the whole archive.
eo: Alkroĉita subskribo estas pli oportuna ol nealkroĉita subskribo, ĉar ĝi moviĝas kune kun la arĥivo. Ĉar nur la individuaj dosieroj estas subskribitaj, la arĥivo estas redensigebla sen eksvalidigi la subskribon, kaj individuaj dosieroj estas kontroleblaj sen reelŝutado de la tuta arĥivo.
ja: 添付された署名は、アーカイブと一体のものとして転送されるので、分離署名よりも便利です。個々のファイルが署名されているだけなので、アーカイブを圧縮し直しても署名が無効にならず、また、アーカイブ全体をダウンロードしなくても個々のファイルの検証を行うことができます。
pt_br: Assinaturas anexadas são mais convenientes do que assinaturas separadas porque elas viajam com o arquivo. Uma vez que apenas os arquivos individuais são assinados, o arquivo pode ser recompactado sem invalidar a assinatura ou os arquivos individuais podem ser verificados sem ter que baixar todo o arquivo.
ru: Прикрепленные подписи более удобны, чем отсоединенные, поскольку они путешествуют вместе с архивом. Поскольку подписываются только отдельные файлы, архив можно перекомпрессировать, не аннулируя подпись, или проверить отдельные файлы без необходимости загружать весь архив.
ta: இணைக்கப்பட்ட கையொப்பங்கள் பிரிக்கப்பட்ட கையொப்பங்களை விட வசதியானவை, ஏனெனில் அவை காப்பகத்துடன் பயணிக்கின்றன. தனிப்பட்ட கோப்புகள் மட்டுமே கையொப்பமிடப்பட்டதால், கையொப்பத்தை செல்லாததாக்காமல் காப்பகத்தை மறுசீரமைக்க முடியும் அல்லது முழு காப்பகத்தையும் பதிவிறக்கம் செய்யாமல் தனிப்பட்ட கோப்புகளை சரிபார்க்க முடியும்.

source: Why does wheel allow JWS signatures?
eo: Kial wheel permesas JWS-subskribojn?
ja: なぜ wheel は JWS 署名を許容するのか？
pt_br: Por que wheel permite assinaturas JWS?
ru: Почему колесо разрешает подписи JWS?
ta: JWS கையொப்பங்களை சக்கரம் ஏன் அனுமதிக்கிறது?

source: The JOSE specifications of which JWS is a part are designed to be easy to implement, a feature that is also one of wheel's primary design goals. JWS yields a useful, concise pure-Python implementation.
eo: La normoj JOSE, de kiuj JWS estas parto, estas laŭfasone facile realigebla; tio estas ankaŭ unu el la fasonaj ĉefceloj de wheel. JWS ebligas utilan, mallongan pure Python-an realigon.
ja: JWS がその一部を構成する JOSE の仕様は実装を容易にするように設計されており、その性質は wheel の基本的な設計目標のひとつでもあります。 JWS は使いやすくて簡潔な純 Python の実装をもたらします。
pt_br: As especificações JOSE das quais o JWS faz parte foram projetadas para serem fáceis de implementar, um recurso que também é um dos principais objetivos do projeto da roda. O JWS produz uma implementação puro Python concisa e útil.
ru: Спецификации JOSE, частью которых является JWS, разработаны для простоты реализации, что также является одной из основных целей дизайна Wheel. JWS представляет собой полезную и лаконичную реализацию на чистом Python.
ta: சே.டபிள்யூ.எச் ஒரு பகுதியாக இருக்கும் சோச் விவரக்குறிப்புகள் நடைமுறைப்படுத்த எளிதானதாக வடிவமைக்கப்பட்டுள்ளன, இது சக்கரத்தின் முதன்மை வடிவமைப்பு இலக்குகளில் ஒன்றாகும். JWS ஒரு பயனுள்ள, சுருக்கமான தூய-பைதான் செயல்படுத்தலை அளிக்கிறது.

source: Why does wheel also allow S/MIME signatures?
eo: Kial wheel ankaŭ permesas S/MIME-subskribojn?
ja: なぜ wheel は S/MIME 署名をも許容するのか？
pt_br: Por que wheel também permite assinaturas S/MIME?
ru: Почему wheel также позволяет использовать подписи S/MIME?
ta: வீல் ஏன் எச்/மைம் கையொப்பங்களையும் அனுமதிக்கிறது?

source: S/MIME signatures are allowed for users who need or want to use existing public key infrastructure with wheel.
eo: S/MIME-subskribo estas permesata por tiuj uzantoj, kiuj devas aŭ volas uzi ekzistantan publikŝlosilan infrastrukturon kun wheel.
ja: S/MIME 署名は、既存の公開鍵基盤を wheel でも採用する必要があるか、または、採用したいユーザのために許容されています。
pt_br: Assinaturas S/MIME são permitidas para usuários que precisam ou querem usar uma infraestrutura de chaves públicas existente com o wheel.
ru: Подписи S/MIME разрешены для пользователей, которым необходимо или хочется использовать существующую инфраструктуру открытых ключей с помощью колеса.
ta: தற்போதுள்ள பொது விசை உள்கட்டமைப்பை சக்கரத்துடன் பயன்படுத்த விரும்பும் அல்லது பயன்படுத்த விரும்பும் பயனர்களுக்கு எச்/மைம் கையொப்பங்கள் அனுமதிக்கப்படுகின்றன.

source: Signed packages are only a basic building block in a secure package update system. Wheel only provides the building block.
eo: Subskribita pako estas nur baza briko de sekura pako-ĝisdatiga sistemo. Wheel nur provizas la bazan brikon.
ja: 署名されたパッケージは、セキュアなパッケージ更新システムを構成するひとつのビルディングブロックであるというだけのものです。 Wheel としては、単にビルディングブロックを提供するだけです。
pt_br: Pacotes assinados são apenas um bloco de construção básico em um sistema de atualização segura de pacotes. Wheel só fornece o bloco de construção.
ru: Подписанные пакеты являются лишь базовым элементом системы безопасного обновления пакетов. Wheel предоставляет только строительный блок.
ta: கையொப்பமிடப்பட்ட தொகுப்புகள் பாதுகாப்பான தொகுப்பு புதுப்பிப்பு அமைப்பில் ஒரு அடிப்படை கட்டுமானத் தொகுதி மட்டுமே. சக்கரம் கட்டுமானத் தொகுதியை மட்டுமே வழங்குகிறது.

source: What's the deal with "purelib" vs. "platlib"?
eo: Kio temas pri «purelib» kontraste kun «platlib»?
ja: "pure lib" と "plat lib" って、どう扱えばいいの？
pt_br: Qual é a diferença entre "purelib" e "platlib"?
ru: Как обстоят дела с "purelib" и "platlib"?
ta: "பியூரிலிப்" வெர்சச் "பிளாட்ட்லிப்" உடன் என்ன ஒப்பந்தம்?

source: Wheel preserves the "purelib" vs. "platlib" distinction, which is significant on some platforms. For example, Fedora installs pure Python packages to '/usr/lib/pythonX.Y/site-packages' and platform dependent packages to '/usr/lib64/pythonX.Y/site-packages'.
eo: Wheel konservas la distingon inter «purelib» kaj «platlib», kio gravas sur kelkaj platformoj. Ekzemple, Fedora instalas pure Python-ajn pakojn al «/usr/lib/pythonX.Y/site-packages» kaj platformo-dependajn pakojn al «/usr/lib64/pythonX.Y/site-packages».
ja: Wheel は "purelib" と "platlib" を区別して扱いますが、これらはプラットフォームによっては大きな違いがあります。例えば、 Fedora では純 Python のパッケージを '/usr/lib/pythonX.Y/site-packages' にインストールし、プラットフォームに依存しないパッケージを '/usr/lib64/pythonX.Y/site-packages' にインストールします。
pt_br: O Wheel preserva a distinção "purelib" vs. "platlib", que é significativa em algumas plataformas. Por exemplo, o Fedora instala pacotes puro Python em '/usr/lib/pythonX.Y/site-packages' e pacotes dependentes de plataforma em '/usr/lib64/pythonX.Y/site-packages'.
ru: Wheel сохраняет различие между "purelib" и "platlib", что важно для некоторых платформ. Например, Fedora устанавливает пакеты чистого Python в '/usr/lib/pythonX.Y/site-packages', а платформозависимые пакеты - в '/usr/lib64/pythonX.Y/site-packages'.
ta: சக்கரம் "பியூரிலிப்" எதிராக "பிளாட்ட்லிப்" வேறுபாட்டைப் பாதுகாக்கிறது, இது சில தளங்களில் குறிப்பிடத்தக்கதாகும். எடுத்துக்காட்டாக, ஃபெடோரா தூய பைதான் தொகுப்புகளை '/usr/lib/pythonx.y/site-packages' மற்றும் இயங்குதள சார்பு தொகுப்புகளை '/usr/lib64/pythonx.y/site-packages' க்கு நிறுவுகிறது.

source: A wheel with "Root-Is-Purelib: false" with all its files in ``{name}-{version}.data/purelib`` is equivalent to a wheel with "Root-Is-Purelib: true" with those same files in the root, and it is legal to have files in both the "purelib" and "platlib" categories.
eo: Wheel kun «``Root-Is-Purelib: false``», kies ĉiuj dosieroj troviĝas en ``{nomo}-{versio}.data/purelib``, ekvivalentas al wheel kun «``Root-Is-Purelib: true``» kun la samaj dosieroj en la radiko. Estas valide havi dosierojn en kaj «purelib» kaj «platlib».
ja: ``{name}-{version}.data/purelib`` 内の全てのファイルについて "Root-Is-Purelib: false" という設定になっている wheel ファイルは、同じファイルがルートディレクトリ内にあって "Root-Is-Purelib: true" になっている wheel ファイルと相同であり、 "purelib" と "platlib" の両カテゴリにファイル群が存在することには問題がありません。
pt_br: Um wheel com "Root-Is-Purelib: false" com todos os seus arquivos em ``{nome}-{versão}.data/purelib`` é equivalente a um wheel com "Root-Is-Purelib: true" com os mesmos arquivos na raiz, e é válido ter arquivos nas categorias "purelib" e "platlib".
ru: Колесо с "Root-Is-Purelib: false" со всеми своими файлами в ``{name}-{version}.data/purelib`` эквивалентно колесу с "Root-Is-Purelib: true" с теми же файлами в корне, и законно иметь файлы как в категории "purelib", так и в категории "platlib".
ta: `` {name}-{version} .data/purelib`` இல் அதன் அனைத்து கோப்புகளையும் கொண்ட "ரூட்-ஐச்-பூரலிப்: பொய்" கொண்ட ஒரு சக்கரம் "ரூட்-இச்-பூரலிப்: ட்ரூ" கொண்ட ஒரு சக்கரத்திற்கு சமம் ரூட்டில் உள்ள கோப்புகள், மற்றும் "பியூரிலிப்" மற்றும் "பிளாட்லிப்" வகைகளில் கோப்புகளை வைத்திருப்பது சட்டபூர்வமானது.

source: In practice a wheel should have only one of "purelib" or "platlib" depending on whether it is pure Python or not and those files should be at the root with the appropriate setting given for "Root-is-purelib".
eo: Praktike, wheel havu nur unu el ``purelib`` aŭ ``platlib``, depende de ĉu ĝi estas pure Python-a aŭ ne, kaj tiaj dosieroj estu ĉe la radiko kun taŭgaj agordoj pri ``Root-is-purelib``.
ja: 実際のところ、 wheel は、それが純 Python なのかそうでないのかによって "purelib" または "platlib" のいずれか一方しか持たず、 "Root-Is-purelib" を適切に設定しつつファイル群をルートディレクトリに置くべきです。
pt_br: Na prática, um wheel deve ter apenas um de "purelib" ou "platlib" dependendo se é puro Python ou não e esses arquivos devem estar na raiz com a configuração apropriada fornecida para "Root-is-purelib".
ru: На практике колесо должно иметь только один из "purelib" или "platlib" в зависимости от того, является ли оно чистым Python или нет, и эти файлы должны находиться в корне с соответствующей настройкой для "Root-is-purelib".
ta: நடைமுறையில் ஒரு சக்கரத்தில் அது தூய பைத்தான் இல்லையா என்பதைப் பொறுத்து "பியூரிலிப்" அல்லது "பிளாட்லிப்" ஒன்று மட்டுமே இருக்க வேண்டும், மேலும் அந்த கோப்புகள் "ரூட்-இச்-பூரெலிப்" க்கு வழங்கப்பட்ட பொருத்தமான அமைப்போடு வேரில் இருக்க வேண்டும்.

source: Is it possible to import Python code directly from a wheel file?
eo: Ĉu eblas importi Python-kodon rekte el wheel-dosiero?
ja: Python のソースコードを wheel ファイルから直接にインポートすることはできますか？
pt_br: É possível importar código Python diretamente de um arquivo wheel?
ru: Можно ли импортировать код Python непосредственно из файла wheel?
ta: சக்கர கோப்பிலிருந்து நேரடியாக பைதான் குறியீட்டை இறக்குமதி செய்ய முடியுமா?

source: Technically, due to the combination of supporting installation via simple extraction and using an archive format that is compatible with ``zipimport``, a subset of wheel files *do* support being placed directly on ``sys.path``. However, while this behaviour is a natural consequence of the format design, actually relying on it is generally discouraged.
ja: 技術的な話としては、単純に展開するだけでインストールできる機能と ``zipimport`` と互換性のあるアーカイブフォーマットの両方をサポートしているので、一部の wheel ファイルは ``sys.path`` に直接に置くことを *サポートしています* 。しかし、このような動作はフォーマット設計の自然な結果とはいうものの、実際にはこれに依存することは一般的には推奨されていません。
pt_br: Tecnicamente, devido à combinação de suporte de instalação via extração simples e usando um formato de arquivo compatível com ``zipimport``, um subconjunto de arquivos wheel oferece suporte a ser colocado diretamente no ``sys.path``. No entanto, embora esse comportamento seja uma consequência natural do design do formato, não é recomendável confiar nele.
ru: Технически, из-за сочетания поддержки установки через простое извлечение и использования формата архива, совместимого с ``zipimport``, подмножество файлов колеса *до* поддерживает размещение непосредственно в ```sys.path``. Однако, хотя такое поведение является естественным следствием дизайна формата, полагаться на него, как правило, не рекомендуется.
ta: தொழில்நுட்ப ரீதியாக, எளிய பிரித்தெடுத்தல் வழியாக துணை நிறுவலின் கலவையின் காரணமாகவும், `` சிபிமோர்ட்`` உடன் இணக்கமான காப்பக வடிவமைப்பைப் பயன்படுத்துவதன் மூலமும், சக்கரக் கோப்புகளின் துணைக்குழு * ஆதரவை நேரடியாக `` sys.path`` இல் வைக்கவும். இருப்பினும், இந்த நடத்தை வடிவமைப்பு வடிவமைப்பின் இயல்பான விளைவு என்றாலும், உண்மையில் அதை நம்பியிருப்பது பொதுவாக ஊக்கமளிக்கிறது.

source: Firstly, wheel *is* designed primarily as a distribution format, so skipping the installation step also means deliberately avoiding any reliance on features that assume full installation (such as being able to use standard tools like ``pip`` and ``virtualenv`` to capture and manage dependencies in a way that can be properly tracked for auditing and security update purposes, or integrating fully with the standard build machinery for C extensions by publishing header files in the appropriate place).
eo: Unue, wheel *estas* fasonita ĉefe kiel distribua dosierformo; tial, preterpasi la instaladon ankaŭ implicas intence eviti dependi de funkcioj supozantaj plenan instalon (inkluzive de la kapablo uzi normajn ilojn kiel ``pip`` kaj ``virtualenv`` por registri kaj administri dependecojn spureble por reviziado kaj sekurigo, aŭ plena integrado kun la norma konstrumeĥanismo de C-etendaĵo per ĉapdosieroj en konvena loko).
ja: 第一に、wheel は一義的に配布物のフォーマットとして *設計されている* ので、インストールの段階を省略するということは、完全なインストールがなされているものと仮定している機能 (例えば、正当性監査やセキュリティアップデートのために正しく追跡することができるひとつの方法であるところの ``pip`` や ``virtualenv`` のような標準ツールを使った依存関係の捕捉や管理の機能、あるいは、ヘッダファイルを適切な場所に公開することによって C 言語拡張をビルドする標準的な機構を完全に統合する機能) への信頼を故意に避けることになります。
pt_br: Em primeiro lugar, o wheel *é* projetado principalmente como um formato de distribuição, então pular a etapa de instalação também significa evitar deliberadamente qualquer dependência de recursos que pressupõem a instalação completa (como ser capaz de usar ferramentas padrão como ``pip`` e ``virtualenv`` para capturar e gerenciar dependências de uma forma que possam ser devidamente rastreadas para fins de auditoria e atualização de segurança, ou integração completa com o maquinário de construção padrão para extensões C, publicando arquivos de cabeçalho no local apropriado).
ru: Во-первых, wheel *is* разработан в первую очередь как формат дистрибутива, поэтому пропуск шага установки также означает намеренный отказ от использования функций, предполагающих полную установку (например, возможность использовать стандартные инструменты вроде ``pip`` и ``virtualenv`` для захвата и управления зависимостями таким образом, чтобы их можно было правильно отслеживать для целей аудита и обновления безопасности, или полная интеграция со стандартным механизмом сборки для C-расширений путем публикации заголовочных файлов в соответствующем месте).
ta: முதலாவதாக, வீல் * முதன்மையாக ஒரு விநியோக வடிவமாக வடிவமைக்கப்பட்டுள்ளது, எனவே நிறுவல் படியைத் தவிர்ப்பது என்பது முழு நிறுவலைக் கருதும் அம்சங்களை நம்பியிருப்பதை வேண்டுமென்றே தவிர்ப்பது (`` பிப்` மற்றும் `` மெய்நிகர்என்.வி` போன்ற நிலையான கருவிகளைப் பயன்படுத்துவது போன்றவை `தணிக்கை மற்றும் பாதுகாப்பு புதுப்பிப்பு நோக்கங்களுக்காக சரியாகக் கண்காணிக்கக்கூடிய வகையில் சார்புகளை கைப்பற்றி நிர்வகிப்பது அல்லது வெளியீட்டின் மூலம் சி நீட்டிப்புகளுக்கான நிலையான உருவாக்க இயந்திரங்களுடன் முழுமையாக ஒருங்கிணைத்தல் தலைப்பு கோப்புகள் பொருத்தமான இடத்தில்).
