Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Due to the way most Linux distributions are handling the Python 3 migration, Linux users using the system Python without creating a virtual environment first should replace the ``python`` command in this tutorial with ``python3`` and the ``python -m pip`` command with ``python3 -m pip --user``. Do *not* run any of the commands in this tutorial with ``sudo``: if you get a permissions error, come back to the section on creating virtual environments, set one up, and then continue with the tutorial as written.
eo: Pro la maniero, kiel multaj Linux-distribuoj pritraktas la migradon al Python 3, uzanto de Linux uzanta la sisteman Python-on sen virtuala medio unue devas anstataŭigi la komandon ``python`` en ĉi tiu lernilo per ``python3`` kaj la komandon ``python -m pip`` per ``python3 -m pip --user``. *Ne* rulu ajnan komandon en ĉi tiu lernilo kun ``sudo``: se vi ricevas eraron pri permesoj, reiru al la paragrafo pri kreado de virtuala medio, kreu virtualan medion, kaj daŭru sekvante la lernilon laŭvorte.
ja: ほとんどの Linux ディストロが Python 3 の移植を扱う方法のせいで、仮想環境を作ること抜きでシステム側の Python を使う Linux ユーザは、まず、このチュートリアルに出てくる ``python`` コマンドを ``python3`` に、そして、 ``python -m pip`` コマンドを ``python3 -m pip --user`` に置換するべきです。このチュートリアルに出てくるコマンドを ``sudo`` 付きで実行することは *やめてください*: パーミッションエラーが発生する場合には、仮想環境の作成の節に戻って仮想環境を作成し、チュートリアルに書かれている通りのやり方で再開してください。
pt_br: Devido à forma como a maioria das distribuições Linux está lidando com a migração Python 3, os usuários Linux usando o sistema Python sem criar um ambiente virtual primeiro devem substituir o comando ``python`` neste tutorial por ``python3`` e o comando ``python -m pip`` com ``python3 -m pip --user``. *Não* execute nenhum dos comandos neste tutorial com ``sudo``: se você receber um erro de permissão, volte para a seção sobre como criar ambientes virtuais, configure um e então continue com o tutorial como escrito.
ru: В связи с тем, что большинство дистрибутивов Linux работают с миграцией Python 3, пользователям Linux, использующим системный Python без создания виртуальной среды, следует заменить команду ``python`` в этом руководстве на ``python3``, а команду ``python -m pip`` на ``python3 -m pip --user``. Не запускайте ни одну из команд в этом руководстве с ``sudo`: если вы получите ошибку разрешения, вернитесь к разделу о создании виртуальных сред, настройте их, а затем продолжите руководство, как написано.
ta: பெரும்பாலான லினக்ச் விநியோகங்கள் பைதான் 3 இடம்பெயர்வுகளைக் கையாளும் விதம் காரணமாக, முதலில் ஒரு மெய்நிகர் சூழலை உருவாக்காமல் கணினி பைத்தானைப் பயன்படுத்தும் லினக்ச் பயனர்கள் இந்த டுடோரியலில் `` பைதான்`` கட்டளையை `` பைதான் 3`` மற்றும் `` பைதான் -எம் பிப்` கட்டளை `` பைட்டான் 3. இந்த டுடோரியலில் உள்ள எந்தவொரு கட்டளைகளையும் `` sudo`` உடன் இயக்க வேண்டாம்: உங்களுக்கு இசைவு பிழை ஏற்பட்டால், மெய்நிகர் சூழல்களை உருவாக்குவது குறித்த பகுதிக்கு திரும்பி வந்து, ஒன்றை அமைத்து, பின்னர் எழுதப்பட்ட டுடோரியலுடன் தொடரவும்.

source: Ensure you can run pip from the command line
eo: Certigu, ke vi povas ruli pip ĉe la komandlinio
ja: コマンドラインから pip を実行できることを確実にする
pt_br: Certifique-se de que você pode executar o pip a partir da linha de comando
ru: Убедитесь, что вы можете запустить pip из командной строки
ta: கட்டளை வரியிலிருந்து நீங்கள் PIP ஐ இயக்க முடியும் என்பதை உறுதிப்படுத்தவும்

source: Additionally, you'll need to make sure you have :ref:`pip` available. You can check this by running:
eo: Krome, vi devas certigi, ke :ref:`pip` estas disponebla. Vi povas kontroli tion rulante la jenon:
ja: さらに、 :ref:`pip` コマンドを実行できることを確認しておきましょう。次のコマンドで確認できます:
pt_br: Além disso, você precisa ter certeza de ter :ref:`pip` disponível. Você pode verificar isso executando:
ru: Кроме того, вам нужно убедиться, что у вас доступен :ref:`pip`. Вы можете проверить это, выполнив команду:
ta: கூடுதலாக, உங்களிடம் இருப்பதை உறுதி செய்ய வேண்டும்: குறிப்பு: `பிப்` கிடைக்கிறது. இயங்குவதன் மூலம் இதை நீங்கள் சரிபார்க்கலாம்:

source: If you installed Python from source, with an installer from `python.org`_, or via `Homebrew`_ you should already have pip. If you're on Linux and installed using your OS package manager, you may have to install pip separately, see :doc:`/guides/installing-using-linux-tools`.
eo: Se vi instalis Python el fontkodo, per instalilo el `python.org`_, aŭ per `Homebrew`_, vi jam havas pip. Se vi uzas Linux kaj instalis Python per via mastrumasistema pakadministrilo, vi eble bezonas aparte instali pip laŭ :doc:`/guides/installing-using-linux-tools`.
ja: `python.org`_ から持ってきたインストーラや `Homebrew`_ を使って Python をソースコードからインストールしたのであれば、すでに pip が動作するはずです。 Linux 上で OS のパッケージ管理機構を使ってインストールしたのであれば、 pip を個別にインストールしなければならないかもしれませんが、この場合は :doc:`/guides/installing-using-linux-tools` を見てください。
pt_br: Se você instalou Python a partir do código-fonte, com um instalador de `python.org`_, ou via `Homebrew`_, você já deve ter o pip. Se você estiver no Linux e instalado usando o gerenciador de pacotes do sistema operacional, pode ser necessário instalar o pip separadamente, consulte :doc:`/guides/installing-using-linux-tools`.
ru: Если вы установили Python из исходников, с помощью инсталлятора с сайта `python.org`_ или через `Homebrew`_, у вас уже должен быть pip. Если вы работаете в Linux и устанавливали с помощью менеджера пакетов вашей ОС, вам, возможно, придется установить pip отдельно, см. :doc:`/guides/installing-using-linux-tools`.
ta: நீங்கள் மூலத்திலிருந்து பைத்தானை நிறுவியிருந்தால், `python.org`_ இலிருந்து ஒரு நிறுவியுடன் அல்லது` ஓம் ப்ரூ`_ வழியாக உங்களிடம் ஏற்கனவே பிப் இருக்க வேண்டும். நீங்கள் லினக்சில் இருந்தால், உங்கள் OS தொகுப்பு மேலாளரைப் பயன்படுத்தி நிறுவப்பட்டிருந்தால், நீங்கள் PIP ஐ தனித்தனியாக நிறுவ வேண்டியிருக்கும், பார்க்க: DOC: `/வழிகாட்டிகள்/நிறுவுதல்-பயன்படுத்தும்-லினக்ச்-கருவிகளை நிறுவுதல்.

source: If ``pip`` isn't already installed, then first try to bootstrap it from the standard library:
eo: Se ``pip`` ankoraŭ ne estas instalita, do unue provu estigi ĝin per la norma biblioteko:
ja: まだ ``pip`` がインストールされていなければ、初回は標準ライブラリからブートストラップしてみてください:
pt_br: Se o ``pip`` ainda não estiver instalado, tente primeiro inicializá-lo a partir da biblioteca padrão:
ru: Если ``pip`` еще не установлен, то сначала попробуйте загрузить его из стандартной библиотеки:
ta: `` பிப்`` ஏற்கனவே நிறுவப்படவில்லை என்றால், முதலில் அதை நிலையான நூலகத்திலிருந்து தொடக்கவார் செய்ய முயற்சிக்கவும்:

source: If that still doesn't allow you to run ``python -m pip``:
eo: Se tio ankoraŭ ne ebligas ruli ``python -m pip``:
ja: それでもまだ ``python -m pip`` を実行できないのであれば:
pt_br: Se isso ainda não permitir que você execute ``python -m pip``:
ru: Если это все еще не позволяет, запустите ``python -m pip``:
ta: `` பைதான் -எம் பிப்`` ஐ இயக்க இன்னும் உங்களை அனுமதிக்கவில்லை என்றால்:

source: Securely Download `get-pip.py <https://bootstrap.pypa.io/get-pip.py>`_ [1]_
eo: Sekure elŝutu `get-pip.py <https://bootstrap.pypa.io/get-pip.py>`_ [1]_
ja: `get-pip.py <https://bootstrap.pypa.io/get-pip.py>`_ [1]_ をセキュアにダウンロードする
pt_br: Baixe com segurança `get-pip.py <https://bootstrap.pypa.io/get-pip.py>`_ [1]_
ru: Безопасная загрузка `get-pip.py <https://bootstrap.pypa.io/get-pip.py>`_ [1]_
ta: பாதுகாப்பாக பதிவிறக்குங்கள்

source: Run ``python get-pip.py``. [2]_ This will install or upgrade pip. Additionally, it will install :ref:`setuptools` and :ref:`wheel` if they're not installed already.
eo: Rulu ``python get-pip.py``. [2]_ Tio instalos aŭ ĝisdatigos pip. Krome, ĝi instalos :ref:`setuptools` kaj :ref:`wheel`, se tiuj ne estas jam instalitaj.
ja: ``python get-pip.py`` を実行してください [2]_ 。これで pip をインストールまたは更新することができます。さらに、まだインストールされていなければ、 :ref:`setuptools` と :ref:`wheel` もインストールされるでしょう。
pt_br: Execute ``python get-pip.py``. [2]_ Isso vai instalar ou atualizar o pip. Adicionalmente, vai instalar :ref:`setuptools` e :ref:`wheel` se ainda não estiverem instalados.
ru: Запустите ``python get-pip.py``. [2]_ Это приведет к установке или обновлению pip. Кроме того, будут установлены :ref:`setuptools` и :ref:`wheel`, если они еще не установлены.
ta: `` பைதான் get-pip.py`` ஐ இயக்கவும். [2] _ இது PIP ஐ நிறுவும் அல்லது மேம்படுத்தும். கூடுதலாக, இது நிறுவப்படும்: Ref: `setuptools` மற்றும்: ref:` சக்கரம்` அவை ஏற்கனவே நிறுவப்படவில்லை என்றால்.

source: Be cautious if you're using a Python install that's managed by your operating system or another package manager. get-pip.py does not coordinate with those tools, and may leave your system in an inconsistent state. You can use ``python get-pip.py --prefix=/usr/local/`` to install in ``/usr/local`` which is designed for locally-installed software.
ja: オペレーティングシステムないし他のパッケージ管理機構を使ってインストールした Python を管理しているなら、用心深くあるべきです。 get-pip.py はそのようなツール群と協調して動作する訳ではないので、あなたのシステムの一貫性を破壊するかもしれません。ソフトウェアをローカルにインストールするために設計された ``/usr/local`` にインストールするなら ``python get-pip.py --prefix=/usr/local`` を使うことができます。
pt_br: Tenha cuidado se estiver usando uma instalação do Python gerenciada por seu sistema operacional ou outro gerenciador de pacotes. get-pip.py não coordena com essas ferramentas e pode deixar seu sistema em um estado inconsistente. Você pode usar ``python get-pip.py --prefix=/usr/local/`` para instalar em ``/usr/local`` que é projetado para software instalado localmente.
ru: Будьте осторожны, если вы используете установку Python, управляемую операционной системой или другим менеджером пакетов. get-pip.py не координируется с этими инструментами и может оставить вашу систему в несовместимом состоянии. Вы можете использовать ``python get-pip.py --prefix=/usr/local/`` для установки в ``/usr/local``, который предназначен для локально установленного программного обеспечения.
ta: உங்கள் இயக்க முறைமை அல்லது மற்றொரு தொகுப்பு மேலாளரால் நிர்வகிக்கப்படும் பைதான் நிறுவலைப் பயன்படுத்துகிறீர்கள் என்றால் எச்சரிக்கையாக இருங்கள். get-pip.py அந்த கருவிகளுடன் ஒருங்கிணைக்காது, மேலும் உங்கள் கணினியை சீரற்ற நிலையில் விட்டுவிடக்கூடும். உள்நாட்டில் நிறுவப்பட்ட மென்பொருளுக்காக வடிவமைக்கப்பட்ட ``/usr/local`` இல் நிறுவ `` பைதான் get-pip.py-/USR/`` ஆகியவற்றைப் பயன்படுத்தலாம்.

source: Ensure pip, setuptools, and wheel are up to date
eo: Certigu, ke pip, setuptools kaj wheel estas ĝisdataj
ja: pip ・ setuptools ・ wheel が最新版であることを確実にする
pt_br: Certifique-se que pip, setuptools e wheel estejam atualizados
ru: Убедитесь, что pip, setuptools и wheel находятся в актуальном состоянии
ta: பிப், செட்டுப்டூல்கள் மற்றும் சக்கரம் புதுப்பித்த நிலையில் இருப்பதை உறுதிசெய்க

source: While ``pip`` alone is sufficient to install from pre-built binary archives, up to date copies of the ``setuptools`` and ``wheel`` projects are useful to ensure you can also install from source archives:
eo: Dum ``pip`` sole sufiĉas por instali el antaŭkonstruita duuma arĥivo, ĝisdataj kopioj de la projektoj ``setuptools`` kaj ``wheel`` utilas por instali el fonta arĥivo:
ja: ``pip`` 単体でも事前にビルドされたバイナリアーカイブからインストールを行うには十分ですが、最新の ``setuptools`` と ``wheel`` があればソースコードアーカイブからでも確実にインストールすることができるので便利です:
pt_br: Embora ``pip`` sozinho seja suficiente para instalar a partir de arquivos binários pré-compilados, cópias atualizadas dos projetos ``setuptools`` e ``wheel`` são úteis para garantir que você também possa instalar a partir de arquivos fonte:
ru: Хотя одного ``pip`` достаточно для установки из предварительно собранных бинарных архивов, актуальные копии проектов ``setuptools`` и ``wheel`` полезны для обеспечения возможности установки из исходных архивов:
ta: முன்பே கட்டப்பட்ட பைனரி காப்பகங்களிலிருந்து நிறுவுவதற்கு `` பிப்`` மட்டும் போதுமானது என்றாலும், `` செடிப்டூல்ச்`` மற்றும் `` வீல்`` திட்டங்களின் புதுப்பித்த நகல்கள் மூல காப்பகங்களிலிருந்து நிறுவ முடியும் என்பதை உறுதிப்படுத்த பயனுள்ளதாக இருக்கும்:

source: Optionally, create a virtual environment
eo: Nedevige, kreu virtualan medion
ja: 必須ではないが、仮想環境を構築する
pt_br: Opcionalmente, crie um ambiente virtual
ru: По желанию создайте виртуальную среду
ta: விருப்பமாக, மெய்நிகர் சூழலை உருவாக்கவும்

source: See :ref:`section below <Creating and using Virtual Environments>` for details, but here's the basic :doc:`venv <python:library/venv>` [3]_ command to use on a typical Linux system:
eo: Vidu :ref:`la ĉi-suban paragrafon <Creating and using Virtual Environments>` por detaloj, sed jen la baza komando de :doc:`venv <python:library/venv>` [3]_ por tipa Linux-sistemo:
ja: 詳しいことは、 :ref:`下の節 <Creating and using Virtual Environments>` に出ていますので、ここでは基本的な :doc:`venv <python:library/venv>` [3]_ コマンドを典型的な Linux システムで使うやり方を説明します:
pt_br: Veja a :ref:`seção abaixo <Creating and using Virtual Environments>` para detalhes, mas aqui está o comando básico de :doc:`venv <python:library/venv>` [3]_ para usar em um sistema Linux típico:
ru: Подробности см. в :ref:`разделе ниже <Создание и использование виртуальных сред>`, а вот основная :doc:`venv <python:library/venv>` [3]_ команда для использования в типичной системе Linux:
ta: காண்க: குறிப்பு: `கீழே உள்ள பிரிவு <மெய்நிகர் சூழல்களை உருவாக்குதல் மற்றும் பயன்படுத்துதல்>` விவரங்களுக்கு, ஆனால் இங்கே அடிப்படை: ஆவணம்: `வெவி <பைதான்: நூலகம்/வென்வ்>` [3] _ ஒரு பொதுவான லினக்ச் கணினியில் பயன்படுத்த கட்டளை:

source: This will create a new virtual environment in the ``tutorial_env`` subdirectory, and configure the current shell to use it as the default ``python`` environment.
eo: Tio kreos novan virtualan medion en la subdosierujo ``tutorial_env`` kaj igas la aktualan ŝelon uzi ĝin kiel la implicitan ``python``-medion.
ja: これで新しい仮想環境が ``tutorial_env`` サブディレクトリ内に生成され、それを現在のシェルのデフォルトの ``python`` 環境として使わせることができます。
pt_br: Isso criará um novo ambiente virtual no subdiretório ``tutorial_env`` e configurará o shell atual para usá-lo como o ambiente ``python`` padrão.
ru: Это создаст новое виртуальное окружение в подкаталоге ``tutorial_env`` и настроит текущую оболочку на использование его в качестве окружения по умолчанию ``python``.
ta: இது `` டுடோரியல்_என்வ்`` துணை அடைவில் ஒரு புதிய மெய்நிகர் சூழலை உருவாக்கும், மேலும் தற்போதைய செல்லை இயல்புநிலை `` பைதான்`` சூழலாகப் பயன்படுத்தவும்.

source: Creating Virtual Environments
eo: Krei Virtualajn Mediojn
ja: 仮想環境を構築する
pt_br: Criando ambientes virtuais
ru: Создание виртуальных окружений
ta: மெய்நிகர் சூழல்களை உருவாக்குதல்

source: Python "Virtual Environments" allow Python :term:`packages <Distribution Package>` to be installed in an isolated location for a particular application, rather than being installed globally. If you are looking to safely install global command line tools, see :doc:`/guides/installing-stand-alone-command-line-tools`.
eo: «Virtuala Medio» de Python permesas instaladon de :term:`Python-pako <Distribution Package>` en izolita loko por iu programo, ne instalita malloke. Se vi volas sekure instali komandlinian ilon, vidu :doc:`/guides/installing-stand-alone-command-line-tools`.
ja: Python の "仮想環境" を使えば、 Python の :term:`パッケージ <Distribution Package>` をグローバルな環境にインストールする代わりに、特定のアプリケーションのための隔離された場所にインストールすることができます。グローバルなコマンドラインツールを安全にインストールしたいのであれば、 :doc:`/guides/installing-stand-aline-command-line-tools` を見てください。
pt_br: "Ambientes virtuais" do Python permitem que :term:`pacotes <Pacote de Distribuição>` Python sejam instalados em um local isolado para uma aplicação em particular, ao invés de serem instalados globalmente. Se você deseja instalar ferramentas de linha de comando globais com segurança, consulte :doc:`/guides/installing-stand-alone-command-line-tools`.
ru: Виртуальные среды Python позволяют устанавливать Python :term:`packages <Distribution Package>` в изолированное место для конкретного приложения, а не устанавливать глобально. Если вы хотите безопасно установить глобальные инструменты командной строки, смотрите :doc:`/guides/installing-stand-alone-command-line-tools`.
ta: பைதான் "மெய்நிகர் சூழல்கள்" பைதானை அனுமதிக்கின்றன: கால: `தொகுப்புகள் <விநியோக தொகுப்பு>` உலகளவில் நிறுவப்படுவதை விட, ஒரு குறிப்பிட்ட பயன்பாட்டிற்கான தனிமைப்படுத்தப்பட்ட இடத்தில் நிறுவப்பட வேண்டும். உலகளாவிய கட்டளை வரி கருவிகளை பாதுகாப்பாக நிறுவ நீங்கள் விரும்பினால், காண்க: DOC: `/வழிகாட்டிகள்/நிறுவுதல்-தனித்த-கட்டளை-கோட்டுகளை நிறுவுதல்.

source: Imagine you have an application that needs version 1 of LibFoo, but another application requires version 2. How can you use both these applications? If you install everything into /usr/lib/python3.6/site-packages (or whatever your platform’s standard location is), it’s easy to end up in a situation where you unintentionally upgrade an application that shouldn’t be upgraded.
eo: Supozu, ke oni havas programon bezonantan version 1 de LibFoo, sed alia programo bezonas version 2. Kiel oni povas uzi ambaŭ programojn? Se oni instalus ĉion en /usr/lib/python3.6/site-packages (aŭ la norma loko por onia platformo), oni ofte senintence ĝisdatigus programon ne ĝisdatindan.
ja: 手持ちのあるアプリケーションには LibFoo のバージョン 1 が必要で、しかし、別のアプリケーションではバージョン 2 を要求していると想像してみてください。このようなアプリケーションを両方同時に使うためにはどうすれば良いでしょうか？あらゆるものを /usr/lib/python3.6/site-packages (または、あなたが使っているプラットフォームの標準的な置き場所ならどこでも) にインストールするとすれば、容易く、アップグレードするべきでないはずのアプリケーションを意図せずアップグレードしてしまう結果に終わるでしょう。
pt_br: Imagine que você tenha uma aplicação que precisa da versão 1 do LibFoo, mas outra aplicação requer a versão 2. Como você pode usar essas duas aplicações? Se você instalar tudo em /usr/lib/python3.6/site-packages (ou qualquer que seja o local padrão de sua plataforma), é fácil acabar em uma situação em que você atualiza acidentalmente uma aplicação que não deveria ser atualizada.
ru: Представьте, что у вас есть приложение, которому нужна версия 1 LibFoo, а другому приложению требуется версия 2. Как вы можете использовать оба этих приложения? Если вы установите все в /usr/lib/python3.6/site-packages (или в любое другое стандартное место вашей платформы), легко попасть в ситуацию, когда вы непреднамеренно обновите приложение, которое не должно быть обновлено.
ta: லிப்ஃபூவின் பதிப்பு 1 தேவைப்படும் பயன்பாடு உங்களிடம் இருப்பதாக கற்பனை செய்து பாருங்கள், ஆனால் மற்றொரு பயன்பாட்டிற்கு பதிப்பு தேவைப்படுகிறது. இந்த இரண்டு பயன்பாடுகளையும் நீங்கள் எவ்வாறு பயன்படுத்தலாம்? எல்லாவற்றையும் /usr/lib/python3.6/site-pagages (அல்லது உங்கள் தளத்தின் நிலையான இருப்பிடம் எதுவாக இருந்தாலும்) நிறுவினால், மேம்படுத்தப்படாத ஒரு பயன்பாட்டை நீங்கள் தற்செயலாக மேம்படுத்தும் சூழ்நிலையில் முடிவடைவது எளிது.

source: Or more generally, what if you want to install an application and leave it be? If an application works, any change in its libraries or the versions of those libraries can break the application.
eo: Aŭ pli ĝenerale, kio se oni volas instali programon kaj ne ŝanĝi ĝin? Se programo funkcias, ajna ŝanĝo de ĝiaj bibliotekoj aŭ de la bibliotekaj versioj povas misfunkciigi la programon.
ja: あるいは、もっと一般的には、あるアプリケーションをインストールして、そのままにしておきたいとすればどうでしょう？アプリケーションが動作したとしても、ライブラリへの何らかの変更や、ライブラリのバージョン問題でアプリケーションが動作しなくなってしまうかもしれません。
pt_br: Ou, de forma mais geral, e se você quiser instalar uma aplicação e deixá-la como está? Se uma aplicação funcionar, qualquer alteração em suas bibliotecas ou nas versões dessas bibliotecas pode interromper a aplicação.
ru: А если вы хотите установить приложение и не трогать его? Если приложение работает, любое изменение в его библиотеках или их версиях может привести к поломке приложения.
ta: அல்லது பொதுவாக, நீங்கள் ஒரு பயன்பாட்டை நிறுவி அதை விட்டுவிட விரும்பினால் என்ன செய்வது? ஒரு பயன்பாடு செயல்பட்டால், அதன் நூலகங்களில் ஏதேனும் மாற்றம் அல்லது அந்த நூலகங்களின் பதிப்புகள் பயன்பாட்டை உடைக்கலாம்.

source: Also, what if you can’t install :term:`packages <Distribution Package>` into the global site-packages directory? For instance, on a shared host.
eo: Ankaŭ, kio okazos, se oni ne povas instali :term:`pakon <Distribution Package>` en la tutsisteman dosierujon ``site-packages``? Ekzemple, je komuna gastiganto.
ja: あるいは、グローバルな site-packages ディレクトリに :term:`パッケージ <Distribution Package>` をインストールすることができないとしたら、どうでしょうか？例えば、共有ホストのような。
pt_br: Além disso, e se você não puder instalar :term:`pacotes <Pacote de Distribuição>` no diretório global site-packages? Por exemplo, em um host compartilhado.
ru: Кроме того, что делать, если вы не можете установить :term:`packages <Distribution Package>` в глобальный каталог site-packages? Например, на общем хосте.
ta: மேலும், நீங்கள் நிறுவ முடியாவிட்டால்: கால: `தொகுப்புகள் <விநியோக தொகுப்பு>` உலகளாவிய தள-பேக்கேச்கள் கோப்பகத்தில் என்ன செய்வது? உதாரணமாக, பகிரப்பட்ட ஓச்டில்.

source: In all these cases, virtual environments can help you. They have their own installation directories and they don’t share libraries with other virtual environments.
eo: En tiuj kazoj, virtuala medio povas helpi vin. Ĝi havas sian propran instalan dosierujon kaj ne havas bibliotekon komunan kun aliaj virtualaj medioj.
ja: このようなすべての場合において、仮想環境はあなたを助けることができます。仮想環境にはそれぞれのインストール先ディレクトリが別にあって、他の仮想環境とライブラリを共有するということがないからです。
pt_br: Em todos esses casos, os ambientes virtuais podem lhe ajudar. Eles têm seus próprios diretórios de instalação e não compartilham bibliotecas com outros ambientes virtuais.
ru: Во всех этих случаях вам могут помочь виртуальные среды. У них есть собственные каталоги установки, и они не обмениваются библиотеками с другими виртуальными средами.
ta: இந்த எல்லா சந்தர்ப்பங்களிலும், மெய்நிகர் சூழல்கள் உங்களுக்கு உதவக்கூடும். அவை அவற்றின் சொந்த நிறுவல் கோப்பகங்களைக் கொண்டுள்ளன, மேலும் அவை பிற மெய்நிகர் சூழல்களுடன் நூலகங்களைப் பகிர்ந்து கொள்ளாது.

source: Currently, there are two common tools for creating Python virtual environments:
eo: Aktuale ekzistas du oftaj iloj por krei virtualajn Python-mediojn:
ja: 現在、ふたつの Python 仮想環境を構築するためのツールがよく知られています:
pt_br: Atualmente, existem duas ferramentas comuns para a criação de ambientes virtuais Python:
ru: В настоящее время существует два распространенных инструмента для создания виртуальных сред Python:
ta: தற்போது, பைதான் மெய்நிகர் சூழல்களை உருவாக்க இரண்டு பொதுவான கருவிகள் உள்ளன:

source: :doc:`venv <python:library/venv>` is available by default in Python 3.3 and later, and installs :ref:`pip` into created virtual environments in Python 3.4 and later (Python versions prior to 3.12 also installed :ref:`setuptools`).
eo: :doc:`venv <python:library/venv>` estas apriore disponebla en Python 3.3 kaj pli novaj, kaj instalas :ref:`pip` en la kreitan virtualan medion en Python 3.4 kaj pli novaj (versioj de Python antaŭ 3.12 ankaŭ instalis :ref:`setuptools`).
ja: :doc:`venv <python:library/venv>` は、 Python 3.3 およびそれ以降のバージョンで本体に同梱されていて利用可能であり、 Python 3.4 およびそれ以降では :ref:`pip` と :ref:`setuptools` を作成された仮想環境内にインストールします (3.12 以前の Python のバージョンは :ref:`setuptools` もインストールしていました) 。
ru: : док:`venv <python: библиотека/venv>` доступен по умолчанию в Python 3.3 и выше, и устанавливает : ссылка:`pip` в созданные виртуальные среды в Python 3.4 и выше (версии Python до 3.12 также устанавливали :ссылка:`setuptools`).
ta: :doc:`venv <python:library/venv>` is available by இயல்புநிலை in பைதான் 3.3 and later, and installs :ref:`pip` into உருவாக்கப்பட்டது virtual environments in பைதான் 3.4 and later (Python versions prior பெறுநர் 3.12 also installed :ref:`setuptools`).

source: The basic usage is like so:
eo: Jen la baza uzmaniero:
ja: 基本的な使い方は次の通りです:
pt_br: O uso básico é assim:
ru: Основное использование выглядит следующим образом:
ta: அடிப்படை பயன்பாடு அவ்வாறு உள்ளது:

source: Using :doc:`venv <python:library/venv>`:
eo: Uzi :doc:`venv <python:library/venv>`:
ja: :doc:`venv <python:library/venv>` を使うと:
pt_br: Usando :doc:`venv <python:library/venv>`:
ru: Использование :doc:`venv <python:library/venv>`:
ta: பயன்படுத்துதல்: DOC: `vev <python: நூலகம்/வென்வ்>`:

source: Using :ref:`virtualenv`:
eo: Uzi :ref:`virtualenv`:
ja: :ref:`virtualenv` を使うと:
pt_br: Usando :ref:`virtualenv`:
ru: Использование :ref:`virtualenv`:
ta: பயன்படுத்துதல்: ref: `Virtualenv`:
