Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The version string can be hard-coded into the source code -- either in a special purpose file, such as :file:`_version.txt` (which must then be shipped as part of the project's source distribution package), or as an attribute in a particular module, such as :file:`__init__.py`. The build system can then extract it from the runtime location at build time.
eo: La versio povas esti rekte metita en la fontkodon – aŭ en specialcelan dosieron kiel :file:`_version.txt` (kiu devas esti parto de la fonta distribua pako de la projekto) aŭ kiel atributo en modulo kiel :file:`__init__.py`. Do la konstrua sistemo povas eltiri ĝin el la rultempa loko ĉe konstrua tempo.
ja: バージョン番号の文字列をソースコードの中にハードコードすることもできます -- :file:`_version.txt` のような特別な目的のファイル (これはプロジェクトのソースコード配布物 (パッケージ) の一部として同梱されなければなりません) の中に置くか、あるいは、 :file:`__init__.py` のような特定のモジュールの中のアトリビュートとして置くかです。ビルドシステムは、ビルド時にランタイムの場所からそれを取り出すことができます。
ru: Строка версии может быть жестко закодирована в исходном коде - либо в специальном файле, таком как :file:`_version.txt` (который затем должен поставляться как часть пакета распространения исходного кода проекта), либо как атрибут в определенном модуле, таком как :file:`__init__.py`. Тогда система сборки может извлечь его из места выполнения во время сборки.
ta: பதிப்பு சரம் மூலக் குறியீட்டில் கடினமாக குறியிடப்படலாம்-ஒரு சிறப்பு நோக்கக் கோப்பில், போன்றவை: கோப்பு: `_version.txt` (பின்னர் திட்டத்தின் மூல விநியோக தொகுப்பின் ஒரு பகுதியாக அனுப்பப்பட வேண்டும்), அல்லது ஒரு ஒரு குறிப்பிட்ட தொகுதியில் பண்புக்கூறு, போன்றவை: கோப்பு: `__init __. py`. பில்ட் சிச்டம் பின்னர் அதை உருவாக்கும் நேரத்தில் இயக்க நேர இடத்திலிருந்து பிரித்தெடுக்க முடியும்.

source: Consult your build system's documentation for their recommended method.
eo: Vidu la dokumentaron por via konstrua sistemo por la rekomendata metodo.
ja: 推奨される方法を知るには、ビルドシステムの説明文書に当たってください。
ru: Обратитесь к документации вашей системы сборки, чтобы узнать о рекомендуемом методе.
ta: அவற்றின் பரிந்துரைக்கப்பட்ட முறைக்கு உங்கள் உருவாக்க அமைப்பின் ஆவணங்களை அணுகவும்.

source: When the intention is that a distribution package and its associated import package share the same version, it is recommended that the project include an automated test case that ensures ``import_name.__version__`` and ``importlib.metadata.version("dist-name")`` report the same value (note: for many projects, ``import_name`` and ``dist-name`` will be the same name).
eo: Kiam oni intencas, ke distribua pako kaj ĝia asociita importa pako havu la saman version, ni rekomendas, ke la projekto havu aŭtomatan testkazon certigantan, ke ``nomo_de_importa_pako.__version__`` kaj ``importlib.metadata.version("nomo-de-distribua-pako")`` estu samaj (notu: por multaj projektoj, ``nomo_de_importa_pako`` kaj ``nomo-de-distribua-pako`` estos samaj).
ja: 配布パッケージとそれが関連するインポートパッケージが同一のバージョン番号を共有することを意図する時は、そのプロジェクトに、 ``import_name.__version__`` と ``importlib.metadata.version("dist-name")`` が同じ値を報告することを保証する自動化されたテストケースが含まれていることが推奨されます (ノート: 多くのプロジェクトでは ``import_name`` と ``dist-name`` は同じ名称でしょう) 。
ru: Если предполагается, что дистрибутив и связанный с ним пакет импорта имеют одну и ту же версию, рекомендуется включить в проект автоматизированный тестовый пример, который гарантирует, что ``import_name.__version__`` и ``importlib.metadata.version("dist-name")`` сообщают одно и то же значение (примечание: для многих проектов ``import_name`` и ``dist-name`` будут иметь одно и то же имя).
ta: ஒரு விநியோக தொகுப்பும் அதனுடன் தொடர்புடைய இறக்குமதி தொகுப்பும் ஒரே பதிப்பைப் பகிர்ந்து கொள்ள வேண்டும் என்ற நோக்கம் இருக்கும்போது, திட்டத்தில் ஒரு தானியங்கி சோதனை வழக்கு அடங்கும், இது `` இறக்குமதி_பெயர் .__ பதிப்பு __`` மற்றும் `` இறக்குமதி லிப். பெயர் ")` `அதே மதிப்பைப் புகாரளிக்கவும் (குறிப்பு: பல திட்டங்களுக்கு,` `இறக்குமதி_நாம்`` மற்றும்` `டிச்ட்-பெயர்`` ஒரே பெயராக இருக்கும்).

source: Build System Version Handling
eo: Pritraktado de Versioj far Konstruaj Sistemoj
ja: ビルドシステムでのバージョン番号の取り扱い
ru: Обработка версий системы сборки
ta: கணினி பதிப்பு கையாளுதலை உருவாக்குங்கள்

source: The following are links to some build system's documentation for handling version strings.
eo: Jen hiperligoj al dokumentaroj de konstrusistemoj por pritraktado de versiaj signoĉenoj.
ja: 以下は、ビルドシステムのいくつかの、バージョン文字列の取り扱い方を説明した文書です。
ru: Ниже приведены ссылки на документацию некоторых систем сборки по работе со строками версий.
ta: பதிப்பு சரங்களைக் கையாள்வதற்கான சில உருவாக்க அமைப்பின் ஆவணங்களுக்கான இணைப்புகள் பின்வருமாறு.

source: `Flit <https://flit.pypa.io/en/stable/>`_
ta: `ஃபிளிட் <https://flit.pypa.io/en/stable/>` _

source: `Hatchling <https://hatch.pypa.io/1.9/version/>`_
ta: `அட்ச்லிங் <https://hatch.pypa.io/1.9/version/>` _

source: src layout vs flat layout
eo: src-aranĝo kontraste al plata aranĝo
ja: src レイアウト対フラットレイアウト
pt_br: layout src vs layout plano
ru: src-макет против плоского макета
ta: எச்.ஆர்.சி தளவமைப்பு vs பிளாட் தளவமைப்பு

source: The "flat layout" refers to organising a project's files in a folder or repository, such that the various configuration files and :term:`import packages <Import Package>` are all in the top-level directory.
eo: La «plata aranĝo» signifas organizi la projektajn dosierojn en dosierujo aŭ deponejo tiel, ke la diversaj agordaoj dosieroj kaj :term:`importaj pakoj <Import Package>` estas ĉiuj en la supranivela dosierujo.
ja: 「フラットレイアウト」とは、さまざまな設定ファイルや :term:`インポートパッケージ <Import Package>` をすべてトップレベルのディレクトリに置くようなやり方で、プロジェクトのファイル群をひとつのフォルダまたはリポジトリに配置することです。
pt_br: O "layout plano" (em inglês, *flat layout*) refere-se à organização dos arquivos de um projeto em uma pasta ou repositório, de forma que os vários arquivos de configuração e :term:`pacotes de importação <Import Package>` estejam todos no diretório de nível superior.
ru: «плоский макет» относится к организации файлов проекта в папке или репозитории, так что различные файлы конфигурации и :термин: «импортные пакеты <Import Package>` все в директории верхнего уровня.
ta: "பிளாட் தளவமைப்பு" என்பது ஒரு திட்டத்தின் கோப்புகளை ஒரு கோப்புறை அல்லது களஞ்சியத்தில் ஒழுங்கமைப்பதைக் குறிக்கிறது, அதாவது பல்வேறு உள்ளமைவு கோப்புகள் மற்றும்: கால: `இறக்குமதி தொகுப்புகள் <இறக்குமதி தொகுப்பு>` அனைத்தும் உயர்மட்ட கோப்பகத்தில் உள்ளன.

source: The "src layout" deviates from the flat layout by moving the code that is intended to be importable (i.e. ``import awesome_package``, also known as :term:`import packages <Import Package>`) into a subdirectory. This subdirectory is typically named ``src/``, hence "src layout".
eo: La «src-aranĝo» diferencas de la plata aranĝo movanta la kodon importeblan (t.e. ``import mia_pako``, ankaŭ konatan kiel :term:`importajn pakojn <Import Package>`) en subdosierujon. Tiu subdosierujo estas ofte nomita ``src/``; tial la nomo «src-aranĝo».
ja: 「src レイアウト」は、インポート可能 (すなわち ``import awesome_package`` 、別名 :term:`インポートパッケージ <Import Package>`) にするつもりのソースコードをサブディレクトリに置く点でフラットレイアウトとは異なります。このサブディレクトリは、典型的には ``src/`` と命名されるので、「src レイアウト」と呼ばれるのです。
pt_br: O "layout src" (em inglês, *layout src*)se desvia do layout plano movendo o código que se destina a ser importável (ou seja, ``import awesome_package``, também conhecido como :term:`pacotes de importação <Import Package>`) para um subdiretório. Este subdiretório é normalmente chamado de ``src/``, daí "layout src".
ru: src раскладка" отличается от плоской раскладки тем, что код, который должен быть импортируемым (например, ``import awesome_package``, также известный как :term:`import packages <Import Package>`), перемещается в подкаталог. Этот подкаталог обычно называется ``rc/``, отсюда и "src раскладка".
ta: "எச்.ஆர்.சி தளவமைப்பு" இறக்குமதி செய்யக்கூடிய குறியீட்டை நகர்த்துவதன் மூலம் தட்டையான தளவமைப்பிலிருந்து விலகிச் செல்கிறது (அதாவது `` `இறக்குமதி அற்புதமான_பேக்கேச்`, மேலும் இது அழைக்கப்படுகிறது: கால:` இறக்குமதி தொகுப்புகள் <இறக்குமதி தொகுப்பு> `) ஒரு துணை அடைவில். இந்த துணை அடைவு பொதுவாக `` SRC/`` என்று பெயரிடப்பட்டுள்ளது, எனவே "SRC தளவமைப்பு".

source: Here's a breakdown of the important behaviour differences between the src layout and the flat layout:
eo: Jen resumo de la gravaj kondutaj diferencoj inter src-aranĝo kaj plata aranĝo:
ja: ここで、src レイアウトとフラットレイアウトの動作の違いで重要なものを掲出しておきましょう:
pt_br: Aqui está uma análise das diferenças de comportamento importantes entre o layout src e o layout plano:
ru: Вот разбивка важных различий в поведении между макетом дуги и плоской компоновкой:
ta: எச்.ஆர்.சி தளவமைப்பு மற்றும் தட்டையான தளவமைப்புக்கு இடையிலான முக்கியமான நடத்தை வேறுபாடுகளின் முறிவு இங்கே:

source: The src layout requires installation of the project to be able to run its code, and the flat layout does not.
eo: La src-aranĝo postulas instaladon de la projekto por ruli ĝian kodon, dum la plata aranĝo ne postulas tion.
ja: src レイアウトではそのソースコードを走らせるためにプロジェクトのインストールが要求されますが、フラットレイアウトではそのようなことはありません。
pt_br: O layout src requer a instalação do projeto para poder executar seu código, e o layout plano não.
ru: Схема арки требует установки проекта, чтобы иметь возможность запустить его код, а плоской планировки нет.
ta: எச்.ஆர்.சி தளவமைப்புக்கு அதன் குறியீட்டை இயக்க திட்டத்தை நிறுவ வேண்டும், மேலும் தட்டையான தளவமைப்பு இல்லை.

source: This means that the src layout involves an additional step in the development workflow of a project (typically, an :doc:`editable installation <setuptools:userguide/development_mode>` is used for development and a regular installation is used for testing).
eo: Tio signifas, ke la src-aranĝo necesigas ekstran paŝon en la evoluada laborfluo de projekto (ofte :doc:`modifebla instalo <setuptools:userguide/development_mode>` uziĝas por evoluigado, kaj ordinara instalo uziĝas por testado).
ja: これが意味するところは、src レイアウトの場合にはプロジェクトの開発ワークフローに追加的なステップ (典型的には、開発には :doc:`編集可能なインストール <setuptools:userguide/development_mode>` を使い、テストには通常のインストールを用いる) が必要になるということです。
pt_br: Isso significa que o layout src envolve uma etapa adicional no fluxo de trabalho de desenvolvimento de um projeto (normalmente, uma :doc:`instalação editável <setuptools:userguide/development_mode>` é usada para desenvolvimento e uma instalação regular é usada para teste) .
ru: Это означает, что планировка дуги включает в себя дополнительный шаг в процессе разработки проекта (как правило, :doc: «отредактируемая установка <setuptools:userguide/development_mode>` используется для разработки и для тестирования используется регулярная установка).
ta: இதன் பொருள் எச்.ஆர்.சி தளவமைப்பு ஒரு திட்டத்தின் மேம்பாட்டு பணிப்பாய்வுகளில் கூடுதல் படியை உள்ளடக்கியது (பொதுவாக, ஒரு: டிஓசி: `திருத்தக்கூடிய நிறுவல் <செட்டப்டூல்ச்: யூசர்சூட்/டெவலப்மென்ட்_மோட்>` வளர்ச்சிக்கு பயன்படுத்தப்படுகிறது மற்றும் சோதனைக்கு வழக்கமான நிறுவல் பயன்படுத்தப்படுகிறது).

source: The src layout helps prevent accidental usage of the in-development copy of the code.
eo: La src-aranĝo malhelpas neintencitan uzadon de la evoluigata kopio de la kodo.
ja: src レイアウトを採用することは、今まさに開発中のソースコードを使ってしまうという事故を防ぐことを助けます。
pt_br: O layout src ajuda a evitar o uso acidental da cópia em desenvolvimento do código.
ru: Схема кружево помогает предотвратить случайное использование копии кода в разработке.
ta: எச்.ஆர்.சி தளவமைப்பு குறியீட்டின் மேம்பாட்டு நகலின் தற்செயலான பயன்பாட்டைத் தடுக்க உதவுகிறது.

source: This is relevant since the Python interpreter includes the current working directory as the first item on the import path. This means that if an import package exists in the current working directory with the same name as an installed import package, the variant from the current working directory will be used. This can lead to subtle misconfiguration of the project's packaging tooling, which could result in files not being included in a distribution.
eo: Tio gravas, ĉar la Python-interpretilo inkluzivas la aktualan dosierujon kiel la unuan eron de la importa dosierlokaro. Tial, se en la aktuala dosierujo ekzistas importa pako, kies nomo estas sama kiel instalita importa pako, do la varianto en la aktuala dosierujo estos uzata. Tio povas kaŭzi subtilajn misaĵojn de la pakado, rezultigante dosierojn mankantajn en la distribuo.
ja: Python インタープリタはカレントワーキングディレクトリをインポートパスの先頭に含むので、これは妥当なことです。これが意味するところは、もしインストール済みのパッケージと同名のものがカレントワーキングディレクトリに存在するならば、カレントワーキングディレクトリにあるものが使われるであろうということです。これによって、配布物に一部ファイル群が含まれない結果に終わるという、プロジェクトのパッケージングツールの微妙な誤設定をもたらしかねません。
pt_br: Isso é relevante, pois o interpretador Python inclui o diretório de trabalho atual como o primeiro item no caminho de importação. Isso significa que se existir um pacote de importação no diretório de trabalho atual com o mesmo nome de um pacote de importação instalado, a variante do diretório de trabalho atual será usada. Isso pode levar a uma configuração incorreta sutil das ferramentas de empacotamento do projeto, o que pode resultar na não inclusão de arquivos em uma distribuição.
ru: Это актуально, поскольку интерпретатор Python включает текущий рабочий каталог в качестве первого пункта на пути импорта. Это означает, что если пакет импорта существует в текущем рабочем каталоге с тем же названием, что и установленный пакет импорта, будет использоваться вариант из текущего рабочего каталога. Это может привести к тонкой неправильной настройке инструментов упаковки проекта, что может привести к тому, что файлы не будут включены в распределение.
ta: பைதான் மொழிபெயர்ப்பாளர் இறக்குமதி பாதையில் முதல் உருப்படியாக தற்போதைய பணி கோப்பகத்தை உள்ளடக்கியிருப்பதால் இது பொருத்தமானது. இதன் பொருள், நிறுவப்பட்ட இறக்குமதி தொகுப்பின் அதே பெயருடன் தற்போதைய பணி கோப்பகத்தில் இறக்குமதி தொகுப்பு இருந்தால், தற்போதைய பணி கோப்பகத்திலிருந்து மாறுபாடு பயன்படுத்தப்படும். இது திட்டத்தின் பேக்கேசிங் கருவியின் நுட்பமான தவறான கட்டமைப்பிற்கு வழிவகுக்கும், இதன் விளைவாக கோப்புகள் விநியோகத்தில் சேர்க்கப்படாது.

source: The src layout helps avoid this by keeping import packages in a directory separate from the root directory of the project, ensuring that the installed copy is used.
eo: La src-aranĝo avertas tion, tenante la importajn pakojn en dosierujo aparta de la radika dosierujo de la projekto, certigante, ke la instalita kopio uziĝos.
ja: src レイアウトを使えば、パッケージ群をプロジェクトのルートディレクトリとは異なるディレクトリに置くので、インストール済みのパッケージの方を使用することが保証され、このような誤設定を避ける助けになります。
pt_br: O layout src ajuda a evitar isso mantendo os pacotes de importação em um diretório separado do diretório raiz do projeto, garantindo que a cópia instalada seja usada.
ru: Схема src помогает избежать этого, сохраняя импортные пакеты в каталоге отдельно от корневого каталога проекта, обеспечивая использование установленной копии.
ta: எச்.ஆர்.சி தளவமைப்பு இதைத் தவிர்க்க உதவுகிறது, இறக்குமதி தொகுப்புகளை திட்டத்தின் ரூட் கோப்பகத்திலிருந்து பிரித்து, நிறுவப்பட்ட நகல் பயன்படுத்தப்படுவதை உறுதிசெய்கிறது.

source: The src layout helps enforce that an :doc:`editable installation <setuptools:userguide/development_mode>` is only able to import files that were meant to be importable.
eo: La src-aranĝo devigas, ke :doc:`redaktebla instalo < setuptools:userguide/development_mode>` nur kapablas importi tiujn dosierojn, kiuj estas intence importeblaj.
ja: src レイアウトを使うことで、インポートしようと意図した :doc:`編集可能なインストール <setuptools:userguide/development_mode>` だけをインポートするように強制することを助けます。
pt_br: O layout src ajuda a reforçar que uma :doc:`instalação editável <setuptools:userguide/development_mode>` só é capaz de importar arquivos que deveriam ser importados.
ru: Схема src помогает обеспечить, чтобы :doc:`editableinstall <setuptools:userguide/development_mode>` смог импортировать только файлы, которые должны были быть импортированы.
ta: எச்.ஆர்.சி தளவமைப்பு ஒரு: டாக்: `திருத்தக்கூடிய நிறுவல் <செட்டப்டூல்ச்: யூசர்சூட்/டெவலப்மென்ட்_மோட்>` இறக்குமதி செய்யக்கூடிய கோப்புகளை மட்டுமே இறக்குமதி செய்ய முடியும் என்பதை செயல்படுத்த உதவுகிறது.

source: This is especially relevant when the editable installation is implemented using a `path configuration file <https://docs.python.org/3/library/site.html#index-2>`_ that adds the directory to the import path.
eo: Tio estas speciale utila, kiam la modifebla instalo estas realigita per `dosierloko-agorda dosiero <https://docs.python.org/3/library/site.html#index-2>`_ aldonanta la dosierujon al la importa dosierlokaro.
ja: これは、編集可能なインストール (のパッケージ) がインポートパスにそのディレクトリを追加するように動く `パス設定ファイル <https://docs.python.org/3/library/site.html#index-2>`_ を使って実装されている場合に、特に適切です。
pt_br: Isso é especialmente relevante quando a instalação editável é implementada usando um `arquivo de configuração de caminho <https://docs.python.org/pt-br/3/library/site.html#index-2>`_ que adiciona o diretório ao caminho de importação.
ru: Это особенно актуально, когда редактируемая установка реализована с помощью файла <https.python.org/3/library/site.html#index-2>`_ это добавляет каталог к пути импорта.
ta: `பாதை உள்ளமைவு கோப்பைப் பயன்படுத்தி திருத்தக்கூடிய நிறுவல் செயல்படுத்தப்படும்போது இது மிகவும் பொருத்தமானது <https://docs.python.org/3/library/site.html#index-2> _ _ இது கோப்பகத்தை இறக்குமதி பாதையில் சேர்க்கிறது.

source: The flat layout would add the other project files (eg: ``README.md``, ``tox.ini``) and packaging/tooling configuration files (eg: ``setup.py``, ``noxfile.py``) on the import path. This would make certain imports work in editable installations but not regular installations.
eo: La plata aranĝo aldonus aliajn projektaojn dosierojn (ekzemple ``README.md``, ``tox.ini``) kaj pakadajn/ilajn agordajn dosierojn (ekzemple ``setup.py``, ``noxfile.py``) al la importa dosierlokaro. Tio kaŭzus, ke kelkaj importoj funkcius en modifebla instalo sed ne en ordinara instalo.
ja: フラットレイアウトでは、インポートパスに他のプロジェクトファイル群 (例えば ``README.md`` や ``tox.ini``) や、パッケージング/ツール使用の設定ファイル (例えば ``setup.py`` や ``noxfile.py``) を追加します。こうすることによって、あるインポートが、通常のインストールではなくて編集可能なインストールの側を使うことを確実にするでしょう。
pt_br: O layout plano adicionaria os outros arquivos de projeto (por exemplo: ``README.md``, ``tox.ini``) e arquivos de configuração de pacotes/ferramentas (por exemplo: ``setup.py``, ``noxfile.py``) no caminho de importação. Isso faria com que certas importações funcionassem em instalações editáveis, mas não em instalações regulares.
ru: В плоском макете будут добавлены другие файлы проекта (например: ``README.md``, ``tox.ini``) и файлы конфигурации упаковки/инструмента (например: ``setup.py``, ``noxfile.py``) на пути импорта. Это позволило бы производить определенные импортные работы на редактируемых установках, но не на обычных установках.
ta: தட்டையான தளவமைப்பு மற்ற திட்டக் கோப்புகளைச் சேர்க்கும் (எ.கா. ``) இறக்குமதி பாதையில். இது சில இறக்குமதிகள் திருத்தக்கூடிய நிறுவல்களில் செயல்பட வைக்கும், ஆனால் வழக்கமான நிறுவல்கள் அல்ல.

source: Running a command-line interface from source with src-layout
eo: Ruli komandlinian fasadon el fonto per src-aranĝo
ja: src レイアウト付きのソースコードからコマンドラインインターフェースを走らせる
pt_br: Executando uma interface de linha de comando da fonte com src-layout
ru: Запуск интерфейса командной строки из исходного текста с помощью src-layout
ta: எச்.ஆர்.சி-லேஅவுட்டுடன் மூலத்திலிருந்து கட்டளை-வரி இடைமுகத்தை இயக்குகிறது

source: Due to the firstly mentioned specialty of the src layout, a command-line interface can not be run directly from the :term:`source tree <Project Source Tree>`, but requires installation of the package in :doc:`Development Mode <setuptools:userguide/development_mode>` for testing purposes. Since this can be unpractical in some situations, a workaround could be to prepend the package folder to Python's :py:data:`sys.path` when called via its :file:`__main__.py` file:
eo: Pro la unue menciita kvalito de la src-aranĝo, oni ne povas ruli komandlinian fasadon rekte de la :term:`fontarbo <Project Source Tree>`, sed devas instali la pakon en :doc:`Evoluada Reĝimo <setuptools:userguide/development_mode>` por testado. Se tio malutilias, oni povas antaŭmeti la pakan dosierujon al :py:data:`sys.path` de Python, kiam oni rulas la dosieron :file:`__main__.py`:
ja: 最初に述べた src レイアウトの特殊性の故に、コマンドラインインタフェースは、 :term:`ソースコードツリー <Project Source Tree>` から直接に起動することができず、試験目的のために :doc:`開発モード <setuptools:userguide/development_mode>`:doc:`開発モード <setuptools:userguide/development_mode>` でインストールされたパッケージを要求します。状況によってはこれは現実的ではなくなるので、 :file:`__main__.py` ファイル経由で呼ばれた時にパッケージフォルダを Python の :py:data:`sys.path` の先頭に追加することが回避策になるかもしれません。
ru: В связи с первой из упомянутых особенностей компоновки src, интерфейс командной строки не может быть запущен непосредственно из :term:`source tree <Project Source Tree>`, а требует установки пакета в :doc:`Development Mode <setuptools:userguide/development_mode>` для целей тестирования. Поскольку это может быть непрактично в некоторых ситуациях, обходным решением может быть добавление папки пакета к :py:data:`sys.path` при вызове через файл :file:`__main__.py`:
ta: எச்.ஆர்.சி தளவமைப்பின் முதன்முதலில் குறிப்பிடப்பட்ட சிறப்பு காரணமாக, ஒரு கட்டளை-வரி இடைமுகத்தை நேரடியாக இயக்க முடியாது: கால: `மூல மரம் <திட்ட மூல மரம்>`, ஆனால் தொகுப்பை நிறுவ வேண்டும்: டாக்: `மேம்பாட்டு முறை < setuptools: USERGUIDE/Development_mode> `சோதனை நோக்கங்களுக்காக. சில சூழ்நிலைகளில் இது நடைமுறைக்கு மாறானதாக இருப்பதால், தொகுப்பு கோப்புறையை பைத்தானுக்கு தயார்படுத்துவது ஒரு பணித்தொகுப்பு: py: data: `sys.path` அதன் வழியாக அழைக்கப்படும்போது: கோப்பு:` __main __. பை` கோப்பு:

source: Versioning
eo: Versiado
ja: バージョニング
pt_br: Versionamento
ru: Версионирование
ta: பதிப்பு

source: This discussion covers all aspects of versioning Python packages.
eo: Jen diskuto pri ĉiuj flankoj de la versiado de Python-pakoj.
ja: この議論では、 Python パッケージのバージョニングについてあらゆる角度からカバーします。
pt_br: Esta discussão cobre todos os aspectos do versionamento de pacotes Python.
ru: В этой статье рассматриваются все аспекты версионирования пакетов Python.
ta: இந்த விவாதம் பைதான் தொகுப்புகளை பதிப்பதன் அனைத்து அம்சங்களையும் உள்ளடக்கியது.

source: Valid version numbers
eo: Validaj versiaj numeroj
ja: 正当なバージョン番号
pt_br: Números de versão validos
ru: Допустимые номера версий
ta: செல்லுபடியாகும் பதிப்பு எண்கள்
