Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Rename or remove the ``RECORD`` file to prevent changes via other tools (e.g. appending a suffix to create a non-standard ``RECORD.tool`` file if the tool itself needs the information, or omitting the file entirely if the package contents are tracked and managed via other means)
ja: 他のツール類を経由した変更を抑止するために、``RECORD`` ファイルを別の名前にするか、削除するか (このファイル内の情報が必要なら、例えば標準的でない名前の ``RECORD.tool`` というファイルを作成するために拡張子を追加すること、あるいは、パッケージの内容物を他の手段で追跡・管理しているのであればファイルを完全に除外しておくこと) してください
ru: Переименуйте или удалите файл ``RECORD``, чтобы предотвратить изменения с помощью других инструментов (например, добавьте суффикс для создания нестандартного файла ``RECORD.tool``, если информация нужна самому инструменту, или полностью удалите файл, если содержимое пакета отслеживается и управляется другими средствами)
ta: பிற கருவிகள் வழியாக மாற்றங்களைத் தடுக்க `` பதிவு` `கோப்பை மறுபெயரிடுங்கள் அல்லது அகற்றவும் (எ.கா. தரமற்ற` `பதிவு.

source: Write an ``INSTALLER`` file indicating the name of the tool that should be used to manage the package (this allows ``RECORD``-aware tools to provide better error notices when asked to modify affected packages)
eo: Kreu dosieron ``INSTALLER`` sciiganta pri la nomo de la ilo por mastrumi la pakon (tio permesas al ilo scianta pri ``RECORD`` provizi bonajn erarojn pri modifado de rilataj pakoj)
ja: そのパッケージを管理するのに使用されるべきツールの名前を示すように``INSTALLER`` ファイルを書いてください (これによって、 ``RECORD`` を参照できるツール群が影響を被るパッケージを修正するように言われた時により良いエラー通知を提供できます)
ru: Запишите файл ``INSTALLER``, указывающий имя инструмента, который должен использоваться для управления пакетом (это позволяет инструментам, знающим ``RECORD``, выдавать более точные уведомления об ошибках при запросе на модификацию затронутых пакетов)
ta: தொகுப்பை நிர்வகிக்கப் பயன்படுத்த வேண்டிய கருவியின் பெயரைக் குறிக்கும் `` நிறுவி`` கோப்பை எழுதுங்கள் (பாதிக்கப்பட்ட தொகுப்புகளை மாற்றும்படி கேட்கும்போது `` பதிவு``-விழிப்புணர்வை சிறந்த பிழை அறிவிப்புகளை வழங்க இது அனுமதிக்கிறது)

source: Python runtime providers may also prevent inadvertent modification of platform provided packages by modifying the default Python package installation scheme to use a location other than that used by platform provided packages (while also ensuring both locations appear on the default Python import path).
ja: Python ランタイムの提供者は、デフォルトの Python パッケージのインストレーションスキームを修正してプラットフォームが提供するパッケージ群で使われるものとは別の場所を使うようにすることで、プラットフォームが提供するパッケージ群を意図せずに修正してしまうことを防いでも構いません。
ru: Провайдеры среды выполнения Python также могут предотвратить непреднамеренную модификацию пакетов, предоставляемых платформой, изменив схему установки пакетов Python по умолчанию, чтобы использовать местоположение, отличное от того, которое используется пакетами, предоставляемыми платформой (при этом оба места должны быть указаны в пути импорта Python по умолчанию).
ta: பைதான் இயக்க நேர வழங்குநர்கள் இயங்குதளம் வழங்கப்பட்ட தொகுப்புகளை மாற்றியமைப்பதன் மூலம் இயங்குதளத்தின் கவனக்குறைவான மாற்றத்தைத் தடுக்கலாம், இயல்புநிலை பைதான் தொகுப்பு நிறுவல் திட்டத்தை மேடையில் வழங்கப்பட்ட தொகுப்புகளால் பயன்படுத்தப்படுவதைத் தவிர வேறு இடத்தைப் பயன்படுத்தலாம் (அதே நேரத்தில் இரு இடங்களும் இயல்புநிலை பைதான் இறக்குமதி பாதையில் தோன்றுவதை உறுதிசெய்கின்றன).

source: In some circumstances, it may be desirable to block even installation of additional packages via Python-specific tools. For these cases refer to :ref:`externally-managed-environments`
eo: Kelkfoje, oni bezonas malhelpi eĉ instaladon de pliaj pakoj per Python-specifaj iloj. Tiukaze vidu :ref:`externally-managed-environments`
ja: いくつかの環境では、 Python 特有のツール群を経由した追加パッケージのインストールさえもブロックすることが望ましいかもしれません。このようなケースについては :ref:`外部から管理される環境 <externally-managed-environments>` を参照してください
ru: В некоторых обстоятельствах может быть желательно заблокировать даже установку дополнительных пакетов с помощью инструментов, специфичных для Python. Для таких случаев обратитесь к :ref:`externally-managed-environments`
ta: சில சூழ்நிலைகளில், பைதான்-குறிப்பிட்ட கருவிகள் வழியாக கூடுதல் தொகுப்புகளை நிறுவுவதைத் தடுப்பது விரும்பத்தக்கதாக இருக்கலாம். இந்த நிகழ்வுகளுக்கு: ref: `வெளிப்புறமாக நிர்வகிக்கப்பட்ட-சூழல்கள்`

source: June 2009: The original version of this specification was approved through :pep:`376`. At the time, it was known as the *Database of Installed Python Distributions*.
eo: Junio 2009: La originala versio de ĉi tiu specifo estis aprobita per :pep:`376`. Tiam, ĝi nomiĝis la *Datenbanko de Instalitaj Python-Distribuoj*.
ja: 2009年6月: :pep:`376` を通じてこの仕様の元々のバージョンが承認されました。当時は、 *インストール済みの Python 配布物のデータベース* という名前でした。
ru: Июнь 2009 г: Первоначальная версия этой спецификации была одобрена через :pep:`376`. В то время она была известна как *База данных установленных дистрибутивов Python*.
ta: சூன் 2009: இந்த விவரக்குறிப்பின் அசல் பதிப்பு அங்கீகரிக்கப்பட்டது: PEP: `376`. அந்த நேரத்தில், இது நிறுவப்பட்ட பைதான் விநியோகங்களின் *தரவுத்தளமாக அறியப்பட்டது *.

source: March 2020: The specification of the ``direct_url.json`` file was approved through :pep:`610`. It is only mentioned on this page; see :ref:`direct-url` for the full definition.
eo: Marto 2020: La specifo de la dosiero ``direct_url.json`` estis aprobita per :pep:`610`. Ĉi tiu paĝo nur mencias ĝin; vidu :ref:`direct-url` por la plena difino.
ja: 2020年3月: :pep:`610` を通じて ``direct_url.json`` ファイルの仕様が承認されました。これは、このページで言及されるのみです; 完全な定義については :ref:`direct-url` を見てください。
ru: Март 2020 г: Спецификация файла ``direct_url.json`` была одобрена через :pep:`610``. Он только упоминается на этой странице; полное определение см. в :ref:`direct-url`.
ta: மார்ச் 2020: `` `direct_url.json`` கோப்பின் விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP:` 610`. இது இந்த பக்கத்தில் மட்டுமே குறிப்பிடப்பட்டுள்ளது; காண்க: குறிப்பு: முழு வரையறைக்கு `நேரடி-உர்எல்`.

source: September 2020: Various amendments and clarifications were approved through :pep:`627`.
eo: Septembro 2020: Diversaj amendoj kaj klarigoj estis aprobitaj per :pep:`627`.
ja: 2020年9月: :pep:`627` を通じて、さまざまな修正や明確化が承認されました。
ru: Сентябрь 2020 года: Различные поправки и уточнения были одобрены через :pep:`627`.
ta: செப்டம்பர் 2020: பல்வேறு திருத்தங்கள் மற்றும் விளக்கங்கள் மூலம் அங்கீகரிக்கப்பட்டன: PEP: `627`.

source: Package Distribution File Formats
eo: Pako-Distribuaj Dosierformoj
ja: パッケージ配布物のファイルフォーマット
pt_br: Formatos de arquivos de distribuição de pacotes
ru: Форматы файлов распространения пакетов
ta: தொகுப்பு விநியோக கோப்பு வடிவங்கள்

source: Package Distribution Metadata
eo: Pako-Distribuaj Metadatenoj
ja: パッケージ配布物のメタデータ
pt_br: Metadados de distribuição de pacotes
ru: Метаданные распространения пакетов
ta: தொகுப்பு விநியோக மேனிலை தரவு

source: Package Installation Metadata
eo: Pako-Instalaj Metadatenoj
ja: パッケージのインストールに関するメタデータ
ru: Метаданные установки пакета
ta: தொகுப்பு நிறுவல் மேனிலை தரவு

source: Package Index Interfaces
eo: Pakindeksaj Interfacoj
ja: パッケージインデックスのインタフェース
pt_br: Interfaces de índices de pacotes
ru: Индекс пакета Интерфейсы
ta: தொகுப்பு குறியீட்டு இடைமுகங்கள்

source: Simple repository API
eo: Simpla deponeja API
ja: シンプルなリポジトリ API
pt_br: API de repositório simples
ru: Простой API репозитория
ta: எளிய களஞ்சிய பநிஇ

source: All subsequent URLs in this document will be relative to this base URL (so given PyPI's URL, a URL of ``/foo/`` would be ``https://pypi.org/simple/foo/``.
eo: Ĉiuj sekvaj retadresoj en ĉi tiu dokumento estos relativaj al tiu baza retadreso. (Ekzemple, pri retadreso de PyPI, ``/foo/`` respondos al ``https://pypi.org/simple/foo/``.
ja: この説明文書でこのあと出てくる URL 群はすべて、このベース URL <base URL> からの相対的なものです (したがって、PyPI に関する URL なら、 ``/foo/`` は ``https://pypi.org/simple/foo/`` のことです。
ru: Все последующие URL в этом документе будут относительными к этому базовому URL (поэтому, учитывая URL PyPI, URL ``/foo/`` будет ``https://pypi.org/simple/foo/``.
ta: இந்த ஆவணத்தில் உள்ள அனைத்து அடுத்தடுத்த முகவரி களும் இந்த அடிப்படை முகவரி உடன் தொடர்புடையதாக இருக்கும் (எனவே பைபியின் முகவரி கொடுக்கப்பட்டால், ``/foo/`` முகவரி `` https: // pypi.org/simple/foo/`` ஆக இருக்கும்.

source: Normalized Names
eo: Normigitaj Nomoj
ja: 正規化された名称
ru: Нормализованные названия
ta: இயல்பாக்கப்பட்ட பெயர்கள்

source: This spec references the concept of a "normalized" project name. As per :ref:`the name normalization specification <name-normalization>` the only valid characters in a name are the ASCII alphabet, ASCII numbers, ``.``, ``-``, and ``_``. The name should be lowercased with all runs of the characters ``.``, ``-``, or ``_`` replaced with a single ``-`` character. This can be implemented in Python with the ``re`` module::
eo: Ĉi tiu specifo referencas la koncepton de «normigita» projekta nomo. Laŭ :ref:`la specifo pri normigo de nomoj <name-normalization>`, la validaj skrisbignoj en nomo estas Askiaj literoj, Asikaj ciferoj, ``.``, ``-``, kaj ``_``. La nomo estu minuskligita, kun sinsekvoj de ``.``, ``-``, aŭ ``_`` anstataŭigitaj per unu skribsigno ``-``. Oni povas fari tion en Python per la modulo ``re``::
ja: この仕様は、 "正規化された" プロジェクト名称の概念を参照しています。 :ref:`名称正規化仕様 <name-normalization>` によれば、名称における正当な文字は、 ASCII アルファベット・ ASCII 数字・ ``.`` ・ ``-`` ・ ``_`` だけです。名称は、 `.`` ・ ``-`` ・ ``_`` がいくつ連続していてもそれを単一の ``-`` 文字に置き換え、小文字で統一されているべきです。これは Python の ``re`` モジュールで実装されています::
ru: Эта спецификация ссылается на концепцию "нормализованного" имени проекта. Согласно : ссылка:спецификации нормализации имен <название - нормализация>` единственными допустимыми символами в имени являются алфавит ASCII, числа ASCII, ``.``, ``-`` и ``_``. Имя должно быть строчным, при этом все пробелы символов ``.``, ``-`` или ``_`` должны быть заменены одним символом ``-``. Это можно реализовать на языке Python с помощью модуля ``re``::
ta: இந்த விவரக்குறிப்பு "இயல்பாக்கப்பட்ட" திட்ட பெயரின் கருத்தை குறிக்கிறது. படி: ref: `பெயர் இயல்பாக்குதல் விவரக்குறிப்பு <பெயர்-இயல்பாக்கம்>` ஒரு பெயரில் உள்ள ஒரே செல்லுபடியாகும் எழுத்துக்கள் தபஅஇகு எழுத்துக்கள், தபஅஇகு எண்கள், `` .``, `` -``, மற்றும் `` _``. ```,` `-``, அல்லது` `_`` ஒரு ஒற்றை` `-`` எழுத்துடன் மாற்றப்பட்ட எழுத்துக்களின் அனைத்து ரன்களிலும் பெயர் குறைவாக இருக்க வேண்டும். இதை பைத்தானில் `` ரீ`` தொகுதி :: உடன் செயல்படுத்தலாம்

source: Versioning PyPI's Simple API
eo: Versiado de la Simpla API de PyPI
ja: PyPI のシンプルな API にバージョンを付与する
ru: Версионирование простого API PyPI
ta: பதிப்பு PYPI எளிய பநிஇ

source: When interpreting the repository version:
eo: Dum interpretado de la deponeja versio:
ja: リポジトリのバージョンを翻訳する時:
ru: При интерпретации версии репозитория:
ta: களஞ்சிய பதிப்பை விளக்கும் போது:

source: Incrementing the major version is used to signal a backwards incompatible change such that existing clients would no longer be expected to be able to meaningfully use the API.
eo: Alkremento de la maĵora versio signifas neretrokongruan ŝanĝon tian, ke ekzistanta kliento supozeble ne plu povas signife uzi la API.
ja: メジャーバージョンの増加は、既存のクライアントがその API を意味ある形で使うことができるとはもはや期待できないような後方互換性のない変更のシグナルとして使われます。
ru: Увеличение основной версии используется для сигнализации об изменении, несовместимом с обратной стороной, когда существующие клиенты уже не смогут полноценно использовать API.
ta: முக்கிய பதிப்பை அதிகரிப்பது பின்னோக்கி பொருந்தாத மாற்றத்தை சமிக்ஞை செய்யப் பயன்படுகிறது, அதாவது இருக்கும் வாடிக்கையாளர்கள் இனி பநிஇ ஐ அர்த்தமுள்ளதாக பயன்படுத்த முடியும் என்று எதிர்பார்க்க முடியாது.

source: Incrementing the minor version is used to signal a backwards compatible change such that existing clients would still be expected to be able to meaningfully use the API.
eo: Alkremento de la minora versio signifas retrokongruan ŝanĝon tian, ke ekzistantaj klientoj verŝajne povas daŭre signife uzi la API.
ja: マイナーバージョンの増加は、既存のクライアントが依然として意味ある形で API を使うことができることが期待されるような、後方互換性を保つ変更のシグナルとして使われます。
ru: Увеличение минорной версии используется для того, чтобы сигнализировать об изменении обратной совместимости, так что ожидается, что существующие клиенты все еще смогут полноценно использовать API.
ta: சிறிய பதிப்பை அதிகரிப்பது பின்னோக்கி இணக்கமான மாற்றத்தைக் குறிக்கப் பயன்படுகிறது, அதாவது இருக்கும் வாடிக்கையாளர்கள் பநிஇ ஐ அர்த்தமுள்ளதாக பயன்படுத்த முடியும் என்று எதிர்பார்க்கப்படுகிறது.

source: It is left up to the discretion of any future specs as to what specifically constitutes a backwards incompatible vs compatible change beyond the broad suggestion that existing clients will be able to "meaningfully" continue to use the API, and can include adding, modifying, or removing existing features.
ja: 将来の仕様の選択は、既存のクライアントが引き続き "意味ある形で" APIを使うことができるであろう、そして、既存の機能に対する追加・修正・削除ができるであろうという幅広い示唆を越えて、特に後方互換性の有無を構成するものに委ねられています。
ru: На усмотрение любых будущих спецификаций остается вопрос о том, что именно считать обратно несовместимым и совместимым изменением, помимо широкого предложения о том, что существующие клиенты смогут "осмысленно" продолжать использовать API, и это может включать добавление, модификацию или удаление существующих функций.
ta: தற்போதுள்ள வாடிக்கையாளர்கள் பநிஇ ஐ "அர்த்தமுள்ள வகையில்" பயன்படுத்த முடியும் என்ற பரந்த பரிந்துரைக்கு அப்பால் பின்னோக்கி பொருந்தாத Vs இணக்கமான மாற்றத்தை குறிப்பாக உருவாக்குவது குறித்து எதிர்கால விவரக்குறிப்புகளின் விருப்பப்படி இது விடப்படுகிறது, மேலும் ஏற்கனவே உள்ள அம்சங்களைச் சேர்ப்பது, மாற்றியமைப்பது அல்லது அகற்றுவது ஆகியவை அடங்கும்.

source: It is expectation of this spec that the major version will never be incremented, and any future major API evolutions would utilize a different mechanism for API evolution. However the major version is included to disambiguate with future versions (e.g. a hypothetical simple api v2 that lived at /v2/, but which would be confusing if the repository-version was set to a version >= 2).
eo: La aŭtoroj de ĉi tiu normo atendas, ke la maĵora versio neniam alkrementiĝos, kaj ajna estonta grava evoluo de la API uzos alian meĥanismon por API-evoluo. Tamen la maĵora versio inkluziviĝas por malambiguigi kun estontaj versioj (ekz. pri hipoteza simpla API v2, kiuj ĉeestus ĉe /v2/, estus konfuza, se la deponejo-versio estus ≥2).
ja: メジャーバージョンを増加することは考えられず、将来発生する API の進化は API の進化における異なったメカニズムを通じて実現されるであろうというのが、この仕様の期待するところです。しかしながら、メジャーバージョンは、将来のバージョンとの違い (例えば、 /v2/ を使う仮説としてのシンプル API v2 、しかしこれはリポジトリバージョンが version >= 2 に設定されれば混乱を招くかもしれません) を明らかにするためにここに含まれているのです。
ru: Предполагается, что основная версия никогда не будет увеличиваться, и любые будущие основные эволюции API будут использовать другой механизм для эволюции API. Тем не менее, основная версия включена для того, чтобы не было разночтений с будущими версиями (например, гипотетический простой api v2, который жил по адресу /v2/, но который был бы запутан, если бы в репозитории-версия была установлена версия >= 2).
ta: முக்கிய பதிப்பு ஒருபோதும் அதிகரிக்கப்படாது என்பது இந்த விவரக்குறிப்பின் எதிர்பார்ப்பாகும், மேலும் எதிர்கால பெரிய பநிஇ பரிணாமங்கள் பநிஇ படிமலர்ச்சி வளர்ச்சிக்கு வேறுபட்ட வழிமுறையைப் பயன்படுத்தும். எவ்வாறாயினும், எதிர்கால பதிப்புகளுடன் (எ.கா..

source: Clients
eo: Klientoj
ja: クライアント
ru: Клиенты
ta: வாடிக்கையாளர்கள்

source: Clients interacting with the simple API **SHOULD** introspect each response for the repository version, and if that data does not exist **MUST** assume that it is version 1.0.
eo: Kliento interaganta kun la simpla API **INSPEKTU** ĉiun respondon pri la deponeja versio. Se tiu dateno mankas, la kliento **DEVAS** supozi, ke ĝi estas versio 1.0.
ja: シンプルな API と相互作用するクライアントは、応答を受け取るたびにそのリポジトリバージョンをよく **検査するべき** で、もし存在しなければバージョン 1.0 であるものと **仮定しなければなりません** 。
ru: Клиенты, взаимодействующие с простым API, **ОБЯЗАНЫ** проверять каждый ответ на версию хранилища, и если эти данные отсутствуют, **ОБЯЗАНЫ** считать, что это версия 1.0.
ta: எளிய பநிஇ உடன் தொடர்பு கொள்ளும் வாடிக்கையாளர்கள் ** களஞ்சிய பதிப்பிற்கான ஒவ்வொரு பதிலையும் ** உள்நோக்கிக் கொள்ள வேண்டும், மேலும் அந்த தரவு இல்லை என்றால் ** ** இது பதிப்பு 1.0 என்று கருத வேண்டும்.

source: When encountering a major version greater than expected, clients **MUST** hard fail with an appropriate error message for the user.
eo: Renkontinte maĵoran version pli grandan ol la atenditan, kliento **DEVAS** malsukcesi kun taŭga erarmesaĝo por la uzanto.
ja: 想定していたよりも大きなメジャーバージョンに遭遇した時には、クライアントは、ユーザ向けの適切なエラーメッセージと共に **ハードフェイルをしなければなりません** 。
ru: При столкновении с основной версией, превышающей ожидаемую, клиенты **ДОЛЖНЫ** жестко отказывать с соответствующим сообщением об ошибке для пользователя.
ta: ஒரு முக்கிய பதிப்பை எதிர்பார்த்ததை விட அதிகமாக எதிர்கொள்ளும்போது, வாடிக்கையாளர்கள் ** பயனருக்கு பொருத்தமான பிழை செய்தியுடன் ** கடினமாக இருக்க வேண்டும்.

source: When encountering a minor version greater than expected, clients **SHOULD** warn users with an appropriate message.
eo: Renkontinte minoran version pli grandan ol la atenditan, kliento **AVERTU** la uzanton kun taŭga mesaĝo.
ja: 想定していたよりも大きなマイナーバージョンに遭遇した時には、クライアントは、適切なメッセージと共にユーザに対して **警告するべき** です。
ru: При столкновении с минорной версией, превышающей ожидаемую, клиенты **ДОЛЖНЫ** предупреждать пользователей соответствующим сообщением.
ta: ஒரு சிறிய பதிப்பை எதிர்பார்த்ததை விட அதிகமாக எதிர்கொள்ளும்போது, வாடிக்கையாளர்கள் ** ** பொருத்தமான செய்தியுடன் பயனர்களை எச்சரிக்க வேண்டும்.

source: Clients **MAY** still continue to use feature detection in order to determine what features a repository uses.
eo: Kliento **POVAS** daŭre uzi detektadon de funkcioj por determini la funkciojn uzatajn de iu deponejo.
ja: クライアントは、リポジトリがどんな機能を使っているかを判断するために、さらに機能探索 <feature detection> を **継続しても構いません** 。
ru: Клиенты **МОГУТ** продолжать использовать обнаружение функций, чтобы определить, какие функции использует хранилище.
ta: ஒரு களஞ்சியம் பயன்படுத்தும் எந்த இடங்களைக் கொண்டுள்ளது என்பதைத் தீர்மானிக்க வாடிக்கையாளர்கள் ** இருக்கலாம் ** அம்சக் கண்டறிதலைப் பயன்படுத்தலாம்.

source: Project List
eo: Listo de Projektoj
ja: プロジェクトのリスト
ru: Список проектов
ta: திட்ட பட்டியல்

source: Project Detail
eo: Projekta Detalo
ja: プロジェクトの詳細
ru: Деталь проекта
ta: திட்ட விவரம்

source: In addition to the above, the following constraints are placed on the API:
eo: Aldone al ĉi-supro, ekzistas la jenaj limigoj pri la API:
ja: 上記に加えて、以下の制約が API に課せられます:
ru: В дополнение к вышесказанному, на API накладываются следующие ограничения:
ta: மேற்கூறியவற்றைத் தவிர, பின்வரும் தடைகள் பநிஇ இல் வைக்கப்படுகின்றன:

source: All URLs which respond with an HTML5 page **MUST** end with a ``/`` and the repository **SHOULD** redirect the URLs without a ``/`` to add a ``/`` to the end.
eo: Ĉiu URL respondanta per HTML-paĝo **DEVAS** finiĝi per ``/``. La deponejo **REDIREKTU** URL sen ``/`` al URL kun sufiksa ``/``.
ja: HTML5 ページで応答するすべての URL は ``/`` で終わるものでなければならず、リポジトリは ``/`` で終わらない URL の最後に ``/`` を加えたものへリダイレクト **するべき** です。
ru: Все URL-адреса, которые отвечают HTML5-страницей, **ДОЛЖНЫ** заканчиваться ``/``, а хранилище **ДОЛЖНО** перенаправлять URL-адреса без ``/``, чтобы добавить ``/`` в конец.
ta: ஒரு HTML5 பக்கத்துடன் பதிலளிக்கும் அனைத்து முகவரி களும் ** ** ஒரு ``/`` உடன் முடிவடைய வேண்டும், மேலும் களஞ்சியத்தை ** ** முகவரி களை ``/`` இல்லாமல் திருப்பி விட வேண்டும் ``/`` இறுதியில்.

source: URLs may be either absolute or relative as long as they point to the correct location.
eo: URL povas esti aŭ absoluta aŭ relativa, se ĝi montras la ĝustan lokon.
ja: URL は、間違いのないロケーションを指し示している限りは絶対パスであっても相対パスであっても構いません。
ru: URL-адреса могут быть как абсолютными, так и относительными, если они указывают на правильное местоположение.
ta: முகவரி கள் சரியான இடத்தை சுட்டிக்காட்டும் வரை முழுமையான அல்லது உறவினராக இருக்கலாம்.

source: There are no constraints on where the files must be hosted relative to the repository.
eo: Ekzistas nenia limigo pri kie la dosieroj ĉeestu relative al la deponejo.
ja: ファイル群が置かれている場所が、リポジトリに対して相対的な場所のどこであるかについては制約条件はありません。
ru: Нет никаких ограничений на то, где должны быть размещены файлы относительно хранилища.
ta: களஞ்சியத்துடன் ஒப்பிடும்போது கோப்புகள் எங்கு புரவலன் செய்யப்பட வேண்டும் என்பதில் எந்த தடைகளும் இல்லை.

source: There may be any other HTML elements on the API pages as long as the required anchor elements exist.
eo: Povas ekzisti aliaj HTML-elementoj sur la API-paĝo, se la postulataj ankraj elementoj ekzistas.
ja: 要求されているアンケー要素が存在している限り、API ページ上にどのような他の HTML 要素があっても構いません。
ru: На страницах API могут быть любые другие HTML-элементы при условии наличия необходимых элементов якоря.
ta: தேவையான நங்கூர கூறுகள் இருக்கும் வரை பநிஇ பக்கங்களில் வேறு ஏதேனும் உஉகுமொ கூறுகள் இருக்கலாம்.

source: Repositories **MAY** redirect unnormalized URLs to the canonical normalized URL (e.g. ``/Foobar/`` may redirect to ``/foobar/``), however clients **MUST NOT** rely on this redirection and **MUST** request the normalized URL.
eo: Deponejo **POVAS** redirekti nenormigitan retadreson al la kanona normigita retadreso (ekz. de ``/Foobar/`` al ``/foobar/``). Tamen, kliento **DEVAS NE** dependi de tia redirektado kaj **DEVAS** peti la normigitan retadreson.
ja: リポジトリは、正規化されていない URL を正統で正規化された URL にリダイレクトしても **構いません** (例えば、 ``/Foobar/`` を ``/foobar/`` にリダイレクトしてもよい) が、クライアントの側ではこのリダイレクト機能に **依存してはならず** 、正規化された URL に対してリクエストを **送らなければなりません** 。
ru: Репозитории **МОГУТ** перенаправлять ненормализованные URL на канонический нормализованный URL (например, ``/Foobar/`` может перенаправлять на ``/foobar/``), однако клиенты **НЕ ДОЛЖНЫ** полагаться на это перенаправление и **МОГУТ** запрашивать нормализованный URL.
ta: களஞ்சியங்கள் ** நியமன இயல்பாக்கப்பட்ட முகவரி க்கு சிறப்பான முகவரி களை திருப்பிவிடலாம் (எ.கா. இயல்பாக்கப்பட்ட முகவரி ஐக் கோர வேண்டும்.

source: Repositories **SHOULD** choose a hash function from one of the ones guaranteed to be available via the :py:mod:`hashlib` module in the Python standard library (currently ``md5``, ``sha1``, ``sha224``, ``sha256``, ``sha384``, ``sha512``). The current recommendation is to use ``sha256``.
eo: Deponejo **ELEKTU** haketfunkcion el unu el tiuj garantie disponeblaj ĉe la modulo :py:mod:`hashlib` en la norma biblioteko de Python (aktuale ``md5``, ``sha1``, ``sha224``, ``sha256``, ``sha384``, ``sha512``). La nuna rekomendo estas uzi ``sha256``.
ja: レジストリは、 Python の標準ライブラリの :py:mod:`hashlib` モジュール経由で利用可能であると保証されたハッシュ関数の中から一つを **選択するべきです** (現時点では、 ``md5`` ・ ``sha1`` ・ ``sha224`` ・ ``sha256`` ・ ``sha384`` ・ ``sha512``)。現時点では、 ``sha256`` の使用が推奨されています。
ru: Репозитории **ДОЛЖНЫ** выбирать хэш-функцию из числа тех, которые гарантированно доступны через модуль :py:mod:`hashlib` в стандартной библиотеке Python (в настоящее время это ``md5``, ```sha1``, ```sha224``, ```sha256``, ```sha384``, ```sha512``). В настоящее время рекомендуется использовать ``sha256``.
ta: களஞ்சியங்கள் ** ** பைதான் நிலையான நூலகத்தில் (தற்போது `` MD5``, `` சா 1``, ` `Sha224``,` `Sha256``,` `Sha384``, `` Sha512``). தற்போதைய பரிந்துரை `` Sha256`` ஐப் பயன்படுத்த வேண்டும்.
