Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Install the latest version of `twine <https://github.com/pypa/twine>`_; version 1.12.0 or higher is required:
eo: Instalu la plej novan version de `twine <https://github.com/pypa/twine>`_; versio 1.12.0 aŭ pli nova estas bezonata:
ja: 最新版の `twine <https://github.com/pypa/twine>`_ をインストールします; バージョン 1.12.0 またはそれ以上のものが必須です:
pt_br: Instale a versão mais recente do `twine <https://github.com/pypa/twine>`_; versão 1.12.0 ou superior é necessária:
ru: Установите последнюю версию `twine <https://github.com/pypa/twine>`_; требуется версия 1.12.0 или выше:
ta: `ட்வைன் <https://github.com/pypa/twine>` _; பதிப்பு 1.12.0 அல்லது அதற்கு மேற்பட்டது தேவை:

source: Build the sdist and wheel for your project as described under :ref:`Packaging Your Project`.
eo: Konstruu la fontan distribuon kaj la wheel por via projekto laŭ :ref:`Paki Vian Projekton <Packaging Your Project>`.
ja: :ref:`あなたのプロジェクトをパッケージする <Packaging Your Project>` に記述されているように、プロジェクトの sdist と wheel をビルドします。
pt_br: Construa o sdist e o wheel para seu projeto conforme descrito em :ref:`Empacotando seu projeto <Packaging Your Project>`.
ru: Соберите sdist и wheel для вашего проекта, как описано в разделе :ref:`Packaging Your Project`.
ta: கீழ் விவரிக்கப்பட்டுள்ளபடி உங்கள் திட்டத்திற்கான SDIST மற்றும் சக்கரத்தை உருவாக்குங்கள்: ref: `உங்கள் திட்டத்தை பேக்கேசிங் செய்தல்`.

source: Run ``twine check`` on the sdist and wheel:
eo: Rulu ``twine check`` pri la fonta distribuo kaj la wheel:
ja: sdist と wheel に対して ``twine check`` を実行します:
pt_br: Execute ``twine check`` no sdist e wheel:
ru: Запустите ``twine check`` на sdist и wheel:
ta: Sdist மற்றும் சக்கரத்தில் `` கயிறு காசோலை`` ஐ இயக்கவும்:

source: This command will report any problems rendering your README. If your markup renders fine, the command will output ``Checking distribution FILENAME: Passed``.
eo: Ĉi tiu komando raportis ajnan problemon pri montrado de via README. Se ĉio estas senproblema, la komando eligos ``Checking distribution DOSIERNOMO: Passed``.
ja: このコマンドは README のレンダリングに関する問題があれば報告するでしょう。マークアップのレンダリングに問題がなければ、 ``配布物を検査しています FILENAME: 合格 <Checking distribution FILENAME: Passed>`` と出力するでしょう。
pt_br: Este comando relatará quaisquer problemas ao processar seu README. Se sua marcação renderizar corretamente, o comando produzirá ``Checking Distribution FILENAME: Passed``.
ru: Эта команда сообщит о любых проблемах с рендерингом вашего README. Если разметка отображается нормально, команда выведет ``Проверка дистрибутива FILENAME: Пройдена``.
ta: இந்த கட்டளை உங்கள் README ஐ வழங்குவதில் ஏதேனும் சிக்கல்களைப் புகாரளிக்கும். உங்கள் மார்க்அப் நன்றாக வழங்கினால், கட்டளை வெளியிடும் `` விநியோக கோப்பு பெயரைச் சரிபார்க்கிறது: தேர்ச்சி பெற்றவர்``.

source: Migrating to PyPI.org
eo: Migri al PyPI.org
ja: PyPI.org へ移設する
pt_br: Migrando para PyPI.org
ru: Переход на PyPI.org
ta: Pypi.org க்கு இடம்பெயர்கிறது

source: Obsolete
eo: Evitinda
ja: 古い情報
pt_br: Obsoleto
ru: Устаревшее
ta: வழக்கற்றுப்போன

source: :term:`pypi.org` is the new, rewritten version of PyPI that has replaced the legacy PyPI code base. It is the default version of PyPI that people are expected to use. These are the tools and processes that people will need to interact with ``PyPI.org``.
eo: :term:`pypi.org` estas la nova, reverkita versio de PyPI anstataŭinta la malnovan kodon de PyPI. Ĝi estas la apriora versio de PyPI, kiun ĉiuj uzu. Jen la iloj kaj procedoj por interagi kun ``PyPI.org``.
ja: :term:`pypi.org` は、新しくて書き直されたバージョンの PyPI で、以前の PyPI コードベースを置き換えるものです。みなさんが普通はこれを使うものと期待されているバージョンの PyPI です。 ``PyPI.org`` とやり取りするためのツールや手順があります。
pt_br: :term:`pypi.org` é a nova versão reescrita do PyPI que substituiu a base de código legada do PyPI. É a versão padrão do PyPI que se espera que as pessoas usem. Estas são as ferramentas e processos que as pessoas precisarão para interagir com o ``PyPI .org``.
ru: :term:`pypi.org` - это новая, переработанная версия PyPI, которая заменила устаревшую кодовую базу PyPI. Это версия PyPI по умолчанию, которую люди должны использовать. Это инструменты и процессы, которые понадобятся людям для взаимодействия с ``PyPI.org``.
ta: : கால: `pypi.org` என்பது பைபியின் புதிய, மீண்டும் எழுதப்பட்ட பதிப்பாகும், இது மரபு பைபி குறியீடு தளத்தை மாற்றியுள்ளது. பைபியின் இயல்புநிலை பதிப்பாகும், மக்கள் பயன்படுத்துவார்கள் என்று எதிர்பார்க்கப்படுகிறது. மக்கள் `` pypi.org`` உடன் தொடர்பு கொள்ள வேண்டிய கருவிகள் மற்றும் செயல்முறைகள் இவை.

source: Publishing releases
eo: Publikigi eldonojn
ja: リリースを公開する
pt_br: Publicando lançamentos
ru: Публикация выпусков
ta: வெளியீட்டு வெளியீடுகள்

source: ``pypi.org`` is the default upload platform as of September 2016.
eo: ``pypi.org`` estas la implicita alŝuta platformo en Septembro 2016.
ja: 2016年9月以降、 ``pypi.org`` がデフォルトのアップロードプラットフォームです。
pt_br: ``pypi.org`` é a plataforma padrão para envio em setembro de 2016.
ru: С сентября 2016 года платформой загрузки по умолчанию является ``pypi.org``.
ta: `` pypi.org`` என்பது செப்டம்பர் 2016 நிலவரப்படி இயல்புநிலை பதிவேற்ற தளமாகும்.

source: Uploads through ``pypi.python.org`` were *switched off* on **July 3, 2017**. As of April 13th, 2018, ``pypi.org`` is the URL for PyPI.
eo: Alŝutoj per ``pypi.python.org` *ne plu eblas* ekde **3 Julio 2017**. Je 13 Aprilo 2018, ``pypi.org`` estas la retadreso por PyPI.
ja: ``pypi.python.org`` を通じたアップロードは **2017年7月3日** に使用不可能になりました。2018年4月13日以降は、``pypi.org`` が PyPI のURLです。
pt_br: Os envios por meio de ``pypi.python.org`` foram *desativados* em **3 de julho de 2017**. Desde 13 de abril de 2018, ``pypi.org`` é a URL do PyPI.
ru: Загрузка через ``pypi.python.org`` была *отключена* с **июля 3 июля 2017 года**. По состоянию на 13 апреля 2018 года URL-адресом PyPI является ``pypi.org``.
ta: `` Pypi.python.org`` மூலம் பதிவேற்றங்கள் ** சூலை 3, 2017 அன்று*சுவிட்ச் ஆஃப்***. ஏப்ரல் 13, 2018 நிலவரப்படி, `` pypi.org`` என்பது PYPI க்கான முகவரி ஆகும்.

source: The recommended way to migrate to PyPI.org for uploading is to ensure that you are using a new enough version of your upload tool.
eo: La rekomendata maniero migri al PyPI.org por alŝutado estas certigi, ke vi uzas sufiĉe novan version de via alŝutilo.
ja: PyPI.org へ移行するためのアップロードでは、アップロードに使うツールが十分に新しいバージョンのものであることを確実にしておくことが推奨されます。
pt_br: A maneira recomendada de migrar para PyPI.org para enviar é garantir que você esteja usando uma versão nova o suficiente de sua ferramenta de envio.
ru: Рекомендуемый способ перехода на PyPI.org для загрузки - убедиться, что вы используете достаточно новую версию вашего инструмента загрузки.
ta: பதிவேற்றுவதற்காக pypi.org க்கு இடம்பெயர பரிந்துரைக்கப்பட்ட வழி, உங்கள் பதிவேற்ற கருவியின் புதிய பதிப்பைப் பயன்படுத்துகிறீர்கள் என்பதை உறுதி செய்வதாகும்.

source: The default upload settings switched to ``pypi.org`` in the following versions:
eo: La implicita alŝuta celo ŝanĝiĝis al ``pypi.org`` en la jenaj versioj:
ja: ``pypi.org`` に転換するためのデフォルトのアップロード設定は次のようなバージョンです:
pt_br: As configurações de envio padrão mudaram para ``pypi.org`` nas seguintes versões:
ru: Настройки загрузки по умолчанию переключились на ``pypi.org`` в следующих версиях:
ta: இயல்புநிலை பதிவேற்ற அமைப்புகள் பின்வரும் பதிப்புகளில் `` pypi.org`` க்கு மாற்றப்பட்டன:

source: Python 2.7.13 (``distutils`` update)
eo: Python 2.7.13 (ĝisdatigo de ``distutils``)
ja: Python 2.7.13 (``distutils`` 更新)
pt_br: Python 2.7.13 (atualização de ``distutils``)
ru: Python 2.7.13 (обновление ``distutils``)
ta: பைதான் 2.7.13 (`` தொலைதூரங்கள்` புதுப்பிப்பு)

source: Python 3.4.6 (``distutils`` update)
eo: Python 3.4.6 (ĝisdatigo de ``distutils``)
ja: Python 3.4.6 (``distutils`` 更新)
pt_br: Python 3.4.6 (atualização de ``distutils``)
ru: Python 3.4.6 (обновление ``distutils``)
ta: பைதான் 3.4.6 (`` தொலைதூரங்கள்` புதுப்பிப்பு)

source: Python 3.5.3 (``distutils`` update)
eo: Python 3.5.3 (ĝisdatigo de ``distutils``)
ja: Python 3.5.3 (``distutils`` 更新)
pt_br: Python 3.5.3 (atualização de ``distutils``)
ru: Python 3.5.3 (обновление ``distutils``)
ta: பைதான் 3.5.3 (`` distutils`` புதுப்பிப்பு)

source: Python 3.6.0 (``distutils`` update)
eo: Python 3.6.0 (ĝisdatigo de ``distutils``)
ja: Python 3.6.0 (``distutils`` 更新)
pt_br: Python 3.6.0 (atualização de ``distutils``)
ru: Python 3.6.0 (обновление ``distutils``)
ta: பைதான் 3.6.0 (`` தொலைதூரங்கள்` புதுப்பிப்பு)

source: In addition to ensuring you're on a new enough version of the tool for the tool's default to have switched, you must also make sure that you have not configured the tool to override its default upload URL. Typically this is configured in a file located at :file:`$HOME/.pypirc`. If you see a file like:
ja: ツールのデフォルト設定が切り替わっている程に十分に新しいツールを使っていることを確認するのに加えて、そのデフォルトのアップロード先 URL を上書きするような設定をしていないことを確実にしてください。これは典型的には file:`$HOME/.pypirc` で設定されています。もしこんなファイルを目にするようであれば:
pt_br: Além de garantir que você esteja em uma versão nova o suficiente da ferramenta para que o padrão da ferramenta seja alterado, você também deve se certificar de que não configurou a ferramenta para substituir sua URL de envio padrão. Normalmente, isso é configurado em um arquivo localizado em :file:`$HOME/.pypirc`. Se você vir um arquivo como:
ru: Помимо того, что вы находитесь на достаточно новой версии инструмента, чтобы его значение по умолчанию изменилось, вы также должны убедиться, что не настроили инструмент на переопределение URL-адреса загрузки по умолчанию. Обычно это настраивается в файле, расположенном по адресу :file:`$HOME/.pypirc`. Если вы видите файл вида:
ta: கருவியின் இயல்புநிலை மாற்றுவதற்கான கருவியின் புதிய பதிப்பில் நீங்கள் இருப்பதை உறுதி செய்வதோடு மட்டுமல்லாமல், அதன் இயல்புநிலை பதிவேற்ற முகவரி ஐ மேலெழுத கருவியை நீங்கள் கட்டமைக்கவில்லை என்பதையும் உறுதிப்படுத்த வேண்டும். பொதுவாக இது அமைந்துள்ள ஒரு கோப்பில் கட்டமைக்கப்பட்டுள்ளது: கோப்பு: `$ home/.pypirc`. நீங்கள் ஒரு கோப்பைக் கண்டால்:

source: Then simply delete the line starting with ``repository`` and you will use your upload tool's default URL.
eo: Poste simple forigu la linion komenciĝanta per ``repository``, kaj vi uzos la aprioran retadreson de via alŝutilo.
ja: その時は、 ``repository`` で始まる行を削除するだけで、アップロードツールのデフォルト URL を使うようになります。
pt_br: Em seguida, simplesmente exclua a linha começando com ``repository`` e você usará a URL padrão da sua ferramenta de envio.
ru: Затем просто удалите строку, начинающуюся с ``repository``, и вы будете использовать URL по умолчанию вашего инструмента загрузки.
ta: பின்னர் `` களஞ்சியம்`` உடன் தொடங்கும் வரியை நீக்கவும், உங்கள் பதிவேற்ற கருவியின் இயல்புநிலை முகவரி ஐப் பயன்படுத்துவீர்கள்.

source: If for some reason you're unable to upgrade the version of your tool to a version that defaults to using PyPI.org, then you may edit :file:`$HOME/.pypirc` and include the ``repository:`` line, but use the value ``https://upload.pypi.org/legacy/`` instead:
eo: Se ial vi ne povas ĝisdatigi ilon al versio, kiu apriore uzas PyPI.org, do vi modifu :file:`$HOME/.pypirc` kaj inkluzivu la linion ``repository:``, sed anstataŭe uzu la valoron ``https://upload.pypi.org/legacy/``:
ja: なんらかの事情でPyPI.orgをデフォルトで使うところまでアップロードツールのバージョンを上げられないのであれば、 :file:`$HOME/.pypirc` で ``repository:`` 行が ``https://upload.pypi.org/legacy/`` を指すように編集しても構いません。
pt_br: Se por algum motivo você não puder atualizar a versão de sua ferramenta para uma versão que usa o padrão PyPI.org, então você pode editar :file:`$HOME/.pypirc` e incluir a linha ``repository:``, mas use o valor ``https://upload.pypi.org/legacy/`` em vez disso:
ru: Если по каким-то причинам вы не можете обновить версию вашего инструмента до версии, которая по умолчанию использует PyPI.org, то вы можете отредактировать :file:`$HOME/.pypirc` и включить строку ``repository:``, но вместо нее использовать значение ``https://upload.pypi.org/legacy/``:
ta: சில காரணங்களால் உங்கள் கருவியின் பதிப்பை pypi.org ஐப் பயன்படுத்துவதற்கு இயல்புநிலையாக இருக்கும் பதிப்பிற்கு மேம்படுத்த முடியாவிட்டால், நீங்கள் திருத்தலாம்: கோப்பு: `$ home/.pypirc` மற்றும்` `களஞ்சியம்:` `வரி சேர்க்கவும் .

source: (``legacy`` in this URL refers to the fact that this is the new server implementation's emulation of the legacy server implementation's upload API.)
eo: (``legacy`` en ĉi tiu retadreso signifas, ke tio estas la imitado, far la nova servila realigo, de la alŝuta API de la malnova servila realigo.)
ja: (この URL の中の ``legacy`` は、新しいサーバ実装が、以前のサーバ実装のアップロード API をエミュレートしているという事実を示しています。)
pt_br: (``legacy`` nesta URL refere-se ao fato de que esta é a emulação da implementação do novo servidor para a API de envio da implementação do servidor legado.)
ru: (``legacy`` в этом URL означает, что это новая реализация сервера, эмулирующая API загрузки старой реализации сервера)
ta: (``legacy`` in this முகவரி refers பெறுநர் the fact that this is the புதிய சேவையகம் implementation's போன்மம் of the legacy சேவையகம் implementation's upload API.)

source: Registering package names & metadata
eo: Registri pakajn nomojn kaj metadatenojn
ja: パッケージの名前とメタデータを登録する
pt_br: Registrando nomes pacotes e metadados
ru: Регистрация имён и метаданных пакетов
ta: தொகுப்பு பெயர்கள் மற்றும் மெட்டாடேட்டாவை பதிவு செய்தல்

source: Explicit pre-registration of package names with the ``setup.py register`` command prior to the first upload is no longer required, and is not currently supported by the legacy upload API emulation on PyPI.org.
eo: Eksplicita antaŭregistrado de paknomo per la komando ``setup.py register`` antaŭ la unua alŝuto ne plu necesas kaj aktuale ne estas subtenata de la imitado de la malnova alŝuta API ĉe PyPI.org.
ja: 初回のアップロードに先立って ``setup.py register`` コマンドでパッケージの名前を明示的に先行登録する必要がなくなり、PyPI.org における以前のアップロード API のエミュレーションではサポートされなくなりました。
pt_br: O pré-registro explícito de nomes de pacotes com o comando ``setup.py register`` antes do primeiro envio não é mais necessário e não é mais suportado pela emulação de API de envio legado no PyPI.org.
ru: Явная предварительная регистрация имен пакетов с помощью команды ``setup.py register`` перед первой загрузкой больше не требуется, и в настоящее время не поддерживается эмуляцией устаревшего API загрузки на PyPI.org.
ta: முதல் பதிவேற்றத்திற்கு முன்னர் `` setup.py பதிவு` கட்டளையுடன் தொகுப்பு பெயர்களை வெளிப்படையாக பதிவு செய்வது இனி தேவையில்லை, மேலும் தற்போது pypi.org இல் மரபு பதிவேற்ற பநிஇ ஈமுலேசன் மூலம் ஆதரிக்கப்படவில்லை.

source: As a result, attempting explicit registration after switching to using PyPI.org for uploads will give the following error message::
eo: Tial, provado registri eksplicite post ŝanĝado al PyPI. org por alŝutado kaŭzos la jenan eraron::
ja: その結果、アップロードに PyPI.org を使うように切り替えた後は明示的な登録の試行は次のエラーメッセージを返すでしょう::
pt_br: Como resultado, a tentativa de registro explícito após alternar para o uso de PyPI.org para envios gerará a seguinte mensagem de erro::
ru: В результате попытка явной регистрации после перехода на использование PyPI.org для загрузки приведет к следующему сообщению об ошибке::
ta: இதன் விளைவாக, பதிவேற்றங்களுக்கு pypi.org ஐப் பயன்படுத்துவதற்கு மாறிய பின் வெளிப்படையான பதிவை முயற்சிப்பது பின்வரும் பிழை செய்தியைக் கொடுக்கும் ::

source: The solution is to skip the registration step, and proceed directly to uploading artifacts.
eo: La solvo estas transsalti la registradon kaj rekte alŝuti artefaktojn.
ja: 解決方法は登録の段階を飛ばしていきなり作品のアップロードへと進むことです。
pt_br: A solução é pular a etapa de registro e prosseguir diretamente para o envio dos artefatos.
ru: Решение состоит в том, чтобы пропустить шаг регистрации и перейти непосредственно к загрузке артефактов.
ta: பதிவு படிநிலையைத் தவிர்ப்பதே தீர்வு, மற்றும் கலைப்பொருட்களைப் பதிவேற்றுவதற்கு நேரடியாக தொடரவும்.

source: Using TestPyPI
eo: Uzi TestPyPI
ja: TestPyPI を使う
pt_br: Usando TestPyPI
ru: Использование TestPyPI
ta: TestPypi ஐப் பயன்படுத்துதல்

source: Legacy TestPyPI (testpypi.python.org) is no longer available; use `test.pypi.org <https://test.pypi.org>`_ instead. If you use TestPyPI, you must update your :file:`$HOME/.pypirc` to handle TestPyPI's new location, by replacing ``https://testpypi.python.org/pypi`` with ``https://test.pypi.org/legacy/``, for example:
eo: La malonva Prova PyPI (testpypi.python.org) ne plu haveblas; uzu `test.pypi.org <https://test.pypi.org>`_ anstataŭe. Se vi uzas la Provan PyPI, vi devas ĝisdatigi la :file:`$HOME/.pypirc` por la nova loko de Prova PyPI, anstataŭigante ``https://testpypi.python.org/pypi`` per ``https://test.pypi.org/legacy/``, jene:
ja: 以前からの TestPyPI (testpypi.python.org) はもはや利用できませんので、代わりに `test.pypi.org <https://test.pypi.org>`_ を使ってください。 TestPyPI を使うのであれば、 :file:`$HOME/.pypirc` で ``https://testpypi.python.org/pypi`` を ``https://test.pypi.org/legacy/`` に置き換えるなどして、 TestPyPI の新しい場所を使うように設定しなければなりません。例えば:
pt_br: O TestPyPI legado (testpypi.python.org) não está mais disponível; use `test.pypi.org <https://test.pypi.org>`_ em vez disso. Se você usar o TestPyPI, você deve atualizar seu :file:`$HOME/.pypirc` para lidar com o novo local do TestPyPI, substituindo ``https://testpypi.python.org/pypi`` por ``https://test.pypi.org/legacy/``, por exemplo:
ru: Устаревший TestPyPI (testpypi.python.org) больше не доступен; вместо него используйте `test.pypi.org <https://test.pypi.org>`_. Если вы используете TestPyPI, вы должны обновить свой :file:`$HOME/.pypirc` для соответствия новому местоположению TestPyPI, заменив ``https://testpypi.python.org/pypi`` на ``https://test.pypi.org/legacy/``, например:
ta: மரபு டெச்ட்பை (testpy.python.org) இனி கிடைக்காது; அதற்கு பதிலாக `test.pypi.org <https://test.pypi.org>` _ ஐப் பயன்படுத்தவும். நீங்கள் டெச்ட்பிஐயைப் பயன்படுத்தினால், உங்கள்: கோப்பு: `$ முகப்பு/.pypirc` டெச்ட்பைப்பின் புதிய இருப்பிடத்தைக் கையாள,` `https: // testpy.python.org/pypi`` ஐ` `https: // தேர்வு உடன் மாற்றுவதன் மூலம் புதுப்பிக்க வேண்டும் .pypi.org/மரபு/``, எடுத்துக்காட்டாக:

source: Registering new user accounts
eo: Registri novajn uzantokontojn
ja: 新しいユーザアカウントを登録する
pt_br: Registrando novas contas de usuário
ru: Регистрация новых учётных записей пользователей
ta: புதிய பயனர் கணக்குகளை பதிவு செய்தல்

source: In order to help mitigate spam attacks against PyPI, new user registration through ``pypi.python.org`` was *switched off* on **February 20, 2018**. New user registrations at ``pypi.org`` are open.
eo: Por malpliigi atakojn kontraŭ PyPI, registrado de nova uzanto per ``pypi.python.org`` *malebliĝis* je *20a de Februaro 2018*. Eblas registrado de nova uzanto ĉe ``pypi.org``.
ja: PyPI に対するスパム攻撃を緩和する補助するために、 ``pypi.python.org`` における新規ユーザ登録は **2018年2月20日** に *終了* しました。 ``pypi.org`` での新規ユーザ登録が始まっています。
pt_br: A fim de ajudar a mitigar ataques de spam contra PyPI, o registro de novo usuário por meio de ``pypi.python.org`` foi *desativado* em **20 de fevereiro de 2018**. Novos registros de usuários em ``pypi.org`` estão abertos.
ru: Для того, чтобы помочь смягчить спам-атаки на PyPI, регистрация новых пользователей через ``pypi.python.org`` была *отключена* с **февраля 20, 2018**. Регистрация новых пользователей на ``pypi.org`` открыта.
ta: PYPI க்கு எதிரான ச்பேம் தாக்குதல்களைத் தணிக்க உதவுவதற்காக, `` pypi.python.org`` மூலம் புதிய பயனர் பதிவு**பிப்ரவரி 20, 2018 அன்று அணைக்கப்பட்டது***. `` Pypi.org`` இல் புதிய பயனர் பதிவுகள் திறந்திருக்கும்.

source: Browsing packages
eo: Foliumi pakojn
ja: パッケージを一覧する
pt_br: Navegando pelos pacotes
ru: Просмотр пакетов
ta: தொகுப்புகள் உலாவுதல்

source: While ``pypi.python.org`` is may still be used in links from other PyPA documentation, etc, the default interface for browsing packages is ``pypi.org``. The domain pypi.python.org now redirects to pypi.org, and may be disabled sometime in the future.
eo: Kvankam hiperligoj en alia dokumentoj de PyPA povas ankoraŭ uzi ``pypi.python.org'', la apriora fasado por foliumi pakojn estas ``pypi.org``. La retejo ``pypi.python.org`` nun estas redirektata al ``pypi.org``, kaj povas ekmalesti estontece.
ja: ``pypi.python.org`` が他の PyPA 説明文書などからのリンクに使われているとしても、パッケージを一覧するデフォルトのインタフェイスは ``pypi.org`` です。pupi.python.org ドメイン名は今は pypi.org へリダイレクトされていて、いつか将来の時点で無効にされるでしょう。
pt_br: Embora ``pypi.python.org`` ainda possa ser usado em links de outras documentações do PyPA, etc, a interface padrão para navegar pelos pacotes é ``pypi.org``. O domínio pypi.python.org agora redireciona para pypi.org e pode ser desativado em algum momento no futuro.
ru: Хотя ``pypi.python.org`` по-прежнему может использоваться в ссылках из другой документации PyPA и т.д., по умолчанию для просмотра пакетов используется интерфейс ``pypi.org``. Домен pypi.python.org сейчас перенаправляет на pypi.org, и может быть отключен в будущем.
ta: `` Pypi.python.org`` `மற்ற PYPA ஆவணங்கள் போன்றவற்றிலிருந்து இன்னும் பயன்படுத்தப்படலாம் என்றாலும், தொகுப்புகளை உலாவுவதற்கான இயல்புநிலை இடைமுகம்` `pypi.org``. Pypi.python.org டொமைன் இப்போது pypi.org க்கு திருப்பி விடுகிறது, மேலும் எதிர்காலத்தில் முடக்கப்படலாம்.

source: Downloading packages
eo: Elŝuti pakojn
ja: パッケージをダウンロードする
pt_br: Baixando pacotes
ru: Загрузка пакетов
ta: தொகுப்புகளைப் பதிவிறக்குகிறது

source: ``pypi.org`` is the default host for downloading packages.
eo: ``pypi.org`` estas la implicita servilo por elŝuti pakojn.
ja: ``pypi.org`` が、パッケージをダウンロードする際のデフォルトのホストです。
pt_br: ``pypi.org`` é o host padrão para download de pacotes.
ru: ``pypi.org`` является хостом по умолчанию для загрузки пакетов.
ta: `` pypi.org`` என்பது தொகுப்புகளைப் பதிவிறக்குவதற்கான இயல்புநிலை புரவலன் ஆகும்.

source: Managing published packages and releases
eo: Administri eldonitajn pakojn kaj eldonojn
ja: 公開済みパッケージとリリースを管理する
pt_br: Gerenciando pacotes e lançamentos publicados
ru: Управление опубликованными пакетами и выпусками
ta: வெளியிடப்பட்ட தொகுப்புகள் மற்றும் வெளியீடுகளை நிர்வகித்தல்

source: ``pypi.org`` provides a fully functional interface for logged in users to manage their published packages and releases.
eo: ``pypi.org`` provizas plenfunkcian fasadon por salutintaj uzantoj administri siajn eldonitajn pakojn kaj versiojn.
ja: ``pypi.org`` では、ログインしたユーザが自分が公開したプロジェクトやリリースについて管理するための全機能を提供しています。
pt_br: ``pypi.org`` fornece uma interface totalmente funcional para usuários autenticados gerenciarem seus pacotes publicados e lançamentos.
ru: ``pypi.org`` предоставляет полнофункциональный интерфейс для авторизованных пользователей для управления своими опубликованными пакетами и релизами.
ta: `` pypi.org`` பயனர்கள் தங்கள் வெளியிடப்பட்ட தொகுப்புகள் மற்றும் வெளியீடுகளை நிர்வகிக்க உள்நுழைந்த ஒரு முழுமையான செயல்பாட்டு இடைமுகத்தை வழங்குகிறது.

source: How to modernize a ``setup.py`` based project?
eo: Kiel modernigi projekton uzantan ``setup.py``?
ja: どうすれば ``setup.py`` ベースのプロジェクトを近代化できるでしょうか？
pt_br: Como modernizar um projeto baseado em ``setup.py``?
ru: Как модернизировать проект, основанный на ``setup.py``?
ta: `` Setup.py`` அடிப்படையிலான திட்டத்தை எவ்வாறு நவீனமயமாக்குவது?

source: Should ``pyproject.toml`` be added?
eo: Ĉu aldoni ``pyproject.toml``?
ja: ``pyproject.toml`` を追加するべきですか？
pt_br: ``pyproject.toml`` deve ser adicionado?
ru: Нужно ли добавить ``pyproject.toml``?
ta: `` Pyproject.toml`` சேர்க்கப்பட வேண்டுமா?
