Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: :doc:`Docs <index>` | `Issues <https://github.com/pypa/packaging.python.org/issues>`__ | `GitHub <https://github.com/pypa/packaging.python.org>`__
eo: :doc:`Dokumentaro <index>` | `Cimoj <https://github.com/pypa/packaging.python.org/issues>`__ | `GitHub <https://github.com/pypa/packaging.python.org>`__
ja: :doc:`説明文書 <index>` | `課題リスト <https://github.com/pypa/packaging.python.org/issues>`__ | `GitHub <https://github.com/pypa/packaging.python.org>`__
pt_br: :doc:`Documentação <index>` | `Issues <https://github.com/pypa/packaging.python.org/issues>`__ | `GitHub <https://github.com/pypa/packaging.python.org>`__
ru: :doc:`Документы <индекс>` | `Вопросы <https://github.com/pypa/packaging.python.org/issues>`__ | `GitHub <https://github.com/pypa/packaging.python.org>`__
ta: : டாக்: `டாக்ச் <குறியீட்டு>` | `சிக்கல்கள் <https://github.com/pypa/packaging.python.org/issues>` __ | `Github <https://github.com/pypa/packaging.python.org> __ __ __

source: This guide!
eo: Jen ĉi tiu gividilo!
ja: このガイド!
pt_br: Este guia!
ru: Это руководство!
ta: இந்த வழிகாட்டி!

source: readme_renderer
ta: README_RENDER

source: `GitHub and docs <https://github.com/pypa/readme_renderer/>`__ | `PyPI <https://pypi.org/project/readme-renderer/>`__
eo: `GitHub kaj dokumentaro <https://github.com/pypa/readme_renderer/>`__ | `PyPI <https://pypi.org/project/readme-renderer/>`__
ja: `GitHub および説明文書 <https://github.com/pypa/readme_renderer/>`__ | `PyPI <https://pypi.org/project/readme-renderer/>`__
pt_br: `GitHub e documentação <https://github.com/pypa/readme_renderer/>`__ | `PyPI <https://pypi.org/project/readme-renderer/>`__
ru: `GitHub и документация <https://github.com/pypa/readme_renderer/>`__ | `PyPI <https://pypi.org/project/readme-renderer/>`__
ta: `கிதுப் மற்றும் டாக்ச் <https://github.com/pypa/readme_renderer/> __ | `Pypi <https://pypi.org/project/readme-renderer/> __ __ __

source: ``readme_renderer`` is a library that package developers use to render their user documentation (README) files into HTML from markup languages such as Markdown or reStructuredText. Developers call it on its own or via :ref:`twine`, as part of their release management process, to check that their package descriptions will properly display on PyPI.
ja: ``readme_renderer`` は、Markdown や reStructuredText のようなマークアップ言語で書かれたユーザ向け説明ファイル (README) を HTML に展開するためにパッケージ開発者が用いるライブラリです。開発者は、リリース管理プロセスの一環として直接または :ref:`twine` 経由でこれを呼び出し、そのパッケージに関する説明がきちんと PyPI に表示されることを確認します。
pt_br: ``readme_renderer`` é uma biblioteca que os desenvolvedores de pacote usam para renderizar seus arquivos de documentação de usuário (README) no HTML a partir de linguagens de marcação como Markdown ou reStructuredText. Os desenvolvedores o chamam por conta própria ou via :ref:`twine`, como parte de seu processo de gerenciamento de lançamento, para verificar se as descrições de seus pacotes serão exibidas corretamente no PyPI.
ru: ``readme_renderer`` - это библиотека, которую разработчики пакетов используют для рендеринга файлов пользовательской документации (README) в HTML из языков разметки, таких как Markdown или reStructuredText. Разработчики вызывают ее самостоятельно или через :ref:`twine`, как часть процесса управления релизами, чтобы проверить, что описания их пакетов будут правильно отображаться на PyPI.
ta: `` ReadMe_Renderer`` என்பது ஒரு நூலகம் ஆகும், இது தொகுப்பு உருவாக்குபவர்கள் தங்கள் பயனர் ஆவணங்களை (README) கோப்புகளை உஉகுமொ இல் மார்க்அப் மொழிகளான மார்க் பேரூர் அல்லது மறுசீரமைப்பது போன்றவற்றிலிருந்து வழங்க பயன்படுத்தும் ஒரு நூலகமாகும். உருவாக்குபவர்கள் அதை சொந்தமாக அல்லது வழியாக அழைக்கிறார்கள்: ref: `கயிறு`, அவர்களின் வெளியீட்டு மேலாண்மை செயல்முறையின் ஒரு பகுதியாக, அவர்களின் தொகுப்பு விளக்கங்கள் PYPI இல் சரியாகக் காண்பிக்கப்படும் என்பதை சரிபார்க்க.

source: `Docs <https://setuptools.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/setuptools/issues>`__ | `GitHub <https://github.com/pypa/setuptools>`__ | `PyPI <https://pypi.org/project/setuptools>`__
eo: `Dokumentaro <https://setuptools.readthedocs.io/en/latest/>`__ | `Cimoj <https://github.com/pypa/setuptools/issues>`__ | `GitHub <https://github.com/pypa/setuptools>`__ | `PyPI <https://pypi.org/project/setuptools>`__
ja: `説明文書 <https://setuptools.readthedocs.io/en/latest/>`__ | `課題リスト <https://github.com/pypa/setuptools/issues>`__ | `GitHub <https://github.com/pypa/setuptools>`__ | `PyPI <https://pypi.org/project/setuptools>`__
pt_br: `Documentação <https://setuptools.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/setuptools/issues>`__ | `GitHub <https://github.com/pypa/setuptools>`__ | `PyPI <https://pypi.org/project/setuptools>`__
ru: `Документы <https://setuptools.readthedocs.io/en/latest/>`__ | `Проблемы <https://github.com/pypa/setuptools/issues>`__ | `GitHub <https://github.com/pypa/setuptools>`__ | `PyPI <https://pypi.org/project/setuptools>`__
ta: `டாக்ச் <https://setuptools.readthedocs.io/en/latest/> __ | `சிக்கல்கள் <https://github.com/pypa/setuptools/issues>` __ | `Github <https://github.com/pypa/setuptools>` __ | `Pypi <https://pypi.org/project/setuptools>` __

source: Setuptools (which includes ``easy_install``) is a collection of enhancements to the Python distutils that allow you to more easily build and distribute Python :term:`distributions <Distribution Package>`, especially ones that have dependencies on other packages.
eo: Setuptools (kiu inkluzivas ``easy_install``) estas kolekto de plibonigaĵoj por la modulo ``distutils`` de Python permesanta pli facile konstrui kaj distribui :term:`distribuojn <Distribution Package>` por Python, speciale tiujn dependantajn de aliaj pakoj.
ja: (``easy_install`` を含む) Setuptools は Python の distutils への拡張を集めたもので、特に他のパッケージに依存関係がある場合に、より簡単に Python の :term:`配布物 <Distribution Package>` をビルドし配布することが可能となります。
pt_br: Setuptools (que inclui ``easy_install``) é uma coleção de melhorias para o distutils do Python que permite a você construir e distribuir mais facilmente :term:`distribuições <Pacote de Distribuição>` Python, especialmente aquelas que possuem dependências de outros pacotes.
ru: Setuptools (включающий ``easy_install``) - это набор улучшений для Python distutils, которые позволяют вам легче собирать и распространять Python :term:`distributions <Distribution Package>`, особенно те, которые имеют зависимости от других пакетов.
ta: Setuptools (இதில் `` Ease_install`` ஐ உள்ளடக்கியது) என்பது பைத்தான் தொலைதூரங்களுக்கு மேம்பாடுகளின் தொகுப்பாகும், இது பைத்தானை எளிதாக உருவாக்கவும் விநியோகிக்கவும் உங்களை அனுமதிக்கிறது: கால: `விநியோகம் <விநியோக தொகுப்பு>`, குறிப்பாக பிற தொகுப்புகளைச் சார்ந்திருக்கும்.

source: trove-classifiers
ta: ட்ரோவ்-கிளாசிஃபையர்கள்

source: `Issues <https://github.com/pypa/trove-classifiers/issues>`__ | `GitHub <https://github.com/pypa/trove-classifiers>`__ | `PyPI <https://pypi.org/project/trove-classifiers/>`__
eo: `Cimoj <https://github.com/pypa/trove-classifiers/issues>`__ | `GitHub <https://github.com/pypa/trove-classifiers>`__ | `PyPI <https://pypi.org/project/trove-classifiers/>`__
ja: `課題リスト <https://github.com/pypa/trove-classifiers/issues>`__ | `GitHub <https://github.com/pypa/trove-classifiers>`__ | `PyPI <https://pypi.org/project/trove-classifiers/>`__
ru: `Проблемы <https://github.com/pypa/trove-classifiers/issues>`__ | `GitHub <https://github.com/pypa/trove-classifiers>`__ | `PyPI <https://pypi.org/project/trove-classifiers/>`__
ta: `சிக்கல்கள் <https://github.com/pypa/trove-classifiers/issues>` __ | `Github <https://github.com/pypa/trove-classifiers>` __ | `Pypi <https://pypi.org/project/trove-classifiers/> ____ __ __

source: trove-classifiers is the canonical source for `classifiers on PyPI <https://pypi.org/classifiers/>`_, which project maintainers use to :ref:`systematically describe their projects <core-metadata-classifier>` so that users can better find projects that match their needs on the PyPI.
eo: trove-classifiers estas la norma fonto por `klasigiloj ĉe PyPI <https://pypi.org/classifiers/>`_, kiujn mastrumantoj uzas por :ref:`sisteme priskribi siajn projektojn <core-metadata-classifier>`, helpante uzantojn facile serĉi projektojn taŭgajn por siaj bezonoj ĉe PyPI.
ja: trove-classifiers は、`PyPI における分類子 <https://pypi.org/classifiers/>`_ の正統な源泉で、ユーザがそのニーズに即したプロジェクトを PyPI でよりうまく探し出せるように、プロジェクトの保守者が `プロジェクトを体系的に表現する <core-metadata-classifier>`_ のに使います。
pt_br: trove-classifiers é a fonte canônica para `classificadores no PyPI <https://pypi.org/classifiers/>`_, que os mantenedores de projetos usam para :ref:`descrever sistematicamente seus projetos <core-metadata-classifier>` para que os usuários possam encontrar melhor os projetos que correspondem às suas necessidades no PyPI.
ru: trove-classifiers - это канонический источник для `классификаторов на PyPI <https://pypi.org/classifiers/>`_, которые сопровождающие проектов используют для :ref:`систематического описания своих проектов <core-metadata-classifier>`, чтобы пользователи могли лучше находить проекты, соответствующие их потребностям, на PyPI.
ta: Pypi <https://pypi.org/classifiers/> _ _, இது திட்ட பராமரிப்பாளர்கள் பயன்படுத்தும்: ref: `அவர்களின் திட்டங்களை முறையாக விவரிக்கவும் <கோர்-மெட்டாடேட்டா-கிளாசிஃபையர்> பயனர்கள் தங்கள் தேவைகளுக்கு பொருந்தக்கூடிய திட்டங்களை PYPI இல் சிறப்பாகக் காணலாம்.

source: The trove-classifiers package contains a list of valid classifiers and deprecated classifiers (which are paired with the classifiers that replace them). Use this package to validate classifiers used in packages intended for uploading to PyPI. As this list of classifiers is published as code, you can install and import it, giving you a more convenient workflow compared to referring to the `list published on PyPI <https://pypi.org/classifiers/>`_. The `issue tracker <https://github.com/pypa/trove-classifiers/issues>`_ for the project hosts discussions on proposed classifiers and requests for new classifiers.
eo: La pako ``trove-classifiers`` enhavas liston de validaj klasigiloj kaj evitindaj klasigiloj (parigitaj kun la anstataŭantaj klasigiloj). Uzu tiun pakon por konfirmi klasigilon en pako alŝutota al PyPI. Ĉar tiu listo de klasigiloj estas kodo, oni povas instali kaj importi ĝin, por pli facila laborfluo ol la `listo ĉe PyPI <https://pypi.org/classifiers/>`_. La `cimdatenbanko <https://github.com/pypa/trove-classifiers/issues>`_ de la projekto gastigas diskutojn pri proponitaj klasigiloj kaj petoj por novaj klasigiloj.
ja: trove-classifiers パッケージには、正当な分類子および (それを置き換えた分類子と一組で) 非推奨になった分類子のリストが含まれています。 PyPI にアップロードしようとしているパッケージで使われている分類子の正当性を確認するために、このパッケージを使いましょう。この分類子リストがソースコードの形で公開されているので、それをインストールしてインポートすれば、 `PyPI で公開されているリスト <https://pypi.org/classifiers/>`_ を参照するよりももっと便利なワークフローを構築することができます。本プロジェクトの `課題リスト <https://github.com/pypa/trove-classifiers/issues>`_ に、提案された分類子に関する議論や新しい分類子が欲しいという要求に関する議論が公開されています。
pt_br: O pacote trove-classifiers contém uma lista de classificadores válidos e classificadores descontinuados (que são pareados com os classificadores que os substituem). Use este pacote para validar classificadores usados em pacotes destinados ao envio para o PyPI. Como esta lista de classificadores é publicada como código, você pode instalá-la e importá-la, proporcionando um fluxo de trabalho mais conveniente em comparação com a referência à `lista publicada em PyPI <https://pypi.org/classifiers/>`_. O `rastreador de problemas <https://github.com/pypa/trove-classifiers/issues>`_ para o projeto hospeda discussões sobre classificadores propostos e solicitações de novos classificadores.
ru: Пакет trove-classifiers содержит список валидных классификаторов и устаревших классификаторов (которые сопровождаются классификаторами, которые их заменяют). Используйте этот пакет для проверки классификаторов, используемых в пакетах, предназначенных для загрузки в PyPI. Поскольку этот список классификаторов опубликован в виде кода, вы можете устанавливать и импортировать его, что обеспечивает более удобный рабочий процесс по сравнению с обращением к `списку, опубликованному на PyPI <https://pypi.org/classifiers/>`_. На трекере `issue tracker <https://github.com/pypa/trove-classifiers/issues>`_ проекта ведутся обсуждения предлагаемых классификаторов и запросы на новые классификаторы.
ta: ட்ரோவ்-கிளாசிஃபியர்ச் தொகுப்பில் செல்லுபடியாகும் வகைப்படுத்திகள் மற்றும் நீக்கப்பட்ட வகைப்படுத்திகளின் பட்டியல் உள்ளது (அவை அவற்றை மாற்றும் வகைப்படுத்திகளுடன் இணைக்கப்பட்டுள்ளன). PYPI இல் பதிவேற்றுவதற்காக வடிவமைக்கப்பட்ட தொகுப்புகளில் பயன்படுத்தப்படும் வகைப்படுத்திகளை சரிபார்க்க இந்த தொகுப்பைப் பயன்படுத்தவும். வகைப்படுத்திகளின் இந்த பட்டியல் குறியீடாக வெளியிடப்படுவதால், நீங்கள் அதை நிறுவி இறக்குமதி செய்யலாம், இது பைபி <https://pypi.org/classifiers/> `_ இல் வெளியிடப்பட்ட` பட்டியலைக் குறிப்பிடுவதை ஒப்பிடும்போது மிகவும் வசதியான பணிப்பாய்வுகளை உங்களுக்கு வழங்குகிறது. `வெளியீடு டிராக்கர் <https://github.com/pypa/trove-classifiers/issues>` _ திட்டத்திற்கு முன்மொழியப்பட்ட வகைப்படுத்திகள் பற்றிய விவாதங்கள் மற்றும் புதிய வகைப்படுத்திகளுக்கான கோரிக்கைகள்.

source: twine
ta: கயிறு

source: `Docs <https://twine.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/twine/issues>`__ | `GitHub <https://github.com/pypa/twine>`__ | `PyPI <https://pypi.org/project/twine>`__
eo: `Dokumentaro <https://twine.readthedocs.io/en/latest/>`__ | `Cimoj <https://github.com/pypa/twine/issues>`__ | `GitHub <https://github.com/pypa/twine>`__ | `PyPI <https://pypi.org/project/twine>`__
ja: `説明文書 <https://twine.readthedocs.io/en/latest/>`__ | `課題リスト <https://github.com/pypa/twine/issues>`__ | `GitHub <https://github.com/pypa/twine>`__ | `PyPI <https://pypi.org/project/twine>`__
pt_br: `Documentação <https://twine.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/twine/issues>`__ | `GitHub <https://github.com/pypa/twine>`__ | `PyPI <https://pypi.org/project/twine>`__
ru: `Документы <https://twine.readthedocs.io/en/latest/>`__ | `Проблемы <https://github.com/pypa/twine/issues>`__ | `GitHub <https://github.com/pypa/twine>`__ | `PyPI <https://pypi.org/project/twine>`__
ta: `டாக்ச் <https://twine.readthedocs.io/en/latest/> __ | `சிக்கல்கள் <https://github.com/pypa/twine/issues>` __ | `Github <https://github.com/pypa/twine>` __ | `Pypi <https://pypi.org/project/twine>` __

source: Twine is the primary tool developers use to upload packages to the Python Package Index or other Python package indexes. It is a command-line program that passes program files and metadata to a web API. Developers use it because it's the official PyPI upload tool, it's fast and secure, it's maintained, and it reliably works.
eo: Twine estas la ĉefa ilo por alŝuti pakon al la Python-Pakindekso aŭ alia pakindekso por Python. Ĝi estas komandlinia programo, kiu liveras programdosierojn kaj metadatenojn al TTT-a API. Programistoj uzas ĝin, ĉar ĝi estas la oficiala PyPI-alŝutilo, ĝi estas rapida kaj sekura, ĝi estas mastrumata, kaj ĝi funkcias fidinde.
ja: Twine は、開発者がパッケージをPython パッケージインデックス (PyPI) や他の Python 用パッケージインデックスへアップロードするのに使う最初の選択肢です。これはコマンドラインプログラムで、プログラムのファイルやメタデータを web API へ渡します。開発者がこれを使うのは、公式の PyPI へのアップロードツールであるからであり、動作が速く安全であるからであり、保守されているからであり、動作が信頼できるからです。
pt_br: Twine é a principal ferramenta que os desenvolvedores usam para enviar pacotes para o índice de pacotes Python ou outros Python Package Index. É um programa de linha de comando que passa arquivos de programa e metadados para uma API web. Os desenvolvedores o usam porque é a ferramenta oficial de envio do PyPI, é rápida e segura, é mantida e funciona de forma confiável.
ru: Twine - это основной инструмент, используемый разработчиками для загрузки пакетов в Python Package Index или другие индексы пакетов Python. Это программа командной строки, которая передает файлы программ и метаданные в веб-интерфейс. Разработчики используют его, потому что это официальный инструмент загрузки PyPI, он быстрый и безопасный, его поддерживают, и он надежно работает.
ta: பைதான் தொகுப்பு குறியீட்டு அல்லது பிற பைதான் தொகுப்பு குறியீடுகளுக்கு தொகுப்புகளை பதிவேற்ற உருவாக்குபவர்கள் பயன்படுத்தும் முதன்மை கருவி உருவாக்குபவர்கள் கயிறு. இது ஒரு கட்டளை-வரி நிரலாகும், இது நிரல் கோப்புகள் மற்றும் மெட்டாடேட்டாவை ஒரு வலை பநிஇ க்கு அனுப்பும். உருவாக்குபவர்கள் இதைப் பயன்படுத்துகிறார்கள், ஏனெனில் இது அதிகாரப்பூர்வ PYPI பதிவேற்ற கருவி, இது வேகமாகவும் பாதுகாப்பாகவும் இருக்கிறது, அது பராமரிக்கப்படுகிறது, மேலும் இது நம்பத்தகுந்த வகையில் செயல்படுகிறது.

source: virtualenv
ta: மெய்நிகர்இன்

source: `Docs <https://virtualenv.pypa.io/en/stable/index.html>`__ | `Issues <https://github.com/pypa/virtualenv/issues>`__ | `GitHub <https://github.com/pypa/virtualenv>`__ | `PyPI <https://pypi.org/project/virtualenv/>`__
eo: `Dokumentaro <https://virtualenv.pypa.io/en/stable/index.html>`__ | `Cimoj <https://github.com/pypa/virtualenv/issues>`__ | `GitHub <https://github.com/pypa/virtualenv>`__ | `PyPI <https://pypi.org/project/virtualenv/>`__
ja: `説明文書 <https://virtualenv.pypa.io/en/stable/index.html>`__ | `課題リスト <https://github.com/pypa/virtualenv/issues>`__ | `GitHub <https://github.com/pypa/virtualenv>`__ | `PyPI <https://pypi.org/project/virtualenv/>`__
pt_br: `Documentação <https://virtualenv.pypa.io/en/stable/index.html>`__ | `Issues <https://github.com/pypa/virtualenv/issues>`__ | `GitHub <https://github.com/pypa/virtualenv>`__ | `PyPI <https://pypi.org/project/virtualenv/>`__
ru: `Документация <https://virtualenv.pypa.io/en/stable/index.html>`__ | `Замечания <https://github.com/pypa/virtualenv/issues>`__ | `GitHub <https://github.com/pypa/virtualenv>`__ | `PyPI <https://pypi.org/project/virtualenv/>`__
ta: `டாக்ச் <https://virtualenv.pypa.io/en/stable/index.html> __ | `சிக்கல்கள் <https://github.com/pypa/virtualenv/issues> __ | `Github <https://github.com/pypa/virtualenv>` __ | `Pypi <https://pypi.org/project/virtualenv/> ____ __

source: virtualenv is a tool for creating isolated Python :term:`Virtual Environments <Virtual Environment>`, like :ref:`venv`. Unlike :ref:`venv`, virtualenv can create virtual environments for other versions of Python, which it locates using the PATH environment variable. It also provides convenient features for configuring, maintaining, duplicating, and troubleshooting virtual environments. For more information, see the section on :ref:`Creating and using Virtual Environments`.
ja: virtualenv は、 :ref:`venv` と同様に独立した Python :term:`仮想環境 <Virtual Environment>` を生成するツールです。 :ref:`venv` とは異なり、virtualenv は PATH 環境変数を使って特定することで他のバージョンの Python 用の仮想環境を作成することができます。他にも、仮想環境の設定・保守・複製・問題解決のための便利な機能を提供しています。より詳しくは、 :ref:`仮想環境を作って使う <Creating and using Virtual Environments>` の節を見てください。
pt_br: virtualenv é uma ferramenta para criar :term:`Ambientes Virtuais <Virtual Environment>` isolados do Python, de forma similar ao :ref:`venv`. Ao contrário de :ref:`venv`, virtualenv pode criar ambientes virtuais para outras versões de Python, que ele localiza usando a variável ambiente PATH. Ele também fornece recursos convenientes para configurar, manter, duplicar e solucionar ambientes virtuais. Para obter mais informações, consulte a seção :ref:`Creating and using Virtual Environments`.
ru: virtualenv - это инструмент для создания изолированных Python :term:`Virtual Environments <Виртуальная среда>`, подобно :ref:`venv`. В отличие от :ref:`venv`, virtualenv может создавать виртуальные среды для других версий Python, которые он находит с помощью переменной окружения PATH. Он также предоставляет удобные функции для настройки, поддержки, дублирования и устранения неполадок в виртуальных средах. Для получения дополнительной информации см. раздел :ref:`Создание и использование виртуальных сред`.
ta: மெய்நிகர் ஈன்வ் என்பது தனிமைப்படுத்தப்பட்ட பைத்தானை உருவாக்குவதற்கான ஒரு கருவியாகும்: கால: `மெய்நிகர் சூழல்கள் <மெய்நிகர் சூழல்>`, போன்றவை: குறிப்பு: `வெவி`. போலியானது: ref: `vev`, மலைப்பாம்பின் பிற பதிப்புகளுக்கு மெய்நிகர் சூழல்களை உருவாக்க முடியும், இது பாதை சூழல் மாறியைப் பயன்படுத்தி கண்டுபிடிக்கும். மெய்நிகர் சூழல்களை கட்டமைத்தல், பராமரித்தல், நகல் செய்தல் மற்றும் சரிசெய்தல் ஆகியவற்றிற்கான வசதியான அம்சங்களையும் இது வழங்குகிறது. மேலும் தகவலுக்கு, பகுதியைப் பார்க்கவும்: ref: `மெய்நிகர் சூழல்களை உருவாக்குதல் மற்றும் பயன்படுத்துதல்`.

source: Warehouse
ta: கிடங்கு

source: `Docs <https://warehouse.pypa.io/>`__ | `Issues <https://github.com/pypa/warehouse/issues>`__ | `GitHub <https://github.com/pypa/warehouse>`__
eo: `Dokumentaro <https://warehouse.pypa.io/>`__ | `Cimoj <https://github.com/pypa/warehouse/issues>`__ | `GitHub <https://github.com/pypa/warehouse>`__
ja: `説明文書 <https://warehouse.pypa.io/>`__ | `課題リスト <https://github.com/pypa/warehouse/issues>`__ | `GitHub <https://github.com/pypa/warehouse>`__
pt_br: `Documentação <https://warehouse.pypa.io/>`__ | `Issues <https://github.com/pypa/warehouse/issues>`__ | `GitHub <https://github.com/pypa/warehouse>`__
ru: `Документы <https://warehouse.pypa.io/>`__ | `Проблемы <https://github.com/pypa/warehouse/issues>`__ | `GitHub <https://github.com/pypa/warehouse>`__
ta: `டாக்ச் <https://warehouse.pypa.io/> __ | `சிக்கல்கள் <https://github.com/pypa/warehouse/issues>` __ | `Github <https://github.com/pypa/warehouse> ____ __

source: The current codebase powering the :term:`Python Package Index (PyPI)`. It is hosted at `pypi.org <https://pypi.org/>`_. The default source for :ref:`pip` downloads.
eo: La aktuala programaro funkciiganta la :term:`Python-Pakindekson <Python Package Index (PyPI)>)`. Ĝi troviĝas ĉe `pypi.org <https://pypi.org/>`_. La implicita fonto de elŝutado per :ref:`pip`.
ja: 現在の :term:`Python パッケージインデックス <Python Package Index (PyPI)>` を構成しているコードベース。 `pypi.org <https://pypi.org/>`_ にホストされています。 :ref:`pip` がダウンロードする際のデフォルトのソースです。
pt_br: A base de código atual que alimenta o :term:`Python Package Index (PyPI)`. Está hospedado em `pypi.org <https://pypi.org/>`_. A fonte padrão para downloads do :ref:`pip`.
ru: Текущая кодовая база, лежащая в основе :term:`Python Package Index (PyPI)`. Она размещена на сайте `pypi.org <https://pypi.org/>`_. Источник по умолчанию для загрузки :ref:`pip`.
ta: தற்போதைய குறியீட்டு தளத்தை இயக்குகிறது: கால: `பைதான் தொகுப்பு அட்டவணை (PYPI)`. இது `pypi.org <https://pypi.org/>` _ இல் வழங்கப்படுகிறது. இதற்கான இயல்புநிலை ஆதாரம்: குறிப்பு: `பிப்` பதிவிறக்கங்கள்.

source: wheel
ta: சக்கரம்

source: `Docs <https://wheel.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/wheel/issues>`__ | `GitHub <https://github.com/pypa/wheel>`__ | `PyPI <https://pypi.org/project/wheel>`__
eo: `Dokumentaro <https://wheel.readthedocs.io/en/latest/>`__ | `Cimoj <https://github.com/pypa/wheel/issues>`__ | `GitHub <https://github.com/pypa/wheel>`__ | `PyPI <https://pypi.org/project/wheel>`__
ja: `説明文書 <https://wheel.readthedocs.io/en/latest/>`__ | `課題リスト <https://github.com/pypa/wheel/issues>`__ | `GitHub <https://github.com/pypa/wheel>`__ | `PyPI <https://pypi.org/project/wheel>`__
pt_br: `Documentação <https://wheel.readthedocs.io/en/latest/>`__ | `Issues <https://github.com/pypa/wheel/issues>`__ | `GitHub <https://github.com/pypa/wheel>`__ | `PyPI <https://pypi.org/project/wheel>`__
ru: `Документы <https://wheel.readthedocs.io/en/latest/>`__ | `Проблемы <https://github.com/pypa/wheel/issues>`__ | `GitHub <https://github.com/pypa/wheel>`__ | `PyPI <https://pypi.org/project/wheel>`__
ta: `டாக்ச் <https://wheel.readthedocs.io/en/latest/> __ | `சிக்கல்கள் <https://github.com/pypa/wheel/issues>` __ | `Github <https://github.com/pypa/wheel>` __ | `Pypi <https://pypi.org/project/wheel> ____
