Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: It MUST contain at least two fields. The first one is ``url``, with type ``string``. Its content must be a valid URL according to the `WHATWG URL Standard <whatwg-url-standard_>`_.
eo: Ĝi DEVAS enhavi almenaŭ du kampoj. La unua estas ``url`` de tipo ``string``. Ĝia enhavo devas esti valida URL laŭ la `normo de WHATWG pri URL <whatwg-url-standard_>`_.
ja: 少なくとも二つのフィールドが含まれていなければなりません。一つ目は ``string`` 型の ``url`` です。その内容は、 `WHATWG URL 標準 <whatwg-url-standard_>`_ に従う正当な URL でなければなりません。
ru: Он ДОЛЖЕН содержать как минимум два поля. Первое - ``url``, с типом ``string``. Его содержимое должно быть правильным URL в соответствии со стандартом URL <whatwg-url-standard_>`_.
ta: அதில் குறைந்தது இரண்டு புலங்கள் இருக்க வேண்டும். முதலாவது `` url``, வகை `` சரம்``. அதன் உள்ளடக்கம் `whatewg முகவரி தரநிலை <whatewg-url- தரப்பு_>` _ இன் படி செல்லுபடியாகும் முகவரி ஆக இருக்க வேண்டும்.

source: Depending on what ``url`` refers to, the second field MUST be one of ``vcs_info`` (if ``url`` is a VCS reference), ``archive_info`` (if ``url`` is a source archive or a wheel), or ``dir_info`` (if ``url`` is a local directory). These info fields have a (possibly empty) subdictionary as value, with the possible keys defined below.
eo: Depende de la celo de ``url``, la dua kampo DEVAS esti unu el ``vcs_info`` (se ``url`` referencas versikontrolan sistemon), ``archive_info`` (se ``url`` estas fonta arĥivo aŭ wheel), aŭ ``dir_info`` (se ``url`` estas loka dosierujo). La valoro de tia kampo estas (eble malplena) subvortaro, kies eblaj ŝlosiloj difiniĝas ĉi-sube.
ja: ``url`` が何を参照しているかによって、二つ目のフィールドは ``vcs_info`` (``url`` が VCS 参照である場合)・ ``archive_info`` (``url`` がソースコードアーカイブか wheel である場合)・ ``dir_info`` (``url`` がローカルディレクトリである場合) のうちのいずれか一つでなければなりません。これらの info フィールドは、(空である場合もありますが) 以下に定義するキー群を持つことができるサブディレクトリを値として持ちます。
ru: В зависимости от того, на что ссылается ``url``, второе поле ДОЛЖНО быть одним из ``vcs_info`` (если ``url`` является ссылкой на VCS), ``archive_info`` (если ``url`` является архивом исходного кода или колесом), или ``dir_info`` (если ``url`` является локальным каталогом). Эти информационные поля имеют в качестве значения (возможно, пустой) подсловарь, возможные ключи которого определены ниже.
ta: `` Url`` எதைக் குறிக்கிறது என்பதைப் பொறுத்து, இரண்டாவது புலம் `` vcs_info`` (`` url`` ஒரு வி.சி.எச் குறிப்பு என்றால்), `` `url`` என்றால்` `url`` மூல காப்பகம் அல்லது ஒரு சக்கரம்), அல்லது `` dir_info`` (`` url`` என்றால் உள்ளக அடைவு என்றால்). இந்த செய்தி புலங்கள் ஒரு (சாத்தியமான வெற்று) அடக்குமுறையை மதிப்பாக வைத்திருக்கின்றன, கீழே வரையறுக்கப்பட்ட விசைகள் உள்ளன.

source: Security Considerations
eo: Konsideroj pri Sekureco
ru: Соображения безопасности
ta: பாதுகாப்பு பரிசீலனைகள்

source: When persisted, ``url`` MUST be stripped of any sensitive authentication information, for security reasons.
eo: Se konservita, ``url`` DEVAS esti senigita je ajna grava aŭtentikiga informo, por sekureco.
ja: 固持する場合には、``url`` は、セキュリティ上の理由から、機微に関わる認証情報をすべて削除しておかなければなりません。
pt_br: Quando persistido, ``url`` DEVE ser podado a fim de retirar qualquer informação sensível de autenticação, por razões de segurança.
ru: При сохранении ``url`` должен быть очищен от любой конфиденциальной информации об аутентификации в целях безопасности.
ta: தொடர்ந்து இருக்கும்போது, பாதுகாப்பு காரணங்களுக்காக, `` url`` எந்தவொரு முக்கியமான அங்கீகார தகவல்களையும் அகற்ற வேண்டும்.

source: The user:password section of the URL MAY however be composed of environment variables, matching the following regular expression:
eo: La parto «uzanto:pasvorto» de la URL POVAS tamen konsisti el medio-variabloj laŭ la jena regula esprimo:
ja: URLの user:password の部分は、しかしながら、次に述べる正規表現に合致する形で、環境変数から構成しても構いません:
ru: Однако секция user:password в URL МОЖЕТ состоять из переменных окружения, соответствующих следующему регулярному выражению:
ta: பயனர்: முகவரி இன் கடவுச்சொல் பிரிவு சுற்றுச்சூழல் மாறிகள் கொண்டதாக இருக்கலாம், பின்வரும் வழக்கமான வெளிப்பாட்டுடன் பொருந்துகிறது:

source: Additionally, the user:password section of the URL MAY be a well-known, non security sensitive string. A typical example is ``git`` in the case of a URL such as ``ssh://git@gitlab.com/user/repo``.
eo: Krome, la parto «uzanto:pasvorto» de la URL POVAS esti bone konata, ne-sekurece-grava signoĉeno. Tipa ekzemplo estas ``git`` en URL kiel ``ssh://git@gitlab.com/uzanto/deponejo``.
ru: Кроме того, секция user:password в URL может быть известной строкой, не связанной с безопасностью. Типичным примером является ``git`` в случае такого URL, как ``ssh://git@gitlab.com/user/repo``.
ta: கூடுதலாக, பயனர்: முகவரி இன் கடவுச்சொல் பிரிவு நன்கு அறியப்பட்ட, பாதுகாப்பு அல்லாத உணர்திறன் கொண்ட சரமாக இருக்கலாம். `` Ssh: // git@gitlab.com/பயனர்/ரெப்போ`` போன்ற முகவரி இன் விசயத்தில் `` கிட்`` ஒரு பொதுவான எடுத்துக்காட்டு.

source: VCS URLs
eo: Versikontrolsistemaj Retadresoj
ja: VCS URL群
pt_br: URLs de VCS
ta: பகஅ முகவரி கள்

source: When ``url`` refers to a VCS repository, the ``vcs_info`` key MUST be present as a dictionary with the following keys:
eo: Se ``url`` montras versikontrolsisteman deponejon, la ŝlosilo ``vcs_info`` DEVAS ekzisti kiel vortaro kun la jenaj ŝlosiloj:
ja: ``url`` が VCS リポジトリを参照している場合、 以下のキー群を伴った ``vcs_info`` キーが辞書に存在していなければなりません:
pt_br: Quando a ``url`` faz referência a um repositório VCS, a chave ``vcs_info`` DEVE estar presente como um dicionário com as seguintes chaves:
ru: Когда ``url`` ссылается на VCS-репозиторий, ключ ``vcs_info`` ДОЛЖЕН присутствовать в виде словаря со следующими ключами:
ta: `` Url`` ஒரு வி.சி.எச் களஞ்சியத்தைக் குறிக்கும் போது, `` VCS_INFO`` விசை பின்வரும் விசைகளுடன் அகராதியாக இருக்க வேண்டும்:

source: A ``vcs`` key (type ``string``) MUST be present, containing the name of the VCS (i.e. one of ``git``, ``hg``, ``bzr``, ``svn``). Other VCS's SHOULD be registered by writing a PEP to amend this specification. The ``url`` value MUST be compatible with the corresponding VCS, so an installer can hand it off without transformation to a checkout/download command of the VCS.
eo: Ŝlosilo ``vcs`` (de tipo ``string``) DEVAS ĉeesti, enhavante la nomon de la versikontrola sistemo (unu el ``git``, ``hg``, ``bzr``, ``svn``). Alia versikontrola sistemo ESTU registrita per nova PEP amendanta ĉi tiun specifon. La valoro de ``url`` DEVAS kongrui kun la respondanta versikontrola sistemo tiel, ke instalilo povas facile krei komandon por elŝutado el versikontrola sistemo.
ja: (``git`` ・ ``hg`` ・ ``bzr`` ・ ``svn`` のいずれかのような) VCS の名前を含んだ ``vcs`` キー (``string`` 型) が存在していなければなりません。その他の VCS については、この仕様を修正するための PEP を書くことによって登録されるべきです。当該 VCS の checkout/download コマンドへの翻訳をしなくてもインストーラが 手を離してしまえるようにするために、 ``url`` の値は対応する VCS と齟齬のないものでなければなりません。
pt_br: Uma chave ``vcs`` (tipo ``string``) DEVE estar presente, contendo o nome do VCS (ou seja, um de ``git``, ``hg``, ``bzr``, ``svn``). Outros VCS DEVERIAM ser registrados escrevendo uma PEP para alterar esta especificação. O valor ``url`` DEVE ser compatível com o VCS correspondente, para que um instalador possa entregá-lo sem transformação em um comando de checkout/download do VCS.
ru: Ключ ``vcs`` (тип ``string``) ДОЛЖЕН присутствовать, содержащий имя VCS (т.е. одно из ``git``, ``hg``, ``bzr``, ``svn``). Другие VCS ДОЛЖНЫ быть зарегистрированы путем написания PEP для изменения этой спецификации. Значение ``url`` ДОЛЖНО быть совместимым с соответствующей VCS, чтобы установщик мог передать его без преобразования команде проверки/загрузки VCS.
ta: ஒரு `` vcs`` விசை (வகை `` சரம்```) இருக்க வேண்டும், இதில் VC களின் பெயரைக் கொண்டுள்ளது (அதாவது `` git``, `` hg``, `` bzr``, `` svn ``). இந்த விவரக்குறிப்பை திருத்துவதற்கு ஒரு PEP ஐ எழுதுவதன் மூலம் பிற வி.சி.க்கள் பதிவு செய்யப்பட வேண்டும். `` Url`` மதிப்பு தொடர்புடைய VC களுடன் இணக்கமாக இருக்க வேண்டும், எனவே ஒரு நிறுவி பகஅ இன் புதுப்பித்து/பதிவிறக்க கட்டளைக்கு மாற்றப்படாமல் அதை ஒப்படைக்க முடியும்.

source: A ``requested_revision`` key (type ``string``) MAY be present naming a branch/tag/ref/commit/revision/etc (in a format compatible with the VCS). This field MUST match the revision requested by the user and MUST NOT exist when the user did not select a specific revision.
ja: ``requested_revision`` キー (``string`` 型) は、 (VCS と互換性のあるフォーマットであれば) どのブランチ・タグ・リファレンス・コミット・リビジョンその他を指定するために存在していても構いません。このフィールドは、ユーザが要求するリビジョンに合致しなければなりませんし、ユーザが特定のリビジョンを選択していない場合には存在してはなりません。
ru: Ключ ``запрошенная_ревизия`` (тип ``строка``) МОЖЕТ присутствовать, называя ветку/тег/реф/коммит/ревизию/etc (в формате, совместимом с VCS). Это поле ДОЛЖНО соответствовать ревизии, запрошенной пользователем, и НЕ ДОЛЖНО существовать, если пользователь не выбрал конкретную ревизию.
ta: ஒரு `` கோரப்பட்ட_ரெவிசன்`` விசை (வகை `` சரம்``) ஒரு கிளை/குறிச்சொல்/ரெஃப்/கமிட்/திருத்தம்/போன்றவற்றை பெயரிடலாம் (வி.சி.எச் உடன் இணக்கமான வடிவத்தில்). இந்த புலம் பயனர் கோரிய திருத்தத்துடன் பொருந்த வேண்டும், பயனர் ஒரு குறிப்பிட்ட திருத்தத்தைத் தேர்ந்தெடுக்காதபோது இருக்கக்கூடாது.

source: A ``commit_id`` key (type ``string``) MUST be present, containing the exact commit/revision number that was/is to be installed. If the VCS supports commit-hash based revision identifiers, such commit-hash MUST be used as ``commit_id`` in order to reference an immutable version of the source code.
eo: Ŝlosilo ``commit_id`` (de tipo ``string``) DEVAS ekzisti, kies valoro estas la ekzakta revizia numero intalota. Se la versikontrola sistemo subtenas haketaĵo-baza revizio-identigilo, oni DEVAS uzi tian haketaĵon kiel ``commit_id`` por referenci nemodifeblan version de la fontokodo.
ja: ``commit_id`` キー (``string`` 型) は、正確にどのコミットまたはリビジョンがインストールされた/されるかを示すもので、必須のキーです。 VCS がリビジョン識別子に基づくコミットハッシュをサポートしているなら、インストールされたもののソースコードの不変のバージョンを指し示す目的で、そのようなコミットハッシュを ``commit_id`` として使わなければなりません。
pt_br: Uma chave ``commit_id`` (tipo ``string``) DEVE estar presente, contendo o número exato de commit/revisão que foi/será instalado. Se o VCS oferecer suporte a identificadores de revisão baseados em hash de commit, tal hash de commit DEVE ser usado como ``commit_id`` para referenciar a versão imutável do código-fonte.
ru: Ключ ``commit_id`` (тип ``string``) ДОЛЖЕН присутствовать, содержащий точный номер коммита/ревизии, которая была/есть установлена. Если VCS поддерживает идентификаторы ревизий на основе commit-hash, то такой commit-hash ДОЛЖЕН использоваться в качестве ``commit_id``, чтобы ссылаться на неизменяемую версию исходного кода.
ta: ஒரு `` கமிட்_ஐடி`` விசை (வகை `` சரம்``) இருக்க வேண்டும், இதில் சரியான கமிட்/திருத்த எண்ணை நிறுவ வேண்டும்/நிறுவ வேண்டும். மூலக் குறியீட்டின் மாறாத பதிப்பைக் குறிப்பிடுவதற்கு வி.சி.எச் கமிட்-ஆச் அடிப்படையிலான திருத்த அடையாளங்காட்டிகளை ஆதரித்தால், அத்தகைய கமிட்-ஆச் `` கமிட்_ஐடி`` எனப் பயன்படுத்தப்பட வேண்டும்.

source: Archive URLs
eo: Arĥivaj Retadresoj
ja: アーカイブ URL 群
pt_br: URLs de arquivos
ru: Архивные URL
ta: காப்பக முகவரி கள்

source: When ``url`` refers to a source archive or a wheel, the ``archive_info`` key MUST be present as a dictionary with the following keys:
eo: Se ``url`` montras fontan arĥivon aŭ wheel, la ŝlosilo ``archive_info`` DEVAS ekzisti kiel vortaro kun la jenaj ŝlosiloj:
ja: ``url`` がソースコードのアーカイブや wheel ファイルを指し示す場合には、 ``archive_info`` キーが次のようなキーを持つ辞書の形で存在しなければなりません:
pt_br: Quando ``url`` se refere a um arquivo fonte ou wheel, a chave ``archive_info`` DEVE estar presente como um dicionário com as seguintes chaves:
ru: Когда ``url`` ссылается на исходный архив или колесо, ключ ``archive_info`` ДОЛЖЕН присутствовать в виде словаря со следующими ключами:
ta: `` Url`` ஒரு மூல காப்பகம் அல்லது சக்கரத்தைக் குறிக்கும் போது, `` காப்பகம்_இன்ஃபோ`` விசை பின்வரும் விசைகளுடன் அகராதியாக இருக்க வேண்டும்:

source: A ``hashes`` key SHOULD be present as a dictionary mapping a hash name to a hex encoded digest of the file.
eo: Ŝlosilo ``hashes`` ĈEESTU kiel vortaro rilatanta haketaĵan nomon al deksesume kodita haketaĵo de la dosiero.
ja: ``hashes`` キーは、ハッシュ名から16進数表記のファイルハッシュ値への対応を保持する辞書として存在するべきです。
pt_br: Uma chave ``hashes`` DEVE estar presente como um dicionário mapeando um nome de hash para um resumo de arquivo codificado em hex.
ru: Ключ ``hashes`` ДОЛЖЕН присутствовать в виде словаря, сопоставляющего имя хэша с шестнадцатеричным дайджестом файла.
ta: ஒரு `` ஆச்கள்`` விசையானது கோப்பின் ஃச் குறியிடப்பட்ட டைசெச்டுக்கு ஒரு ஆச் பெயரை மேப்பிங் செய்வதாக இருக்க வேண்டும்.

source: Multiple hashes can be included, and it is up to the consumer to decide what to do with multiple hashes (it may validate all of them or a subset of them, or nothing at all).
eo: Oni povas inkluzivi plurajn haketaĵojn. La konsumanto decidas kion fari pri pluraj haketaĵoj (ĝi povas kontroli ĉiujn, aŭ iujn, aŭ neniun).
ja: 複数のハッシュ値を含めることが可能で、そのような複数のハッシュ値を使って何をするか (すべてのハッシュ値を検証しても一部だけを検証しても構いませんし、何もしなくても構いません) については利用する側次第です。
pt_br: Vários hashes podem ser incluídos e cabe ao consumidor decidir o que fazer com vários hashes (pode validar todos eles ou um subconjunto deles, ou nada).
ru: Можно включить несколько хэшей, и потребитель сам решает, что делать с несколькими хэшами (он может подтвердить все из них или их подмножество, или вообще ничего).
ta: பல ஆச்களைச் சேர்க்கலாம், மேலும் பல ஆச்களை என்ன செய்வது என்று தீர்மானிக்க வேண்டியது நுகர்வோர் பொறுப்பாகும் (இது அனைத்தையும் அல்லது அவற்றின் துணைக்குழுவை சரிபார்க்கலாம், அல்லது ஒன்றும் இல்லை).

source: These hash names SHOULD always be normalized to be lowercase.
eo: Tiuj haketaĵaj nomoj ESTU normigitaj minuskle.
ja: これらのハッシュの名前は、常に小文字に正規化されているべきです。
pt_br: Esses nomes de hash DEVEM sempre ser normalizados para letras minúsculas.
ru: Эти имена хэшей ДОЛЖНЫ быть всегда приведены к нижнему регистру.
ta: இந்த ஆச் பெயர்கள் எப்போதும் சிறிய எழுத்துக்களாக இயல்பாக்கப்பட வேண்டும்.

source: Any hash algorithm available via :py:mod:`hashlib` (specifically any that can be passed to :py:func:`hashlib.new()` and do not require additional parameters) can be used as a key for the hashes dictionary. At least one secure algorithm from :py:data:`hashlib.algorithms_guaranteed` SHOULD always be included. At time of writing, ``sha256`` specifically is recommended.
eo: Ajna haketaĵa algoritmo disponebla per :py:mod:`hashlib` (pli precize, donebla al :py:func:`hashlib.new()` sen pliaj parametroj) estas uzebla kiel ŝlosilo por la vortaro ``hashes``. Oni INKLUZIVU almenaŭ unu sekuran algoritmon el :py:data:`hashlib.algorithms_guaranteed`. Aktuale, ni specife rekomendas ``sha256``.
ja: :py:mod:`hash lib` 経由で利用可能なハッシュアルゴリズム (とりわけ、 :py:func:`hashlib.new()` に渡すことができて、かつ、それ以上のパラメータを必要としないもの) はどれでも、ハッシュ値を格納する辞書のキーとして用いることができます。 :py:data:`hashlib.algorithms_garanteed` から安全なアルゴリズムを少なくともひとつ選択して含めるべきです。執筆時点では、 ``sha256`` が特に推奨されています。
ru: В качестве ключа для словаря хэшей можно использовать любой алгоритм, доступный через :py:mod:`hashlib` (в частности, те, которые можно передать в :py:func:`hashlib.new()` и которые не требуют дополнительных параметров). По крайней мере, один безопасный алгоритм из :py:data:`hashlib. алгоритмы_гарантированы` ДОЛЖЕН быть всегда включен. На момент написания статьи рекомендуется ``sha256`.
ta: எந்த ஆச் வழிமுறையும் மூலம் கிடைக்கும்: PY: MOD: `ஆச்லிப்` (குறிப்பாக ஏதேனும் தேர்ச்சி பெறக்கூடியது: PY: FUNC:` Hashlib.new () `மற்றும் கூடுதல் அளவுருக்கள் தேவையில்லை) ஆசச் அகராதி ஒரு விசையாக பயன்படுத்தப்படலாம் . இருந்து குறைந்தது ஒரு பாதுகாப்பான வழிமுறை: PY: தரவு: `hashlib.algorithms_ugranaled` எப்போதும் சேர்க்கப்பட வேண்டும். எழுதும் நேரத்தில், `` சா 256`` குறிப்பாக பரிந்துரைக்கப்படுகிறது.

source: A deprecated ``hash`` key (type ``string``) MAY be present for backwards compatibility purposes, with value ``<hash-algorithm>=<expected-hash>``.
eo: Evitinda ŝlosilo ``hash`` (de tipo ``string``) POVAS ĉeesti por retrokongrueco, kies valoro estas ``<haketaĵa-algoritmo>=<atendata-haketaĵo>``.
ja: 非推奨となった ``hash`` キー (``string`` 型) は、後方互換性を保つ目的でなら ``<hash-algorithm>=<expected-hash>`` を値に取る形で存在していても構いません。
pt_br: Uma chave descontinuada ``hash`` (tipo ``string``) PODE estar presente para fins de compatibilidade com versões anteriores, com valor ``<hash-algorithm>=<expected-hash>``.
ru: Устаревший ключ ``hash`` (тип ``string``) МОЖЕТ присутствовать в целях обратной совместимости, со значением ``<hash-algorithm>=<expected-hash>``.
ta: ஒரு நீக்கப்பட்ட `` ஆச்`` விசை (வகை `` சரம்``) பின்னோக்கி பொருந்தக்கூடிய நோக்கங்களுக்காக இருக்கலாம், மதிப்பு `` <ஆச்-அல்காரிதம்> = <எதிர்பார்க்கப்படும்-ஆச்> ``.

source: Producers of the data structure SHOULD emit the ``hashes`` key whether one or multiple hashes are available. Producers SHOULD continue to emit the ``hash`` key in contexts where they did so before, so as to keep backwards compatibility for existing clients.
ja: データ構造を生成する側では、ひとつまたは複数のハッシュが利用できるなら ``hashes`` キーを生成するべきです。以前からそうしていたので既存のクライアントのために後方互換性を保つためなら、生成側は ``hash`` キーの生成を継続するべきです。
pt_br: Os produtores da estrutura de dados DEVEM emitir a chave ``hashes`` se um ou vários hashes estiverem disponíveis. Os produtores DEVEM continuar a emitir a chave ``hash`` em contextos onde o faziam antes, de modo a manter a compatibilidade com versões anteriores para clientes existentes.
ru: Производители структуры данных ДОЛЖНЫ выдавать ключ ``hashes`` независимо от того, один или несколько хэшей доступны. Производители ДОЛЖНЫ продолжать выдавать ключ ``hash`` в тех контекстах, где они делали это раньше, чтобы сохранить обратную совместимость для существующих клиентов.
ta: தரவு கட்டமைப்பின் தயாரிப்பாளர்கள் ஒன்று அல்லது பல ஆச்கள் கிடைக்குமா என்பதை `` ஆச்கள்` `விசையை வெளியிட வேண்டும். தயாரிப்பாளர்கள் `` ஆச்`` விசையை அவர்கள் முன்பு செய்த சூழல்களில் தொடர்ந்து வெளியிட வேண்டும், இதனால் இருக்கும் வாடிக்கையாளர்களுக்கு பின்னோக்கி பொருந்தக்கூடிய தன்மையை வைத்திருக்க வேண்டும்.

source: When both the ``hash`` and ``hashes`` keys are present, the hash represented in the ``hash`` key MUST also be present in the ``hashes`` dictionary, so consumers can consider the ``hashes`` key only if it is present, and fall back to ``hash`` otherwise.
eo: Kiam ambaŭ ŝlosiloj ``hash`` kaj ``hashes`` ekzistas, la haketaĵo prezentita de la ŝlosilo ``hash`` DEVAS ankaŭ ĉeestas en la vortaro de ``hashes``, por ke uzanto povas nur uzi la ŝlosilon ``hashes``, se ĝi ekzistas, kaj nur uzi ``hash`` se ne.
ja: ``hash`` と ``hashes`` の両方のキーが存在する時は、 ``hash`` キーの中に現れるハッシュは、 ``hashes`` の辞書の中にも存在しなければならず、そうすることで利用する側では ``hashes`` キーがあればそれだけを考慮し、なければ ``hash`` にフォールバックすることが可能になります。
pt_br: Quando as chaves ``hash`` e ``hashes`` estão presentes, o hash representado na chave ``hash`` DEVE também estar presente no dicionário ``hashes``, para que os consumidores possam considerar a chave ``hashes`` apenas se estiver presente, e voltar para ``hash`` caso contrário.
ru: Если присутствуют ключи ``hash`` и ``hashes``, хэш, представленный в ключе ``hash``, ДОЛЖЕН присутствовать и в словаре ``hashes``, поэтому пользователи могут рассматривать ключ ``hashes``, только если он присутствует, и возвращаться к ``hash`` в противном случае.
ta: `` ஆச்`` மற்றும் `` ஆச்கள்`` விசைகள் இரண்டும் இருக்கும்போது, `` ஆச்` விசையில் குறிப்பிடப்பட்டுள்ள ஆச் `` ஆச்கள்`` அகராதியில் இருக்க வேண்டும், எனவே நுகர்வோர் `` ஆச்களைக் கருத்தில் கொள்ளலாம் `` அது இருந்தால் மட்டுமே முக்கியமானது, இல்லையெனில் `` ஆச்`` க்கு திரும்பவும்.

source: Local directories
eo: Lokaj dosierujoj
ja: ローカルディレクトリ
pt_br: Diretórios locais
ru: Локальные каталоги
ta: உள்ளக கோப்பகங்கள்

source: When ``url`` refers to a local directory, the ``dir_info`` key MUST be present as a dictionary with the following key:
eo: Se ``url`` montras lokan dosierujon, la ŝlosilo ``vcs_info`` DEVAS ekzisti kiel vortaro kun la jenaj ŝlosiloj:
ja: ``url`` がローカルのディレクトリを参照している場合には、以下のキーを含む辞書として ``dir_info`` キーが存在していなければなりません。
pt_br: Quando ``url`` se refere a um diretório local, a chave ``dir_info`` DEVE estar presente como um dicionário com a seguinte chave:
ru: Когда ``url`` ссылается на локальный каталог, ключ ``dir_info`` ДОЛЖЕН присутствовать в виде словаря со следующим ключом:
ta: `` Url`` ஒரு உள்ளக கோப்பகத்தைக் குறிக்கும் போது, `` dir_info`` விசை பின்வரும் விசையுடன் அகராதியாக இருக்க வேண்டும்:

source: ``editable`` (type: ``boolean``): ``true`` if the distribution was/is to be installed in editable mode, ``false`` otherwise. If absent, default to ``false``.
eo: ``editable`` (tipo: ``boolean``): ``true`` se la distribuo estas/estis instalita en modifebla reĝimo, ``false`` se ne. Se ĝi mankas, la implicita valoro estas ``false``.
ja: 配布物が編集可能モードでインストールされた/される場合には ``editable`` (``boolean`` 型): ``true`` 、そうでなければ ``false`` 。存在していない場合のデフォルトは ``false`` です。
pt_br: ``editable`` (tipo: ``boolean``): ``true`` se a distribuição foi/será instalada em modo editável, ``false`` caso contrário. Se ausente, é usado o padrão ``false``.
ru: ``editable`` (тип: ``boolean``): ``true``, если дистрибутив был/будет установлен в редактируемом режиме, ``false`` в противном случае. Если отсутствует, то по умолчанию ``false``.
ta: `` திருத்தக்கூடிய`` (வகை: `` பூலியன்``): `` உண்மை`` விநியோகம்/திருத்தக்கூடிய பயன்முறையில் நிறுவப்பட வேண்டுமானால், இல்லையெனில் `` தவறு`. இல்லையென்றால், இயல்புநிலை `` பொய்``.

source: When ``url`` refers to a local directory, it MUST have the ``file`` scheme and be compliant with :rfc:`8089`. In particular, the path component must be absolute. Symbolic links SHOULD be preserved when making relative paths absolute.
eo: Se ``url`` referencas lokan dosierujon, ĝi DEVAS havi la skemon ``file`` kaj observu :rfc:`8089`. Speciale, la dosierloka komponanto devas esti absoluta. Simbola ligo ESTU konservata, dum absolutigo de relativa dosierloko.
ja: ``url`` がローカルのディレクトリを参照している場合、 :rfc:``8089` に適合する ``file`` スキームが存在していなければなりません。特にパス部分は絶対パスでなければなりません。相対パスを絶対パスに変換する際には、シンボリックリンクはそのまま保存されているべきです。
pt_br: Quando ``url`` se refere a um diretório local, ele DEVE ter o esquema ``file`` e ser compatível com :rfc:`8089` Em particular, o componente do caminho deve ser absoluto. Links simbólicos DEVERIAM ser preservados ao tornar os caminhos relativos absolutos.
ru: Когда ``url`` ссылается на локальный каталог, он ДОЛЖЕН иметь схему ``file`` и соответствовать :rfc:`8089`. В частности, компонент пути должен быть абсолютным. Символьные ссылки ДОЛЖНЫ сохраняться при преобразовании относительных путей в абсолютные.
ta: `` Url`` ஒரு உள்ளக கோப்பகத்தைக் குறிக்கும் போது, அதற்கு `` கோப்பு`` திட்டத்தைக் கொண்டிருக்க வேண்டும் மற்றும் இணக்கமாக இருக்க வேண்டும்: RFC: `8089`. குறிப்பாக, பாதை கூறு முழுமையானதாக இருக்க வேண்டும். உறவினர் பாதைகளை முழுமையானதாக மாற்றும்போது குறியீட்டு இணைப்புகள் பாதுகாக்கப்பட வேண்டும்.

source: Projects in subdirectories
eo: Projektoj en subdosierujoj
ja: サブディレクトリ内のプロジェクト群
pt_br: Projetos em subdiretórios
ru: Проекты в подкаталогах
ta: துணை அடைவுகளில் திட்டங்கள்

source: A top-level ``subdirectory`` field MAY be present containing a directory path, relative to the root of the VCS repository, source archive or local directory, to specify where ``pyproject.toml`` or ``setup.py`` is located.
eo: Supranivela kampo ``subdirectory`` POVAS ekzisti, enhavanta dosierujan lokon relativan al la radiko de la versikontrolsistema deponejo, fonta arĥivo aŭ loka dosierujo, por specifi la lokon de ``pyproject.toml`` aŭ ``setup.py``.
ja: トップレベルの ``subdirectory`` フィールドは、 ``pyproject.toml`` または ``setup.py`` が存在する場所を指定するために、 VCS リポジトリやソースコードのアーカイブやローカルのディレクトリのルートディレクトリに対する相対パスとして示したディレクトリパスを値とするものとして存在することが許されています。
pt_br: Um campo ``subdirectory`` de nível superior PODE estar presente contendo um caminho de diretório, relativo à raiz do repositório VCS, arquivo fonte ou diretório local, para especificar onde ``pyproject.toml`` ou ``setup.py`` está localizado.
ru: Поле верхнего уровня ``поддиректория`` МОЖЕТ содержать путь к каталогу, относительно корня VCS-репозитория, исходного архива или локального каталога, чтобы указать, где находится ``pyproject.toml`` или ``setup.py``.
ta: `` Pyproject.toml`` அல்லது `` setup.py. `அமைந்துள்ளது.

source: Registered VCS
eo: Registrita Versikontrola Sistemo
ja: 登録済みの VCS
pt_br: VCS registrados
ru: Зарегистрированный VCS
ta: பதிவுசெய்யப்பட்ட வி.சி.
