Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Open :file:`pyproject.toml` and enter the following content. Change the ``name`` to include your username; this ensures that you have a unique package name that doesn't conflict with packages uploaded by other people following this tutorial.
eo: Malfermu :file:`pyproject.toml`, kaj tajpu la jenon. Ŝanĝu ``name`` inkluzivante vian salutnomon; tio certigas, ke via paka nomo estas unika, ne kolizianta kun la pakojn alŝutitajn de aliuloj sekvantaj ĉi tiun lernilon.
ja: :file:`pyproject.toml` を開いて、以下の内容を入力してください。 ``name`` の値はあなたのユーザ名に書き換えてください; こうすることで、このチュートリアルを履修している他の人たちがアップロードするパッケージと衝突を起こさない一意なパッケージ名を使っていることを保証することができます。
pt_br: Abra :file:`pyproject.toml` e insira o seguinte conteúdo. Mude o ``name`` para incluir seu nome de usuário; isso garante que você tenha um nome de pacote exclusivo que não entre em conflito com os pacotes carregados por outras pessoas que seguem este tutorial.
ru: Откройте :file:`pyproject.toml` и введите следующее содержимое. Измените ``имя``, чтобы оно включало ваше имя пользователя; это гарантирует, что у вас будет уникальное имя пакета, которое не будет конфликтовать с пакетами, загруженными другими людьми, следующими этому руководству.
ta: திறந்த: கோப்பு: `pyproject.toml` மற்றும் பின்வரும் உள்ளடக்கத்தை உள்ளிடவும். உங்கள் பயனர்பெயரைச் சேர்க்க `` பெயர்`` ஐ மாற்றவும்; இந்த டுடோரியலைத் தொடர்ந்து மற்றவர்களால் பதிவேற்றப்பட்ட தொகுப்புகளுடன் முரண்படாத ஒரு தனித்துவமான தொகுப்பு பெயர் உங்களிடம் இருப்பதை இது உறுதி செய்கிறது.

source: ``name`` is the *distribution name* of your package. This can be any name as long as it only contains letters, numbers, ``.``, ``_`` , and ``-``. It also must not already be taken on PyPI. **Be sure to update this with your username** for this tutorial, as this ensures you won't try to upload a package with the same name as one which already exists.
eo: ``name`` estas la *distribua nomo* de via pako. Ĝi povas esti ajna nomo enhavanta nur literojn, ciferojn, ``.``, ``_`` , kaj ``-``. Ĝi ankaŭ devas ne esti jam uzata ĉe PyPI. **Certigu, ke vi ĝisdatigu ĝin per via salutnomo** por ĉi tiu lernilo; tio certigas, ke vi ne alŝutos pakon de la sama nomo kiel pako jam ekzistanta.
ja: ``name`` は、あなたのパッケージの *配布物の名前* です。これは、文字・数字・ ``.`` ・ ``_`` ・ ``-`` だけで構成されている限りは、どんな名前でも構いません。また、 PyPI 上に既に存在するものであってはなりません。このチュートリアルでは、あなたのユーザ名を使って更新していることを **確実にしてください** 、というのは、そうすることで、既存の名前と同じ名前のパッケージのアップロードを試みることがないと保証できるからです。
pt_br: ``name`` é o *nome da distribuição* do seu pacote. Pode ser qualquer nome, desde que contenha apenas letras, números, ``.``, ``_`` e ``-``. Também não deve ser feito em PyPI. **Certifique-se de atualizá-lo com seu nome de usuário** para este tutorial, pois isso garante que você não tentará enviar um pacote com o mesmo nome de um que já existe.
ru: ``имя`` - это *имя дистрибутива* вашего пакета. Это может быть любое имя, если оно содержит только буквы, цифры, ``.``, ``_`` и ``-``. Оно также не должно быть уже занято на PyPI. **Убедитесь, что вы указали в нем свое имя пользователя** для этого руководства, так как это гарантирует, что вы не попытаетесь загрузить пакет с тем же именем, что и уже существующий.
ta: `` பெயர்`` என்பது உங்கள் தொகுப்பின் * விநியோக பெயர் *. கடிதங்கள், எண்கள், `` .``, `` _``, மற்றும் `` -`` ஆகியவற்றைக் கொண்டிருக்கும் வரை இது எந்த பெயராகவும் இருக்கலாம். இது ஏற்கனவே பைபி மீது எடுக்கப்படக்கூடாது. ** இந்த டுடோரியலுக்காக இதை உங்கள் பயனர்பெயருடன் புதுப்பிக்க மறக்காதீர்கள், ஏனெனில் இது ஏற்கனவே இருக்கும் அதே பெயருடன் ஒரு தொகுப்பை பதிவேற்ற முயற்சிக்காது என்பதை இது உறுதி செய்கிறது.

source: ``version`` is the package version. (Some build backends allow it to be specified another way, such as from a file or Git tag.)
eo: ``version`` estas la versio de la pako. (Kelkaj konstruaj malfasadoj permesas aliajn manierojn specifi ĝin, kiel per dosiero aŭ Git-etikedo.)
ja: ``version`` は、パッケージのバージョン番号です。 (ビルドバックエンドの中には、ファイルや Git のタグからといった別の方法で指定することができるものもあります。)
ru: ``version`` - это версия пакета. (Некоторые сборки позволяют указывать ее другим способом, например, из файла или Git-тега)
ta: `` பதிப்பு`` என்பது தொகுப்பு பதிப்பு. (சில கட்டமைப்பை பின்தளத்தில் ஒரு கோப்பு அல்லது அறிவிலி குறிச்சொல் போன்ற வேறு வழியில் குறிப்பிட அனுமதிக்கிறது.)

source: ``authors`` is used to identify the author of the package; you specify a name and an email for each author. You can also list ``maintainers`` in the same format.
eo: ``authors`` identigas la aŭtoron de la pakon; vi specifu nomon kaj retpoŝtan adreson por ĉiu aŭtoro. La kampo ``maintainers`` por mastrumantoj sekvas la saman formon.
ja: ``authors`` は、パッケージの作者を識別するために使われます; 作者の一人一人について名前と電子メールアドレスを指定します。同じフォーマットで ``maintainers`` を列挙することもできます。
pt_br: ``authors`` é usado para identificar o autor do pacote; você especifica um nome e um e-mail para cada autor. Você também pode listar ``maintainers`` no mesmo formato.
ru: ``authors`` используется для идентификации автора пакета; вы указываете имя и email для каждого автора. В таком же формате можно перечислить ``maintainers``.
ta: தொகுப்பின் ஆசிரியரை அடையாளம் காண `` ஆசிரியர்கள்`` பயன்படுத்தப்படுகிறது; ஒவ்வொரு எழுத்தாளருக்கும் ஒரு பெயர் மற்றும் மின்னஞ்சலைக் குறிப்பிடுகிறீர்கள். அதே வடிவத்தில் `` பராமரிப்பாளர்கள்` ஐ பட்டியலிடலாம்.

source: ``description`` is a short, one-sentence summary of the package.
eo: ``description`` estas mallonga, unufraza resumo de la pako.
ja: ``description`` は、１文で短くパッケージを説明するものです。
pt_br: ``description`` é um resumo curto do pacote contendo apenas uma frase.
ru: ``description`` - это краткое, в одно предложение, описание пакета.
ta: `` விளக்கம்`` என்பது தொகுப்பின் குறுகிய, ஒரு வாக்கிய சுருக்கமாகும்.

source: ``readme`` is a path to a file containing a detailed description of the package. This is shown on the package detail page on PyPI. In this case, the description is loaded from :file:`README.md` (which is a common pattern). There also is a more advanced table form described in the :ref:`pyproject.toml guide <writing-pyproject-toml>`.
ja: ``readme`` は、パッケージに関する詳細な説明を含んだファイルへのパスです。 PyPI 上のパッケージ詳細のページにこの内容が表示されます。この場合、説明の文言は :file:`README.md` (これがよくあるパターンです) からロードされます。他にも、 :ref:`pyproject.toml ガイド文書 <writing-pyproject-toml>` に記述されているもっと先進的なテーブル形式があります。
ru: ``readme`` - это путь к файлу, содержащему подробное описание пакета. Он отображается на странице подробного описания пакета на PyPI. В данном случае описание загружается из :file:`README.md` (это общий шаблон). Существует также более продвинутая форма таблицы, описанная в руководстве :ref:`pyproject.toml <writing-pyproject-toml>`.
ta: `` ரீட்மே`` என்பது தொகுப்பின் விரிவான விளக்கத்தைக் கொண்ட கோப்பிற்கான பாதை. இது PYPI இல் உள்ள தொகுப்பு விவரம் பக்கத்தில் காட்டப்பட்டுள்ளது. இந்த வழக்கில், விளக்கம் ஏற்றப்பட்டது: கோப்பு: `ReadMe.md` (இது ஒரு பொதுவான முறை). இதில் விவரிக்கப்பட்டுள்ள ஒரு மேம்பட்ட அட்டவணை வடிவமும் உள்ளது: erf: `pyproject.toml வழிகாட்டி <எழுதுதல்-பைபிரெக்ட்-டாம்>`.

source: ``requires-python`` gives the versions of Python supported by your project. An installer like :ref:`pip` will look back through older versions of packages until it finds one that has a matching Python version.
eo: ``requires-python`` listigas la versiojn de Python subtenataj de via projekto. Instalilo kiel :ref:`pip` serĉas tra malnovaj versioj de pakoj ĝis kiam ĝi trovas pakan version kongruan al la versio de Python.
ja: ``requires-python`` は、そのプロジェクトがサポートしている Python のバージョンを与えます。 :ref:`pip` のようなインストーラは、 Python バージョンが合致するものを見つけるまでパッケージのバージョンを遡って探索します。
ru: ``requires-python`` указывает версии Python, поддерживаемые вашим проектом. Программа установки, такая как :ref:`pip`, будет просматривать старые версии пакетов, пока не найдет ту, которая имеет соответствующую версию Python.
ta: `` தேவை-பைதான் `your உங்கள் திட்டத்தால் ஆதரிக்கப்படும் பைதனின் பதிப்புகளைத் தருகிறது. இது போன்ற ஒரு நிறுவி: ref: `பிப்` பொருந்தக்கூடிய பைதான் பதிப்பைக் கொண்ட ஒன்றைக் கண்டுபிடிக்கும் வரை பழைய பதிப்புகளின் மூலம் திரும்பிப் பார்க்கும்.

source: ``classifiers`` gives the index and :ref:`pip` some additional metadata about your package. In this case, the package is only compatible with Python 3 and is OS-independent. You should always include at least which version(s) of Python your package works on and which operating systems your package will work on. For a complete list of classifiers, see https://pypi.org/classifiers/.
ta: `` வகைப்படுத்திகள்`` குறியீட்டைக் கொடுக்கும்: குறிப்பு: `பிப்` உங்கள் தொகுப்பைப் பற்றி சில கூடுதல் மேனிலை தரவு. இந்த வழக்கில், தொகுப்பு பைதான் 3 உடன் மட்டுமே இணக்கமானது மற்றும் OS- சுயாதீனமானது. பைதனின் எந்த பதிப்பு (கள்) உங்கள் தொகுப்பு செயல்படுகிறது, எந்த இயக்க முறைமைகள் உங்கள் தொகுப்பு செயல்படும் என்பதை நீங்கள் எப்போதும் சேர்க்க வேண்டும். வகைப்படுத்திகளின் முழுமையான பட்டியலுக்கு, https://pypi.org/classifiers/ ஐப் பார்க்கவும்.

source: ``urls`` lets you list any number of extra links to show on PyPI. Generally this could be to the source, documentation, issue trackers, etc.
eo: ``urls`` ebligas vin listigi ajnan nombron da ekstraj hiperligoj montrotaj sur PyPI. Ĝenerale tiuj povas esti la fonto, dokumentaro, cimaro ktp.
ja: ``urls`` には、 PyPI で表示するその他のリンクを幾つでも列挙しておくことができます。一般的に、ソースコードや説明文書、課題追跡システムその他へのリンクを挙げておけばよいでしょう。
pt_br: ``urls`` permite listar qualquer número de links extras para mostrar no PyPI. Geralmente, isso pode ser para o código-fonte, a documentação, os rastreadores de problemas, etc.
ru: ``urls`` позволяет вам перечислить любое количество дополнительных ссылок, которые нужно показать на PyPI. Обычно это могут быть ссылки на исходный текст, документацию, трекеры проблем и т.д.
ta: `` urls`` PYPI இல் காண்பிக்க கூடுதல் கூடுதல் இணைப்புகளை பட்டியலிட அனுமதிக்கிறது. பொதுவாக இது மூல, ஆவணங்கள், வெளியீட்டு டிராக்கர்கள் போன்றவற்றுக்கு இருக்கலாம்.

source: See the :ref:`pyproject.toml guide <writing-pyproject-toml>` for details on these and other fields that can be defined in the ``[project]`` table. Other common fields are ``keywords`` to improve discoverability and the ``dependencies`` that are required to install your package.
eo: Vidu la :ref:`gvidilon pri pyproject.toml <writing-pyproject-toml>` por detaloj pri tiuj kaj aliaj kampoj difineblaj en la tabelo ``[project]``. Jen aliaj oftaj kampoj: ``keywords`` por malkovrebleco, ``dependencies`` pri dependecoj postulataj por instali la pakon.
ja: ``[project]`` テーブルに定義できるこれらのフィールドやその他のフィールドについての詳しい情報が必要であれば、 :ref:`pyproject.toml ガイド文書 <writing-pyproject-toml>` を見てください。他のよく使われるフィールドには、検索にかかりやすくするための ``keywords`` や、当該パッケージをインストールするために必須のパッケージを示す ``dependencies`` があります。
ru: Подробности об этих и других полях, которые могут быть определены в таблице ``[проект]``, см. в руководстве <writing-pyproject-toml>`. Другими распространенными полями являются ``ключевые слова'' для повышения удобства поиска и ``зависимости'', необходимые для установки вашего пакета.
ta: `` [திட்டம்] `` அட்டவணையில் வரையறுக்கக்கூடிய இந்த மற்றும் பிற துறைகள் பற்றிய விவரங்களுக்கு `pyproject.toml வழிகாட்டி <எழுதுதல்-பைபிரோசெக்ட்-டோம்>` ஐக் காண்க. கண்டுபிடிப்புத்தன்மையை மேம்படுத்துவதற்கான பிற பொதுவான புலங்கள் `` முக்கிய வார்த்தைகள்` மற்றும் உங்கள் தொகுப்பை நிறுவ தேவையான `` சார்புகள்`.

source: Creating README.md
eo: Krei la dosieron README.md
ja: README.md を作成する
pt_br: Criando README.md
ru: Создание файла :file:`README.md`
ta: README.MD ஐ உருவாக்குதல்

source: Open :file:`README.md` and enter the following content. You can customize this if you'd like.
eo: Malfermu :file:`README.md`, kaj tajpu la jenon. Vi povas adapti ĝin, se tio plaĉas al vi.
ja: :file:`README.md` を開いて、以下の内容を入力してください。そうしたければ、カスタマイズした内容でも構いません。
pt_br: Abra :file:`README.md` e insira o seguinte conteúdo. Você pode personalizar isso se desejar.
ru: Откройте :file:`README.md` и введите следующее содержимое. Вы можете настроить его по своему усмотрению.
ta: திறந்த: கோப்பு: `ReadMe.md` மற்றும் பின்வரும் உள்ளடக்கத்தை உள்ளிடவும். நீங்கள் விரும்பினால் இதைத் தனிப்பயனாக்கலாம்.

source: Creating a LICENSE
eo: Krei la dosieron LICENSE
ja: LICENSE ファイルを作成する
pt_br: Criando um LICENSE
ru: Создание файла :file:`LICENSE`
ta: உரிமத்தை உருவாக்குதல்

source: It's important for every package uploaded to the Python Package Index to include a license. This tells users who install your package the terms under which they can use your package. For help picking a license, see https://choosealicense.com/. Once you have chosen a license, open :file:`LICENSE` and enter the license text. For example, if you had chosen the MIT license:
eo: Gravas, ke ĉiu pako alŝutita al la Python-Pakindekso inkluzivu licencon. Tio sciigas al uzanto instalinta pakon la kondiĉojn, sub kiuj oni povas uzi la pakon. Por helpo elekti licencon, vizitu https://choosealicense.com/. Post elekto de licenco, malfermu :file:`LICENSE`, kaj tajpu la licencan tekston. Ekzemple, se vi elektus la MIT-licencon:
ja: Python パッケージインデックスにアップロードされた各々のパッケージにとって、ライセンス条項を明示することは重要です。こうすることで、そのパッケージをインストールするユーザに対して、どのような条件のもとでそのパッケージを使うことができるのかを伝えることができるからです。ライセンス選択の助けが必要ならば、 https://choosealicense.com/ を見てください。どのライセンスにするか選択できたら、 :file:`LICENSE` ファイルを開いてそのライセンス条項を書き込んでください。例えば、 MIT ライセンスを選択したなら次のようにします:
pt_br: É importante que cada pacote enviado para o Índice de Pacotes do Python inclua uma licença. Isso informa aos usuários que instalam seu pacote os termos sob os quais eles podem usá-lo. Para obter ajuda na escolha de uma licença, consulte https://choosealicense.com/. Depois de escolher uma licença, abra :file:`LICENSE` e digite o texto da licença. Por exemplo, se você escolheu a licença MIT:
ru: Важно, чтобы каждый пакет, загруженный в Python Package Index, содержал лицензию. Это указывает пользователям, устанавливающим ваш пакет, на каких условиях они могут его использовать. О том, как выбрать лицензию, читайте на сайте https://choosealicense.com/. Выбрав лицензию, откройте :file:`LICENSE` и введите текст лицензии. Например, если вы выбрали лицензию MIT:
ta: பைதான் தொகுப்பு குறியீட்டில் பதிவேற்றப்பட்ட ஒவ்வொரு தொகுப்புக்கும் உரிமம் சேர்க்க வேண்டியது தேவை. உங்கள் தொகுப்பைப் பயன்படுத்தக்கூடிய விதிமுறைகளை உங்கள் தொகுப்பை நிறுவும் பயனர்களிடம் இது சொல்கிறது. உரிமத்தை எடுக்க உதவ, https://choosealicense.com/ ஐப் பார்க்கவும். நீங்கள் உரிமத்தைத் தேர்ந்தெடுத்ததும், திறந்து: கோப்பு: `உரிமம்` மற்றும் உரிம உரையை உள்ளிடவும். எடுத்துக்காட்டாக, நீங்கள் எம்ஐடி உரிமத்தைத் தேர்ந்தெடுத்திருந்தால்:

source: Most build backends automatically include license files in packages. See your backend's documentation for more details. If you include the path to license in the ``license-files`` key of :file:`pyproject.toml`, and your build backend supports :pep:`639`, the file will be automatically included in the package.
eo: La plejmulto de konstruaj malfasadoj aŭtomate inkluzivas licencajn dosierojn en pakojn. Legu la dokumentaron de via malfasado por detaloj. Se vi metas la dosierlokon de la licenco en la ŝlosilon ``license-files`` de :file:`pyproject.toml` kaj via konstrua malfasado subtenas :pep:`639`, la dosiero aŭtomate inkluziviĝos en la pakon.
ta: பெரும்பாலானவை பின்தளத்தில் தானாகவே தொகுப்புகளில் உரிமக் கோப்புகளை உள்ளடக்குகின்றன. மேலும் விவரங்களுக்கு உங்கள் பின்தளத்தில் ஆவணங்களைப் பார்க்கவும். உரிமம் பெறுவதற்கான பாதையை `` உரிமம்-கோப்புகள்` `விசையில் சேர்த்தால்: கோப்பு:` pyproject.toml`, மற்றும் உங்கள் உருவாக்க பின்தளத்தில் ஆதரவளிக்கிறது: PEP: `639`, கோப்பு தானாகவே தொகுப்பில் சேர்க்கப்படும்.

source: Including other files
eo: Inkluzivi aliajn dosierojn
ja: その他のファイルを包含する
pt_br: Incluindo outros arquivos
ru: Включение других файлов
ta: பிற கோப்புகள் உட்பட

source: The files listed above will be included automatically in your :term:`source distribution <Source Distribution (or "sdist")>`. If you want to include additional files, see the documentation for your build backend.
eo: La ĉi-supraj dosieroj inkluziviĝos aŭtomate en vian :term:`fontan distribuon <Source Distribution (or "sdist")>`. Se vi volas inkluzivi aliajn dosierojn, legu la dokumentaron por via konstruilo.
ja: 上に挙げたファイル群は、 :term:`ソースコード配布物 <Source Distribution (or "sdist")>` に自動的に含まれるでしょう。他のファイルも含めておきたいなら、使っているビルドバックエンドの説明文書を見てください。
pt_br: Os arquivos listados acima serão incluídos automaticamente em sua :term:`distribuição fonte <Distribuição Fonte (ou "sdist")>`. Se você deseja incluir arquivos adicionais, veja a documentação para seu backend de construção.
ru: Перечисленные выше файлы будут автоматически включены в ваш :term:`source дистрибутив <Source Distribution (или "sdist")>`. Если вы хотите включить дополнительные файлы, обратитесь к документации по вашему бэкенду сборки.
ta: மேலே பட்டியலிடப்பட்டுள்ள கோப்புகள் தானாகவே உங்கள்: கால: `மூல வழங்கல் <மூல வழங்கல் (அல்லது" SDIST ")>` இல் சேர்க்கப்படும். கூடுதல் கோப்புகளை நீங்கள் சேர்க்க விரும்பினால், உங்கள் உருவாக்க பின்தளத்தில் ஆவணங்களைப் பார்க்கவும்.

source: Generating distribution archives
eo: Generi distribuan arĥivon
ja: 配布物アーカイブを生成する
pt_br: Gerando arquivos de distribuição
ru: Создание архивов дистрибутивов
ta: விநியோக காப்பகங்களை உருவாக்குதல்

source: The next step is to generate :term:`distribution packages <Distribution Package>` for the package. These are archives that are uploaded to the Python Package Index and can be installed by :ref:`pip`.
eo: La sekva paŝo estas generi :term:`distribuajn pakojn <Distribution Package>` por la pakoj. Tiuj estas arĥivoj alŝutotaj al Python Package Index kaj instaleblaj per :ref:`pip`.
ja: 次のステップでは、そのパッケージの :term:`配布物パッケージ <Distribution Package>` を生成します。これらは、 Python パッケージインデックスへアップロードされ、 :ref:`pip` でインストールされることができるものです。
pt_br: O próximo passo é gerar :term:`pacotes de distribuição <Pacote de Distribuição>` para o pacote. Estes são arquivos que são enviados para o Índice de Pacotes do Python e podem ser instalados pelo :ref:`pip`.
ru: Следующим шагом будет создание :term:`distribution packages <Distribution Package>` для пакета. Это архивы, которые загружаются в индекс пакетов Python и могут быть установлены с помощью :ref:`pip`.
ta: அடுத்த கட்டம் உருவாக்குவது: கால: `விநியோக தொகுப்புகள் <விநியோக தொகுப்பு>` தொகுப்புக்கு. இவை பைதான் தொகுப்பு குறியீட்டில் பதிவேற்றப்படும் காப்பகங்கள் மற்றும் நிறுவலாம்: ref: `பிப்`.

source: Make sure you have the latest version of PyPA's :ref:`build` installed:
eo: Certigu, ke vi instalis la plej novan version de :ref:`build` de PyPA:
ja: PyPA の :ref:`build` の最新版がインストールされていることを確認してください:
pt_br: Certifique-se de que você tenha a versão mais recente da :ref:`construção <build>` do PyPA instalada:
ru: Убедитесь, что у вас установлена последняя версия PyPA :ref:`build`:
ta: பைபாவின் அண்மைக் கால பதிப்பு உங்களிடம் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்: குறிப்பு: `பில்ட்` நிறுவப்பட்டுள்ளது:

source: If you have trouble installing these, see the :doc:`installing-packages` tutorial.
eo: Se malfacilas instali tiujn, vidu la lernilon :doc:`installing-packages`.
ja: これらをインストールするのに困難を感じるようなら、 :doc:`パッケージをインストールする <installing-packages>` チュートリアルを見てください。
pt_br: Se você tiver problemas ao instalá-los, veja o tutorial :doc:`installing-packages`.
ru: Если у вас возникли проблемы с их установкой, обратитесь к руководству :doc:`installing-packages`.
ta: இவற்றை நிறுவுவதில் சிக்கல் இருந்தால், இதைக் காண்க: டாக்: `நிறுவுதல்-பேக்கேச்கள்` டுடோரியல்.

source: Now run this command from the same directory where :file:`pyproject.toml` is located:
eo: Nun rulu la jenan komandon ĉe la sama dosierujo kie troviĝas :file:`pyproject.toml`:
ja: さて、 :file:`pyproject.toml` ファイルがあるのと同じディレクトリでこのコマンドを実行しましょう:
pt_br: Agora, execute este comando a partir do mesmo diretório no qual :file:`pyproject.toml` está localizado:
ru: Теперь запустите эту команду из той же директории, где находится :file:`pyproject.toml`:
ta: இப்போது இந்த கட்டளையை அதே கோப்பகத்திலிருந்து இயக்கவும்: கோப்பு: `pyproject.toml` அமைந்துள்ளது:

source: This command should output a lot of text and once completed should generate two files in the :file:`dist` directory:
eo: Tiu komando eligos multon da teksto, kaj post fino estos kreinta du dosierojn en la dosierujo :file:`dist`:
ja: このコマンドから多くのテキストメッセージが出力されますが、実行が終われば :file:`dist` ディレクトリにふたつのファイルが生成されていることでしょう:
pt_br: Este comando deve produzir muito texto e, uma vez concluído, deve gerar dois arquivos no diretório :file:`dist`:
ru: Эта команда должна вывести много текста и по завершении создать два файла в каталоге :file:`dist`:
ta: இந்த கட்டளை நிறைய உரையை வெளியிட வேண்டும் மற்றும் முடிந்ததும் இரண்டு கோப்புகளை உருவாக்க வேண்டும்: கோப்பு: `Dist` அடைவு:

source: The ``tar.gz`` file is a :term:`source distribution <Source Distribution (or "sdist")>` whereas the ``.whl`` file is a :term:`built distribution <Built Distribution>`. Newer :ref:`pip` versions preferentially install built distributions, but will fall back to source distributions if needed. You should always upload a source distribution and provide built distributions for the platforms your project is compatible with. In this case, our example package is compatible with Python on any platform so only one built distribution is needed.
eo: La dosiero ``tar.gz`` estas :term:`fonta distribuo <Source Distribution (or "sdist")>`, dum la dosiero ``.whl`` estas :term:`konstruita distribuo <Built Distribution>`. Novaj versioj de :ref:`pip` preferas instali konstruitan distribuon sed instalas fontan distribuon, se tio necesas. Oni ĉiam alŝutu fontan distribuon kaj ankaŭ la konstruitajn distribuojn por kongruaj platformoj. Niakaze, la ekzempla pako kongruas kun Python sur ajna platformo; tial ni nur bezonas unu konstruitan distribuon.
ja: ``tar.gz`` ファイルは :term:`ソースコード配布物 <Source Distribution (or "sdist")>` であり、 ``.whl`` ファイルは :term:`ビルド済配布物 <Built Distribution>` です。新しめのバージョンの :ref:`pip` では、ビルド済配布物を優先的にインストールしますが、必要であればソースコード配布物にフォールバックします。ソースコード配布物については常にアップロードするべきであり、あなたのプロジェクトが動作するはずのプラットフォーム向けのビルド済配布物についても準備するべきです。我々の例示のためのパッケージはすべてのプラットフォーム上の Python で動作するものなので、ビルド済配布物がひとつあれば十分です。
pt_br: O arquivo ``tar.gz`` é um :term:`distribuição fonte <Distribuição Fonte (ou "sdist")>` enquanto o arquivo ``.whl`` é uma :term:`distribuição construída <Distribuição Construída>`. As versões :ref:`pip` mais recentes instalam preferencialmente distribuições construídas, mas irão recorrer às distribuições fonte se necessário. Você deve sempre enviar uma distribuição fonte e fornecer distribuições construídas para as plataformas com as quais seu projeto é compatível. Neste caso, nosso pacote de exemplo é compatível com Python em qualquer plataforma, portanto, apenas uma distribuição construída é necessária.
ru: Файл ``tar.gz`` представляет собой :term:``исходный дистрибутив <Source Distribution (или "sdist")>``, а файл ``.whl`` представляет собой :term:``сборный дистрибутив <Built Distribution>`. Более новые версии :ref:`pip` предпочитают устанавливать собранные дистрибутивы, но при необходимости возвращаются к исходным дистрибутивам. Вы всегда должны загружать исходный дистрибутив и предоставлять собранные дистрибутивы для платформ, с которыми совместим ваш проект. В данном случае наш пример пакета совместим с Python на любой платформе, поэтому требуется только один собранный дистрибутив.
ta: `` Tar.gz`` கோப்பு என்பது ஒரு: கால: `மூல வழங்கல் <மூல வழங்கல் (அல்லது" SDIST ")>` அதேசமயம் `` .Whl`` கோப்பு ஒரு: கால: `கட்டப்பட்ட வழங்கல் <கட்டமைக்கப்பட்ட விநியோகம்>`. புதியது: ref: `பிப்` பதிப்புகள் முன்னுரிமையாக கட்டமைக்கப்பட்ட விநியோகங்களை நிறுவுகின்றன, ஆனால் தேவைப்பட்டால் மூல விநியோகங்களுக்கு மீண்டும் வரும். நீங்கள் எப்போதும் ஒரு மூல விநியோகத்தை பதிவேற்ற வேண்டும் மற்றும் உங்கள் திட்டம் இணக்கமான தளங்களுக்கு கட்டப்பட்ட விநியோகங்களை வழங்க வேண்டும். இந்த வழக்கில், எங்கள் எடுத்துக்காட்டு தொகுப்பு எந்தவொரு தளத்திலும் பைத்தானுடன் இணக்கமானது, எனவே கட்டப்பட்ட ஒரு வழங்கல் மட்டுமே தேவைப்படுகிறது.

source: Uploading the distribution archives
eo: Alŝuti la distribuajn arĥivojn
ja: 配布物アーカイブをアップロードする
pt_br: Enviando os arquivos de distribuição
ru: Загрузка архивов дистрибутива
ta: விநியோக காப்பகங்களைப் பதிவேற்றுதல்
