Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Each record is composed of three elements: the file's **path**, the **hash** of the contents, and its **size**.
eo: Ĉiu rikordo konsistas el tri elemento: la dosierloko (**path**), la haketaĵo (**hash**) de la enhavo, kaj la grando (**size**).
ja: 各レコードは３個の要素から構成されます: ファイルの **パス** 、内容の **ハッシュ値** 、そして、その **サイズ** です。
pt_br: Cada registro é composto de três elementos: o **caminho** do arquivo, o **hash** do conteúdo e seu **tamanho**.
ru: Каждая запись состоит из трех элементов: **путь** файла, **хэш** его содержимого и **размер**.
ta: ஒவ்வொரு பதிவும் மூன்று கூறுகளால் ஆனது: கோப்பின் ** பாதை **, உள்ளடக்கங்களின் ** ஆச் ** மற்றும் அதன் ** அளவு **.

source: The *path* may be either absolute, or relative to the directory containing the ``.dist-info`` directory (commonly, the ``site-packages`` directory). On Windows, directories may be separated either by forward- or backslashes (``/`` or ``\``).
eo: La *path* povas esti aŭ malrelativa aŭ relativa al la dosierujo enhavanta la dosierujon ``.dist-info`` (ordinare, la dosierujo ``site-packages``). Je Windows, oni povas disigi dosierlokajn komponantojn per aŭ suprenstreko (``/``) aŭ malsuprenstreko (``\``).
ja: *パス* は ``.dist-info`` ディレクトリを含むディレクトリ (通常は ``site-packages`` ディレクトリ) へのパスで、絶対パスでも相対パスでも構いません。 Windows では、ディレクトリはスラッシュで区切ってもバックスラッシュで区切っても構いません (``/`` または ``\``) 。
pt_br: O *caminho* pode ser absoluto ou relativo ao diretório que contém o diretório ``.dist-info`` (comumente, o diretório ``site-packages``). No Windows, os diretórios podem ser separados por barras ou barras invertidas (``/`` ou ``\``).
ru: Путь *path* может быть как абсолютным, так и относительным к каталогу, содержащему каталог ``.dist-info`` (обычно это каталог ``ite-packages``). В Windows каталоги могут быть разделены прямыми или обратными слешами (``/`` или ``\``).
ta: * பாதை * முழுமையானதாக இருக்கலாம், அல்லது `.dist-info`` கோப்பகத்தைக் கொண்ட கோப்பகத்துடன் தொடர்புடையதாக இருக்கலாம் (பொதுவாக,` `தள-பேக்கேச்கள்` கோப்பகம்). சாளரங்களில், கோப்பகங்கள் முன்னோக்கி அல்லது பின்வாங்குவதன் மூலம் பிரிக்கப்படலாம் (``/`` அல்லது `` \ ``).

source: The *hash* is either an empty string or the name of a hash algorithm from :py:data:`hashlib.algorithms_guaranteed`, followed by the equals character ``=`` and the digest of the file's contents, encoded with the urlsafe-base64-nopad encoding (:py:func:`base64.urlsafe_b64encode(digest) <base64.urlsafe_b64encode()>` with trailing ``=`` removed).
eo: La *hash* estas aŭ malplena signoĉeno aŭ la nomo de haketaĵa algoritmo el :py:data:`hashlib.algorithms_guaranteed`, sekvita de la egalsigno ``=`` kaj la haketaĵo de la enhavo de la dosiero kodita laŭ urlsafe-base64-nopad (:py:func:`base64.urlsafe_b64encode(haketaĵo) <base64.urlsafe_b64encode()>` sen fina ``=``).
ja: *hash* は、空文字列または ``hashlib.algorithms_guaranteed`` から取ったハッシュアルゴリズムの名前の後ろに等号 ``=`` を付けて、ファイルの内容のハッシュ値を urlsafe-base64-nopad エンコーディング (``base64.urlsafe_b64encode(digest) <base64.urlsafe_b64encode()>`` の結果から末尾の ``=`` を取り除いたもの) で記したものです。
ru: В качестве *hash* используется либо пустая строка, либо имя хэш-алгоритма из :py:data:`hashlib. алгоритмы_гарантированы`, за которым следует символ равенства ``=`` и дайджест содержимого файла, закодированный с помощью кодировки urlsafe-base64-nopad (:py:func:`base64.urlsafe_b64encode(digest) <base64.urlsafe_b64encode()>` с удаленным ``=`` в конце).
ta: * ஆச் * என்பது ஒரு வெற்று சரம் அல்லது ஒரு ஆச் வழிமுறையின் பெயர்: py: தரவு: `hashlib.algorithms_guaranded`, அதைத் தொடர்ந்து சமமான தன்மை` `=` `மற்றும் கோப்பின் உள்ளடக்கங்களின் டைசச்ட், URLSAFE உடன் குறியிடப்பட்டுள்ளது -பேச் 64-நோபாட் குறியாக்கம் (: py: func: `base64.urlsafe_b64encode (டைசச்ட்) <base64.urlsafe_b64encode ()> `பின்னால்` `=` `அகற்றப்பட்டது).

source: The *size* is either the empty string, or file's size in bytes, as a base 10 integer.
eo: La *size* estas aŭ la malplena signoĉeno aŭ la grando de la dosiero en bajtoj kiel dekuma entjero.
ja: *size* は、空文字列か、または、ファイルサイズを 10 進数のバイト数で書いたものです。
pt_br: O *tamanho* é a string vazia ou o tamanho do arquivo em bytes, como um inteiro de base 10.
ru: Параметр *size* - это либо пустая строка, либо размер файла в байтах, как целое число по основанию 10.
ta: * அளவு * என்பது வெற்று சரம் அல்லது பைட்டுகளில் உள்ள கோப்பின் அளவு, அடிப்படை 10 முழு எண்ணாக உள்ளது.

source: For any file, either or both of the *hash* and *size* fields may be left empty. Commonly, entries for ``.pyc`` files and the ``RECORD`` file itself have empty *hash* and *size*. For other files, leaving the information out is discouraged, as it prevents verifying the integrity of the installed project.
ja: どのファイルについても、 *hash* フィールドと *size* フィールドの片方もしくは両方が空欄になっていても構いません。通常は、 ``.pyc`` ファイルと ``RECORDS`` ファイル自身については *hash* フィールドと *size* フィールドの両方が空欄になっています。その他のファイルについては、インストールされたプロジェクトに関する完全性を検証するために情報を与えておくことが推奨されています。
pt_br: Para qualquer arquivo, um ou ambos os campos de *hash* e *tamanho* podem ser deixados em branco. Normalmente, entradas para arquivos ``.pyc`` e o próprio arquivo ``RECORD`` têm *hash* e *tamanho* vazios. Para os demais arquivos, não é recomendável deixar as informações de fora, pois impede a verificação da integridade do projeto instalado.
ru: Для любого файла любое из полей *hash* и *size* или оба могут быть пустыми. Обычно записи для файлов ``.pyc`` и самого файла ``RECORD`` имеют пустые *hash* и *size*. Для других файлов оставлять эту информацию не рекомендуется, так как это мешает проверке целостности установленного проекта.
ta: எந்தவொரு கோப்பிற்கும், அல்லது * ஆச் * மற்றும் * அளவு * புலங்கள் காலியாக விடப்படலாம். பொதுவாக, `` .பிசி`` கோப்புகளுக்கான உள்ளீடுகள் மற்றும் `` பதிவு`` கோப்பில் வெற்று *ஆச் *மற்றும் *அளவு *உள்ளன. மற்ற கோப்புகளுக்கு, நிறுவப்பட்ட திட்டத்தின் ஒருமைப்பாட்டை சரிபார்க்கத் தடுக்கும் என்பதால், தகவல்களை வெளியே விட்டுவிடுவது ஊக்கமளிக்கிறது.

source: If the ``RECORD`` file is present, it must list all installed files of the project, except ``.pyc`` files corresponding to ``.py`` files listed in ``RECORD``, which are optional. Notably, the contents of the ``.dist-info`` directory (including the ``RECORD`` file itself) must be listed. Directories should not be listed.
ja: もし ``RECORD`` ファイルが存在するなら、 ``RECORD`` に記入された ``.py`` ファイルに対応する ``.pyc`` ファイルを記入することはオプションですが、それを除いてそのプロジェクトからインストールされたファイルの全てについて列挙していなければなりません。特に、 ``.dist-info`` ディレクトリ の内容 (``RECORD`` ファイル自身を含む) については、書いておかなければなりません。ディレクトリについては記入してはなりません。
pt_br: Se o arquivo ``RECORD`` estiver presente, ele deve listar todos os arquivos instalados do projeto, exceto os arquivos ``.pyc`` correspondentes aos arquivos ``.py`` listados em ``RECORD``, que são opcionais. Notavelmente, o conteúdo do diretório ``.dist-info`` (incluindo o próprio arquivo ``RECORD``) deve ser listado. Os diretórios não devem ser listados.
ru: Если файл ``RECORD`` присутствует, в нем должны быть перечислены все установленные файлы проекта, за исключением файлов ``.pyc``, соответствующих файлам ``.py``, перечисленным в ``RECORD``, которые являются необязательными. В частности, должно быть перечислено содержимое каталога ``.dist-info`` (включая сам файл ``RECORD``). Каталоги перечислять не следует.
ta: `` பதிவு`` கோப்பு இருந்தால், அது விருப்பமான `` பதிவு`` இல் பட்டியலிடப்பட்ட `` .பீ`` கோப்புகளுடன் தொடர்புடைய `` .பிசி`` கோப்புகளைத் தவிர, திட்டத்தின் அனைத்து நிறுவப்பட்ட கோப்புகளையும் பட்டியலிட வேண்டும். குறிப்பிடத்தக்க வகையில், `` .டிச்ட்-இன்ஃபோ`` கோப்பகத்தின் உள்ளடக்கங்கள் (`` பதிவு`` கோப்பு உட்பட) பட்டியலிடப்பட வேண்டும். கோப்பகங்கள் பட்டியலிடப்படக்கூடாது.

source: To completely uninstall a package, a tool needs to remove all files listed in ``RECORD``, all ``.pyc`` files (of all optimization levels) corresponding to removed ``.py`` files, and any directories emptied by the uninstallation.
eo: Por plene malinstali pakon, ilo devas forviŝi ĉiujn dosierojn en ``RECORD``, ĉiujn dosierojn ``.pyc`` (de ajna optimumiga nivelo) respondantajn al forviŝotaj ``.py``-dosieroj, kaj ajnaj dosierujoj malplenigotaj de la malinstalo.
ja: パッケージを完全にアンインストールするためには、ツールは、 ``RECORD`` に列挙された全てのファイルと、 ``.py`` ファイルに対応する (あらゆる最適化状態の) ``.pyc`` ファイルと、アンインストールによって空になったすべてのディレクトリを削除する必要があります。
pt_br: Para desinstalar completamente um pacote, uma ferramenta precisa remover todos os arquivos listados em ``RECORD``, todos os arquivos ``.pyc`` (de todos os níveis de otimização) correspondentes aos arquivos ``.py`` removidos e quaisquer diretórios esvaziados pela desinstalação.
ru: Чтобы полностью удалить пакет, инструмент должен удалить все файлы, перечисленные в ``RECORD``, все файлы ``.pyc`` (всех уровней оптимизации), соответствующие удаленным файлам ``.py``, и все каталоги, опустошенные в результате деинсталляции.
ta: ஒரு தொகுப்பை முழுமையாக நிறுவல் நீக்க, ஒரு கருவி `` பதிவு``, அனைத்து `` .பிசி`` கோப்புகள் (அனைத்து தேர்வுமுறை நிலைகளிலும்) அகற்றப்பட்ட `` .பீ`` கோப்புகளுடன் தொடர்புடைய அனைத்து கோப்புகளையும் அகற்ற வேண்டும், மேலும் எந்த கோப்பகங்களும் காலியாகிவிட்டன நிறுவல் நீக்குவதன் மூலம்.

source: Here is an example snippet of a possible ``RECORD`` file::
eo: Jen ekzemplo de ebla dosiero ``RECORD``::
ja: ありうる ``RECORD`` ファイルの一部を切り出した例をここに掲げます::
pt_br: Aqui está um trecho de exemplo de um possível arquivo ``RECORD``::
ru: Вот пример фрагмента возможного файла ``RECORD``::
ta: சாத்தியமான `` பதிவு`` கோப்பின் சான்று இங்கே ::

source: If the ``RECORD`` file is missing, tools that rely on ``.dist-info`` must not attempt to uninstall or upgrade the package. (This restriction does not apply to tools that rely on other sources of information, such as system package managers in Linux distros.)
eo: Se la dosiero ``RECORD`` mankas, ilo dependanta de ``.dist-info`` devas ne provi malinstali aŭ ĝisdatigi la pakon. (Tiu devo ne temas pri ilo uzanta aliajn informojn kiel sistema pakadministrilo de Linux-distribuo.)
ja: ``RECORD`` ファイルが存在しない場合、 ``.dist-info`` に依存するツールは、アンインストールやアップグレードを試みてはなりません。(この制約は、 Linux ディストロにおけるシステムのパッケージ管理機構のような、それ以外の情報源に依存するツールには適用されません。)
ru: Если файл ``RECORD`` отсутствует, инструменты, полагающиеся на ``.dist-info``, не должны пытаться удалить или обновить пакет. (Это ограничение не распространяется на инструменты, которые полагаются на другие источники информации, такие как системные менеджеры пакетов в дистрибутивах Linux.)
ta: `` பதிவு`` கோப்பு காணவில்லை என்றால், `` .dist-info`` ஐ நம்பியிருக்கும் கருவிகள் தொகுப்பை நிறுவல் நீக்கவோ மேம்படுத்தவோ முயற்சிக்கக்கூடாது. (லினக்ச் டிச்ட்ரோசில் கணினி தொகுப்பு மேலாளர்கள் போன்ற பிற தகவல்களின் ஆதாரங்களை நம்பியிருக்கும் கருவிகளுக்கு இந்த கட்டுப்பாடு பொருந்தாது.)

source: It is *strongly discouraged* for an installed package to modify itself (e.g., store cache files under its namespace in ``site-packages``). Changes inside ``site-packages`` should be left to specialized installer tools such as pip. If a package is nevertheless modified in this way, then the ``RECORD`` must be updated, otherwise uninstalling the package will leave unlisted files in place (possibly resulting in a zombie namespace package).
eo: Ni *rekomendegas*, ke instalita pako ne modifu sin (ekz. per enkaŝmemorigo de dosieroj sub sia nomspaco en ``site-packages``). Nur fakaj instaliloj kiel pip modifu ``site-changes``. Se pako tamen tiel sin modifas, do ĝi devas ĝisdatigu ``RECORD``; se tio ne okazus, malinstalado de pako lasus eksterlistajn dosierojn (eble kreante fantoman nomspacan pakon).
ja: インストール済みのパッケージが自分自身を修正すること (例えば、 ``site-packages`` 内の名前空間の下にキャッシュファイルを保存すること) は、 *強い非推奨* 事項です。 ``site-packages`` の内側での変更は、 pip のような特別なインストールツールに委ねられるべきです。それにも関わらず、パッケージがこのようなやり方で修正された場合には必ず ``RECORD`` を更新しなければならず、そうしなければパッケージをアンインストールの時に、リストに洩れているファイルがその場に残されてしまうでしょう (おそらくはゾンビ状態の名前空間パッケージになるでしょう)。
ru: Устанавливаемому пакету *сильно не рекомендуется* изменять себя (например, хранить файлы кэша в своем пространстве имен в ``ite-packages``). Изменения внутри ``site-packages` следует оставить специализированным инструментам установки, таким как pip. Если пакет все же был изменен таким образом, то необходимо обновить ``RECORD``, иначе при деинсталляции пакета на месте останутся незарегистрированные файлы (возможно, это приведет к появлению пакета-зомби в пространстве имен).
ta: நிறுவப்பட்ட தொகுப்பு தன்னை மாற்றிக் கொள்வது * கடுமையாக ஊக்கமளிக்கிறது * (எ.கா., கேச் கோப்புகளை அதன் பெயர்வெளியின் கீழ் `` தள-தொகுப்புகள்`` இல் சேமிக்கவும்). `` தள-பேக்கேச்கள்`` க்குள் மாற்றங்கள் பிஐபி போன்ற சிறப்பு நிறுவி கருவிகளுக்கு விடப்பட வேண்டும். இருப்பினும் ஒரு தொகுப்பு இந்த வழியில் மாற்றியமைக்கப்பட்டால், `` பதிவு`` புதுப்பிக்கப்பட வேண்டும், இல்லையெனில் தொகுப்பை நிறுவல் நீக்குவது பட்டியலிடப்படாத கோப்புகளை வைக்கும் (இதன் விளைவாக ஒரு சாம்பி பெயர்வெளி தொகுப்பு ஏற்படலாம்).

source: The INSTALLER file
eo: La dosiero INSTALLER
ja: INSTALLER ファイル
pt_br: O arquivo INSTALLER
ru: Файл INSTALLER
ta: நிறுவி கோப்பு

source: If present, ``INSTALLER`` is a single-line text file naming the tool used to install the project. If the installer is executable from the command line, ``INSTALLER`` should contain the command name. Otherwise, it should contain a printable ASCII string.
eo: Se dosiero ``INSTALLER`` ekzistas, ĝi estas unulinia teksta dosiero nomanta la ilon uzitan por instali la projekton. Se la instalilo estas rulebla ĉe la komandlinio, ``INSTALLER`` enhavu la nomon de la komando. Se ne, ĝi enhavu preseblan Askian signoĉenon.
ja: もし存在するなら、 ``INSTALLER`` は、プロジェクトのインストールに使われたツールを名指しする１行のテキストファイルです。インストーラがコマンドラインから起動されるなら、 ``INSTALLER`` はそのコマンドの名前を含んでいるべきです。そうでなければ印刷可能な ASCII 文字を含んでいるべきです。
pt_br: Se presente, ``INSTALLER`` é um arquivo de texto de uma linha que nomeia a ferramenta usada para instalar o projeto. Se o instalador for executável a partir da linha de comando, ``INSTALLER`` deve conter o nome do comando. Caso contrário, deve conter uma string ASCII imprimível.
ru: Если присутствует, ``INSTALLER`` - это однострочный текстовый файл с названием инструмента, используемого для установки проекта. Если программа установки исполняется из командной строки, ``INSTALLER`` должен содержать имя команды. В противном случае в нем должна содержаться печатаемая ASCII-строка.
ta: இருந்தால், `` நிறுவி`` என்பது திட்டத்தை நிறுவ பயன்படும் கருவியை பெயரிடும் ஒற்றை வரி உரை கோப்பு. நிறுவி கட்டளை வரியிலிருந்து இயங்கக்கூடியதாக இருந்தால், `` நிறுவி`` கட்டளை பெயரைக் கொண்டிருக்க வேண்டும். இல்லையெனில், அதில் அச்சிடக்கூடிய ASCII சரம் இருக்க வேண்டும்.

source: The file can be terminated by zero or more ASCII whitespace characters.
eo: La dosiero povas finiĝi per nul aŭ pli da Askiaj blankspacaj signoj.
ja: ファイルは、0個またはそれ以上の ASCII 空白文字で終端することができます。
pt_br: O arquivo pode ser encerrado com zero ou mais caracteres de espaço em branco ASCII.
ru: Файл может быть завершен нулем или несколькими пробельными символами ASCII.
ta: கோப்பை பூச்சியம் அல்லது அதற்கு மேற்பட்ட ASCII வைட்ச்பேச் எழுத்துக்கள் மூலம் நிறுத்தலாம்.

source: Here are examples of two possible ``INSTALLER`` files::
eo: Jen ekzemploj de du eblaj dosieroj ``INSTALLER``::
ja: ``INSTALLER`` ファイルについて、二つの可能な例を示します::
pt_br: Aqui estão exemplos de dois possíveis arquivos ``INSTALLER``::
ru: Вот примеры двух возможных файлов ``INSTALLER``::
ta: சாத்தியமான இரண்டு `` நிறுவி` கோப்புகளின் எடுத்துக்காட்டுகள் இங்கே ::

source: This value should be used for informational purposes only. For example, if a tool is asked to uninstall a project but finds no ``RECORD`` file, it may suggest that the tool named in ``INSTALLER`` may be able to do the uninstallation.
eo: Tiu valoro estu uzata nur por informaj celoj. Ekzemple, se oni provus malinstali projekton per iu ilo, sed la ilo ne trovus dosieron ``RECORD``, ĝi povus sugesti, ke oni uzu la ilon nomitan en ``INSTALLER`` por malinstali.
ja: この値は情報提供目的にのみ使用されるべきです。例えば、あるツールでプロジェクトのアンインストールをしようとしたが ``RECORD`` ファイルを見つけられなかった場合には、そのツールは ``INSTALLER`` ファイルに書いてある (別の) ツールを使えばアンインストールができるかもしれないと示唆しても構いません。
pt_br: Este valor deve ser usado apenas para fins informativos. Por exemplo, se uma ferramenta é solicitada a desinstalar um projeto, mas não encontra o arquivo ``RECORD``, pode sugerir que a ferramenta nomeada em ``INSTALLER`` pode ser capaz de fazer a desinstalação.
ru: Это значение следует использовать только в информационных целях. Например, если инструменту предлагается удалить проект, но он не находит файла ``RECORD``, он может предположить, что инструмент, названный в ``INSTALLER``, может выполнить удаление.
ta: இந்த மதிப்பு செய்தி நோக்கங்களுக்காக மட்டுமே பயன்படுத்தப்பட வேண்டும். எடுத்துக்காட்டாக, ஒரு திட்டத்தை நிறுவல் நீக்க ஒரு கருவி கேட்கப்பட்டால், ஆனால் `` பதிவு`` கோப்பைக் கண்டறிந்தால், `` நிறுவி`` இல் பெயரிடப்பட்ட கருவி நிறுவல் நீக்குதலைச் செய்ய முடியும் என்று அது பரிந்துரைக்கலாம்.

source: The entry_points.txt file
eo: La dosiero entry_points.txt
ja: entry_points.txt ファイル
pt_br: O arquivo entry_points.txt
ru: Файл entry_points.txt
ta: Entery_points.txt கோப்பு

source: This file MAY be created by installers to indicate when packages contain components intended for discovery and use by other code, including console scripts and other applications that the installer has made available for execution.
eo: Ĉi tiun dosieron instalilo POVAS krei por indiki, ke pako enhavas komponantojn malkovreblajn kaj uzeblajn de alia kodo, inkluzive de konzolaj programetoj kaj aliaj programoj rulebligitaj de la instalilo.
ja: インストーラが (他者から) 実行できる状態にするコンソールスクリプトや他のアプリケーションを含めて、 (他者から) 発見されたり他のソースコードから利用されたりすることを意図したコンポーネントを当該パッケージが含んでいる場合には、インストーラがその由を表示するためにこのファイルを作っても構いません。
ru: Этот файл МОЖЕТ быть создан программой установки, чтобы указать, когда пакеты содержат компоненты, предназначенные для обнаружения и использования другим кодом, включая консольные сценарии и другие приложения, которые программа установки сделала доступными для выполнения.
ta: இந்த கோப்பு நிறுவிகளால் உருவாக்கப்படலாம், தொகுப்புகளில் கண்டுபிடிப்பு மற்றும் பிற குறியீட்டால் பயன்படுத்தப்பட்ட கூறுகள் இருக்கும்போது, கன்சோல் ச்கிரிப்ட்கள் மற்றும் நிறுவி செயல்படுத்தலுக்கு கிடைக்கக்கூடிய பிற பயன்பாடுகள் உள்ளிட்ட பிற குறியீடுகளால் பயன்படுத்தப்படும் கூறுகள் இருக்கும்போது குறிக்கலாம்.

source: Its detailed specification is at :ref:`entry-points`.
eo: Ĝia detala specifo troviĝas ĉe :ref:`entry-points`.
ja: その詳細な仕様は :ref:`entry-points` にあります。
ru: Его подробная спецификация находится по адресу :ref:`entry-points`.
ta: அதன் விரிவான விவரக்குறிப்பு: ref: `நுழைவு புள்ளிகள்`.

source: The direct_url.json file
eo: La dosiero direct_url.json
ja: direct_url.json ファイル
pt_br: O arquivo direct_url.json
ru: Файл direct_url.json
ta: Direct_url.json கோப்பு

source: This file MUST be created by installers when installing a distribution from a requirement specifying a direct URL reference (including a VCS URL).
eo: Tiu dosiero DEVAS esti kreita de instalilo dum instalado de distribuo pro postulo specifitanta rektan retadresan referencon (inkluzive de versikontrolsistema retadreso).
ja: このファイルは、要求事項が指定するダイレクト URL (VCS の URL を含む) から配布物をインストールする際に、インストーラによって生成されなければなりません。
pt_br: Este arquivo DEVE ser criado por instaladores ao instalar uma distribuição a partir de um requisito que especifica uma referência de URL direta (incluindo uma URL de VCS).
ru: Этот файл ДОЛЖЕН создаваться программой установки при установке дистрибутива из требования, указывающего прямую URL-ссылку (включая VCS URL).
ta: நேரடி முகவரி குறிப்பைக் குறிப்பிடும் தேவையிலிருந்து விநியோகத்தை நிறுவும் போது இந்த கோப்பு நிறுவிகளால் உருவாக்கப்பட வேண்டும் (VCS முகவரி உட்பட).

source: Its detailed specification is at :ref:`direct-url`.
eo: La detala specifo troviĝas ĉe :ref:`direct-url`.
ja: その詳細な仕様は :ref:`direct-url` にあります。
pt_br: Sua especificação detalhada está em :ref:`direct-url`.
ru: Его подробная спецификация находится по адресу :ref:`direct-url`.
ta: அதன் விரிவான விவரக்குறிப்பு உள்ளது: குறிப்பு: `நேரடி-உர்எல்`.

source: The :file:`licenses/` subdirectory
eo: La dosierujo :file:`licenses/`
ru: Подкаталог :file:`licenses/`
ta: தி: கோப்பு: `உரிமங்கள்/` துணை அடைவு

source: If the metadata version is 2.4 or greater and one or more ``License-File`` fields is specified, the :file:`.dist-info/` directory MUST contain a :file:`licenses/` subdirectory which MUST contain the files listed in the ``License-File`` fields in the :file:`METADATA` file at their respective paths relative to the :file:`licenses/` directory. Any files in this directory MUST be copied from wheels by the install tools.
ru: Если версия метаданных 2.4 или выше и указано одно или несколько полей ``License-File``, каталог :file:`.dist-info/` ДОЛЖЕН содержать подкаталог :file:`licenses/`, который ДОЛЖЕН содержать файлы, перечисленные в полях ``License-File`` в файле :file:`METADATA`` по их соответствующим путям относительно каталога :file:`licenses/`. Любые файлы в этом каталоге ДОЛЖНЫ быть скопированы с колеса средствами установки.
ta: மேனிலை தரவு பதிப்பு 2.4 அல்லது அதற்கு மேற்பட்டது மற்றும் ஒன்று அல்லது அதற்கு மேற்பட்ட `` உரிம-கோப்பு` `புலங்கள் குறிப்பிடப்பட்டால்,: கோப்பு:` .டிச்ட்-இன்ஃபோ/`கோப்பகத்தில் ஒரு: கோப்பு:` உரிமங்கள்/`துணை அடைவு இருக்க வேண்டும், அவை கொண்டிருக்க வேண்டும் `` உரிம-கோப்பு`` புலங்களில் பட்டியலிடப்பட்ட கோப்புகள்: கோப்பு: `மெட்டாடேட்டா` அந்தந்த பாதைகளில்: கோப்பு:` உரிமங்கள்/` அடைவு. இந்த கோப்பகத்தில் உள்ள எந்த கோப்புகளும் நிறுவும் கருவிகளால் சக்கரங்களிலிருந்து நகலெடுக்கப்பட வேண்டும்.

source: Intentionally preventing changes to installed packages
eo: Intence malhelpi ŝanĝi instalitajn pakojn
ja: インストール済みのパッケージ群への変更を意図的に防ぐ
pt_br: Prevenindo intencionalmente modificações nos pacotes instalados
ru: Намеренное предотвращение изменений в установленных пакетах
ta: நிறுவப்பட்ட தொகுப்புகளில் மாற்றங்களை வேண்டுமென்றே தடுக்கிறது

source: In some cases (such as when needing to manage external dependencies in addition to Python ecosystem dependencies), it is desirable for a tool that installs packages into a Python environment to ensure that other tools are not used to uninstall or otherwise modify that installed package, as doing so may cause compatibility problems with the wider environment.
ja: (Python エコシステムでの依存関係に加えて外部の依存関係を管理する必要がある場合など) いくつかの場合には、 Python 環境にパッケージをインストールするツールが、そのインストール済みパッケージを他のツールがアンインストールも修正もしていないことを、もしそんなことをしていればより広範な環境に互換性問題を引き起こしかねないので、しっかりと確認することが望ましいです。
ru: В некоторых случаях (например, при необходимости управлять внешними зависимостями в дополнение к зависимостям экосистемы Python) желательно, чтобы инструмент, устанавливающий пакеты в среду Python, не использовал другие инструменты для удаления или иного изменения установленного пакета, поскольку это может привести к проблемам совместимости с более широкой средой.
ta: சில சந்தர்ப்பங்களில் (பைத்தான் சுற்றுச்சூழல் சார்புநிலைகளுக்கு கூடுதலாக வெளிப்புற சார்புகளை நிர்வகிக்க வேண்டியிருக்கும் போது), பைதான் சூழலில் தொகுப்புகளை நிறுவும் ஒரு கருவிக்கு இது விரும்பத்தக்கது, மற்ற கருவிகள் நிறுவப்பட்ட தொகுப்பை மாற்றியமைக்கவோ அல்லது மாற்றியமைக்கவோ பயன்படுத்தப்படுவதில்லை என்பதை உறுதிப்படுத்த, அவ்வாறு செய்வது வைர சூழலில் இணக்கத்தன்மை சிக்கல்களை ஏற்படுத்தக்கூடும்.

source: To achieve this, affected tools should take the following steps:
eo: Por tio, rilataj iloj faru la jenon:
ja: これを達成するために、影響を被るツール群は次のような段階を踏むべきです:
ru: Чтобы добиться этого, пострадавшие инструменты должны предпринять следующие шаги:
ta: இதை அடைய, பாதிக்கப்பட்ட கருவிகள் பின்வரும் நடவடிக்கைகளை எடுக்க வேண்டும்:
