Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Secondly, while some Python software is written to support running directly from a zip archive, it is still common for code to be written assuming it has been fully installed. When that assumption is broken by trying to run the software from a zip archive, the failures can often be obscure and hard to diagnose (especially when they occur in third party libraries). The two most common sources of problems with this are the fact that importing C extensions from a zip archive is *not* supported by CPython (since doing so is not supported directly by the dynamic loading machinery on any platform) and that when running from a zip archive the ``__file__`` attribute no longer refers to an ordinary filesystem path, but to a combination path that includes both the location of the zip archive on the filesystem and the relative path to the module inside the archive. Even when software correctly uses the abstract resource APIs internally, interfacing with external components may still require the availability of an actual on-disk file.
eo: Due, dum iuj Python-programoj subtenas ruliĝante rekte el zip-arĥivoj, tamen ofte kodo supozas, ke ĝi estis plene instalita. Kiam tiu supozo estas rompita rulante programon el zip-arĥivo, la eraroj ofte estas obskuraj kaj malfacilaj por diagnozi (speciale en triapartiaj bibliotekoj). La du plej oftaj fontoj de problemoj pri tio estas la faktoj, ke importado de C-etendaĵoj el zip-arĥivo estas *ne* subtenata de CPython (ĉar tion ne subtenas la dinamika ŝargada meĥanismo sur ajna platformo), kaj ke dum rulado el zip-arĥivo la atributo ``__file__`` ne estas ordinara dosiersistema loko sed kombina vojo inkluzivanta kaj la lokon de la zip-arĥivo kaj la relativan vojon al la modulo en la arĥivo. Eĉ kiam programo ĝuste uzas la abstraktajn rimedajn API-ojn interne, interagado kun eksteraj komponantoj povas postuli realan surdiskan dosieron.
ja: 第二に、 Python のソフトウェアの中には zip アーカイブから直接に動作させることをサポートするように書かれているものもありますが、やはり完全にインストールされることを前提にして書かれたソースコードが今も普通です。 zip アーカイブからソフトウェアを走らせようと試みてこの仮定を崩すと、 (とりわけ失敗動作がサードパーティのライブラリで起きる場合には) しばしば失敗動作がわかりにくく原因究明が困難になるでしょう。この問題の最もありがちなふたつの根源は、 C 言語拡張を zip アーカイブからインポートすることが CPython では *サポートされていない* こと (というのは、どんなプラットフォームの動的ローディング機構でもこのような動作が直接にはサポートされていないから) 、および、 zip アーカイブから動作する際には ``__file__`` 属性がもはや普通のファイルシステム上のファイルパスを参照しておらず、 zip アーカイブのファイルシステム上の置き場所のパスとアーカイブ内のモジュールへの相対パスの両方を含んだ連結パスになることです。ソフトウェア内では抽象化された資源への API 群を正しく扱えたとしても、外部の部品とのインタフェイスは依然として実際にディスク上に存在するファイルがないと動作できないかもしれません。
pt_br: Em segundo lugar, embora alguns softwares Python sejam escritos para suportar a execução direta de um arquivo zip, ainda é comum que o código seja escrito assumindo que foi totalmente instalado. Quando essa suposição é quebrada ao tentar executar o software a partir de um arquivo zip, as falhas podem frequentemente ser obscuras e difíceis de diagnosticar (especialmente quando ocorrem em bibliotecas de terceiros). As duas fontes mais comuns de problemas com isso são o fato de que a importação de extensões C de um arquivo zip *não* ser suportada pelo CPython (uma vez que fazer isso não é suportado diretamente pela máquina de carregamento dinâmico em qualquer plataforma) e que quando executando a partir de um arquivo zip, o atributo ``__file__`` não se refere mais a um caminho de sistema de arquivos comum, mas a um caminho de combinação que inclui tanto a localização do arquivo zip no sistema de arquivos quanto o caminho relativo para o módulo dentro do arquivo. Mesmo quando o software usa corretamente as APIs de recursos abstratos internamente, a interface com componentes externos ainda pode exigir a disponibilidade de um arquivo real no disco.
ru: Во-вторых, хотя некоторые программы на Python написаны так, что поддерживают запуск непосредственно из zip-архива, все равно часто код пишется в предположении, что он полностью установлен. Когда это предположение нарушается при попытке запустить программу из zip-архива, сбои часто бывают неясными и трудно диагностируемыми (особенно когда они происходят в библиотеках сторонних разработчиков). Два наиболее распространенных источника проблем с этим - тот факт, что импорт расширений C из zip-архива *не* поддерживается CPython (поскольку это не поддерживается напрямую механизмом динамической загрузки на любой платформе) и что при запуске из zip-архива атрибут ``__file__`` ссылается уже не на обычный путь к файловой системе, а на комбинированный путь, включающий как расположение zip-архива в файловой системе, так и относительный путь к модулю внутри архива. Даже если программа корректно использует абстрактные API ресурсов внутри, взаимодействие с внешними компонентами все равно может потребовать наличия реального файла на диске.
ta: இரண்டாவதாக, சில பைதான் மென்பொருள்கள் ஒரு சிப் காப்பகத்திலிருந்து நேரடியாக இயங்குவதை ஆதரிக்க எழுதப்பட்டாலும், குறியீடு முழுமையாக நிறுவப்பட்டதாகக் கருதி எழுதப்படுவது இன்னும் பொதுவானது. ஒரு சிப் காப்பகத்திலிருந்து மென்பொருளை இயக்க முயற்சிப்பதன் மூலம் அந்த அனுமானம் உடைக்கப்படும்போது, தோல்விகள் பெரும்பாலும் தெளிவற்றதாகவும், கண்டறிய கடினமாக இருக்கும் (குறிப்பாக அவை மூன்றாம் தரப்பு நூலகங்களில் நிகழும்போது). இதில் உள்ள சிக்கல்களின் இரண்டு பொதுவான ஆதாரங்கள் என்னவென்றால், ஒரு சிப் காப்பகத்திலிருந்து சி நீட்டிப்புகளை இறக்குமதி செய்வது * சிபிதானால் ஆதரிக்கப்படவில்லை (அவ்வாறு செய்வது எந்த தளத்திலும் மாறும் ஏற்றுதல் இயந்திரங்களால் நேரடியாக ஆதரிக்கப்படவில்லை என்பதால்) மற்றும் ஒரு இயங்கும் போது ZIP காப்பகம் `__ __file__`` பண்புக்கூறு இனி ஒரு சாதாரண கோப்பு முறைமை பாதையை குறிக்கவில்லை, ஆனால் கோப்பு முறைமையில் சிப் காப்பகத்தின் இருப்பிடம் மற்றும் உறவினர் இரண்டையும் உள்ளடக்கிய ஒரு சேர்க்கை பாதைக்கு காப்பகத்திற்குள் உள்ள தொகுதிக்கான பாதை. மென்பொருள் சுருக்கமான வள ஏபிஐகளை உள்நாட்டில் சரியாகப் பயன்படுத்தும்போது கூட, வெளிப்புற கூறுகளுடன் இடைமுகப்படுத்த இன்னும் உண்மையான வட்டு கோப்பின் கிடைக்கும் தன்மை தேவைப்படலாம்.

source: Like metaclasses, monkeypatching and metapath importers, if you're not already sure you need to take advantage of this feature, you almost certainly don't need it. If you *do* decide to use it anyway, be aware that many projects will require a failure to be reproduced with a fully installed package before accepting it as a genuine bug.
ja: メタクラスと同様に、モンキーパッチングとメタパスからのインポートは、この機能を使う利点をあなたが本当に必要としていると確信しているのでなければ、おそらくあなたはこの機能を使う必要がないと思われます。兎にも角にもこれを使う *意思を固めた* のであれば、 (訳注、この機能を使った時に生じた) ある動作不良を真性のバグであると認めてもらう前に、多くのプロジェクトではそれを完全インストールの状態で再現するように要求されるであろうということを認識しておいてください。
pt_br: Como metaclasses, *monkeypatching* e importadores de metacaminho, se você ainda não tem certeza de que precisa tirar proveito desse recurso, é quase certo que não precisa dele. Se você decidir usá-lo de qualquer maneira, esteja ciente de que muitos projetos exigirão que uma falha seja reproduzida com um pacote totalmente instalado antes de aceitá-lo como um bug genuíno.
ru: Как и в случае с метаклассами, monkeypatching и импортерами metapath, если вы еще не уверены, что вам нужно воспользоваться этой возможностью, она вам почти наверняка не понадобится. Если же вы *решили* воспользоваться ею, имейте в виду, что многие проекты потребуют воспроизвести сбой с полностью установленным пакетом, прежде чем принять его за настоящую ошибку.
ta: மெட்டாக்ளாச்கள், குரங்கிபாட்ச் மற்றும் மெட்டாபாத் இறக்குமதியாளர்களைப் போலவே, இந்த அம்சத்தை நீங்கள் பயன்படுத்திக் கொள்ள வேண்டும் என்று நீங்கள் ஏற்கனவே உறுதியாக தெரியவில்லை என்றால், உங்களுக்கு நிச்சயமாக இது தேவையில்லை. நீங்கள் எப்படியாவது இதைப் பயன்படுத்த முடிவு செய்தால், பல திட்டங்களுக்கு உண்மையான பிழையாக ஏற்றுக்கொள்வதற்கு முன்பு முழுமையாக நிறுவப்பட்ட தொகுப்புடன் மீண்டும் உருவாக்கத் தோல்வி தேவைப்படும் என்பதை அறிந்து கொள்ளுங்கள்.

source: History
eo: Historio
ja: 歴史
pt_br: Histórico
ru: История
ta: வரலாறு

source: February 2013: This specification was approved through :pep:`427`.
eo: Februaro 2013: Ĉi tiu specifo estis aprobita per :pep:`427`.
ja: 2013年2月: :pep:`427` を通じてこの仕様書が承認されました。
ru: Февраль 2013 г: Эта спецификация была одобрена через :pep:`427`.
ta: பிப்ரவரி 2013: இந்த விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `427`.

source: February 2021: The rules on escaping in wheel filenames were revised, to bring them into line with what popular tools actually do.
eo: Februaro 2021: La reguloj pri kodŝanĝado en wheel-dosiernomoj estis reviziitaj konforme al la fakta konduto de popularaj iloj.
ja: 2021年2月: 他の普及しているツールが実際にやるのと同じやり方に合わせて、 wheel のファイル名におけるエスケーピングの規則が修正されました。
ru: Февраль 2021 года: Правила экранирования в именах файлов wheel были пересмотрены, чтобы привести их в соответствие с тем, что на самом деле делают популярные инструменты.
ta: பிப்ரவரி 2021: சக்கர கோப்பு பெயர்களில் தப்பிப்பது தொடர்பான விதிகள் திருத்தப்பட்டன, பிரபலமான கருவிகள் உண்மையில் என்ன செய்கின்றன என்பதற்கு ஏற்ப அவற்றைக் கொண்டுவருவதற்காக.

source: December 2024: Clarified that the ``scripts`` folder should only contain regular files (the expected behaviour of consuming tools when encountering symlinks or subdirectories in this folder is not formally defined, and hence may vary between tools).
eo: Decembro 2024: Klarigis, ke la dosierujo ``scripts`` nur enhavu ordinaraj dosierojn (ne formale difiniĝas la atendata konduto de konsumanta ilo pri simbola ligilo aŭ subdosierujo en tiu dosierujo; tial kondutoj povas diferenci inter iloj).
ru: Декабрь 2024: Уточнено, что папка ``scripts`` должна содержать только обычные файлы (ожидаемое поведение инструментов потребления при встрече с симлинками или подкаталогами в этой папке формально не определено, и поэтому может отличаться для разных инструментов).
ta: டிசம்பர் 2024: `` ச்கிரிப்ட்கள்` கோப்புறையில் வழக்கமான கோப்புகள் மட்டுமே இருக்க வேண்டும் என்று தெளிவுபடுத்தியது (இந்த கோப்புறையில் சிம்லிங்க்கள் அல்லது துணை அடைவுகளை எதிர்கொள்ளும்போது கருவிகளின் எதிர்பார்க்கப்படும் நடத்தை முறையாக வரையறுக்கப்படவில்லை, எனவே கருவிகளுக்கு இடையில் வேறுபடலாம்).

source: December 2024: The :file:`.dist-info/licenses/` directory was specified through :pep:`639`.
eo: Decembro 2024: La dosierujo :file:`.dist-info/licenses/` estis specifita per :pep:`639`.
ru: Декабрь 2024 года: Каталог :file:`.dist-info/licenses/` был указан через :pep:`639`.
ta: டிசம்பர் 2024: தி: கோப்பு: `.டிச்ட்-இன்ஃபோ/உரிமங்கள்/` அடைவு மூலம் குறிப்பிடப்பட்டது: PEP: `639`.

source: January 2025: Clarified that name and version needs to be normalized for ``.dist-info`` and ``.data`` directories.
eo: Januaro 2025: Klarigis, ke nomo kaj versio devas esti normigitaj por la dosierujoj ``.dist-info`` kaj ``.data``.
ru: Январь 2025 года: Уточнено, что имя и версия должны быть нормализованы для директорий ``.dist-info`` и ``.data``.
ta: சனவரி 2025: அந்த பெயர் மற்றும் பதிப்பை தெளிவுபடுத்தியது `` .dist-info`` மற்றும் `.data`` கோப்பகங்களுக்கு இயல்பாக்கப்பட வேண்டும்.

source: Appendix
eo: Apendico
ja: 補遺
pt_br: Apêndice
ru: Приложение
ta: பின் இணைப்பு

source: Example urlsafe-base64-nopad implementation::
eo: Ekzempla realigo de urlsafe-base64-nopad::
ja: urlsafe-base64-nopad の実装の例::
pt_br: Exemplo de implementação de urlsafe-base64-nopad::
ru: Пример реализации urlsafe-base64-nopad::
ta: எடுத்துக்காட்டு urlsafe-base64-NOPAD செயல்படுத்தல் ::

source: Example
eo: Ekzemplo
ja: 例
pt_br: Exemplo
ru: Пример
ta: எடுத்துக்காட்டு

source: Specification
eo: Specifado
ja: 仕様
pt_br: Especificação
ru: Спецификация
ta: விவரக்குறிப்பு

source: Core metadata specifications
eo: Kernaj metadatenaj specifoj
ja: コアとなるメタデータの仕様
pt_br: Especificações de metadados principais
ru: Спецификации основных метаданных
ta: கோர் மேனிலை தரவு விவரக்குறிப்புகள்

source: Fields defined in the following specification should be considered valid, complete and not subject to change. The required fields are:
eo: La kampoj difinitaj en la jena specifo estu konsiderataj kiel validaj, plenaj kaj ne ŝanĝotaj. Jen la postulataj kampoj:
ja: この後の仕様の中で定義されるフィールドは、正当かつ完全であって、変更の可能性がないものと見做されるべきです。必須のフィールドは以下の通り:
pt_br: Os campos definidos nas especificações a seguir devem ser considerados válidos, completos e não sujeitos a alterações. Os campos obrigatórios são:
ru: Поля, определенные в следующей спецификации, должны считаться действительными, полными и не подлежащими изменению. К обязательным полям относятся:
ta: பின்வரும் விவரக்குறிப்பில் வரையறுக்கப்பட்ட புலங்கள் செல்லுபடியாகும், முழுமையானவை மற்றும் மாற்றத்திற்கு உட்பட்டவை என்று கருதப்பட வேண்டும். தேவையான புலங்கள்:

source: ``Name``
ru: ``Имя``
ta: `` பெயர்``

source: All the other fields are optional.
eo: Ĉiuj aliaj kampoj estas nedevigaj.
ja: これら以外のすべてのフィールドは必須のものではありません。
pt_br: Todos os outros campos são opcionais.
ru: Все остальные поля являются необязательными.
ta: மற்ற அனைத்து புலங்களும் விருப்பமானவை.

source: The standard file format for metadata (including in :doc:`wheels <binary-distribution-format>` and :doc:`installed projects <recording-installed-packages>`) is based on the format of email headers. However, email formats have been revised several times, and exactly which email RFC applies to packaging metadata is not specified. In the absence of a precise definition, the practical standard is set by what the standard library :mod:`python:email.parser` module can parse using the :data:`~.python:email.policy.compat32` policy.
ja: (:doc:`wheels <binary-distribution-format>` および :doc:`インストール済みのプロジェクト <recording-installed-packages>` の両文書に含まれる) メタデータのための標準的なファイルフォーマットは、電子メールのヘッダーのフォーマットに基いています。しかしながら、電子メールのフォーマットは何度か修正が入っていますが、正確にはどの電子メールの RFC がパッケージングのメタデータに適用されるのかについては指定がありません。精密な定義が欠落しているので、標準ライブラリの :mod:`python:email.parser` モジュールが :data:`~.python:email.policy.compat32` のポリシーを用いて読み込むことができるものを実務上の標準として設定しています。
pt_br: O formato de arquivo padrão para metadados (incluindo em :doc:`wheels <binary-distribution-format>` e :doc:`projetos instalados <recording-installed-packages>`) é baseado no formato de cabeçalhos de e-mail. No entanto, os formatos de e-mail foram revisados várias vezes e não é especificado exatamente qual RFC de e-mail se aplica aos metadados do pacote. Na ausência de uma definição precisa, o padrão prático é definido pelo que o módulo da biblioteca padrão :mod:`python:email.parser` pode analisar usando a política :data:`~.python:email.policy.compat32`.
ru: Стандартный формат файлов для метаданных (в том числе в :doc:`wheels <binary-distribution-format>` и :doc:`installed projects <recording-installed-packages>`) основан на формате заголовков электронной почты. Однако форматы электронной почты неоднократно пересматривались, и какой именно почтовый RFC применяется к метаданным упаковки, не уточняется. В отсутствие точного определения практический стандарт устанавливается тем, что может разобрать модуль стандартной библиотеки :mod:`python:email.parser`, используя политику :data:`~.python:email.policy.compat32`.
ta: மெட்டாடேட்டாவிற்கான நிலையான கோப்பு வடிவம் (உள்ளிட்டவை: டாக்: `சக்கரங்கள் <பைனரி-விநியோக வடிவங்கள்>` மற்றும்: டாக்: `நிறுவப்பட்ட திட்டங்கள் <பதிவு-நிறுவப்பட்ட-பேக்கேச்கள்>`) மின்னஞ்சல் தலைப்புகளின் வடிவமைப்பை அடிப்படையாகக் கொண்டது. இருப்பினும், மின்னஞ்சல் வடிவங்கள் பல முறை திருத்தப்பட்டுள்ளன, மேலும் பேக்கேசிங் மெட்டாடேட்டாவுக்கு எந்த மின்னஞ்சல் RFC பொருந்தாது என்பது குறிப்பிடப்படவில்லை. ஒரு துல்லியமான வரையறை இல்லாத நிலையில், நிலையான நூலகம்: மோட்: `பைதான்: மின்னஞ்சல்.பார்சர்` தொகுதி: தரவு:` ~ .பிதான்: மின்னஞ்சல்.

source: Whenever metadata is serialised to a byte stream (for example, to save to a file), strings must be serialised using the UTF-8 encoding.
eo: Se metadatenoj seriiĝas al bajta fluo (ekzemple, por konservado sur dosieron), signoĉenoj devas esti koditaj laŭ UTF-8.
ja: メタデータをバイト列 (例えばファイルに保存するために) にシリアル化する際にはいつでも、文字列を UTF-8 エンコーディングを用いてシリアル化しなければなりません。
pt_br: Sempre que os metadados são serializados para um fluxo de bytes (por exemplo, para salvar em um arquivo), as strings devem ser serializadas usando a codificação UTF-8.
ru: При сериализации метаданных в поток байтов (например, для сохранения в файл) строки должны быть сериализованы с использованием кодировки UTF-8.
ta: மேனிலை தரவு ஒரு பைட் ச்ட்ரீமுக்கு சீரியலை செய்யும்போதெல்லாம் (எடுத்துக்காட்டாக, ஒரு கோப்பில் சேமிக்க), யுடிஎஃப் -8 குறியாக்கத்தைப் பயன்படுத்தி சரங்களை வரிசைப்படுத்த வேண்டும்.

source: Although :pep:`566` defined a way to transform metadata into a JSON-compatible dictionary, this is not yet used as a standard interchange format. The need for tools to work with years worth of existing packages makes it difficult to shift to a new format.
eo: Kvankam :pep:`566` difinis manieron transformi metadatenojn en JSON-kongruan vortaron, ĝi ankoraŭ ne estas uzata kiel norma interŝanĝa dosierformo. Por iloj, la bezono kunfunkcii kun jaroj da ekzistantaj pakoj malfaciligas adoptadon de nova dosierformo.
ja: :pep:`566` でメタデータを JSON 互換の辞書型に変換する一つの方法を定義していますが、標準の交換フォーマットとしてはまだ使われていません。既に何年間も使われてきた既存のパッケージと共に動作するツールが必要なので、新しいフォーマットに移行することは困難なのです。
pt_br: Embora a :pep:`566` tenha definido uma maneira de transformar metadados em um dicionário compatível com JSON, isso ainda não é usado como um formato de intercâmbio padrão. A necessidade de ferramentas para trabalhar com anos de pacotes existentes torna difícil mudar para um novo formato.
ru: Хотя в :pep:`566` определен способ преобразования метаданных в JSON-совместимый словарь, он пока не используется в качестве стандартного формата обмена. Необходимость работы инструментов с многолетними существующими пакетами затрудняет переход на новый формат.
ta: இருப்பினும்: PEP: `566` மெட்டாடேட்டாவை JSON- இணக்கமான அகராதியாக மாற்றுவதற்கான வழியை வரையறுத்தது, இது இன்னும் ஒரு நிலையான பரிமாற்ற வடிவமாக பயன்படுத்தப்படவில்லை. பல ஆண்டுகளாக மதிப்புள்ள தொகுப்புகளுடன் பணிபுரிய கருவிகளின் தேவை ஒரு புதிய வடிவத்திற்கு மாற்றுவது கடினம்.

source: *Interpreting old metadata:* In :pep:`566`, the version specifier field format specification was relaxed to accept the syntax used by popular publishing tools (namely to remove the requirement that version specifiers must be surrounded by parentheses). Metadata consumers may want to use the more relaxed formatting rules even for metadata files that are nominally less than version 2.1.
ja: *古い形式のメタデータを翻訳する:* :pep:`566` では、バージョン指定子フィールドのフォーマット仕様がよく用いられている公開ツール群で使われる構文を受け入れる (正確にはバージョン指定子が丸括弧で囲まれていなければならないという要求事項を削除することによって) ようにと緩められました。メタデータを使う側としては、メタデータファイルが名ばかりのものとなっている 2.1 よりも前のバージョンであってさえも、もっと寛容なフォーマット規則を使いたいかもしれません。
pt_br: *Interpretando metadados antigos:* Na :pep:`566`, a especificação do formato do campo do especificador de versão foi relaxada para aceitar a sintaxe usada por ferramentas de publicação populares (nomeadamente para remover o requisito de que os especificadores de versão devem estar entre parênteses). Os consumidores de metadados podem querer usar regras de formatação mais relaxadas, mesmo para arquivos de metadados que são nominalmente inferiores à versão 2.1.
ru: *Интерпретация старых метаданных:* В :pep:`566` спецификация формата поля спецификатора версии была смягчена, чтобы принять синтаксис, используемый популярными издательскими инструментами (а именно, убрать требование, что спецификаторы версии должны быть окружены круглыми скобками). Потребители метаданных могут захотеть использовать более мягкие правила форматирования даже для файлов метаданных, которые номинально меньше версии 2.1.
ta: * பழைய மெட்டாடேட்டாவை விளக்குதல்:* இல்: PEP: `566`, பிரபலமான வெளியீட்டு கருவிகளால் பயன்படுத்தப்படும் தொடரியல் ஏற்றுக்கொள்ள பதிப்பு விவரக்குறிப்பு புலம் வடிவமைப்பு விவரக்குறிப்பு தளர்த்தப்பட்டது (அதாவது பதிப்பு விவரக்குறிப்புகள் அடைப்புக்குறிகளால் சூழப்பட வேண்டும் என்ற தேவையை அகற்ற). மேனிலை தரவு நுகர்வோர் பதிப்பு 2.1 ஐ விட பெயரளவில் குறைவாக இருக்கும் மேனிலை தரவு கோப்புகளுக்கு கூட மிகவும் தளர்வான வடிவமைப்பு விதிகளைப் பயன்படுத்த விரும்பலாம்.

source: Metadata-Version
ta: மெட்டாடேட்டா-பதிப்பு

source: Version of the file format; legal values are "1.0", "1.1", "1.2", "2.1", "2.2", "2.3", and "2.4".
eo: Versio de la dosierformo; la validaj valoroj estas «1.0», «1.1», «1.2», «2.1», «2.2», «2.3», kaj «2.4».
ta: கோப்பு வடிவத்தின் பதிப்பு; சட்ட மதிப்புகள் "1.0", "1.1", "1.2", "2.1", "2.2", "2.3" மற்றும் "2.4".

source: Automated tools consuming metadata SHOULD warn if ``metadata_version`` is greater than the highest version they support, and MUST fail if ``metadata_version`` has a greater major version than the highest version they support (as described in the :ref:`Version specifier specification <version-specifiers>`, the major version is the value before the first dot).
ja: メタデータを処理する自動化ツールは、 ``metadata_version`` が自身のサポートする最大のものより大きい場合には警告を行うべきであり、かつ、 ``metadata_version`` が自身のサポートする最大のメジャーバージョンより大きいメジャーバージョンを持つ場合には異常終了しなければなりません (:ref:`バージョン指定子 <Version specifier>` に記述されている通り、メジャーバージョンとはバージョンのうち最初のドットよりも前の部分です) 。
pt_br: Ferramentas automatizadas que consomem metadados DEVEM avisar se ``metadata_version`` é maior que a versão mais alta à qual oferecem suporte, e DEVEM falhar se ``metadata_version`` tem uma versão maior do que a versão mais alta à qual oferecem suporte (como descrito na :ref:`especificação de especificadores de versão <version-specifiers>`, a versão principal é o valor antes do primeiro ponto).
ru: Автоматизированные инструменты, потребляющие метаданные, ДОЛЖНЫ предупреждать, если ``metadata_version`` больше, чем самая высокая поддерживаемая ими версия, и ДОЛЖНЫ отказать, если ``metadata_version`` имеет большую основную версию, чем самая высокая поддерживаемая ими версия (как описано в :ref:`Спецификация спецификатора версии <version-specifiers>`, основная версия - это значение перед первой точкой).
ta: மெட்டாடேட்டாவை உட்கொள்ளும் தானியங்கி கருவிகள் `` மெட்டாடேட்டா_்வெர்சன்`` அவர்கள் ஆதரிக்கும் மிக உயர்ந்த பதிப்பை விட அதிகமாக இருந்தால் எச்சரிக்க வேண்டும், மேலும் அவர்கள் ஆதரிக்கும் மிக உயர்ந்த பதிப்பைக் காட்டிலும் அதிக பெரிய பதிப்பைக் கொண்டிருந்தால் `` மெட்டாடேட்டா_்வெர்சன்` என்றால் தோல்வியடைய வேண்டும் (இதில் விவரிக்கப்பட்டுள்ளபடி: ` பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்> `, முக்கிய பதிப்பு முதல் புள்ளிக்கு முந்தைய மதிப்பு).

source: For broader compatibility, build tools MAY choose to produce distribution metadata using the lowest metadata version that includes all of the needed fields.
eo: Por pli larĝa kongrueco, konstruilo POVAS generi distribuajn metadatenojn uzante la plej malnovan metadatenan version inkluzivantan ĉiujn necesajn kampojn.
ja: より広く互換性を保つために、ビルドツールは、必要なフィールドをすべて含む前提で最も古いバージョンのメタデータ仕様を使って配布物のメタデータを生成するという選択を行なっても構いません。
pt_br: Para uma compatibilidade mais ampla, as ferramentas de construção PODEM escolher produzir metadados de distribuição usando a versão de metadados mais baixa que inclui todos os campos necessários.
ru: Для более широкой совместимости инструменты сборки MAY выбирают для создания метаданных дистрибутива самую низкую версию метаданных, которая включает все необходимые поля.
ta: பரந்த பொருந்தக்கூடிய தன்மைக்கு, தேவையான அனைத்து புலங்களையும் உள்ளடக்கிய மிகக் குறைந்த மேனிலை தரவு பதிப்பைப் பயன்படுத்தி விநியோக மெட்டாடேட்டாவை உருவாக்க பில்ட் கருவிகள் தேர்வு செய்யலாம்.

source: Example::
eo: Ekzemple::
ja: 例::
pt_br: Exemplo::
ru: Пример::
ta: எடுத்துக்காட்டு ::

source: Added restrictions on format from the :ref:`name format <name-format>`.
eo: Aldonis restriktojn pri formo el la :ref:`noma formo <name-format>`.
ja: :ref:`名称のフォーマット <name-format>` から採用したフォーマットに対する制限を追加した。
ru: Добавлены ограничения на формат из :ref:`формат имени <имя-формат>`.
ta: வடிவமைப்பில் கட்டுப்பாடுகள் சேர்க்கப்பட்டன: ref: `பெயர் வடிவம் <பெயர்-வடிவ>`.

source: The name of the distribution. The name field is the primary identifier for a distribution. It must conform to the :ref:`name format specification <name-format>`.
eo: La nomo de la distribuo. La kampo ``name`` estas la ĉefa identigilo de distribuo. Ĝi devas observi la :ref:`specifon pri nomformoj <name-format>`.
ja: 配布物の名称。name フィールドは配布物の最も基本的な識別子です。 :ref:`名称フォーマット仕様 <name-format>` を満たしていなければなりません。
ru: Имя дистрибутива. Поле имени является основным идентификатором дистрибутива. Оно должно соответствовать спецификации :ref:`формата имени <name-format>`.
ta: விநியோகத்தின் பெயர். பெயர் புலம் ஒரு விநியோகத்திற்கான முதன்மை அடையாளங்காட்டியாகும். இது: ref: `பெயர் வடிவமைப்பு விவரக்குறிப்பு <பெயர்-வடிவ>` க்கு இணங்க வேண்டும்.
