Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: An increasing number of operating systems -- including Linux, Mac OS, and Windows -- can be set up to run applications packaged as lightweight images, using a relatively modern arrangement often referred to as `operating-system-level virtualization <https://en.wikipedia.org/wiki/Operating-system-level_virtualization>`_, or *containerization*.
eo: Multaj mastrumaj sistemoj – inkluzive de Linux, macOS kaj Windows – povas ruli programon pakitan kiel leĝeran diskokopion, uzante la relative modernan manieron de `mastrumasistemo-nivela virgualigo <https://en.wikipedia.org/wiki/OS-level_virtualization>`_, aŭ *ujigo*.
ja: オペレーティングシステム -- Linux や Mac OS や Windows を含む -- で、しばしば `オペレーティングシステムレベルの仮想化 <https://en.wikipedia.org/wiki/Operating-system-level_virtualization>`_ もしくは *コンテナ化* として参照される相対的に新しい手法を用いた、軽量のイメージとしてパッケージされたアプリケーションを走らせるように設定することができるものが数を増しています。
pt_br: Um número crescente de sistemas operacionais -- incluindo Linux, Mac OS e Windows -- pode ser configurado para executar aplicações empacotadas como imagens leves, usando um arranjo relativamente moderno, frequentemente referido como `virtualização em nível de sistema operacional <https://en.wikipedia.org/wiki/Operating-system-level_virtualization>`_ ou *conteinerização*.
ru: Все больше операционных систем, включая Linux, Mac OS и Windows, могут быть настроены на запуск приложений, упакованных в легкие образы, с помощью относительно современной схемы, часто называемой `виртуализацией на уровне операционной системы` <https://en.wikipedia.org/wiki/Operating-system-level_virtualization>`_, или *контейнеризацией*.
ta: லினக்ச், மேக் ஓஎச் மற்றும் சாளரங்கள் உள்ளிட்ட இயக்க முறைமைகளின் எண்ணிக்கை அதிகரித்து வருகிறது-இலகுரக படங்களாக தொகுக்கப்பட்ட பயன்பாடுகளை இயக்க அமைக்கலாம், ஒப்பீட்டளவில் நவீன ஏற்பாட்டைப் பயன்படுத்தி பெரும்பாலும் `இயக்க-அமைப்பு-நிலை மெய்நிகராக்கம் <https:/ .

source: These techniques are mostly Python agnostic, because they package whole OS filesystems, not just Python or Python packages.
eo: Tiaj teĥnikoj estas plejparte sendependaj de Python, ĉar ili pakas tutajn mastrumsistemajn dosiersistemojn, ne sole Python aŭ Python-pakojn.
ja: このような手法は Python 単体もしくは Python パッケージではなく OS のファイルシステム全体をパッケージ化するので、ほとんどの場合には Python を直接にサポートしているわけではありません。
pt_br: Essas técnicas são principalmente Python agnósticas, porque empacotam sistemas de arquivos inteiros de sistemas operacionais, não apenas Python ou pacotes Python.
ru: Эти методы в основном не зависят от Python, поскольку они упаковывают целые файловые системы ОС, а не только Python или пакеты Python.
ta: இந்த நுட்பங்கள் பெரும்பாலும் பைதான் அஞ்ஞானவாதிகள், ஏனென்றால் அவை பைதான் அல்லது பைதான் தொகுப்புகளை மட்டுமல்ல, முழு ஓஎச் கோப்பு முறைமைகளையும் தொகுக்கின்றன.

source: Adoption is most extensive among Linux servers, where the technology originated and where the technologies below work best:
eo: Tio estas plej ofta por Linux-servilo, por kiu tiaj teĥnikoj estis inventitaj kaj por kiu tiaj teĥnikoj funkcias plej bone:
ja: (訳注、このような技術の) 取り入れが最も広範囲に渡るのは、この技術の発祥の地であり下に述べる技術が最もうまく動作する Linux サーバです:
pt_br: A adoção é mais extensa entre os servidores Linux, onde a tecnologia se originou e onde as tecnologias abaixo funcionam melhor:
ru: Наиболее широкое распространение эта технология получила на серверах под управлением Linux, где она зародилась и где представленные ниже технологии работают лучше всего:
ta: லினக்ச் சேவையகங்களில் தத்தெடுப்பு மிகவும் விரிவானது, தொழில்நுட்பம் தோன்றிய இடத்திலும், கீழே உள்ள தொழில்நுட்பங்கள் சிறப்பாக செயல்படுகின்றன:

source: `AppImage <https://appimage.org/>`_
ta: `அபிமேச் <https://appimage.org/>` _

source: `Docker <https://www.fullstackpython.com/docker.html>`_
ta: `டோக்கர் <https://www.fullstackpython.com/docker.html>` _

source: `Flatpak <https://flatpak.org/>`_
ta: `Flatpak <htps: //flatpak.org/> _

source: `Snapcraft <https://snapcraft.io/>`_
ta: `Snapcract <https://snapcract.io/>` _

source: Bringing your own kernel
eo: Alporti vian propran kernon
ja: 自分自身のカーネルを持ち込む
pt_br: Trazendo seu próprio kernel
ru: Поставка собственного ядра
ta: உங்கள் சொந்த கர்னலைக் கொண்டுவருகிறது

source: These techniques are mostly reserved for larger scale deployments in data centers, though certain complex applications can benefit from this packaging. The technologies are Python agnostic, and include:
eo: Tiuj teĥnikoj estas plejparte por grandskalaj disponigoj en datencentroj, kvankam iuj kompleksaj programoj povas profiti el tia pakado. La teĥnikoj ne dependas de Python kaj inkluzivas la jenon:
ja: 複雑なアプリケーションの中にはこのパッケージング方法から利益を得るものもありますが、このような手法はたいていの場合はデータセンタにおけるかなり大規模な配置のために使用します。技術としては Python を直接サポートしているわけではなく、次のものを含みます:
pt_br: Essas técnicas são reservadas principalmente para implantações em grande escala em datacenters, embora algumas aplicativas complexas possam se beneficiar desse pacote. As tecnologias são agnósticas ao Python e incluem:
ru: Эти технологии в основном предназначены для крупномасштабных развертываний в центрах обработки данных, хотя некоторые сложные приложения могут извлечь выгоду из такой упаковки. Технологии не зависят от Python и включают в себя:
ta: இந்த நுட்பங்கள் பெரும்பாலும் தரவு மையங்களில் பெரிய அளவிலான வரிசைப்படுத்தலுக்காக ஒதுக்கப்பட்டுள்ளன, இருப்பினும் சில சிக்கலான பயன்பாடுகள் இந்த பேக்கேசிங்கிலிருந்து பயனடையக்கூடும். தொழில்நுட்பங்கள் பைதான் அஞ்ஞானவாதிகள், மேலும் பின்வருவன அடங்கும்:

source: `VHD <https://en.wikipedia.org/wiki/VHD_(file_format)>`_, `AMI <https://en.wikipedia.org/wiki/Amazon_Machine_Image>`_, and :doc:`other formats <openstack:user/formats>`
eo: `VHD <https://en.wikipedia.org/wiki/VHD_(file_format)>`_, `AMI <https://en.wikipedia.org/wiki/Amazon_Machine_Image>`_, kaj :doc:`aliaj dosierformoj <openstack:user/formats>`
ja: `VHD <https://en.wikipedia.org/wiki/VHD_(file_format)>`_ や `AMI <https://en.wikipedia.org/wiki/Amazon_Machine_Image>`_ や :doc:`他のフォーマット <openstack:user/formats>`
pt_br: `VHD <https://en.wikipedia.org/wiki/VHD_(file_format)>`_, `AMI <https://en.wikipedia.org/wiki/Amazon_Machine_Image>`_ e :doc:`outros formatos <openstack:user/formats>`
ru: `VHD <https://en.wikipedia.org/wiki/VHD_(file_format)>`_, `AMI <https://en.wikipedia.org/wiki/Amazon_Machine_Image>`_, и :doc:`другие форматы <openstack:user/formats>`
ta: `VHD <https://en.wikipedia.org/wiki/VHD_(file_format)>`_, `AMI <https://en.wikipedia.org/wiki/Amazon_Machine_Image>`_, and :doc:`other formats <ஓபன்ச்டாக்: பயனர்/வடிவங்கள்> `

source: Bringing your own hardware
eo: Alporti vian propran aparaton
ja: 自分自身のハードウェアを持ち込む
pt_br: Trazendo seu próprio hardware
ru: Поставка собственного оборудования
ta: உங்கள் சொந்த வன்பொருளைக் கொண்டு வருகிறது

source: The most all-encompassing way to ship your software would be to ship it already-installed on some hardware. This way, your software's user would require only electricity.
eo: La plej totala maniero disponigi vian programon estas sendi ĝin jam instalita sur iu aparato. Tiel, la uzanto de via programo postulas nur elektron.
ja: 最もすべてを包含した方法は、あなたのソフトウェアを何らかのハードウェア上にインストールして出荷することです。この方法では、あなたのソフトウェアのユーザは電力供給しか要求されません。
pt_br: A maneira mais abrangente de enviar seu software seria enviá-lo já instalado em algum hardware. Dessa forma, o usuário do seu software precisaria apenas de eletricidade.
ru: Самым универсальным способом доставки программного обеспечения является его установка на какое-либо оборудование. Таким образом, пользователю вашей программы потребуется только электричество.
ta: உங்கள் மென்பொருளை அனுப்புவதற்கான அனைத்தையும் உள்ளடக்கிய வழி, ஏற்கனவே நிறுவப்பட்ட சில வன்பொருள்களில் அனுப்பப்படுவதாகும். இந்த வழியில், உங்கள் மென்பொருளின் பயனருக்கு மின்சாரம் மட்டுமே தேவைப்படும்.

source: Whereas the virtual machines described above are primarily reserved for the tech-savvy, you can find hardware appliances being used by everyone from the most advanced data centers to the youngest children.
eo: Dum la ĉi-supraj virtualaj maŝinoj estas ĉefe uzataj de fakuloj, aparatoj estas uzataj de ĉiuj, de la plej komplikaj datencentroj ĝis la plej junaj infanoj.
ja: 上で述べた仮想マシンがもっぱら技術に明るい人向けであるのに対し、ハードウェアによるアプライアンス機器は最先端のデータセンタから最も若い子供たちまでの誰にでも使えます。
pt_br: Considerando que as máquinas virtuais descritas acima são reservadas principalmente para os conhecedores de tecnologia, você pode encontrar dispositivos de hardware sendo usados por todos, desde os datacenters mais avançados até as crianças mais novas.
ru: В то время как виртуальные машины, описанные выше, предназначены в основном для технически подкованных людей, аппаратные устройства могут использоваться всеми - от самых продвинутых центров обработки данных до самых маленьких детей.
ta: மேலே விவரிக்கப்பட்ட மெய்நிகர் இயந்திரங்கள் முதன்மையாக தொழில்நுட்ப ஆர்வலருக்காக ஒதுக்கப்பட்டிருந்தாலும், மிகவும் மேம்பட்ட தரவு மையங்கள் முதல் இளைய குழந்தைகள் வரை அனைவராலும் பயன்படுத்தப்படுவதை நீங்கள் காணலாம்.

source: Embed your code on an :gh:`Adafruit <adafruit/circuitpython>`, `MicroPython <https://micropython.org/>`_, or more-powerful hardware running Python, then ship it to the datacenter or your users' homes. They plug and play, and you can call it a day.
eo: Metu vian kodon sur :gh:`Adafruit <adafruit/circuitpython>`, `MicroPython <https://micropython.org/>`_, aŭ pli potencan aparaton kapablan ruli Python, kaj sendu ĝin al la datencentro aŭ la hejmo de viaj uzantoj. Ili povos ekuzi, kaj vi povos ekmalstreĉi.
ja: :gh:`Adafruit <adafruit/circuitpython>` や `MicroPython <https://micropython.org/>`_ 、あるいは、もっとパワーのあるハードウェアで Python が動作するものにあなたのプログラムを組み込んで、データセンタやあなたのユーザの家に出荷しましょう。彼らはプラグアンドプレイで使うし、あなたはその日の仕事を終わりにできるでしょう。
pt_br: Incorpore seu código em um :gh:`Adafruit <adafruit/circuitpython>`, `MicroPython <https://micropython.org/>`_ ou hardware mais poderoso executando Python e, em seguida, envie-o para o datacenter ou para as casas de seus usuários. Eles conectam e estará funcionando, e você pode encerrar o dia.
ru: Вставьте свой код в :gh:`Adafruit <adafruit/circuitpython>`, `MicroPython <https://micropython.org/>`_ или более мощное оборудование под управлением Python, затем отправьте его в центр обработки данных или домой к вашим пользователям. Они подключаются и играют, и можно считать, что все готово.
ta: உங்கள் குறியீட்டை AN: GH: `adafruit <adafrut/circuspython>`, `மைக்ரோபிதான் <https://micropython.org/>` _, அல்லது பைத்தானில் இயங்கும் அதிக சக்திவாய்ந்த வன்பொருள் ' வீடுகள். அவை செருகப்பட்டு விளையாடுகின்றன, நீங்கள் அதை ஒரு நாளைக்கு அழைக்கலாம்.

source: A summary of technologies used to package Python applications.
eo: Resumo pri teĥnikoj por paki Python-programojn.
ja: Python アプリケーションをパッケージするのに使われる技術の概要。
pt_br: Um resumo de tecnologias usadas para empacotar aplicações Python.
ru: Краткое описание технологий, используемых для упаковки приложений Python.
ta: பைதான் பயன்பாடுகளை தொகுக்கப் பயன்படுத்தப்படும் தொழில்நுட்பங்களின் சுருக்கம்.

source: The simplified gamut of technologies used to package Python applications.
eo: La simpligita gamo de teĥnikoj uzataj por paki Python-programojn.
ja: Python アプリケーションをパッケージするのに使われる技術の単純化された全体像。
pt_br: A gama simplificada de tecnologias usadas para empacotar aplicações Python.
ru: Упрощенный набор технологий, используемых для упаковки приложений на Python.
ta: பைதான் பயன்பாடுகளை தொகுக்கப் பயன்படுத்தப்படும் தொழில்நுட்பங்களின் எளிமைப்படுத்தப்பட்ட வரம்பு.

source: What about...
eo: Kio pri…
ja: これは何...
pt_br: E quanto a...
ru: Как насчёт...
ta: என்ன ...

source: The sections above can only summarize so much, and you might be wondering about some of the more conspicuous gaps.
eo: La ĉi-supraj paragrafoj nur priskribas tiom, kiom eblas. Vi eble demandos pri mankantaj temoj.
ja: 上記の節ではかなり要約して書いているので、飛躍している点が目につくかもしれません。
pt_br: As seções acima resumem muito, e você pode estar se perguntando sobre algumas das lacunas mais evidentes.
ru: Приведенные выше разделы могут лишь подытожить многое, и вам, возможно, будет интересно узнать о некоторых наиболее заметных пробелах.
ta: மேலே உள்ள பிரிவுகள் இவ்வளவு சுருக்கமாகக் கூற முடியும், மேலும் சில தெளிவான இடைவெளிகளைப் பற்றி நீங்கள் யோசித்துக்கொண்டிருக்கலாம்.

source: Operating system packages
eo: Mastrumasistemaj pakoj
ja: オペレーティングシステムレベルのパッケージ
pt_br: Pacotes de sistema operacional
ru: Пакетов операционной системы
ta: இயக்க முறைமை தொகுப்புகள்

source: As mentioned in :ref:`depending-on-a-separate-ecosystem` above, some operating systems have package managers of their own. If you're very sure of the operating system you're targeting, you can depend directly on a format like `deb <https://en.wikipedia.org/wiki/Deb_(file_format)>`_ (for Debian, Ubuntu, etc.) or `RPM <https://en.wikipedia.org/wiki/RPM_Package_Manager>`_ (for Red Hat, Fedora, etc.), and use that built-in package manager to take care of installation, and even deployment. You can even use `FPM <https://fpm.readthedocs.io/en/latest/cli-reference.html#virtualenv>`_ to generate both deb and RPMs from the same source.
eo: Laŭ la ĉi-supra paragrafo :ref:`depending-on-a-separate-ecosystem`, kelkaj mastrumaj sistemoj havas siajn proprajn pakadministrilojn. Se oni certegas pri la celata mastruma sistemo, oni povas dependi rekte de formo kiel `deb <https://en.wikipedia.org/wiki/Deb_(file_format)>`_ (por Debian, Ubuntu ktp.) aŭ `RPM <https://en.wikipedia.org/wiki/RPM_Package_Manager>`_ (por Red Hat, Fedora ktp.), kaj uzi tiun indiĝenan pakadministrilon por instalado kaj eĉ disponigo. Oni povas eĉ uzi `FPM <https://fpm.readthedocs.io/en/latest/cli-reference.html#virtualenv>`_ por generi kaj deb kaj RPM el la sama fonto.
ja: 上記の :ref:`depending-on-a-separate-ecosystem` で言及したように、オペレーティングシステムの中には独自のパッケージ管理機構を備えているものがあります。あなたがターゲットにするオペレーティングシステムが非常にはっきりわかっているなら、 `deb <https://en.wikipedia.org/wiki/Deb_(file_format)>`_ (Debian や Ubuntu その他向け。) か、 `RPM <https://en.wikipedia.org/wiki/RPM_Package_Manager>`_ (Red Hat や Fedora その他向け。) のようなフォーマットを直接利用して、インストールや配置さえもその面倒を見るのに組み込みのパッケージ管理機構を活用することができます。 `FPM <https://fpm.readthedocs.io/en/latest/cli-reference.html#virtualenv>`_ を使えば、同じソースコードから deb と RPM の両方を生成することさえ可能です。
pt_br: Como mencionado em :ref:`depending-on-a-separate-ecosystem` acima, alguns sistemas operacionais possuem gerenciadores de pacotes próprios. Se você tiver certeza do sistema operacional que está almejando, pode depender diretamente de um formato como `deb <https://en.wikipedia.org/wiki/Deb_(file_format)>`_ (para Debian, Ubuntu , etc.) ou `RPM <https://en.wikipedia.org/wiki/RPM_Package_Manager>`_ (para Red Hat, Fedora, etc.) e usar esse gerenciador de pacotes embutido para cuidar da instalação, e mesmo implantação. Você pode até usar `FPM <https://fpm.readthedocs.io/en/latest/cli-reference.html#virtualenv>`_ para gerar deb e RPMs da mesma fonte.
ru: Как упоминалось выше в :ref:`зависимость от отдельной экосистемы`, некоторые операционные системы имеют собственные менеджеры пакетов. Если вы очень уверены в операционной системе, на которую ориентируетесь, вы можете напрямую зависеть от такого формата, как `deb <https://en.wikipedia.org/wiki/Deb_(file_format)>`_ (для Debian, Ubuntu и т.д.) или `RPM <https://en.wikipedia.org/wiki/RPM_Package_Manager>`_ (для Red Hat, Fedora и т.д.), и использовать этот встроенный менеджер пакетов для установки и даже развертывания. Вы даже можете использовать `FPM <https://fpm.readthedocs.io/en/latest/cli-reference.html#virtualenv>`_ для генерации deb и RPM из одного источника.
ta: குறிப்பிட்டுள்ளபடி: ref: `மேலே-பிரிக்கப்படாத-சுற்றுச்சூழல் அமைப்பைப் பொறுத்து, சில இயக்க முறைமைகள் தங்கள் சொந்த தொகுப்பு மேலாளர்களைக் கொண்டுள்ளன. நீங்கள் குறிவைக்கும் இயக்க முறைமையைப் பற்றி நீங்கள் மிகவும் உறுதியாக இருந்தால், `டெப் <https://en.wikipedia.org/wiki/deb_ (file_format)>` _ (டெபியனைப் பொறுத்தவரை, உபுண்டு , முதலியன) அல்லது `ஆர்.பி.எம் <https://en.wikipedia.org/wiki/rpm_package_manager> `_ (Red Hat, Fedora போன்றவற்றுக்கு), மற்றும் அந்த உள்ளமைக்கப்பட்ட தொகுப்பு மேலாளரை நிறுவலை கவனித்துக்கொள்வதற்கும், வரிசைப்படுத்துவதையும் பயன்படுத்தவும். ஒரே மூலத்திலிருந்து DEB மற்றும் RPMS இரண்டையும் உருவாக்க `FPM <https://fpm.

source: In most deployment pipelines, the OS package manager is just one piece of the puzzle.
eo: En multaj disponigaj ĉenstabloj, la mastrumsistema pakadministrilo estas nur unu ero en la puzlo.
ja: ほとんどの配置パイプラインでは、 OS パッケージ管理機構は全体から見ればほんの一部です。
pt_br: Na maioria das pipelines de implantação, o gerenciador de pacotes do sistema operacional é apenas uma peça do quebra-cabeça.
ru: В большинстве pipконвейеров развертывания менеджер пакетов ОС является лишь одним из элементов головоломки.
ta: பெரும்பாலான வரிசைப்படுத்தல் குழாய்களில், OS தொகுப்பு மேலாளர் புதிரின் ஒரு பகுதி மட்டுமே.

source: :doc:`Virtualenvs <python-guide:dev/virtualenvs>` have been an indispensable tool for multiple generations of Python developer, but are slowly fading from view, as they are being wrapped by higher-level tools. With packaging in particular, virtualenvs are used as a primitive in :doc:`the dh-virtualenv tool <dh-virtualenv:tutorial>` and `osnap <https://github.com/jamesabel/osnap>`_, both of which wrap virtualenvs in a self-contained way.
ja: :doc:`Virtualenvs <python-guide:dev/virtualenvs>` は、複数世代の Python 向けに開発をする者にとっては以前から避けられないツールであり続けてきたが、高レベルのツール群がラップするようになったので徐々に見えなくなりつつあります。特にパッケージングの観点では、共に virtualenvs を内包する形でラップしている :doc:`the dh-virtualenv tool <dh-virtualenv:tutorial>` や `osnap <https://github.com/jamesabel/osnap>`_ では virtualenvs はプリミティブとして使われています。
pt_br: :doc:`Virtualenvs <python-guide:dev/virtualenvs>` têm sido uma ferramenta indispensável para várias gerações de desenvolvedores Python, mas estão desaparecendo lentamente de vista, à medida que estão sendo envoltos por ferramentas de nível superior. Com o empacotamento em particular, virtualenvs são usados como primitivos na :doc:`ferramenta dh-virtualenv <dh-virtualenv:tutorial>` e `osnap <https://github.com/jamesabel/osnap>`_, ambos envolvem virtualenvs de uma forma independente.
ru: :doc:`Virtualenvs <python-guide:dev/virtualenvs>` были незаменимым инструментом для многих поколений разработчиков Python, но постепенно исчезают из поля зрения, поскольку их обволакивают инструменты более высокого уровня. В частности, при упаковке virtualenvs используются в качестве примитива в :doc:`инструменте dh-virtualenv <dh-virtualenv:tutorial>` и `osnap <https://github.com/jamesabel/osnap>`_, оба из которых оборачивают virtualenvs в самодостаточный способ.
ta: . குறிப்பாக பேக்கேசிங் மூலம், மெய்நிகர்இன்வி கள் ஒரு பழமையானதாகப் பயன்படுத்தப்படுகின்றன: டாக்: `டிஎச்ச்டுவல்என்வ் கருவி <dh-virtualenv: டுடோரியல்>` மற்றும் `osnap <https://github.com/jateubel/osnap>` _, இரண்டும் இது மெய்நிகர்என்வ்சை ஒரு தன்னிறைவான முறையில் போர்த்தி விடுகிறது.

source: For production deployments, do not rely on running ``python -m pip install`` from the Internet into a virtualenv, as one might do in a development environment. The overview above is full of much better solutions.
eo: Por grava disponigo, ne dependu de rulado de ``python - m pip install`` de la Interreto al virtuala medio, simile al evoluada medio. La ĉi-supra superrigardo priskribas multe pli bonajn solvojn.
ja: 開発環境ではありがちですが、商用環境への配置ではインターネットから virtualenv への ``python -m pip install`` を走らせることに信用をおいてはなりません。上に述べた概要には、より良い解決策がたくさんあります。
pt_br: Para implantações de produção, não dependa da execução de ``python -m pip install`` da Internet em um virtualenv, como alguém pode fazer em um ambiente de desenvolvimento. A visão geral acima está repleta de soluções muito melhores.
ru: При развертывании на производстве не стоит полагаться на запуск ``python -m pip install`` из интернета в virtualenv, как это можно сделать в среде разработки. В обзоре выше есть много лучших решений.
ta: விளைவாக்கம் வரிசைப்படுத்தல்களைப் பொறுத்தவரை, ஒரு மேம்பாட்டு சூழலில் ஒருவர் செய்யக்கூடியபடி, இணையத்திலிருந்து `பைதான் -எம் பிஐபி நிறுவலை` `பைதான் -எம் பிஐபி நிறுவலை ஒரு மெய்நிகர் ஈவுக்குள் இயக்குவதை நம்ப வேண்டாம். மேலே உள்ள கண்ணோட்டம் மிகச் சிறந்த தீர்வுகள் நிறைந்தது.

source: Security
eo: Sekureco
ja: セキュリティ
pt_br: Segurança
ru: Безопасность
ta: பாதுகாப்பு

source: The further down the gradient you come, the harder it gets to update components of your package. Everything is more tightly bound together.
eo: Ju pli suben vi iras, des pli malfacile estas ĝisdatigi komponantojn de via pako, ĉar ĉiuj estas des pli kunligitaj.
ja: あなたのパッケージの部品を更新することは、ここまで積み上げてきたものよりさらに困難なものになるでしょう。あらゆるものがより緊密に互いに固着しているのです。
pt_br: Quanto mais fundo você descer nas camadas, mais difícil será para atualizar os componentes do seu pacote. Tudo está mais estreitamente ligado.
ru: Чем дальше вниз по градиенту, тем сложнее обновлять компоненты вашего пакета. Все более тесно связано друг с другом.
ta: நீங்கள் வரும் சாய்வு மேலும் கீழே, உங்கள் தொகுப்பின் கூறுகளைப் புதுப்பிப்பது கடினம். எல்லாம் மிகவும் இறுக்கமாக ஒன்றாக பிணைக்கப்பட்டுள்ளது.

source: For example, if a kernel security issue emerges, and you're deploying containers, the host system's kernel can be updated without requiring a new build on behalf of the application. If you deploy VM images, you'll need a new build. Whether or not this dynamic makes one option more secure is still a bit of an old debate, going back to the still-unsettled matter of `static versus dynamic linking <https://www.google.com/search?channel=fs&q=static+vs+dynamic+linking>`_.
ja: 例えば、仮にあなたがコンテナ型の仮想環境を配置していて、カーネルのセキュリティ問題が発生したとすれば、アプリケーションに新たなビルドを要求することなくホスト側のカーネルが更新されるかもしれません。もしあなたが VM イメージを配置しているなら、それを再ビルドする必要があるかもしれません。このような動的な挙動をよりセキュアにするひとつのオプションは、以前から少々議論の的になっているがまだ決着のついていない `静的リンク対動的リンク <https://www.google.com/search?channel=fs&q=static+vs+dynamic+linking>`_ ということになります。
pt_br: Por exemplo, se surgir um problema de segurança do kernel e você estiver implantando contêineres, o kernel do sistema host pode ser atualizado sem a necessidade de uma nova compilação em nome da aplicação. Se você implantar imagens de VM, precisará de uma nova construção. Se essa dinâmica torna ou não uma opção mais segura ainda é um debate antigo, voltando à questão ainda não resolvida de `ligação estática versus ligação dinâmica <https://www.google.com/search?channel=fs&q=static+vs+dynamic+linking>`_.
ru: Например, если возникает проблема безопасности ядра, а вы развертываете контейнеры, ядро хост-системы можно обновить, не требуя новой сборки от имени приложения. Если же вы развертываете образы виртуальных машин, вам потребуется новая сборка. Вопрос о том, делает ли эта динамика один из вариантов более безопасным, все еще остается немного старым спором, восходящим к до сих пор не решенному вопросу `статического и динамического связывания <https://www.google.com/search?channel=fs&q=static+vs+dynamic+linking>`_.
ta: எடுத்துக்காட்டாக, ஒரு கர்னல் பாதுகாப்பு சிக்கல் வெளிவந்தால், நீங்கள் கொள்கலன்களைப் பயன்படுத்தினால், பயன்பாட்டின் சார்பாக புதிய கட்டிடம் தேவையில்லாமல் புரவலன் அமைப்பின் கர்னலை புதுப்பிக்க முடியும். நீங்கள் விஎம் படங்களை வரிசைப்படுத்தினால், உங்களுக்கு புதிய உருவாக்கம் தேவை. இந்த மாறும் ஒரு விருப்பத்தை மிகவும் பாதுகாப்பாக ஆக்குகிறதா இல்லையா என்பது இன்னும் பழைய விவாதமாக உள்ளது, இது `நிலையான மற்றும் மாறும் இணைக்கும் <https://www.google.com/search?channel=fs&q= நிலையான+vs+டைனமிக்+இணைத்தல்> `_.

source: Wrap up
eo: Konkludo
ja: まとめ
pt_br: Resumo
ru: Заключение
ta: மடக்கு
