Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: There are a number of alternative options for obtaining scientific Python libraries (or any other Python libraries that require a compilation environment to install from source and don't provide pre-built wheel files on PyPI).
eo: Ekzistas kelkaj alternativoj por akiri sciencajn Python-bibliotekojn (aŭ aliajn Python-bibliotekojn postulantajn tradukan medion por instali el fonto kaj sen antaŭkonstruitajn wheel-dosierojn ĉe PyPI).
ja: 科学分野の Python ライブラリ (または、ソースコードからインストールする際にコンパイル環境を必要とするが、 PyPI にビルド済みの wheel ファイルが用意されていないような、他の全ての Python ライブラリ) を手に入れるには他にも数多くの代替方法があります。
pt_br: Existem várias opções alternativas para obter bibliotecas científicas Python (ou quaisquer outras bibliotecas Python que requerem um ambiente de compilação para instalar a partir do código-fonte e não fornecem arquivos de wheel pré-construídos no PyPI).
ru: Существует несколько альтернативных вариантов получения научных библиотек Python (или любых других библиотек Python, которые требуют среды компиляции для установки из исходного кода и не предоставляют предварительно собранные файлы wheel на PyPI).
ta: விஞ்ஞான பைதான் நூலகங்களைப் பெறுவதற்கு பல மாற்று விருப்பங்கள் உள்ளன (அல்லது மூலத்திலிருந்து நிறுவ ஒரு தொகுப்பு சூழல் தேவைப்படும் மற்றும் பைபியில் முன்பே கட்டப்பட்ட சக்கர கோப்புகளை வழங்காத வேறு எந்த பைதான் நூலகங்களும்).

source: Building from source
eo: Konstrui el fonto
ja: ソースコードからビルドする
pt_br: Construindo a partir do código-fonte
ru: Создание из исходников
ta: மூலத்திலிருந்து கட்டிடம்

source: The same complexity which makes it difficult to distribute NumPy (and many of the projects that depend on it) as wheel files also make them difficult to build from source yourself. However, for intrepid folks that are willing to spend the time wrangling compilers and linkers for both C and FORTRAN, building from source is always an option.
ja: NumPy (およびそれに依存するプロジェクトの多く) を wheel ファイルとして配布することを難しくする同じ複雑さが、自分でソースコードから作成することをも困難にしています。しかしながら、C言語やFORTRAN言語のコンパイラやリンカを説得するのに喜んで時間を費やそうという勇敢な人々にとっては、ソースコードからビルドすることは常にひとつの選択肢です。
pt_br: A mesma complexidade que torna difícil distribuir o NumPy (e muitos dos projetos que dependem dele) como arquivos wheel também torna difícil construí-los a partir do código-fonte. No entanto, para pessoas intrépidas que estão dispostas a gastar o tempo discutindo compiladores e vinculadores para C e FORTRAN, construir a partir do código-fonte é sempre uma opção.
ru: Та же сложность, которая затрудняет распространение NumPy (и многих проектов, зависящих от него) в виде файлов на колесах, также затрудняет их самостоятельную сборку из исходных текстов. Однако для смельчаков, готовых потратить время на работу с компиляторами и компоновщиками для C и FORTRAN, сборка из исходных текстов - это всегда вариант.
ta: சக்கரக் கோப்புகள் என நம்பியை (மற்றும் அதைச் சார்ந்து இருக்கும் பல திட்டங்களை) விநியோகிப்பது கடினமாக்கும் அதே சிக்கலானது, மூலத்திலிருந்து உங்களை உருவாக்குவது கடினம். எவ்வாறாயினும், சி மற்றும் ஃபோர்ட்ரான் ஆகிய இரண்டிற்கும் கம்பைலர்கள் மற்றும் இணைப்பாளர்களை சண்டையிடும் நேரத்தை செலவிடத் தயாராக இருக்கும் துணிச்சலான அனைவருக்கும், மூலத்திலிருந்து கட்டுவது எப்போதும் ஒரு விருப்பமாகும்.

source: Linux distribution packages
eo: Linux-distribuaj pakoj
ja: Linux 配布パッケージ
pt_br: Pacotes de distribuição Linux
ru: Распространяемые пакеты Linux
ta: லினக்ச் விநியோக தொகுப்புகள்

source: For Linux users, the system package manager will often have pre-compiled versions of various pieces of scientific software, including NumPy and other parts of the scientific Python stack.
eo: Por uzanto de Linux, la sistema pakadministrilo ofte havas antaŭtradukitajn versiojn de diversaj sciencaj programoj inkluzive de NumPy kaj aliaj partoj de la scienca Python-stako.
ja: Linux のユーザなら、システムのパッケージマネージャを使えば NumPy やその他の科学分野のPythonソフトウェア群のコンパイル済みのパッケージが準備されていることも多々あります。
pt_br: Para usuários Linux, o gerenciador de pacotes do sistema frequentemente terá versões pré-compiladas de várias peças de software científico, incluindo NumPy e outras partes da pilha científica Python.
ru: Для пользователей Linux в системном менеджере пакетов часто есть предварительно скомпилированные версии различных научных программ, включая NumPy и другие части научного стека Python.
ta: லினக்ச் பயனர்களைப் பொறுத்தவரை, கணினி தொகுப்பு மேலாளர் பெரும்பாலும் எண் மற்றும் விஞ்ஞான பைதான் அடுக்கின் பிற பகுதிகள் உட்பட பல்வேறு அறிவியல் மென்பொருள்களின் முன் தொகுக்கப்பட்ட பதிப்புகளைக் கொண்டிருப்பார்.

source: If using versions which may be several months old is acceptable, then this is likely to be a good option (just make sure to allow access to distributions installed into the system Python when using virtual environments).
eo: Se uzi version plurmonate malaktualan estas akcepteble, do tio estas verŝajne bona opcio (nur certigu, ke vi permesas atingon al distribuoj instalitaj en la sistema Python dum uzado de virtuala medio).
ja: もし数ヶ月遅れでも構わないのであれば、これは良い選択肢でしょう (仮想環境を使っている場合はシステムの Python にインストールされた配布物にアクセスできるようにしておくのを忘れないでください) 。
pt_br: Se usar versões que podem ter vários meses é aceitável, então esta é provavelmente uma boa opção (apenas certifique-se de permitir o acesso às distribuições instaladas no sistema Python ao usar ambientes virtuais).
ru: Если использование версий, возраст которых может составлять несколько месяцев, допустимо, то это, скорее всего, будет хорошим вариантом (только не забудьте разрешить доступ к дистрибутивам, установленным в системе Python, при использовании виртуальных сред).
ta: பல மாதங்கள் பழமையான பதிப்புகளைப் பயன்படுத்துவது ஏற்றுக்கொள்ளத்தக்கது என்றால், இது ஒரு நல்ல தேர்வாக இருக்கக்கூடும் (மெய்நிகர் சூழல்களைப் பயன்படுத்தும் போது கணினி பைத்தானில் நிறுவப்பட்ட விநியோகங்களை அணுக அனுமதிப்பதை உறுதிசெய்க).

source: Windows installers
eo: Windows-instaliloj
ja: Windows 版インストーラ
pt_br: Instaladores para Windows
ru: Установщики Windows
ta: சாளரங்கள் நிறுவிகள்

source: Many Python projects that don't (or can't) currently publish wheel files at least publish Windows installers, either on PyPI or on their project download page. Using these installers allows users to avoid the need to set up a suitable environment to build extensions locally.
eo: Multaj Python-projektoj, kiuj ne eldonas (aŭ ne povas eldoni) wheel-dosierojn, minimume eldonas Windows-instalilojn, aŭ ĉe PyPI aŭ sur siaj projektaj elŝutaj paĝoj. Uzante tian instalilon, uzanto ne bezonas starigi taŭgan medion por konstrui etendaĵojn loke.
ja: 現時点で wheel ファイルを公開していない(または公開できない)多くの Python プロジェクトでも、 PyPI 上か、または、そのプロジェクトのダウンロードページで、少なくとも Windows 版インストーラを公開しています。このようなインストーラを使えば、(他言語)拡張をローカルでビルドするための適切な環境を準備する手間を省くことができます。
pt_br: Muitos projetos Python que não publicam (ou não podem) atualmente publicar arquivos wheel, pelo menos publicam instaladores Windows, seja no PyPI ou na página de download de seus projetos. O uso desses instaladores permite que os usuários evitem a necessidade de configurar um ambiente adequado para construir extensões localmente.
ru: Многие Python-проекты, которые в настоящее время не публикуют (или не могут опубликовать) файлы wheel, по крайней мере, публикуют инсталляторы для Windows, либо на PyPI, либо на странице загрузки проекта. Использование этих инсталляторов позволяет пользователям избежать необходимости создавать подходящее окружение для локальной сборки расширений.
ta: இல்லாத பல பைதான் திட்டங்கள் தற்போது சக்கரக் கோப்புகளை வெளியிடுகின்றன, குறைந்தது சாளரங்கள் நிறுவிகளை பைபி அல்லது அவற்றின் திட்ட பதிவிறக்க பக்கத்தில் வெளியிடுகின்றன. இந்த நிறுவிகளைப் பயன்படுத்துவது பயனர்கள் உள்நாட்டில் நீட்டிப்புகளை உருவாக்க பொருத்தமான சூழலை அமைக்க வேண்டிய அவசியத்தைத் தவிர்க்க அனுமதிக்கிறது.

source: The extensions provided in these installers are typically compatible with the CPython Windows installers published on python.org.
eo: La etendaĵoj disponigitaj en tiuj instaliloj ofte kongruas kun la Windows-instaliloj de CPython ĉe python.org.
ja: このようなインストーラで用意されている(他言語)拡張は、たいてい、 python.org で公開されている CPython Windows インストーラと互換性のある形で公開されています。
pt_br: As extensões fornecidas nesses instaladores são normalmente compatíveis com os instaladores do CPython para o Windows publicados em python.org.
ru: Расширения, предоставляемые в этих установщиках, обычно совместимы с установщиками CPython для Windows, опубликованными на python.org.
ta: இந்த நிறுவிகளில் வழங்கப்பட்ட நீட்டிப்புகள் பொதுவாக python.org இல் வெளியிடப்பட்ட CPyThon சாளரங்கள் நிறுவிகளுடன் இணக்கமாக இருக்கும்.

source: As with Linux system packages, the Windows installers will only install into a system Python installation - they do not support installation in virtual environments. Allowing access to distributions installed into the system Python when using virtual environments is a common approach to working around this limitation.
eo: Same kiel Linux-sistempakoj, la Windows instaliloj nur instalas en sisteman Python-instalaĵon – ili ne povas instali en virtualan medion. Oni ofte moderigas tiun limigon permesante al virtualaj medioj atingi distribuojn instalitajn en la sisteman Python-instalaĵon.
ja: Linux のシステムパッケージの時と同じく、Windows 版インストーラはシステムワイドの Python 環境にしかインストールしません -- つまり、仮想環境へのインストールはサポートしていないのです。この制約を回避するよくあるやり方は、仮想環境を使っている時にシステムワイドの Python 環境にインストールされた配布物へのアクセスを許可することです。
pt_br: Tal como acontece com os pacotes de sistema Linux, os instaladores Windows irão apenas instalar em uma instalação de sistema Python -- eles não oferecem suporte à instalação em ambientes virtuais. Permitir o acesso a distribuições instaladas no sistema Python ao usar ambientes virtuais é uma abordagem comum para contornar essa limitação.
ru: Как и в случае с системными пакетами Linux, программы установки Windows будут устанавливаться только в системную установку Python - они не поддерживают установку в виртуальных средах. Предоставление доступа к дистрибутивам, установленным в системный Python, при использовании виртуальных сред - распространенный подход к обходу этого ограничения.
ta: லினக்ச் கணினி தொகுப்புகளைப் போலவே, சாளரங்கள் நிறுவிகள் கணினி பைதான் நிறுவலில் மட்டுமே நிறுவப்படும் - அவை மெய்நிகர் சூழல்களில் நிறுவலை ஆதரிக்காது. மெய்நிகர் சூழல்களைப் பயன்படுத்தும் போது கணினி பைத்தானில் நிறுவப்பட்ட விநியோகங்களை அணுக அனுமதிப்பது இந்த வரம்பைச் சுற்றி செயல்படுவதற்கான பொதுவான அணுகுமுறையாகும்.

source: The :term:`Wheel` project also provides a :command:`wheel convert` subcommand that can convert a Windows :command:`bdist_wininst` installer to a wheel.
eo: La projekto :term:`Wheel` ankaŭ provizas subkomandon :command:`wheel convert`, kiu konvertas :command:`bdist_wininst`-instalilon por Windows al wheel.
ja: :term:`Wheel` プロジェクトは、Windows :command:`bdist_wininst` インストーラを wheel に変換するサブコマンド :command:`wheel convert` も提供しています。
pt_br: O projeto :term:`Wheel` também fornece um subcomando :command:`wheel convert` que pode converter um instalador para Windows :command:`bdist_wininst` em um wheel.
ru: Проект :term:`Wheel` также предоставляет подкоманду :command:`wheel convert`, которая может преобразовать установщик Windows :command:`bdist_wininst` в wheel.
ta: தி: கால: `வீல்` திட்டம் ஒரு விண்டோசை மாற்றக்கூடிய ஒரு: கட்டளை:` சக்கர மாற்றுதல் துணைக் கட்டளை: கட்டளை: `bdist_wininst` நிறுவி ஒரு சக்கரத்திற்கு.

source: macOS installers and package managers
eo: Instaliloj kaj pakadministriloj por macOS
ja: macOS インストーラとパッケージマネージャ
pt_br: Instaladores e gerenciadores de pacote para macOS
ru: Установщики и менеджеры пакетов macOS
ta: மேகோச் நிறுவிகள் மற்றும் தொகுப்பு மேலாளர்கள்

source: Similar to the situation on Windows, many projects (including NumPy) publish macOS installers that are compatible with the macOS CPython binaries published on python.org.
eo: Simila al la situacio ĉe Windows, multaj projektoj (inkluzive de NumPy) eldonas macOS-instalilojn kongruajn kun la CPython-duumaĵojn por macOS ĉe python.org.
ja: Windows での状況と同様に、 (NumPy を含む) 多数のプロジェクトは、 python.org で公開される macOS版の Python バイナリと互換性のある macOS 版インストーラを公開しています。
pt_br: Semelhante à situação no Windows, muitos projetos (incluindo NumPy) publicam instaladores para macOS que são compatíveis com os binários do CPython para macOS publicados em python.org.
ru: Как и в случае с Windows, многие проекты (включая NumPy) публикуют инсталляторы для macOS, совместимые с двоичными файлами macOS CPython, опубликованными на python.org.
ta: விண்டோசின் நிலைமையைப் போலவே, பல திட்டங்கள் (NUMPY உட்பட) MACOS நிறுவிகளை வெளியிடுகின்றன, அவை பைதான்.ஆர்சில் வெளியிடப்பட்ட மேகோச் சிபிதான் பைனரிகளுடன் இணக்கமாக உள்ளன.

source: macOS users also have access to Linux distribution style package managers such as ``Homebrew``. The SciPy site has more details on using Homebrew to `install SciPy on macOS <https://scipy.org/install/#macos>`_.
eo: uzantoj de macOS ankaŭ povas uzi Linux-stilan pakadministrilon kiel ``Homebrew``. La retejo de SciPy havas pliajn detalojn pri `instalado de SciPy sur macOS per Homebrew <https://scipy.org/install/#macos>`_.
ja: macOS のユーザは、 ``Homebrew`` のような Linux ディストロスタイルのパッケージマネージャも使うことができます。ScyPy サイトには、もっと詳しい Homebrew を使って `SciPy を macOS にインストールする <https://scipy.org/install/#macos>`_ 方法の説明があります。
pt_br: Os usuários do macOS também têm acesso aos gerenciadores de pacotes de estilo de distribuição Linux, como ``Homebrew``. O site SciPy tem mais detalhes sobre como usar Homebrew para `instalar SciPy no macOS <https://scipy.org/install/#macos>`_.
ru: Пользователи macOS также имеют доступ к пакетным менеджерам в стиле дистрибутива Linux, таким как ``Homebrew``. На сайте SciPy есть более подробная информация об использовании Homebrew для `установки SciPy на macOS <https://scipy.org/install/#macos>`_.
ta: மேகோச் பயனர்கள் `` ஓம் ப்ரூ`` போன்ற லினக்ச் விநியோக பாணி தொகுப்பு மேலாளர்களுக்கும் அணுகலைக் கொண்டுள்ளனர். மேகோச் <https://scipy.org/install/#macos> `_ இல் SCIPY ஐ நிறுவ ஓம் ப்ரூவைப் பயன்படுத்துவது பற்றிய கூடுதல் விவரங்கள் SCIPY தளத்தில் உள்ளன.

source: SciPy distributions
eo: Distribuoj de SciPy
ja: SciPy 配布物
pt_br: Distribuições SciPy
ru: Дистрибутивы SciPy
ta: சுறுசுறுப்பான வழங்கல்

source: The SciPy site lists `several distributions <https://scipy.org/install/>`_ that provide the full SciPy stack to end users in an easy to use and update format.
eo: La retejo de SciPy listigas `plurajn distribuojn <https://scipy.org/install/>`_ provizantajn la plenan SciPy-stakon al uzanto en facile uzebla kaj ĝisdatigebla formo.
ja: SciPy サイトには、利用・更新が簡単なフォーマットでエンドユーザ向けの SciPy の全機能を提供する `いくつかの配布物 <https://scipy.org/install/>`_ のリストがあります。
ru: На сайте SciPy перечислены `несколько дистрибутивов <https://scipy.org/install/>`_, которые предоставляют полный стек SciPy конечным пользователям в удобном для использования и обновления формате.
ta: SCIPY தளம் `பல விநியோகங்களை பட்டியலிடுகிறது <https://scipy.org/install/>` _ இது பயனர்களை எளிதாகப் பயன்படுத்தவும் புதுப்பிக்கவும் முழு ச்கிப்பி அடுக்கை வழங்குகிறது.

source: Some of these distributions may not be compatible with the standard ``pip`` and ``virtualenv`` based toolchain.
eo: Kelkaj el tiuj distribuoj eble ne kongruas kun la norma ilĉeno uzanta ``pip`` kaj ``virtualenv``.
ja: これらの配布物の内のいくつかは、標準的な ``pip`` や ``virtualenv`` を基礎にしたツールチェーンと互換性がないかもしれません。
pt_br: Algumas dessas distribuições podem não ser compatíveis com o conjunto de ferramentas padrão ``pip`` e ``virtualenv``.
ru: Некоторые из этих дистрибутивов могут быть несовместимы со стандартным инструментарием на базе ``pip`` и ``virtualenv``.
ta: இந்த விநியோகங்களில் சில நிலையான `` பிஐபி`` மற்றும் `` மெய்நிகர்என்.வி`` அடிப்படையிலான கருவித்தொகுப்புடன் பொருந்தாது.

source: Spack
ta: ச்பேர்ட்

source: `Spack <https://github.com/spack/spack>`_ is a flexible package manager designed to support multiple versions, configurations, platforms, and compilers. It was built to support the needs of large supercomputing centers and scientific application teams, who must often build software many different ways. Spack is not limited to Python; it can install packages for ``C``, ``C++``, ``Fortran``, ``R``, and other languages. It is non-destructive; installing a new version of one package does not break existing installations, so many configurations can coexist on the same system.
eo: `Spack <https://github.com/spack/spack>`_ estas fleksebla pakadministrilo subtenanta plurajn versiojn, agordojn, platformojn kaj tradukilojn. Ĝi estis verkita por grandaj superkomputejoj kaj sciencaj teamoj, kiuj ofte devas konstrui programojn plurmaniere. Spack ne estas limigita al Python; ĝi povas instali pakojn por ``C``, ``C++``, Fortrano, ``R``, kaj aliajn lingvojn. Ĝi estas nedetruema; instalado de nova versio de unu pako ne rompas ekzistantajn instalojn; tial pluraj agordoj povas kunekzisti sur unu sistemo.
ja: `Spack <https://github.com/spack/spack>`_ は、複数のバージョン・設定・プラットフォーム・コンパイラをサポートできるように設計されたパッケージマネージャです。大規模スーパーコンピュータセンタや科学分野のアプリケーションチームではあるソフトウェアを異なる方法でビルドする必要が多々ありますが、そのようなニーズを満たすように作られています。Spack は Python に限らず、 ``C`` ・ ``C++`` ・ ``Fortran`` ・ ``R`` やその他のプログラミング言語でも利用できます。Spackは破壊的ではありません; というのは、あるパッケージの新しいバージョンをインストールしても先にインストールされたものを壊すことはなく、非常に多くの設定(でインストールされたもの)が同一システム上で共存できるのです。
pt_br: `Spack <https://github.com/spack/spack>`_ é um gerenciador de pacotes flexível projetado para oferecer suporte a múltiplas versões, configurações, plataformas e compiladores. Ele foi construído para dar suporte às necessidades de grandes centros de supercomputação e equipes de aplicações científicas, que frequentemente precisam criar software de muitas maneiras diferentes. O Spack não está limitado a Python; ele pode instalar pacotes para ``C``, ``C++``, ``Fortran``, ``R`` e outras linguagens. É não destrutivo; instalar uma nova versão de um pacote não interrompe as instalações existentes, portanto, muitas configurações podem coexistir no mesmo sistema.
ru: `Spack <https://github.com/spack/spack>`_ - это гибкий менеджер пакетов, разработанный для поддержки множества версий, конфигураций, платформ и компиляторов. Он был создан для удовлетворения потребностей крупных суперкомпьютерных центров и команд разработчиков научных приложений, которым часто приходится собирать программное обеспечение разными способами. Spack не ограничивается Python; он может устанавливать пакеты для ``C``, ``C++``, ``Fortran``, ``R`` и других языков. Spack является неразрушающим; установка новой версии одного пакета не нарушает существующие установки, поэтому на одной системе может сосуществовать множество конфигураций.
ta: `ச்பேக் <https://github.com/spack/spack>` _ என்பது பல பதிப்புகள், உள்ளமைவுகள், தளங்கள் மற்றும் கம்பைலர்களை ஆதரிக்க வடிவமைக்கப்பட்ட ஒரு நெகிழ்வான தொகுப்பு மேலாளராகும். பெரிய சூப்பர் கம்ப்யூட்டிங் மையங்கள் மற்றும் அறிவியல் பயன்பாட்டுக் குழுக்களின் தேவைகளை ஆதரிப்பதற்காக இது கட்டப்பட்டது, அவர்கள் பெரும்பாலும் மென்பொருளை பல வழிகளில் உருவாக்க வேண்டும். ச்பேக் பைத்தானுக்கு மட்டுப்படுத்தப்படவில்லை; இது `` c``, `` c ++ ``, `` ஃபோர்ட்ரான்``, `` r`` மற்றும் பிற மொழிகளுக்கான தொகுப்புகளை நிறுவ முடியும். இது அழிவில்லாதது; ஒரு தொகுப்பின் புதிய பதிப்பை நிறுவுவது ஏற்கனவே உள்ள நிறுவல்களை உடைக்காது, எனவே பல உள்ளமைவுகள் ஒரே கணினியில் இணைந்து வாழ முடியும்.

source: Spack offers a simple but powerful syntax that allows users to specify versions and configuration options concisely. Package files are written in pure Python, and they are templated so that it is easy to swap compilers, dependency implementations (like MPI), versions, and build options with a single package file. Spack also generates *module* files so that packages can be loaded and unloaded from the user's environment.
eo: Spack provizas simplan sed potencan sintakson, kiu permesas al uzanto facile specifi versiojn kaj agordajn opciojn. Pak-dosiero estas verkita en pura Python kaj estas ŝablona tiel, ke per unu pakdosiero facilas ŝanĝi tradukilon, realigon de dependaĵo (kiel MPI), versiojn kaj konstruaj opciojn. Spack ankaŭ produktas *modul-dosierojn*, por ŝargi kaj malŝargi pakojn al/el la medio de la uzanto.
ja: Spack は、ユーザがバージョンや設定のオプションを簡潔に表現する単純で力強い文法を提供します。パッケージファイルは純 Python で書かれていて、コンパイラ・ (MPI のような) 依存先の実装・バージョン・ビルドオプションをひとつのパッケージファイルの中で容易に入れ替えられるようにテンプレート化されています。Spack は、また、ユーザ環境からあるパッケージをロードしたりしなかったりできるように *modules* ファイルを生成します。
pt_br: O Spack oferece uma sintaxe simples, mas poderosa, que permite aos usuários especificar versões e opções de configuração de forma concisa. Os arquivos de pacote são escritos em puro Python e são modelados para que seja fácil trocar compiladores, implementações de dependência (como MPI), versões e opções de construção com um único arquivo de pacote. O Spack também gera arquivos de *módulo* para que os pacotes possam ser carregados e descarregados do ambiente do usuário.
ru: Spack предлагает простой, но мощный синтаксис, который позволяет пользователям лаконично указывать версии и параметры конфигурации. Файлы пакетов написаны на чистом Python, и они сконструированы таким образом, чтобы в одном файле пакета можно было легко менять местами компиляторы, реализации зависимостей (например, MPI), версии и параметры сборки. Spack также генерирует файлы *модулей*, чтобы пакеты можно было загружать и выгружать из окружения пользователя.
ta: ச்பாக் ஒரு எளிய ஆனால் சக்திவாய்ந்த தொடரியல் வழங்குகிறது, இது பயனர்களை பதிப்புகள் மற்றும் உள்ளமைவு விருப்பங்களை சுருக்கமாகக் குறிப்பிட அனுமதிக்கிறது. தொகுப்பு கோப்புகள் தூய பைத்தானில் எழுதப்பட்டுள்ளன, மேலும் அவை வார்ப்புருக்கள், இதனால் கம்பைலர்கள், சார்பு செயலாக்கங்கள் (எம்.பி.ஐ போன்றவை), பதிப்புகள் மற்றும் ஒற்றை தொகுப்பு கோப்புடன் விருப்பங்களை உருவாக்குவது எளிது. ச்பேக் * தொகுதி * கோப்புகளையும் உருவாக்குகிறது, இதனால் பயனரின் சூழலில் இருந்து தொகுப்புகளை ஏற்றவும் இறக்கவும் முடியும்.

source: The conda cross-platform package manager
eo: La plurplatforma pakadministrilo conda
ja: conda クロスプラットフォームパッケージマネージャ
pt_br: O gerenciador de pacotes multiplataforma conda
ru: Кроссплатформенный менеджер пакетов conda
ta: காண்டா குறுக்கு-தளம் தொகுப்பு மேலாளர்
