Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: simpleindex is a :term:`package index <Package Index>` which routes URLs to multiple package indexes (including PyPI), serves local (or cloud-hosted, for example `AWS S3`_, with a custom plugin) directories of packages, and supports custom plugins.
eo: simpleindex estas :term:`pakindekso <Package Index>`, kiu enkursigas retadresojn al pluaj pakindeksoj (inkluzive de PyPI), disponigas lokajn (aŭ nube gastigitajn, ekzemple ĉe `AWS S3`_, per kromprogramo) dosierujojn de pakoj, kaj subtenas kromprogramojn.
ja: simple index は、 URL を (PyPI を含む) 複数のパッケージインデックスに振り分け、ローカルの (または、カスタムプラグインを使って例えば `AWS S3`_ のようなクラウドにホストされた) パッケージディレクトリからファイルを提供し、カスタムプラグインをサポートしている :term:`パッケージインデックス <Package Index>` です。
ru: simpleindex - это : термин:`индекс пакетов <Пакетный индекс>`, который направляет URL к нескольким индексам пакетов (включая PyPI), обслуживает локальные (или размещенные в облаке, например, `AWS S3`_, с помощью пользовательского плагина) каталоги пакетов, а также поддерживает пользовательские плагины.
ta: சிம்பிள்இண்டெக்ச் ஒரு: சொல்: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` இது முகவரி களை பல தொகுப்பு குறியீடுகளுக்கு (PYPI உட்பட) வழிநடத்துகிறது, உள்ளக (அல்லது கிளவுட்-ஓச்ட், எடுத்துக்காட்டாக `AWS S3`_, தனிப்பயன் சொருகி) தொகுப்புகளின் கோப்பகங்கள் , மற்றும் தனிப்பயன் செருகுநிரல்களை ஆதரிக்கிறது.

source: :doc:`Docs <spack:index>` | `GitHub <https://github.com/spack/spack>`__ | `Paper <https://www.computer.org/csdl/proceedings-article/sc/2015/2807623/12OmNBf94Xq>`__ | `Slides <https://tgamblin.github.io/files/Gamblin-Spack-SC15-Talk.pdf>`__
eo: :doc:`Dokumentaro <spack:index>` | `GitHub <https://github.com/spack/spack>`__ | `Artikolo <https://www.computer.org/csdl/proceedings-article/sc/2015/2807623/12OmNBf94Xq>`__ | `Lumbildoj <https://tgamblin.github.io/files/Gamblin-Spack-SC15-Talk.pdf>`__
ja: :doc:`説明文書 <spack:index>` | `GitHub <https://github.com/spack/spack>`__ | `論文 <https://www.computer.org/csdl/proceedings-article/sc/2015/2807623/12OmNBf94Xq>`__ | `スライド <https://tgamblin.github.io/files/Gamblin-Spack-SC15-Talk.pdf>`__
pt_br: :doc:`Documentação <spack:index>` | `GitHub <https://github.com/spack/spack>`__ | `Artigo <https://www.computer.org/csdl/proceedings-article/sc/2015/2807623/12OmNBf94Xq>`__ | `Slides <https://tgamblin.github.io/files/Gamblin-Spack-SC15-Talk.pdf>`__
ru: :doc:`Документы <spack:index>` | `GitHub <https://github.com/spack/spack>`__ | `Paper <https://www.computer.org/csdl/proceedings-article/sc/2015/2807623/12OmNBf94Xq>`__ | `Slides <https://tgamblin.github.io/files/Gamblin-Spack-SC15-Talk.pdf>`__
ta: : டாக்: `டாக்ச் <ச்பேக்: குறியீட்டு>` | `Github <https://github.com/spack/spack>` __ | `Paper <https://www.computer.org/csdl/proceedings-article/sc/2015/2807623/12OmNBf94Xq>`__ | `ச்லைடுகள் <https://tgamblin.github.io/files/gamblin-spack-sc15-talk.pdf> ____ __ __

source: A flexible package manager designed to support multiple versions, configurations, platforms, and compilers. Spack is like Homebrew, but packages are written in Python and parameterized to allow easy swapping of compilers, library versions, build options, etc. Arbitrarily many versions of packages can coexist on the same system. Spack was designed for rapidly building high performance scientific applications on clusters and supercomputers.
ja: (spack は) 複数のバージョン・設定・プラットフォーム・コンパイラをサポートするように設計された自由度の高いパッケージマネージャです。 Spack は Homebrew に似ていますが、Python で書かれていてコンパイラやライブラリのバージョン、ビルドオプションなどが簡単に入れ替えることができるようにパラメータ化されています。同一のシステムの中に任意のバージョンのパッケージをいくつも同居させることができます。 Spack は、元々はクラスタ構成のコンピュータ群やスーパーコンピュータの上で科学分野の高パフォーマンスアプリケーションを素早くビルドするために設計されました。
pt_br: Um gerenciador de pacotes flexível projetado para oferecer suporte a várias versões, configurações, plataformas e compiladores. O Spack é como o Homebrew, mas os pacotes são escritos em Python e parametrizados para permitir fácil troca de compiladores, versões de bibliotecas, opções de construção, etc. Arbitrariamente, muitas versões de pacotes podem coexistir no mesmo sistema. O Spack foi projetado para construir rapidamente aplicações científicas de alto desempenho em clusters e supercomputadores.
ru: Гибкий менеджер пакетов, разработанный для поддержки множества версий, конфигураций, платформ и компиляторов. Spack похож на Homebrew, но пакеты написаны на Python и параметризованы, что позволяет легко менять местами компиляторы, версии библиотек, параметры сборки и т. д. На одной системе может сосуществовать произвольное количество версий пакетов. Spack был разработан для быстрого создания высокопроизводительных научных приложений на кластерах и суперкомпьютерах.
ta: பல பதிப்புகள், உள்ளமைவுகள், தளங்கள் மற்றும் கம்பைலர்களை ஆதரிக்க வடிவமைக்கப்பட்ட ஒரு நெகிழ்வான தொகுப்பு மேலாளர். ச்பேக் ஓம்பிரூ போன்றது, ஆனால் தொகுப்புகள் பைத்தானில் எழுதப்பட்டவை மற்றும் கம்பைலர்கள், நூலக பதிப்புகள், உருவாக்க விருப்பங்கள் போன்றவற்றை எளிதாக மாற்ற அனுமதிக்க அளவுருவாக்கப்பட்டுள்ளன. தன்னிச்சையாக பல தொகுப்புகள் ஒரே அமைப்பில் ஒன்றிணைந்திருக்க முடியும். கொத்துகள் மற்றும் சூப்பர் கம்ப்யூட்டர்களில் உயர் செயல்திறன் கொண்ட விஞ்ஞான பயன்பாடுகளை விரைவாக உருவாக்குவதற்காக ச்பேக் வடிவமைக்கப்பட்டுள்ளது.

source: Spack is not in PyPI (yet), but it requires no installation and can be used immediately after cloning from GitHub.
eo: Spack ne estas en PyPI (ankoraŭ), sed ĝi postulas neniun instaladon kaj estas uzebla tuj post klonado el GitHub.
ja: Spack は (まだ) PyPI にありませんが、 GitHub からクローンした直後にインストール作業なしで使用できます。
pt_br: O Spack não está no PyPI (ainda), mas não requer instalação e pode ser usado imediatamente após a clonagem do GitHub.
ru: Spack нет в PyPI (пока), но он не требует установки и может быть использован сразу после клонирования с GitHub.
ta: ச்பேக் பைபியில் இல்லை (இன்னும்), ஆனால் இதற்கு எந்த நிறுவலும் தேவையில்லை, மேலும் கிட்அப்பிலிருந்து நகலி செய்த உடனேயே பயன்படுத்தலாம்.

source: zest.releaser
ta: zest.relases

source: `Docs <https://zestreleaser.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/zestsoftware/zest.releaser/>`__ | `PyPI <https://pypi.org/project/zest.releaser/>`__
eo: `Dokumentaro <https://zestreleaser.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/zestsoftware/zest.releaser/>`__ | `PyPI <https://pypi.org/project/zest.releaser/>`__
ja: `説明文書 <https://zestreleaser.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/zestsoftware/zest.releaser/>`__ | `PyPI <https://pypi.org/project/zest.releaser/>`__
pt_br: `Documentação <https://zestreleaser.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/zestsoftware/zest.releaser/>`__ | `PyPI <https://pypi.org/project/zest.releaser/>`__
ru: `Документы <https://zestreleaser.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/zestsoftware/zest.releaser/>`__ | `PyPI <https://pypi.org/project/zest.releaser/>`__
ta: `டாக்ச் <https://zestreleaser.readthedocs.io/en/latest/>` __ | `Github <https://github.com/zestsoftware/zest.releaser/> __ | `Pypi <https://pypi.org/project/zest.releaser/> ____ __

source: ``zest.releaser`` is a Python package release tool providing an abstraction layer on top of :ref:`twine`. Python developers use ``zest.releaser`` to automate incrementing package version numbers, updating changelogs, tagging releases in source control, and uploading new packages to PyPI.
eo: ``zest.releaser`` estas Python-paka eldonilo, kiu estas abstrakta tavolo sur :ref:`twine`. Python-programisto uzas ``zest.releaser`` por aŭtomatigi alkrementadon de versiaj numeroj, ĝisdatigadon de ŝanĝoprotokolo, etikedigon de eldonoj en versikontrola sistemo, kaj alŝutadon de nova pako al PyPI.
ja: ``zest.releaser`` は、 :ref:`twine` の上に抽象レイヤを提供する Python パッケージのリリースツールです。 Python 開発者は ``zest.releaser`` を使ってパッケージバージョンを増加させたり、変更履歴 (Changelog) を更新したり、ソースコード管理の側でリリースタグを挿入したり、新しいパッケージを PyPI にアップロードすることを自動化することができます。
pt_br: ``zest.releaser`` é uma ferramenta de lançamento de pacote Python que fornece uma camada de abstração sobre :ref:`twine`. Os desenvolvedores Python usam ``zest.releaser`` para automatizar o incremento de números de versão de pacote, atualizando changelogs, marcando lançamentos no controle de fontes e enviando novos pacotes para PyPI.
ru: ``zest.releaser`` - это инструмент для выпуска пакетов на Python, предоставляющий слой абстракции поверх :ref:`twine``. Разработчики Python используют ``zest.releaser`` для автоматизации увеличения номеров версий пакетов, обновления журналов изменений, маркировки релизов в системе контроля исходного кода и загрузки новых пакетов в PyPI.
ta: `` zest.Releaser`` என்பது ஒரு பைதான் தொகுப்பு வெளியீட்டு கருவியாகும்: மேலே ஒரு சுருக்க அடுக்கை வழங்கும்: குறிப்பு: `ட்வைன்`. பைதான் உருவாக்குபவர்கள் தொகுப்பு பதிப்பு எண்களை அதிகரிக்க, சேஞ்ச்லாக்சைப் புதுப்பித்தல், மூலக் கட்டுப்பாட்டில் வெளியீடுகளைக் குறித்தல் மற்றும் புதிய தொகுப்புகளை PYPI இல் பதிவேற்றுதல் ஆகியவற்றை தானியக்கமாக்க `` zest.releaser`` ஐப் பயன்படுத்துகின்றனர்.

source: Standard Library Projects
eo: Projektoj pri la Norma Biblioteko
ja: 標準ライブラリ内のプロジェクト群
pt_br: Projetos de biblioteca padrão
ru: Проекты в стандартное библиотеке
ta: நிலையான நூலக திட்டங்கள்

source: ensurepip
ta: உறுதிப்படுத்தவும்

source: `Docs <https://docs.python.org/3/library/ensurepip.html>`__ | `Issues <https://bugs.python.org/>`__
eo: `Dokumentaro <https://docs.python.org/3/library/ensurepip.html>`__ | `Cimoj <https://bugs.python.org/>`__
ja: `説明文書 <https://docs.python.org/3/library/ensurepip.html>`__ | `課題リスト <https://bugs.python.org/>`__
pt_br: `Documentação <https://docs.python.org/pt-br/3/library/ensurepip.html>`__ | `Issues <https://bugs.python.org/>`__
ru: `Документация <https://docs.python.org/3/library/ensurepip.html>`__ | `Замечания <http://bugs.python.org>`__
ta: `டாக்ச் <https://docs.python.org/3/library/ensurepip.html> __ | `சிக்கல்கள் <https://bugs.python.org/> ____ __

source: A package in the Python Standard Library that provides support for bootstrapping :ref:`pip` into an existing Python installation or virtual environment. In most cases, end users won't use this module, but rather it will be used during the build of the Python distribution.
eo: Pako en la Norma Biblioteko de Python, kiu ebligas instaladon de :ref:`pip` al ekzistanta Python-instalo aŭ virtuala medio. Ordinare uzanto ne rekte uzas tiun modulon; ĝi estas uzata dum la konstruado de la Python-distribuo.
ja: このパッケージはPython の標準ライブラリ内のパッケージで、既存のインストール済み Python 環境や仮想環境に :ref:`pip` を組み込むためのサポートを提供します。ほとんどの場合にはエンドユーザがこのモジュールを使うことはなく、どちらかと言えば Python 配布物のビルドの際に使われるでしょう。
pt_br: Um pacote na Biblioteca Padrão do Python que fornece suporte para preparar o :ref:`pip` em uma instalação existente do Python ou em ambiente virtual. Na maioria dos casos, os usuários finais não usarão este módulo, mas em vez disso, ele será usado durante a construção da distribuição Python.
ru: Пакет стандартной библиотеки Python, обеспечивающий поддержку загрузки :ref:`pip` в существующую установку Python или виртуальную среду. В большинстве случаев конечные пользователи не будут использовать этот модуль, скорее он будет использоваться во время сборки дистрибутива Python.
ta: பூட்ச்ட்ராப்பிங்கிற்கு ஆதரவை வழங்கும் பைதான் நிலையான நூலகத்தில் ஒரு தொகுப்பு: குறிப்பு: `பிப்` ஏற்கனவே இருக்கும் பைதான் நிறுவல் அல்லது மெய்நிகர் சூழலில். பெரும்பாலான சந்தர்ப்பங்களில், இறுதி பயனர்கள் இந்த தொகுதியைப் பயன்படுத்த மாட்டார்கள், மாறாக இது பைதான் விநியோகத்தின் போது பயன்படுத்தப்படும்.

source: :doc:`Docs <python:library/http.server>` | :gh:`Issues <python/cpython/issues>`
eo: :doc:`Dokumentaro <python:library/http.server>` | :gh:`Cimoj <python/cpython/issues>`
ja: :doc:`説明文書 <python:library/http.server>` | :gh:`課題リスト <python/cpython/issues>`
ru: : Док:`Документы <python:library/http.server>` | :gh:`Выпуски <python/cpython/issues>`
ta: : டாக்: `டாக்ச் <பைதான்: நூலகம்/http.server>` | : GH: `சிக்கல்கள் <பைதான்/சிபிதான்/சிக்கல்கள்>`

source: A package and command-line interface which can host a directory as a website, for example as a :term:`package index <Package Index>` (see :ref:`Hosting your Own Simple Repository`).
eo: Pako kaj komandlinia interfaco, kiu gastigas dosierujon al retejo, ekzemple kiel :term:`pakindekson <Package Index>` (vidu :ref:`Gastigi vian Propran Simplan Deponejon <Hosting your Own Simple Repository>`).
ja: ウェブサイトとして、つまり例えば :term:`パッケージインデックス <Package Index>` として、ディレクトリを扱うことができるパッケージとコマンドラインインタフェース (:ref:`自分用のシンプルなリポジトリをホストする <Hosting your Own Simple Repository>` を参照してください) 。
ru: Пакет и интерфейс командной строки, который может размещать каталог в виде сайта, например, как : термин:`пакетный индекс <Пакетный индекс>` (см. :ссылка:`Хостинг собственного простого репозитория`).
ta: ஒரு வலைத்தளமாக ஒரு கோப்பகத்தை புரவலன் செய்யக்கூடிய ஒரு தொகுப்பு மற்றும் கட்டளை-வரி இடைமுகம், எடுத்துக்காட்டாக ஒரு: கால: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` (பார்க்க: குறிப்பு: `உங்கள் சொந்த எளிய களஞ்சியத்தை புரவலன் செய்தல்`).

source: venv
ta: vev

source: `Docs <https://docs.python.org/3/library/venv.html>`__ | `Issues <https://github.com/python/cpython/issues>`__
eo: `Dokumentaro <https://docs.python.org/3/library/venv.html>`__ | `Cimoj <https://github.com/python/cpython/issues>`__
ja: `説明文書 <https://docs.python.org/3/library/venv.html>`__ | `課題リスト <https://github.com/python/cpython/issues>`__
pt_br: `Documentação <https://docs.python.org/pt-br/3/library/venv.html>`__ | `Issues <https://github.com/python/cpython/issues>`__
ru: `Документация <https://docs.python.org/3/library/venv.html>`__ | `Замечания <https://github.com/python/cpython/issues>`__
ta: `டாக்ச் <https://docs.python.org/3/library/venv.html> __ | `சிக்கல்கள் <https://github.com/python/cpython/issues> ____ __

source: A package in the Python Standard Library (starting with Python 3.3) for creating :term:`Virtual Environments <Virtual Environment>`. For more information, see the section on :ref:`Creating and using Virtual Environments`.
eo: Pako en la Norma Biblioteko de Python (ekde Python 3.3) por krei :term:`Virtualan Medion <Virtual Environment>`. Por pli da informoj, vidu la paragrafon :ref:`Krei kaj uzi virtualajn mediojn <Creating and using Virtual Environments>`.
ja: (Python 3.3 から始まる) Python の標準ライブラリに存在する :term:`仮想環境 <Virtual Environment>` を生成するためのパッケージ。更なる情報については :ref:`仮想環境を作って使う <Creating and using Virtual Environments>` を見てください。
pt_br: Um pacote na Biblioteca Padrão do Python (começando com Python 3.3) para criar :term:`Ambientes Virtuais <Virtual Environment>`. Para obter mais informações, consulte a seção :ref:`Creating and using Virtual Environments`.
ru: Пакет в стандартной библиотеке Python (начиная с Python 3.3) для создания :term:`виртуальных сред <Virtual Environment>`. Для получения дополнительной информации см. раздел :ref:`Создание и использование виртуальных сред`.
ta: பைதான் நிலையான நூலகத்தில் ஒரு தொகுப்பு (பைதான் 3.3 உடன் தொடங்கி) உருவாக்க: கால: `மெய்நிகர் சூழல்கள் <மெய்நிகர் சூழல்>`. மேலும் தகவலுக்கு, பகுதியைப் பார்க்கவும்: ref: `மெய்நிகர் சூழல்களை உருவாக்குதல் மற்றும் பயன்படுத்துதல்`.

source: News
eo: Novaĵoj
ja: ニュース
pt_br: Notícias
ru: Новости
ta: செய்தி

source: This document is not currently updated. Previously, the document highlighted changes in Python packaging.
eo: Ĉi tiu dokumento estas ne plu ĝisdatigata. Antaŭe, ĝi reliefigis ŝanĝojn pri Python-pakado.
ja: この文書は現在では更新されていません。以前は、Python パッケージングでの変更点をハイライトしていました。
pt_br: Este documento não está atualizado. Anteriormente, o documento realçava as mudanças no empacotamento do Python.
ru: В настоящее время этот документ не обновляется. Ранее в этом документе освещались изменения в упаковке Python.
ta: இந்த ஆவணம் தற்போது புதுப்பிக்கப்படவில்லை. முன்னதாக, ஆவணம் பைதான் பேக்கேசிங்கில் ஏற்படும் மாற்றங்களை எடுத்துக்காட்டுகிறது.

source: September 2019
eo: Septembro 2019
ja: 2019年9月
pt_br: Setembro de 2019
ru: Сентябрь 2019
ta: செப்டம்பர் 2019

source: Added a guide about publishing dists via GitHub Actions. (:pr:`647`)
eo: Aldonis gvidilon pri eldonado de distribuoj per GitHub Actions. (:pr:`647`)
ja: GitHub Actions を経由して配布物を公開するためのガイドを追加。 (:pr:`647`)
pt_br: Adicionado um guia sobre como publicar dists por meio do GitHub Actions. (:pr:`647`)
ru: Добавлено руководство по публикации дистрибутивов через GitHub Actions. (:pr:`647`)
ta: அறிவிலிமையம் செயல்கள் வழியாக தொலைதூரங்களை வெளியிடுவது பற்றிய வழிகாட்டியைச் சேர்த்தது. (: பி.ஆர்: `647`)

source: August 2019
eo: Aŭgusto 2019
ja: 2019年8月
pt_br: Agosto de 2019
ru: Август 2019
ta: ஆகச்ட் 2019

source: Updated to use :file:`python3 -m` when installing pipx. (:pr:`631`)
eo: Ekuzis :file:`python3 -m` dum instalado de pipx. (:pr:`631`)
ja: pipx をインストールする際に :file:`python3 -m` を使うように更新。 (:pr:`631`)
pt_br: Atualizado para usar :file:`python3 -m` ao instalar pipx. (:pr:`631`)
ru: Обновлено для использования :file:`python3 -m` при установке pipx. (:pr:`631`)
ta: பயன்படுத்த புதுப்பிக்கப்பட்டது: கோப்பு: `python3 -m` PIPX ஐ நிறுவும் போது. (: பி.ஆர்: `631`)

source: July 2019
eo: Julio 2019
ja: 2019年7月
pt_br: Julho de 2019
ru: Июль 2019
ta: சூலை 2019

source: Marked all PEP numbers with the :pep: role. (:pr:`629`)
eo: Markis ĉiujn PEP-numerojn per la rolo :pep:. (:pr:`629`)
ja: すべての PEP 番号を :pep: 役割の形にした。 (:pr:`629`)
pt_br: Todos os números PEP marcados com função :pep: . (:pr:`629`)
ru: Пометили все номера PEP ролью :pep:. (:pr:`629`)
ta: அனைத்து PEP எண்களையும் குறிக்கப்பட்டுள்ளது: PEP: பங்கு. (: பி.ஆர்: `629`)

source: Upgraded Sphinx version and removed pypa.io intersphinx. (:pr:`625`)
eo: Ĝisdatigis version de Sphinx kaj forigis pypa.io intersphinx. (:pr:`625`)
ja: Sphinx のバージョンを上げ、papa.io の intersphinx を削除した。 (:pr:`625`)
pt_br: Atualizada a versão do Sphinx e removido intersphinx para pypa.io. (:pr:`625`)
ru: Обновлена версия Sphinx и удален pypa.io intersphinx. (:pr:`625`)
ta: மேம்படுத்தப்பட்ட சூரரிமாச்சிலை பதிப்பு மற்றும் அகற்றப்பட்டது pypa.io இன்டர்ச்பிங்க்ச். (: பி.ஆர்: `625`)

source: Mentioned :file:`find_namespace_packages`. (:pr:`622`)
eo: Menciis :file:`find_namespace_packages`. (:pr:`622`)
ja: :file:`find_namespace_packages` に言及した。 (:pr:`622`)
pt_br: Mencionado :file:`find_namespace_packages`. (:pr:`622`)
ru: Упоминается :file:`find_namespace_packages`. (:pr:`622`)
ta: குறிப்பிடப்பட்டுள்ளது: கோப்பு: `find_namespace_packages`. (: பி.ஆர்: `622`)

source: Updated directory layout examples for consistency. (:pr:`611`)
eo: Ĝisdatigis ekzemplojn de dosieruja aranĝo por unuformeco. (:pr:`611`)
ja: 一貫性確保のためにディレクトリ配置の例を更新した。 (:pr:`611`)
pt_br: Atualizados os exemplos de layout de diretório para consistência. (:pr:`611`)
ru: Обновлены примеры расположения каталогов для согласованности. (:pr:`611`)
ta: நிலைத்தன்மைக்கு புதுப்பிக்கப்பட்ட அடைவு தளவமைப்பு எடுத்துக்காட்டுகள். (: பி.ஆர்: `611`)

source: Updated Bandersnatch link to GitHub. (:pr:`623`)
eo: Ĝisdatigis la hiperligon por Bandersnatch al GitHub. (:pr:`623`)
ja: Bandersnatch の GitHub へのリンクを更新した。 (:pr:`623`)
pt_br: Atualizado o link do Bandersnatch para GitHub. (:pr:`623`)
ru: Обновлена ссылка Bandersnatch на GitHub. (:pr:`623`)
ta: கிட்அப்பிற்கு பேண்டர்ச்நாட்ச் இணைப்பு புதுப்பிக்கப்பட்டது. (: பி.ஆர்: `623`)

source: June 2019
eo: Junio 2019
ja: 2019年6月
pt_br: Junho de 2019
ru: Июнь 2019
ta: சூன் 2019

source: Fixed some typos. (:pr:`620`)
eo: Riparis tajperarojn. (:pr:`620`)
ja: いくつかの誤記を訂正した。 (:pr:`620`)
pt_br: Corrigidos de alguns erros de escrita. (:pr:`620`)
ru: Исправлены некоторые опечатки. (:pr:`620`)
ta: சில எழுத்துப்பிழைகள் சரி செய்யப்பட்டன. (: பி.ஆர்: `620`)

source: May 2019
eo: Majo 2019
ja: 2019年5月
pt_br: Maio de 2019
ru: Май 2019
ta: மே 2019

source: Added :file:`python_requires` usage to packaging tutorial. (:pr:`613`)
eo: Klarigis uzadon de :file:`python_requires` en lernilo pri pakado. (:pr:`613`)
ja: :file:`python_requires` の使い方をパッケージングチュートリアルに追記した。 (:pr:`613`)
pt_br: Adicionado o uso de :file:`python_requires` ao tutorial de empacotamento. (:pr:`613`)
ru: В учебник по упаковке добавлено использование :file:`python_requires`. (:pr:`613`)
ta: சேர்க்கப்பட்டது: கோப்பு: பேக்கேசிங் டுடோரியலுக்கான பயன்பாடு `பைதான்_ரொக்வைர்ச். (: பி.ஆர்: `613`)

source: Added a MANIFEST.in guide page. (:pr:`609`)
eo: Aldonis gvidan paĝon pri MANIFEST.in. (:pr:`609`)
ja: MANIFEST.in について説明するページを追加した。 (:pr:`609`)
pt_br: Adicionada uma página de guia sobre MANIFEST.in. (:pr:`609`)
ru: Добавлена страница руководства MANIFEST.in. (:pr:`609`)
ta: ஒரு manifest.in வழிகாட்டி பக்கத்தைச் சேர்த்தது. (: பி.ஆர்: `609`)

source: April 2019
eo: Aprilo 2019
ja: 2019年4月
pt_br: Abril de 2019
ru: Апрель 2019
ta: ஏப்ரல் 2019

source: Added a mention for :file:`shiv` in the key projects section. (:pr:`608`)
eo: Menciis :file:`shiv` en la listo de ĉefprojektoj. (:pr:`608`)
ja: :file:`shiv` への言及を嗅ぎとなるプロジェクト群の節に追加した。 (:pr:`608`)
pt_br: Adicionada uma menção para :file:`shiv` na seção de projetos-chave. (:pr:`608`)
ru: Добавлено упоминание о :file:`shiv` в разделе ключевых проектов. (:pr:`608`)
ta: இதற்கான குறிப்பைச் சேர்த்தது: கோப்பு: `சிவ்` முக்கிய திட்டங்கள் பிரிவில். (: பி.ஆர்: `608`)

source: Reduced emphasis on virtualenv. (:pr:`606`)
eo: Malemfazis virtualenv. (:pr:`606`)
ja: virtualenv に関する強調を減少させた。 (:pr:`606`)
pt_br: Reduzida a ênfase em virtualenv. (:pr:`606`)
ru: Уменьшен акцент на virtualenv. (:pr:`606`)
ta: மெய்நிகர் ஈன்விக்கு முக்கியத்துவம் குறைக்கப்பட்டுள்ளது. (: பி.ஆர்: `606`)

source: March 2019
eo: Marto 2019
ja: 2019年3月
pt_br: Março de 2019
ru: Март 2019
ta: மார்ச் 2019

source: Moved single-sourcing guide version option to Python 3. (:pr:`605`)
eo: Ĝisdatigis opcion en gvidilo pri unufontigo de versio al Python 3. (:pr:`605`)
ja: 「パッケージのバージョンを１箇所で管理する」の項を Python 3 側に移した。 (:pr:`605`)
pt_br: Movida a opção de versão do guia de única fonte para Python 3. (:pr:`605`)
ru: Переместите опцию версии руководства для одиночного сорсинга в Python 3. (:pr:`605`)
ta: பைதானுக்கு ஒற்றை-மூல வழிகாட்டி பதிப்பு விருப்பத்தை நகர்த்தியது. (: Pr: `605`)

source: Covered RTD details for contributing. (:pr:`600`)
eo: Diskutis RTD-detalojn por kontribuado. (:pr:`600`)
ja: RTD の詳細について貢献方法のところでカバーした。 (:pr:`600`)
pt_br: Cobertos detalhes de RTD para contribuição. (:pr:`600`)
ru: Покрытые детали RTD для внесения вклада. (:pr:`600`)
ta: பங்களிப்பதற்கான ஆர்டிடி விவரங்கள். (: பி.ஆர்: `600`)

source: February 2019
eo: Februaro 2019
ja: 2019年2月
pt_br: Fevereiro de 2019
ru: Февраль 2019
ta: பிப்ரவரி 2019

source: Elaborate upon the differences between the tutorial and the real packaging process. (:pr:`602`)
eo: Klarigis la diferencojn inter la lernilo kaj la reala pakada procezo. (:pr:`602`)
ja: チュートリアルの内容と実際のパッケージングプロセスの間の差異について詳しく述べた。 (:pr:`602`)
pt_br: Explicada as diferenças entre o tutorial e o processo de empacotamento real. (:pr:`602`)
ru: Подробно расскажите о различиях между учебным пособием и реальным процессом упаковки. (:pr:`602`)
ta: டுடோரியலுக்கும் உண்மையான பேக்கேசிங் செயல்முறைக்கும் இடையிலான வேறுபாடுகளை விரிவாகக் கூறுங்கள். (: பி.ஆர்: `602`)

source: Added instructions to install Python CLI applications. (:pr:`594`)
eo: Aldonis instrukciojn por instali komandlinian Python-programojn. (:pr:`594`)
ja: Python の CLI アプリケーションをインストールするための指示書きを追加した。 (:pr:`594`)
pt_br: Adicionadas as instruções para instalar aplicações CLI do Python. (:pr:`594`)
ru: Добавлены инструкции по установке приложений Python CLI. (:pr:`594`)
ta: பைதான் சி.எல்.ஐ பயன்பாடுகளை நிறுவ வழிமுறைகளைச் சேர்த்தது. (: பி.ஆர்: `594`)

source: January 2019
eo: Januaro 2019
ja: 2019年1月
pt_br: Janeiro de 2019
ru: Январь 2019
ta: சனவரி 2019

source: Added :file:`--no-deps` to the packaging tutorial. (:pr:`593`)
eo: Aldonis :file:`--no-deps` al la pakada lernilo. (:pr:`593`)
ja: パッケージングチュートリアルに :file:`--no-deps` を追加した。 (:pr:`593`)
pt_br: Adicionado :file:`--no-deps` ao tutorial de empacotamento. (:pr:`593`)
ru: В учебник по упаковке добавлен :file:`--no-deps`. (:pr:`593`)
ta: சேர்க்கப்பட்டது: கோப்பு: பேக்கேசிங் டுடோரியலுக்கு `-நோ-டெப்ச்`. (: பி.ஆர்: `593`)
