Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Debian currently carries a `patch to change the default install location inside a virtual environment`__, using a few heuristics (including checking for the ``VIRTUAL_ENV`` environment variable), largely so that the directory used in a virtual environment remains ``site-packages`` and not ``dist-packages``. This does not particularly affect this proposal, because the implementation of that patch does not actually change the default ``sysconfig`` scheme, and notably does not change the result of ``sysconfig.get_path("stdlib")``.
ja: Debian は、現在、 (``VIRTUAL_ENV`` 環境変数を確認することを含む) いくつかの発見的な解法を使った `仮想環境内のデフォルトのインストール先を変更するパッチ <patch to change the default install location inside a virtual environment>`__ を入れていて、仮想環境内で使われるディレクトリが ``dist-packages`` ではなく ``site-packages`` に留まるようになっています。これは、この提案に特に影響を与えません、というのは、そのパッチの実装は、実際にはデフォルトの ``sysconfig`` スキームを変更するわけではなく、特に ``sysconfig.get_path("stdlib")`` の結果を変更しないからです。
ru: В Debian в настоящее время существует `патч, изменяющий место установки по умолчанию в виртуальном окружении`__, используя несколько эвристик (включая проверку переменной окружения ``VIRTUAL_ENV``), в основном для того, чтобы каталог, используемый в виртуальном окружении, оставался ``ite-packages``, а не ``dist-packages``. Это не особенно влияет на данное предложение, поскольку реализация этого патча фактически не изменяет схему ``sysconfig`` по умолчанию, и, в частности, не изменяет результат ``sysconfig.get_path("stdlib")``.
ta: டெபியன் தற்போது ஒரு மெய்நிகர் சூழலுக்குள் இயல்புநிலை நிறுவும் இருப்பிடத்தை மாற்ற ஒரு `பேட்சைக் கொண்டு செல்கிறார், சில ஊரிச்டிக்சைப் பயன்படுத்தி (` `மெய்நிகர்_இன்`` சுற்றுச்சூழல் மாறியைச் சரிபார்ப்பது உட்பட), பெரும்பாலும் மெய்நிகர் சூழலில் பயன்படுத்தப்படும் அடைவு `` தள-பேக்கேச்கள்`` மற்றும் `` மாவட்ட-பேக்கேச்கள்`` அல்ல. இது குறிப்பாக இந்த திட்டத்தை பாதிக்காது, ஏனென்றால் அந்த இணைப்பை செயல்படுத்துவது உண்மையில் இயல்புநிலை `` சிச்கான்ஃபிக்` திட்டத்தை மாற்றாது, குறிப்பாக `` sysconfig.get_path ("stdlib") `` இன் முடிவை மாற்றாது.

source: Fedora currently carries a `patch to change the default install location when not running inside rpmbuild`__, which they use to implement the two-system-wide-directories approach. This is conceptually the sort of hook envisioned by bpo-43976_, except implemented as a code patch to ``distutils`` instead of as a changed ``sysconfig`` scheme.
eo: Fedora nuntempe havas `flikaĵon por ŝanĝi la aprioran instalan lokon dum rulado ekster rpmbuild <patch to change the default install location when not running inside rpmbuild>`__ , kio realigas du-tutsistem-dosierujan meĥanismon. Tio estas koncepte tia hoko, kian celis bpo-43976_, krom ke ĝi estas flikaĵo sur ``distutils``, ne ŝanĝita ``sysconfig``-skemo.
ja: Fedora は、現在、`rpmbuild 内で実行しているのでなければデフォルトのインストール先を変更するパッチ <patch to change the default install location when not running inside rpmbuild>`__ を適用していて、「ふたつのシステムワイドなディレクトリ」のアプローチを使っています。これは、概念としては、 ``sysconfig`` スキームを変更するものとしてではなく ``distutils`` へのソースコードパッチとして実装されていることを除けば、 bpo-43976_ によって可視化されたある種のフックです。
ru: В настоящее время Fedora содержит `патч для изменения места установки по умолчанию, если не запущен внутри rpmbuild`__, который используется для реализации подхода с двумя системными каталогами. Концептуально это тот же крючок, что и в bpo-43976_, только реализованный в виде исправления кода к ``distutils``, а не в виде изменения схемы ``sysconfig``.
ta: ஃபெடோரா தற்போது rpmbuild`__ க்குள் இயங்காதபோது இயல்புநிலை நிறுவல் இருப்பிடத்தை மாற்ற ஒரு `பேட்சைக் கொண்டுள்ளது, அவை இரண்டு அமைப்பு அளவிலான-இயக்குநர்கள் அணுகுமுறையை செயல்படுத்த பயன்படுத்துகின்றன. மாற்றப்பட்ட `` சிச்கான்ஃபிக்`` திட்டமாக பதிலாக `` டிச்ட்டில்ச்`` ஒரு குறியீடு இணைப்பாக செயல்படுத்தப்பட்டதைத் தவிர, இது பிபிஓ -43976_ ஆல் கற்பனை செய்யப்பட்ட கொக்கி என்பது கருத்தியல் ரீதியாக உள்ளது.

source: The implementation of ``is_virtual_environment`` above, as well as the logic to load the ``EXTERNALLY-MANAGED`` file and find the error message from it, may as well get added to the standard library (``sys`` and ``sysconfig``, respectively), to centralize their implementations, but they don't need to be added yet.
ja: 上記の ``is_virtual_environment`` の実装は、 ``EXTERNALLY-MANAGED`` ファイルをロードしてそこからエラーメッセージを探す論理と同様に、実装を中央一括管理にするために標準ライブラリ (順に ``sys`` と ``sysconfig``) に追加されるかもしれませんが、まだそのようにはなっていません。
ru: Реализация ``is_virtual_environment`` выше, а также логика загрузки файла ``EXTERNALLY-MANAGED`` и поиска сообщения об ошибке из него, могут быть добавлены в стандартную библиотеку (``sys`` и ``sysconfig``, соответственно), чтобы централизовать их реализацию, но пока в этом нет необходимости.
ta: மேலே உள்ள `` is_virtual_enveronment``, அத்துடன் `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` கோப்பை ஏற்றுவதற்கும், அதிலிருந்து பிழை செய்தியைக் கண்டுபிடிப்பதற்கும் தர்க்கத்தையும் செயல்படுத்துவதும் நிலையான நூலகத்தில் சேர்க்கப்படலாம் (`sys`` மற்றும் `` sysconfig``` `முறையே), அவற்றின் செயலாக்கங்களை மையப்படுத்த, ஆனால் அவை இன்னும் சேர்க்கப்பட வேண்டியதில்லை.

source: Copyright
eo: Kopirajtoj
ja: 著作権
pt_br: Diretos autorais
ru: Авторские права
ta: பதிப்புரிமை

source: This document is placed in the public domain or under the CC0-1.0-Universal license, whichever is more permissive.
eo: Jen dokumento, kiu estas publika havaĵo aŭ sub la licenco CC0-1.0-Universal, laŭ via prefero.
ja: この説明文書は、パブリックドメインに置かれるか、または、 CC0-1.0-Universal ライセンスの下に置かれるかですが、いずれにしてもかなり寛大なものです。
ru: Этот документ размещен в общественном достоянии или под лицензией CC0-1.0-Universal, в зависимости от того, что является более разрешительным.
ta: இந்த ஆவணம் பொது களத்தில் அல்லது CC0-1.0-பல்கலைக்கழக உரிமத்தின் கீழ் வைக்கப்பட்டுள்ளது, எது மிகவும் அனுமதிக்கப்பட்டாலும்.

source: June 2022: This specification was approved through :pep:`668`.
eo: Junio 2022: Ĉi tiu specifo estis aprobita per :pep:`668`.
ja: 2022年6月: :pep:`668` を通じてこの仕様が承認されました。
ru: Июнь 2022: Эта спецификация была одобрена через :pep:`668`.
ta: சூன் 2022: இந்த விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `668`.

source: Links in the simple repository **MAY** have a ``data-yanked`` attribute which may have no value, or may have an arbitrary string as a value. The presence of a ``data-yanked`` attribute **SHOULD** be interpreted as indicating that the file pointed to by this particular link has been "Yanked", and should not generally be selected by an installer, except under specific scenarios.
eo: Hiperligo en la simpla deponejo **POVAS** havi atributon ``data-yanked``, kies valoro povas esti malplena aŭ esti ajna signoĉeno. La ĉeesto de atributo ``data-yanked`` **ESTU** interpretata kiel indiko, ke la dosiero montrata de la hiperligo estas fortirita kaj ĝenerale ne elektata de instalilo krom specifaj kondiĉoj.
ja: シンプルなリポジトリの中のリンク群は、値を持たないか任意の文字列を値に取る ``data-yanked`` アトリビュートを持っていても **構いません** 。 ``data-yanked`` アトリビュートが存在していれば、この特定のリンクによって指し示されたファイルが "ヤンクされた <Yanked>" ものだと解釈される **べきであって** 、特定のシナリオ下を除けば一般的にはインストーラによって選択されるべきものではありません。
ru: Ссылки в простом репозитории **МОГУТ** иметь атрибут ``данные-янки'', который может не иметь значения, или иметь произвольную строку в качестве значения. Наличие атрибута ``данные-янки'' **ДОЛЖНО** интерпретироваться как указание на то, что файл, на который указывает данная конкретная ссылка, был "выдернут", и не должен выбираться программой установки, за исключением особых случаев.
ta: எளிய களஞ்சியத்தில் உள்ள இணைப்புகள் ** ** ஒரு `` தரவு-யாங்கட்`` பண்புக்கூறு இருக்கலாம், இது எந்த மதிப்பும் இல்லாதிருக்கலாம், அல்லது ஒரு தன்னிச்சையான சரம் மதிப்பாக இருக்கலாம். ஒரு `` தரவு-யங்க்` பண்புக்கூறு ** இருப்பு ** இந்த குறிப்பிட்ட இணைப்பால் சுட்டிக்காட்டப்பட்ட கோப்பு "அசைக்கப்பட்டது" என்பதைக் குறிக்கிறது, மேலும் குறிப்பிட்ட காட்சிகளின் கீழ் தவிர, ஒரு நிறுவியால் பொதுவாக தேர்ந்தெடுக்கப்படக்கூடாது .

source: The value of the ``data-yanked`` attribute, if present, is an arbitrary string that represents the reason for why the file has been yanked. Tools that process the simple repository API **MAY** surface this string to end users.
eo: La valoro de la atributo ``data-yanked``, se ĝi ekzistas, estas arbitra teksto pri la kialo de la fortiro. Ilo uzanta la simplan deponejan API **POVAS** montri tiun tekston al uzanto.
ja: ``data-yanked`` アトリビュートの値は、もし値が存在するなら、そのファイルがヤンクされた理由を表現する任意の文字列です。シンプルなリポジトリ API を処理するツール類は、エンドユーザ向けにその文字列を表示しても **構いません** 。
ru: Значение атрибута ``данные выдернуты``, если он присутствует, представляет собой произвольную строку, которая отражает причину, по которой файл был выдернут. Инструменты, обрабатывающие простой API репозитория, **МОГУТ** отображать эту строку для конечных пользователей.
ta: `` டேட்டா-யாங்கட்`` பண்புக்கூறின் மதிப்பு, இருந்தால், ஒரு தன்னிச்சையான சரம், இது கோப்பு ஏன் அசைக்கப்பட்டது என்பதற்கான காரணத்தைக் குறிக்கிறது. எளிய களஞ்சிய பநிஇ ** செயலாக்கும் கருவிகள் ** இந்த சரத்தை இறுதி பயனர்களுக்கு மேற்பரப்பு செய்யலாம்.

source: The yanked attribute is not immutable once set, and may be rescinded in the future (and once rescinded, may be reset as well). Thus API users **MUST** be able to cope with a yanked file being "unyanked" (and even yanked again).
eo: La atributo ``yanked`` ne estas senŝanĝebla kaj povas malestiĝi (aŭ reestiĝi). Tial, uzanto de API **DEVAS** povi pritrakti malfortiritan (aŭ eĉ refortiritan) dosieron.
ja: ヤンクされたアトリビュートは一旦設定されると変更できないというわけではなく、将来の時点で廃止されても構いません (そして、一旦廃止されても再設定することができます) 。そういうことですので、 API ユーザは、ヤンクされたファイルが "ヤンク解除" され (さらに再びヤンクされ) ることに対処でき **なければなりません** 。
ru: Атрибут yanked не является неизменяемым после установки и может быть отменен в будущем (а после отмены может быть также сброшен). Таким образом, пользователи API **МОГУТ** быть в состоянии справиться с тем, что файл с атрибутом yanked может быть "отменен" (и даже снова отменен).
ta: யங்க் செய்யப்பட்ட பண்புக்கூறு மாறாதவுடன் மாறாதது அல்ல, எதிர்காலத்தில் ரத்து செய்யப்படலாம் (மற்றும் ரத்து செய்யப்பட்டவுடன், மீட்டமைக்கப்படலாம்). இவ்வாறு பநிஇ பயனர்கள் ** ** ஒரு அழிக்கப்பட்ட கோப்பை "ஒழுங்கற்ற" (மற்றும் மீண்டும் அசைக்கக் கூட) சமாளிக்க முடியும்.

source: Installers
eo: Instaliloj
ja: インストーラ類
ru: Установщики
ta: நிறுவிகள்

source: The desirable experience for users is that once a file is yanked, when a human being is currently trying to directly install a yanked file, that it fails as if that file had been deleted. However, when a human did that awhile ago, and now a computer is just continuing to mechanically follow the original order to install the now yanked file, then it acts as if it had not been yanked.
eo: La dezirinda sperto por uzanto estas, ke post fortiro de dosiero, kiam homo rekte provas instali fortiritan dosieron, tio malsukcesas kvazaŭ la dosiero estus forviŝita. Tamen, kiam homo faris tion antaŭtempe, kaj nun komputilo meĥanike sekvas la originalan ordon instalante la nun fortiritan dosieron, do tio funkcios kvazaŭ la dosiero ne estus fortirita.
ja: ユーザにとって望ましい経験とは、あるファイルが一旦ヤンクされたら、人間側が今まさにヤンクされたファイルを直接にインストールしようと試みている時、まるでそのファイルが削除されたかのように失敗することです。しかしながら、その人が少し前の時点で試みた場合には、今回はコンピュータが機械的にオリジナルの順序にしたがって今まさにヤンクされたファイルをインストールし、それがヤンクされたファイルなどではなかったかのように振る舞うことです。
ru: Для пользователей желательно, чтобы после удаления файла, когда человек в данный момент пытается напрямую установить удаленный файл, это происходило так, как будто файл был удален. Однако если человек сделал это некоторое время назад, а теперь компьютер просто продолжает механически следовать первоначальному приказу установить удаленный файл, то он ведет себя так, как будто он не был удален.
ta: பயனர்களுக்கு விரும்பத்தக்க பட்டறிவு என்னவென்றால், ஒரு கோப்பை அசைத்தவுடன், ஒரு மனிதர் தற்போது ஒரு கோப்பை நேரடியாக நிறுவ முயற்சிக்கும்போது, அந்தக் கோப்பு நீக்கப்பட்டதைப் போல தோல்வியடைகிறது. இருப்பினும், ஒரு மனிதர் சிறிது நேரத்திற்கு முன்பு அதைச் செய்தபோது, இப்போது ஒரு கணினி இப்போது அசைக்கப்பட்ட கோப்பை நிறுவ அசல் வரிசையை இயந்திரத்தனமாக பின்பற்றி வருகிறது, பின்னர் அது அசைக்கப்படாதது போல் செயல்படுகிறது.

source: An installer **MUST** ignore yanked releases, if the selection constraints can be satisfied with a non-yanked version, and **MAY** refuse to use a yanked release even if it means that the request cannot be satisfied at all. An implementation **SHOULD** choose a policy that follows the spirit of the intention above, and that prevents "new" dependencies on yanked releases/files.
eo: Instalilo **DEVAS** ignori fortiritan eldonon, se iu nefortirita eldono plenumas la limigojn de elektado. Instalilo **POVAS** rifuzi uzi fortiritan eldonon, eĉ se tio signifas, ke la limigoj ne estas plenumeblaj. Realigo **ELEKTU** regulojn observantajn la ĉi-supran intencon malhelpantan «novan» dependecon al foritira eldono aŭ dosiero.
ja: インストーラは、ヤンクされたバージョン以外のもので選択上の制約を満足することが可能なら、ヤンクされたリリース群を **無視しなければならず** 、要求が全く満たされないことを意味する場合でさえもヤンクされたリリースを **拒否しても構いません** 。実装では、上記の意図を汲んだポリシーで、かつ、 "新しい" 依存関係を訳されたリリースやファイルに課すことを避けポリシーを **選択するべきです** 。
ru: Программа установки **ДОЛЖНА** игнорировать выдернутые релизы, если ограничения выбора могут быть удовлетворены с помощью не выдернутой версии, и **МОЖЕТ** отказаться от использования выдернутого релиза, даже если это означает, что запрос вообще не может быть удовлетворен. Реализация **ДОЛЖНА** выбрать политику, которая следует духу вышеуказанного намерения и предотвращает "новые" зависимости от выдернутых релизов/файлов.
ta: ஒரு நிறுவி ** ** யங்க் வெளியீடுகளை புறக்கணிக்க வேண்டும், தேர்வு தடைகளை யாங்க்ட் செய்யப்படாத பதிப்பில் நிறைவு அடைய முடியும் என்றால், ** மே ** ஒரு கோரிக்கையை திருப்திப்படுத்த முடியாது என்று பொருள் இருந்தாலும் கூட ஒரு வெளியீட்டைப் பயன்படுத்த மறுக்கலாம். ஒரு செயல்படுத்தல் ** ** மேலே உள்ள நோக்கத்தின் ஆவியைப் பின்பற்றும் ஒரு கொள்கையைத் தேர்வு செய்ய வேண்டும், மேலும் இது வெளியீடுகள்/கோப்புகளை "புதிய" சார்புகளைத் தடுக்கிறது.

source: What this means is left up to the specific installer, to decide how to best fit into the overall usage of their installer. However, there are two suggested approaches to take:
eo: La instalilo determinu sian precizan konduton laŭ sia fasonado. Tamen, jen du sugestataj manieroj:
ja: これが意味するものは、特定のインストーラの全体的な使い方に一番うまく合致する方法を決定するということで、インストーラの裁量に任されています。
ru: Что это значит, решает конкретный инсталлятор, чтобы решить, как лучше всего вписать это в общее использование своего инсталлятора. Однако можно предложить два подхода:
ta: இதன் பொருள் என்னவென்றால், குறிப்பிட்ட நிறுவி வரை, அவற்றின் நிறுவியின் ஒட்டுமொத்த பயன்பாட்டிற்கு எவ்வாறு சிறப்பாக பொருந்துவது என்பதை தீர்மானிக்க. இருப்பினும், எடுக்க இரண்டு பரிந்துரைக்கப்பட்ட அணுகுமுறைகள் உள்ளன:

source: Yanked files are always ignored, unless they are the only file that matches a version specifier that "pins" to an exact version using either ``==`` (without any modifiers that make it a range, such as ``.*``) or ``===``. Matching this version specifier should otherwise be done as per :ref:`the version specifiers specification <version-specifiers>` for things like local versions, zero padding, etc.
ja: ヤンクされたファイル群は、それが (``.*`` のような範囲を構成するいかなる修正子も付いていない) ``==`` か ``===`` を使って特定のバージョンに "ピン留め" されたバージョン指定子に合致する唯一のファイルでない限り、常に無視されます。それ以外の場合、このバージョン指定子とのマッチングは、ローカルバージョン・ゼロでのパディング・その他のような事柄について :ref:`バージョン指定子仕様 <version-specifiers>` にしたがって行われるべきです。
ru: Выдернутые файлы всегда игнорируются, если только они не являются единственным файлом, соответствующим спецификатору версии, который "привязывает" к точной версии с помощью ``==`` (без каких-либо модификаторов, которые делают его диапазоном, таких как ``.*``) или ``===``. В остальном соответствие этому спецификатору версии должно выполняться согласно : ссылка:`спецификации спецификаторов версии <версия-спецификаторы>` для таких вещей, как локальные версии, нулевые подстановки и т.д.
ta: `` == `` (``.*``) அல்லது `` === `` போன்ற ஒரு வரம்பை உருவாக்கும் எந்த மாற்றிகளும் இல்லாமல், சரியான பதிப்பிற்கு "ஊசிகளை" பொருத்தும் ஒரே கோப்பாக இல்லாவிட்டால், அவை எப்போதும் புறக்கணிக்கப்படுகின்றன. இந்த பதிப்பு விவரக்குறிப்பைப் பொருத்துவது இல்லையெனில் செய்யப்பட வேண்டும்: குறிப்பு: `பதிப்பு விவரக்குறிப்புகள் விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>` உள்ளக பதிப்புகள், சுழிய திணிப்பு போன்றவற்றுக்கு.

source: Yanked files are always ignored, unless they are the only file that matches what a lock file (such as ``Pipfile.lock`` or ``poetry.lock``) specifies to be installed. In this case, a yanked file **SHOULD** not be used when creating or updating a lock file from some input file or command.
ja: ヤンクされたファイル群は、 (``Pipfile.lock`` や ``poetry.lock`` のような) ロックファイルがインストールされるべきものとして指定しているものに合致する唯一のファイル出ない限り、常に無視されます。この場合には、ヤンクされたファイルは、何らかの入力ファイルやコマンドからそのロックファイルを作成したり更新したりする場合には、 **使われるべきではありません** 。
ru: Выдернутые файлы всегда игнорируются, если только они не являются единственным файлом, который соответствует тому, что указано в файле блокировки (например, ``Pipfile.lock`` или ``poetry.lock``) для установки. В этом случае выдернутый файл **ДОЛЖЕН** не использоваться при создании или обновлении файла блокировки из какого-либо входного файла или команды.
ta: ஒரு பூட்டுக் கோப்பு (`` pipfile.lock`` அல்லது `` Poetic.lock`` போன்றவை) நிறுவப்பட வேண்டியதைக் குறிப்பிடும் ஒரே கோப்பாக இல்லாவிட்டால், அவை எப்போதும் புறக்கணிக்கப்படும். இந்த வழக்கில், சில உள்ளீட்டு கோப்பு அல்லது கட்டளையிலிருந்து பூட்டு கோப்பை உருவாக்கும்போது அல்லது புதுப்பிக்கும்போது ** ** பயன்படுத்தப்படக்கூடாது.

source: Regardless of the specific strategy that an installer chooses for deciding when to install yanked files, an installer **SHOULD** emit a warning when it does decide to install a yanked file. That warning **MAY** utilize the value of the ``data-yanked`` attribute (if it has a value) to provide more specific feedback to the user about why that file had been yanked.
ja: あるインストーラがヤンクされたファイルをいつインストールするのかを決めるにあたって、ヤンクされたファイルをインストールすると決定した時にインストーラが警告を **発出するべきです** 。そのような警告は、そのファイルがヤンクされた理由についてユーザにより詳しいフィードバックを提供するために、 (もし値があれば) ``data-yanked`` アトリビュートの値を **使っても構いません** 。
ru: Независимо от конкретной стратегии, которую выбирает программа установки для принятия решения об установке выдернутых файлов, программа установки **ДОЛЖНА** выдавать предупреждение, когда она принимает решение об установке выдернутого файла. Это предупреждение **МОЖЕТ** использовать значение атрибута ``данные выдернуты'' (если он имеет значение), чтобы предоставить пользователю более конкретную информацию о том, почему этот файл был выдернут.
ta: யங்க் செய்யப்பட்ட கோப்புகளை எப்போது நிறுவ வேண்டும் என்பதை தீர்மானிக்க ஒரு நிறுவி தேர்வு செய்யும் குறிப்பிட்ட மூலோபாயத்தைப் பொருட்படுத்தாமல், ஒரு நிறுவி ** ** ஒரு எச்சரிக்கையை நிறுவ முடிவு செய்யும் போது எச்சரிக்கையை வெளியிட வேண்டும். அந்த எச்சரிக்கை ** ** அந்தக் கோப்பு ஏன் அசைக்கப்பட்டது என்பது குறித்து பயனருக்கு இன்னும் குறிப்பிட்ட கருத்துக்களை வழங்க `` தரவு-யாங்கட்`` பண்புக்கூறின் (அதற்கு மதிப்பு இருந்தால்) மதிப்பைப் பயன்படுத்தலாம்.

source: Mirrors
eo: Speguloj
ja: ミラー
ru: Зеркала
ta: கண்ணாடிகள்

source: Mirrors can generally treat yanked files one of two ways:
eo: Spegulo povas ĝenerale pritrakti fortiritajn dosierojn laŭ unu el la jenaj du manieroj:
ja: ミラーは、ヤンクされたファイルを次の二つの方法のうちの一つで扱います:
ru: Как правило, зеркала можно обрабатывать одним из двух способов:
ta: கண்ணாடிகள் பொதுவாக இரண்டு வழிகளில் ஒன்றான கோப்புகளை நடத்தலாம்:

source: They may choose to omit them from their simple repository API completely, providing a view over the repository that shows only "active", unyanked files.
eo: Ĝi povas simple plene ignori ilin en la simpla deponeja API, provizante vidon de la deponejo nur de «aktivaj», nefortiritaj dosieroj.
ja: "アクティブ" なヤンクされたものではないファイル群だけを見せるリポジトリのビューを提供して、シンプルなリポジトリ API から (ヤンクされたファイル群を) 完全に排除する選択をしても構いません。
ru: Они могут полностью исключить их из своего простого API репозитория, предоставляя представление репозитория, в котором отображаются только "активные", незаанкетированные файлы.
ta: அவர்கள் தங்கள் எளிய களஞ்சிய பநிஇ இருந்து முற்றிலும் தவிர்க்க தேர்வு செய்யலாம், இது "செயலில்", இணைக்கப்படாத கோப்புகளை மட்டுமே காட்டும் களஞ்சியத்தின் மீது ஒரு பார்வையை வழங்குகிறது.

source: They may choose to include yanked files, and additionally mirror the ``data-yanked`` attribute as well.
eo: Ĝi povas inkluzivi fortiritajn dosierojn kaj ankaŭ speguli la atributon ``data-yanked``.
ja: ヤンクされたファイルも表示するとともに、 ``data-yanked`` アトリビュートをもミラーするという選択をしても構いません。
ru: Они могут выбрать включение выдернутых файлов и дополнительно отразить атрибут ``данные выдернуты``.
ta: அவர்கள் யங்க் செய்யப்பட்ட கோப்புகளைச் சேர்க்க தேர்வு செய்யலாம், மேலும் கூடுதலாக `` தரவு-யாங்கட்`` பண்புகளையும் பிரதிபலிக்கலாம்.

source: Mirrors **MUST NOT** mirror a yanked file without also mirroring the ``data-yanked`` attribute for it.
eo: Speguloj **DEVAS NE** speguli fortiritan dosieron sen spegulado de la atributo ``data-yanked`` pri ĝi.
ja: ミラーは、 ``data-yanked`` アトリビュートを同時にミラーするのでなければヤンクされたファイルを **ミラーしてはいけません** 。
ru: Зеркала **МОГУТ НЕ** зеркалировать выдернутый файл, не зеркалируя также атрибут ``данные выдернуты`` для него.
ta: கண்ணாடிகள் ** ** அதற்கான `` டேட்டா-யாங்கட்`` பண்புக்கூறையும் பிரதிபலிக்காமல் ஒரு அழிந்த கோப்பை பிரதிபலிக்கக்கூடாது.

source: Alphanumeric characters, underscores (``_``), hyphens (``-``) and dots (``.``) MUST be matched verbatim.
eo: Literoj, ciferoj, substrekoj (``_``), streketoj (``-``) kaj punktoj (``.``) DEVAS prezenti sin laŭlitere.
ru: Буквенно-цифровые символы, подчеркивания (``_``), дефисы (``-``) и точки (``.``) ДОЛЖНЫ совпадать дословно.
ta: எண்ணெழுத்து எழுத்துக்கள், அடிக்கோடிட்டு (`` _``), ஐபன்கள் (`` -``) மற்றும் புள்ளிகள் (`` .``) ஆகியவை சொற்களஞ்சியத்துடன் பொருந்த வேண்டும்.

source: Special glob characters: ``*``, ``?``, ``**`` and character ranges: ``[]`` containing only the verbatim matched characters MUST be supported. Within ``[...]``, the hyphen indicates a locale-agnostic range (e.g. ``a-z``, order based on Unicode code points). Hyphens at the start or end are matched literally.
ru: Специальные символы глобуса: ``*``, ``?``, ``**`` и диапазоны символов: ``[...]``, содержащие только дословные совпадающие символы, ДОЛЖНЫ поддерживаться. Внутри ``[...]`` дефис указывает на диапазон, не зависящий от локали (например, ``a-z``, порядок основан на кодовых точках Unicode). Дефисы в начале или в конце совпадают буквально.
ta: சிறப்பு குளோப் எழுத்துக்கள்: ``*``, ``? `` [...] `` க்குள், ஐபன் ஒரு லோகேல்-அஞ்ஞான வரம்பைக் குறிக்கிறது (எ.கா. `` a-z``, யூனிகோட் குறியீடு புள்ளிகளின் அடிப்படையில் ஆர்டர்). தொடக்க அல்லது முடிவில் ஐபன்கள் உண்மையில் பொருந்துகின்றன.

source: Parent directory indicators (``..``) MUST NOT be used.
eo: Indikilo de patra dosierujo (``..``) DEVAS esti NE uzita.
ru: Индикаторы родительского каталога (``..``) НЕ ДОЛЖНЫ использоваться.
ta: பெற்றோர் அடைவு குறிகாட்டிகள் (`` ..``) பயன்படுத்தப்படக்கூடாது.

source: Literal paths (e.g. :file:`LICENSE`) are valid globs which means they can also be defined.
eo: Eksplicita dosierloko (ekz. :file:`LICENSE`) estas valida patroneo, kio signifas ke ĝi estas difinebla.
ru: Буквальные пути (например, :file:`LICENSE`) являются допустимыми глобусами, что означает, что они также могут быть определены.
ta: நேரடி பாதைகள் (எ.கா.: கோப்பு: `உரிமம்`) செல்லுபடியாகும் குளோப்கள், அதாவது அவை வரையறுக்கப்படலாம்.

source: MUST treat each value as a glob pattern, and MUST raise an error if the pattern contains invalid glob syntax.
eo: DEVAS pritrakti ĉiun valoron kiel patroneon kaj DEVAS sciigi eraron, se la patroneo enhavas nevalidan patronean sintakson.
ru: ДОЛЖНО рассматривать каждое значение как шаблон glob, и ДОЛЖНО выдать ошибку, если шаблон содержит неверный синтаксис glob.
ta: ஒவ்வொரு மதிப்பையும் ஒரு குளோப் வடிவமாகக் கருத வேண்டும், மேலும் வடிவத்தில் தவறான குளோப் தொடரியல் இருந்தால் பிழையை உயர்த்த வேண்டும்.

source: MUST raise an error if any individual user-specified pattern does not match at least one file.
eo: DEVAS sciigi eraron, se iu uzanto-specifita patroneo ne kongruas kun minimume unu dosiero.
ru: ДОЛЖНА вызывать ошибку, если любой отдельный шаблон, указанный пользователем, не соответствует хотя бы одному файлу.
ta: எந்தவொரு தனிப்பட்ட பயனர் குறிப்பிட்ட வடிவமும் குறைந்தது ஒரு கோப்பில் பொருந்தவில்லை என்றால் பிழையை உயர்த்த வேண்டும்.

source: PyPA specifications
eo: PyPA-specifoj
ja: PyPA 仕様
pt_br: Especificações do PyPA
ru: Спецификации PyPA
ta: PYPA விவரக்குறிப்புகள்
