Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: poetry is a command-line tool to handle dependency installation and isolation as well as building and packaging of Python packages. It uses ``pyproject.toml`` and, instead of depending on the resolver functionality within :ref:`pip`, provides its own dependency resolver. It attempts to speed users' experience of installation and dependency resolution by locally caching metadata about dependencies.
eo: poezio estas komandlinia ilo por instali dependecojn kaj por izoli, kaj ankaŭ por konstrui kaj paki Python-pakojn. Ĝi uzas ``pyproject.toml`` kaj (ne uzante la solvilon de :ref:`pip`) provizas sian propran dependeco-solvilon. Ĝi provas rapidigi la sperton de uzantoj pri instalado kaj solvado de dependecoj, loke enkaŝmemorigante metadatenojn pri dependecoj.
ja: poetry は、 Python パッケージのビルドやパッケージングに加えて、依存先のインストールや隔離を取り扱うコマンドラインのツールです。 :ref:`pip` に含まれる解決機能に依存する代わりに ``pyproject.toml`` を使って自分自身の依存関係解決機能を提供します。依存関係に関するメタデータをローカルにキャッシュすることでインストールや依存関係解決のユーザ体験を高速化しようとしています。
pt_br: poetry é uma ferramenta de linha de comando para lidar com a instalação de dependências e isolamento, bem como construção e empacotamento de pacotes Python. Ele usa ``pyproject.toml`` e, ao invés de depender da funcionalidade do resolvedor no :ref:`pip`, fornece seu próprio resolvedor de dependências. Ele tenta acelerar a experiência dos usuários de instalação e resolução de dependências, armazenando localmente em cache os metadados sobre as dependências.
ru: poetry - это инструмент командной строки для установки и изоляции зависимостей, а также сборки и упаковки пакетов Python. Он использует ``pyproject.toml`` и, вместо того, чтобы зависеть от функциональности разрешителя в :ref:`pip``, предоставляет свой собственный разрешитель зависимостей. Он пытается ускорить процесс установки и разрешения зависимостей, локально кэшируя метаданные о зависимостях.
ta: பா என்பது சார்பு நிறுவல் மற்றும் தனிமைப்படுத்தல் மற்றும் பைதான் தொகுப்புகளை கட்டியெழுப்புதல் மற்றும் பேக்கேசிங் ஆகியவற்றைக் கையாள ஒரு கட்டளை-வரி கருவியாகும். இது `` pyproject.toml`` ஐப் பயன்படுத்துகிறது, மேலும், தீர்க்கும் செயல்பாட்டைப் பொறுத்து: ref: `PIP`, அதன் சொந்த சார்பு தீர்வை வழங்குகிறது. சார்புகளைப் பற்றி உள்நாட்டில் கேச்சிங் மேனிலை தரவு மூலம் பயனர்களின் நிறுவல் மற்றும் சார்பு தீர்மானத்தை விரைவுபடுத்த முயற்சிக்கிறது.

source: proxpi
ta: ப்ராக்ச்பி

source: proxpi is a simple :term:`package index <Package Index>` which proxies PyPI and other indexes with caching.
eo: proxpi estas simpla :term:`pakindekso <Package Index>`, kiu peras PyPI kaj aliajn indeksojn kun kaŝmemoro.
ja: proxpi は、PyPI や他のインデックスをキャッシュ付きでプロクシする単純な :term:`パッケージインデックス <Package Index>` です。
ru: proxpi - это простой : термин:`индекс пакетов <Индекс пакетов>`, который проксирует PyPI и другие индексы с кэшированием.
ta: ப்ராக்ச்பி ஒரு எளிய: சொல்: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` இது பைபி மற்றும் பிற குறியீடுகளை கேச்சிங் மூலம் பிரதிநிதித்துவப்படுத்துகிறது.

source: Pulp-python
ta: கூழ்-பின்னான்

source: `Docs <https://docs.pulpproject.org/pulp_python/>`__ | :gh:`GitHub <pulp/pulp_python>` | `PyPI <https://pypi.org/project/pulp-python/>`__
eo: `Dokumentaro <https://docs.pulpproject.org/pulp_python/>`__ | :gh:`GitHub <pulp/pulp_python>` | `PyPI <https://pypi.org/project/pulp-python/>`__
ja: `説明文書 <https://docs.pulpproject.org/pulp_python/>`__ | :gh:`GitHub <pulp/pulp_python>` | `PyPI <https://pypi.org/project/pulp-python/>`__
ru: `Документация <https://docs.pulpproject.org/pulp_python/>`__ | :gh:`GitHub <pulp/pulp_python>` | `PyPI <https://pypi.org/project/pulp-python/>`__.
ta: `டாக்ச் <https://docs.pulpproject.org/pulp_python/> __ | :gh:`GitHub <pulp/pulp_python>` | `Pypi <https://pypi.org/project/pulp-python/> __ __ __

source: Pulp-python is the Python :term:`package index <Package Index>` plugin for `Pulp <https://pulpproject.org/>`_. Pulp-python supports mirrors backed by local or `AWS S3`_, package upload, and proxying to multiple package indexes.
eo: Pulp-python estas la Python-a :term:`pakindeksa <Package Index>` kromprogramo por `Pulp <https://pulpproject.org/>`_. Pulp-python subtenas spegulon bazitan sur lokaj dosieroj aŭ `AWS S3`_, alŝutadon de pakoj, kaj peradon al pluraj pakindeksoj.
ja: Pulp-python は、 `Pulp <https://pulpproject.org/>` 向けの Python :term:`パッケージインデックス <Package Index>` プラグインです。 Pulp-python は、ローカルか `AWS S3`_ にファイルを置くミラー機能や、複数のパッケージインデックスへのプロクシ機能をサポートします。
ru: Pulp-python - это плагин Python : термин:`пакетный индекс <Пакетный индекс>` для `Pulp <https://pulpproject.org/>`_. Pulp-python поддерживает зеркала, поддерживаемые локальным или `AWS S3`_, загрузку пакетов и проксирование к нескольким индексам пакетов.
ta: கூழ்-பைதான் பைதான்: சொல்: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` கூழ் <https://pulpproject.org/> _ _ க்கான சொருகி. புல்ப்-பைதான் உள்ளக அல்லது `AWS S3`_, தொகுப்பு பதிவேற்றம் மற்றும் பல தொகுப்பு குறியீடுகளுக்கு ப்ராக்சிங் ஆகியவற்றின் ஆதரவுடன் கண்ணாடியை ஆதரிக்கிறது.

source: PyPI Cloud
ja: PyPI クラウド
ru: Облако PyPI
ta: பைபி முகில்

source: `Docs <https://pypicloud.readthedocs.io/>`__ | :gh:`GitHub <stevearc/pypicloud>` | `PyPI <https://pypi.org/project/pypicloud/>`__
eo: `Dokumentaro <https://pypicloud.readthedocs.io/>`__ | :gh:`GitHub <stevearc/pypicloud>` | `PyPI <https://pypi.org/project/pypicloud/>`__
ja: `説明文書 <https://pypicloud.readthedocs.io/>`__ | :gh:`GitHub <stevearc/pypicloud>` | `PyPI <https://pypi.org/project/pypicloud/>`__
ru: `Документация <https://pypicloud.readthedocs.io/>`__ | :gh:`GitHub <stevearc/pypicloud>` | `PyPI <https://pypi.org/project/pypicloud/>`__.
ta: `டாக்ச் <htttps: //pypicu.se.here/> \ ______________. : \ ght: `github <steavearc/pypicud> `Pypi <htttps: /pypi.org/pypicu/pypicuray/> pypicloud/>` ____

source: PyPI Cloud is a :term:`package index <Package Index>` server, backed by `AWS S3`_ or another cloud storage service, or local files. PyPI Cloud supports redirect/cached proxying for PyPI, as well as authentication and authorisation.
eo: PyPI Cloud estas :term:`pakindeksa <Package Index>` servilo uzanta `AWS S3`_ aŭ alian nubkonservejan servon aŭ lokajn dosierojn. PyPI Cloud subtenas redirektadon kaj kaŝmemoran peradon al PyPI, aŭtentikigon kaj rajtigon.
ja: PyPI クラウドは、`AWS S3`_ や他のクラウドストレージサービス、あるいはローカルのファイル群で裏打ちされた :term:`パッケージインデックス <Package Index>` です。PyPI クラウドは、認証や認可と同様に PyPI に対するリダイレクト機能やプロクシ機能をサポートします。
ru: PyPI Облако - это : термин:`индекс пакетов <Индекс пакетов>` сервер, поддерживающий `AWS S3`_ или другой облачный сервис хранения, или локальные файлы. PyPI Облако поддерживает перенаправление/кэширование прокси для PyPI, а также аутентификацию и авторизацию.
ta: PYPI முகில் ஒரு: கால: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` சேவையகம், `AWS S3`_ அல்லது மற்றொரு முகில் ச்டோரேச் பணி அல்லது உள்ளக கோப்புகளால் ஆதரிக்கப்படுகிறது. PYPI முகில் PYPI க்கான வழிமாற்ற/தற்காலிக சேமிப்பு ப்ராக்சை ஆதரிக்கிறது, அத்துடன் ஏற்பு மற்றும் அங்கீகாரத்தை ஆதரிக்கிறது.

source: :gh:`GitHub <helpshift/pypiprivate>` | `PyPI <https://pypi.org/project/pypiprivate/>`__
ta: : சி.எச்: `கிதுப் <எல்ப்சிஃப்ட்/பைபிப்ரிவேட்>` | `Pypi <https://pypi.org/project/pypiprivate/> ____ __

source: pypiprivate serves a local (or `AWS S3`_-hosted) directory of packages as a :term:`package index <Package Index>`.
eo: pypiprivate serves lokan (aŭ ĉe `AWS S3`_ gastigitan) dosierujon da pakoj kiel :term:`pakindekso <Package Index>`.
ja: pypiprivate は、 :term:`パッケージインデックス <Package Index>` としてローカルの (または `AWS S3`_ でホストされた) パッケージディレクトリを提供します。
ru: pypiprivate обслуживает локальную (или размещенную на `AWS S3`_ директорию пакетов как : термин:`пакетный индекс <Пакетный индекс>`.
ta: Pypiprivate தொகுப்புகளின் உள்ளக (அல்லது `AWS S3`_- ஓச்ட்) கோப்பகத்தை A: கால:` தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு> `.

source: pypiserver
ta: பைபர்வர்

source: pypiserver is a minimalist application that serves as a private Python :term:`package index <Package Index>` (from a local directory) within organizations, implementing a simple API and browser interface. You can upload private packages using standard upload tools, and users can download and install them with :ref:`pip`, without publishing them publicly. Organizations who use pypiserver usually download packages both from pypiserver and from PyPI.
eo: pypiserver estas minimumisma programo servanta privantan :term:`Python-pakindekson <Package Index>` (el loka dosierujo) por organizaĵo, realiganta simplan API kaj TTT-legilan fasadon. Oni povas alŝuti privatan pakon per norma alŝutilo, uzanto povas elŝuti kaj instali pakon per :ref:`pip`, sen publika eldonado. Organizaĵo uzanta pypiserver kutime elŝutas pakojn el kaj pypiserver kaj PyPI.
ja: pypiserver は、単純な API とブラウザ向けのインタフェイスだけを実装した (ローカルディレクトリ上の) 組織内部向けプライベート Python :term:`パッケージインデックス <Package Index>` として振る舞う「小さいことは良いことだ」主義者のアプリケーションです。公衆向けに公開することなく標準のツールを使って外部非公開のパッケージをアップロードすることもできますし、それを `pip` でダウンロード・インストールすることもできます。 pypiserver を用いる組織では、通常は pypiserver と PyPI の両方からパッケージをダウンロードします。
ru: pypiserver - это минималистичное приложение, которое служит в качестве частного Python : термин:`индекс пакетов <Пакетный индекс>` (из локальной директории) в организациях, реализуя простой API и интерфейс браузера. Вы можете загружать частные пакеты с помощью стандартных инструментов загрузки, а пользователи могут скачивать и устанавливать их с помощью : ссылка:`pip`, не публикуя их публично. Организации, использующие pypiserver, обычно загружают пакеты как с pypiserver, так и с PyPI.
ta: பைபிசெவர் என்பது ஒரு தனியார் பைதானாக செயல்படும் ஒரு குறைந்தபட்ச பயன்பாடாகும்: கால: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` (உள்ளூர் கோப்பகத்திலிருந்து) நிறுவனங்களுக்குள், ஒரு எளிய பநிஇ மற்றும் உலாவி இடைமுகத்தை செயல்படுத்துகிறது. நிலையான பதிவேற்ற கருவிகளைப் பயன்படுத்தி நீங்கள் தனிப்பட்ட தொகுப்புகளை பதிவேற்றலாம், மேலும் பயனர்கள் அவற்றை பதிவிறக்கம் செய்து நிறுவலாம்: Ref: `Pip`, அவற்றை பகிரங்கமாக வெளியிடாமல். பைபிசெவரைப் பயன்படுத்தும் நிறுவனங்கள் பொதுவாக பைபிசெவரிலிருந்து மற்றும் பைபி ஆகிய இரண்டிலிருந்தும் தொகுப்புகளைப் பதிவிறக்குகின்றன.

source: PyScaffold
ta: PysCaplold

source: `Docs <https://pyscaffold.org>`__ | `GitHub <https://github.com/pyscaffold/pyscaffold>`__ | `PyPI <https://pypi.org/project/pyscaffold/>`__
eo: `Dokumentaro <https://pyscaffold.org>`__ | `GitHub <https://github.com/pyscaffold/pyscaffold>`__ | `PyPI <https://pypi.org/project/pyscaffold/>`__
ja: `説明文書 <https://pyscaffold.org>`__ | `GitHub <https://github.com/pyscaffold/pyscaffold>`__ | `PyPI <https://pypi.org/project/pyscaffold/>`__
pt_br: `Documentação <https://pyscaffold.org>`__ | `GitHub <https://github.com/pyscaffold/pyscaffold>`__ | `PyPI <https://pypi.org/project/pyscaffold/>`__
ru: `Документы <https://pyscaffold.org>`__ | `GitHub <https://github.com/pyscaffold/pyscaffold>`__ | `PyPI <https://pypi.org/project/pyscaffold/>`__
ta: `டாக்ச் <https://pyscaptord.org>` __ | `Github <https://github.com/pyscaplold/pyscaplold>` __ | `Pypi <https://pypi.org/project/pyscaplold/> ____ __

source: PyScaffold is a project generator for bootstrapping Python packages, ready to be shared on PyPI and installable via :ref:`pip`. It relies on a set of sane default configurations for established tools (such as :ref:`setuptools`, pytest_ and Sphinx_) to provide a productive environment so developers can start coding right away. PyScaffold can also be used with existing projects to make packaging easier.
ja: PyScaffold は、Python パッケージが PyPI で共有できて :ref:`pip` でインストールできるように初期設定を行うプロジェクトジェネレータです。定評のあるツール (:ref:`setuptools` や pytest_ や Sphinx_) 用に穏当なデフォルト設定を与えることで、開発者がすぐにコードを書き始められるような生産的な環境を提供します。 PyScaffold は、また、既存のプロジェクトにおいてもパッケージングをより簡単にするために使用することができます。
pt_br: PyScaffold é um gerador de projeto para inicialização de pacotes Python, pronto para ser compartilhado no PyPI e instalável via :ref:`pip`. Ele se baseia em um conjunto de configurações padrão sãs para ferramentas estabelecidas (como o :ref:`setuptools`, pytest_ e Sphinx_) para fornecer um ambiente produtivo para que os desenvolvedores possam começar a codificar imediatamente. PyScaffold também pode ser usado com projetos existentes para tornar o empacotamento mais fácil.
ru: PyScaffold - это генератор проектов для создания загрузочных пакетов Python, готовых к распространению на PyPI и установке через :ref:`pip`. Он опирается на набор разумных конфигураций по умолчанию для установленных инструментов (таких как :ref:`setuptools`, pytest_ и Sphinx_) для создания продуктивной среды, чтобы разработчики могли сразу же приступить к написанию кода. PyScaffold также можно использовать с существующими проектами, чтобы упростить их упаковку.
ta: பைதான் தொகுப்புகளுக்கான திட்ட செனரேட்டர் பைதான் தொகுப்புகளுக்கான திட்ட செனரேட்டர் ஆகும், இது பைபியில் பகிரத் தயாராக உள்ளது மற்றும் வழியாக நிறுவக்கூடியது: குறிப்பு: `பிப்`. இது ஒரு விளைவாக்கம் சூழலை வழங்குவதற்காக நிறுவப்பட்ட கருவிகளுக்கான விவேகமான இயல்புநிலை உள்ளமைவுகளின் தொகுப்பை நம்பியுள்ளது (போன்றவை: ref: `setuptools`, pytest_ மற்றும் sphinx_), எனவே உருவாக்குபவர்கள் இப்போதே குறியீட்டு முறையைத் தொடங்கலாம். பேக்கேசிங்கை எளிதாக்குவதற்கு பைச்கோகால்ட் ஏற்கனவே உள்ள திட்டங்களுடன் பயன்படுத்தப்படலாம்.

source: pywharf
ta: பைவார்

source: pywharf is a :term:`package index <Package Index>` server, serving files locally or from `GitHub <https://github.com/>`_.
eo: pywharf estas :term:`pakindeksa <Package Index>` servilo, servanta dosierojn loke aŭ el `GitHub <https://github.com/>`_.
ja: pywharf は、ローカルから、もしくは `GitHub <https://github.com/>`_ からファイルを提供する :term:`パッケージインデックス <Package Index>` です。
ru: pywharf - это сервер : термин:`пакетный индекс <Пакетный индекс>`, обслуживающий файлы локально или с `GitHub <https://github.com/>`_.
ta: Pywharf என்பது ஒரு: சொல்: `தொகுப்பு அட்டவணை <தொகுப்பு குறியீட்டு>` சேவையகம், உள்நாட்டில் அல்லது `github <https://github.com/> _ _.

source: scikit-build
ta: சிக்கிட்-கட்டிடம்

source: `Docs <https://scikit-build.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build/>`__ | `PyPI <https://pypi.org/project/scikit-build>`__
eo: `Dokumentaro <https://scikit-build.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build/>`__ | `PyPI <https://pypi.org/project/scikit-build>`__
ja: `説明文書 <https://scikit-build.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build/>`__ | `PyPI <https://pypi.org/project/scikit-build>`__
pt_br: `Documentação <https://scikit-build.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build/>`__ | `PyPI <https://pypi.org/project/scikit-build>`__
ru: `Документы <https://scikit-build.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build/>`__ | `PyPI <https://pypi.org/project/scikit-build>`__
ta: `டாக்ச் <https://scikit-build.readthedocs.io/en/latest/>` __ | `Github <https://github.com/scikit-build/scikit-build/>` __ | `Pypi <https://pypi.org/project/cikit-build>` __

source: Scikit-build is a :ref:`setuptools` wrapper for CPython that builds C/C++/Fortran/Cython extensions It uses `cmake <https://pypi.org/project/cmake>`__ (available on PyPI) to provide better support for additional compilers, build systems, cross compilation, and locating dependencies and their associated build requirements. To speed up and parallelize the build of large projects, the user can install `ninja <https://pypi.org/project/ninja>`__ (also available on PyPI).
eo: Scikit-build estas volvilo de :ref:`setuptools` por CPython konstruanta C/C++/Fortran/Cython-etendaĵojn. Ĝi uzas `cmake <https://pypi.org/project/cmake>`__ (haveblan ĉe PyPI) por pli bone subteni pliajn tradukilojn, konstrusistemojn, intertradukadon, kaj lokigado de dependecoj kaj rilataj konstruo-postuloj. Por rapidigi kaj paraleligi konstruadon de granda projekto, oni povas instali `ninja <https://pypi.org/project/ninja>`__ (ankaŭ haveblan ĉe PyPI).
ja: Scikit-build は、C/C++/Fortran/Cython で書かれた拡張をビルドする CPython のための :ref:`setuptools` ラッパです。追加のコンパイラやビルドシステムやクロスコンパイルに対するより良いサポートを提供するため、また、関連するビルドで要求されるライブラリなど <build requirements> の位置を特定するために `cmake <https://pypi.org/project/cmake>`__ (PyPI にあります) を使用します。大きなプロジェクトのビルドの速度を増したり並列化したりするために、ユーザは `ninja <https://pypi.org/project/ninja>`___ (これも PyPI にあります) をインストールすることができます。
pt_br: Scikit-build é um wrapper do :ref:`setuptools` para CPython que constrói extensões C/C++/Fortran/Cython. Ele usa `cmake <https://pypi.org/project/cmake>`__ (disponível em PyPI) para fornecer melhor suporte para compiladores adicionais, sistemas de construção, compilação cruzada e localização de dependências e seus requisitos de compilação associados. Para acelerar e paralelizar a construção de grandes projetos, o usuário pode instalar `ninja <https://pypi.org/project/ninja>`__ (também disponível em PyPI).
ru: Scikit-build - это :ref:`setuptools` обертка для CPython, которая собирает расширения C/C++/Fortran/Cython. Она использует `cmake <https://pypi.org/project/cmake>`__ (доступен на PyPI) для обеспечения лучшей поддержки дополнительных компиляторов, систем сборки, кросс-компиляции, а также поиска зависимостей и связанных с ними требований к сборке. Для ускорения и распараллеливания сборки больших проектов пользователь может установить `ninja <https://pypi.org/project/ninja>`__ (также доступен на PyPI).
ta: ச்கிகிட்-பில்ட் ஒரு: ref: `செடிப்டூல்ச்` சிபிதானுக்கான ரேப்பர் சி/சி ++/ஃபோர்ட்ரான்/சைடான் நீட்டிப்புகளை உருவாக்குகிறது, இது` cmake <https://pypi.org/project/cmake> __ (பைபி இல் கிடைக்கிறது) கூடுதல் கம்பைலர்கள், உருவாக்க அமைப்புகள், குறுக்கு தொகுப்பு மற்றும் சார்புகளைக் கண்டறிதல் மற்றும் அவற்றுடன் தொடர்புடைய கட்டடத் தேவைகளுக்கு சிறந்த உதவி. பெரிய திட்டங்களின் கட்டமைப்பை விரைவுபடுத்தவும் இணையாகவும், பயனர் `நிஞ்சா <https://pypi.org/project/ninja> __ (பைபியில் கிடைக்கிறது) நிறுவலாம்.

source: scikit-build-core
ta: ச்கிகிட்-பில்ட்-கோர்

source: `Docs <https://scikit-build-core.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build-core/>`__ | `PyPI <https://pypi.org/project/scikit-build-core>`__
eo: `Dokumentaro <https://scikit-build-core.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build-core/>`__ | `PyPI <https://pypi.org/project/scikit-build-core>`__
ja: `説明文書 <https://scikit-build-core.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build-core/>`__ | `PyPI <https://pypi.org/project/scikit-build-core>`__
pt_br: `Documentação <https://scikit-build-core.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build-core/>`__ | `PyPI <https://pypi.org/project/scikit-build-core>`__
ru: `Документы <https://scikit-build-core.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/scikit-build/scikit-build-core/>`__ | `PyPI <https://pypi.org/project/scikit-build-core>`__
ta: `டாக்ச் <https://scikit-build-core.readthedocs.io/en/latest/>` __ | `Github <https://github.com/scikit-build/scikit-build-core/> __ | `Pypi <https://pypi.org/project/cikit-build-core> __ __ __

source: Scikit-build-core is a build backend for CPython C/C++/Fortran/Cython extensions. It enables users to write extensions with `cmake <https://pypi.org/project/cmake>`__ (available on PyPI) to provide better support for additional compilers, build systems, cross compilation, and locating dependencies and their associated build requirements. CMake/Ninja are automatically downloaded from PyPI if not available on the system.
eo: Scikit-build-core estas konstrua malfasado por etendaĵoj por CPython en C/C++/Fortran/Cython. Ĝi permesas verki etendaĵojn per `cmake <https://pypi.org/project/cmake>`__ (havebla ĉe PyPI) por pli bone subteni pliajn tradukilojn, konstrusistemojn, intertradukadon, kaj serĉadon de dependecoj kaj asociitaj konstruaj postuloj. Ĝi aŭtomate elŝutos CMake/Ninja el PyPI, se ili ne jam ekzistas sur la sistemo.
ja: Scikit-build-core は、CPython C/C++/Fortran/Cython による拡張モジュールのためのビルドバックエンドです。追加のコンパイラやビルドシステムやクロスコンパイル、また、依存関係とそれに付随するビルド時の要求事項を解決する点でより良いサポートを提供するために、ユーザが `cmake <https://pypi.org/project/cmake>`__ (PyPI から利用可能) を使って拡張を書くことができるようにします。 CMake/Ninja は、もしシステム上に利用可能なものがなければ、 PyPI から自動的にダウンロードされます。
pt_br: Scikit-build-core é um back-end de construção para extensões CPython C/C++/Fortran/Cython. Ele permite que os usuários escrevam extensões com `cmake <https://pypi.org/project/cmake>`__ (disponível no PyPI) para fornecer melhor suporte para compiladores adicionais, sistemas de construção, compilação cruzada e localização de dependências e suas construções associadas requisitos. CMake/Ninja são baixados automaticamente do PyPI se não estiverem disponíveis no sistema.
ru: Scikit-build-core - это бэкенд сборки для расширений CPython C/C++/Fortran/Cython. Он позволяет пользователям писать расширения с помощью `cmake <https://pypi.org/project/cmake>`__ (доступен на PyPI), обеспечивая лучшую поддержку дополнительных компиляторов, систем сборки, кросс-компиляции, а также поиска зависимостей и связанных с ними требований к сборке. CMake/Ninja автоматически загружаются с PyPI, если не доступны в системе.
ta: ச்கிகிட்-பில்ட்-கோர் என்பது CPython C/C ++/Fortran/Cython நீட்டிப்புகளுக்கான கட்டமைப்பை உருவாக்கும் பின்தளத்தில் உள்ளது. இது பயனர்கள் `cmake <https://pypi.org/project/cmake> __ (PYPI இல் கிடைக்கிறது) உடன் நீட்டிப்புகளை எழுத உதவுகிறது, கூடுதல் கம்பைலர்களுக்கு சிறந்த ஆதரவை வழங்க, அமைப்புகள், குறுக்கு தொகுப்பு மற்றும் அவற்றுடன் தொடர்புடைய கட்டமைப்பைக் கண்டறிதல் தேவைகள். கணினியில் கிடைக்காவிட்டால் Cmake/Nygaa தானாகவே PYPI இலிருந்து பதிவிறக்கம் செய்யப்படும்.

source: shiv
ta: சிவ்

source: `Docs <https://shiv.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/linkedin/shiv>`__ | `PyPI <https://pypi.org/project/shiv/>`__
eo: `Dokumentaro <https://shiv.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/linkedin/shiv>`__ | `PyPI <https://pypi.org/project/shiv/>`__
ja: `説明文書 <https://shiv.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/linkedin/shiv>`__ | `PyPI <https://pypi.org/project/shiv/>`__
pt_br: `Documentação <https://shiv.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/linkedin/shiv>`__ | `PyPI <https://pypi.org/project/shiv/>`__
ru: `Документы <https://shiv.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/linkedin/shiv>`__ | `PyPI <https://pypi.org/project/shiv/>`__
ta: `டாக்ச் <https://shiv.readthedocs.io/en/latest/> __ | `Github <https://github.com/linkedin/shiv>` __ | `Pypi <https://pypi.org/project/shiv/> ____ __

source: shiv is a command line utility for building fully self contained Python zipapps as outlined in :pep:`441`, but with all their dependencies included. Its primary goal is making distributing Python applications and command line tools fast & easy.
eo: shiv estas komandlinia ilo por konstrui plene memsufiĉa Python-zip-aplikaĵo laŭ :pep:`441`, sed inkluzivante ĉiajn dependaĵojn. Ĝi ĉefe celas rapidigi kaj faciligi distribuadon de Python-programoj kaj komandliniaj iloj.
ja: shiv は、 :pep:`441` に概要が示されている完全自己完結型 Python zipapp であるが必要な依存先をすべて内包したものをビルドするためのコマンドラインユーティリティです。このツールの第一の目標は、Python アプリケーションとコマンドラインツールを素早く簡便に配布できるようにすることです。
pt_br: shiv é um utilitário de linha de comando para construir *zipapps* Python totalmente autocontidos conforme descrito na :pep:`441`, mas com todas as suas dependências incluídas. Seu objetivo principal é tornar a distribuição Python de aplicações e ferramentas de linha de comando rápida e fácil.
ru: shiv - это утилита командной строки для создания полностью самодостаточных Python zipapps, как описано в :pep:`441`, но с включением всех зависимостей. Ее основная цель - сделать распространение Python-приложений и инструментов командной строки быстрым и легким.
ta: SHIV என்பது ஒரு கட்டளை வரி பயன்பாடாகும், இது கோடிட்டுக் காட்டப்பட்டுள்ளபடி முழுமையாக சுயமாக இருக்கும் பைதான் சிபாப்சை உருவாக்குகிறது: PEP: `441`, ஆனால் அவற்றின் அனைத்து சார்புகளும் சேர்க்கப்பட்டுள்ளன. அதன் முதன்மை குறிக்கோள் பைதான் பயன்பாடுகள் மற்றும் கட்டளை வரி கருவிகளை விரைவாகவும் எளிதாகவும் விநியோகிப்பதாகும்.

source: simpleindex
ta: எளிய இந்தெக்ச்
