Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Build back-ends MUST raise an error if the metadata defines a ``[project.entry-points.console_scripts]`` or ``[project.entry-points.gui_scripts]`` table, as they would be ambiguous in the face of ``[project.scripts]`` and ``[project.gui-scripts]``, respectively.
eo: Konstrua malfasado DEVAS sciigi pri eraro, se la metadatenoj difinas ``[project.entry-points.console_scripts]`` aŭ ``[project.entry-points.gui_scripts]``, ĉar tiuj estus ambiguaj pro ``[project.scripts]`` kaj ``[project.gui-scripts]``, respektive.
ja: メタデータの中に ``[project.entry-points.console_scripts]`` もしくは ``[project.entry-points.gui_scripts]`` というテーブルが定義されている場合は、それぞれ ``[project.scripts]`` や ``[project.gui-scripts]`` と混同してしまうといけないので、ビルド時のバックエンドがエラーを発生させなければなりません。
pt_br: Backends de construção DEVEM levantar um erro se os metadados definem uma tabela ``[project.entry-points.console_scripts]`` ou ``[project.entry-points.gui_scripts]``, pois elas seriam ambíguas perante ``[project.scripts]`` e ``[project.gui-scripts]``, respectivamente.
ru: Внутренние компоненты сборки ДОЛЖНЫ выдавать ошибку, если метаданные определяют таблицу ``[project.entry-points.console_scripts]`` или ``[project.entry-points.gui_scripts]``, поскольку они будут неоднозначными перед лицом ``[project.scripts]`` и ``[project.gui-scripts]``, соответственно.
ta: மேனிலை தரவு ஒரு `` [project.entry- புள்ளிகள். `` [project.scripts] `` மற்றும் `` [project.gui-scripts] ``.

source: TOML_ type: Array of :pep:`508` strings (``dependencies``), and a table with values of arrays of :pep:`508` strings (``optional-dependencies``)
eo: Tipo de TOML_: Listo de signoĉenoj laŭ :pep:`508` (``dependencies``) kaj tabelo de valoroj de listoj de signoĉenoj laŭ :pep:`508` (``optional-dependencies``)
ja: TOML_ 型: :pep:`508` の文字列 (``dependencies``) の配列、および、 :pep:`508` の文字列 (``optional-dependencies``) の配列の値を伴ったテーブル
pt_br: Tipo TOML_: Vetor de strings da :pep:`508` (``dependencies``) e uma tabela com valores de vetores de strings da :pep:`508` (``optional-dependencies``)
ru: Тип TOML_: Массив строк :pep:`508` (``зависимости``), и таблица со значениями массивов строк :pep:`508` (``опциональные-зависимости``)
ta: TOML_ வகை: வரிசை: PEP: `508` சரங்கள் (` `சார்புநிலைகள்``), மற்றும் வரிசைகளின் மதிப்புகளைக் கொண்ட அட்டவணை: PEP:` 508` சரங்கள் (`` விருப்ப-சார்புநிலைகள்``)

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Requires-Dist <core-metadata-requires-dist>` and :ref:`Provides-Extra <core-metadata-provides-extra>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Requires-Dist <core-metadata-requires-dist>` kaj :ref:`Provides-Extra <core-metadata-provides-extra>`
ja: 対応する :ref:`コアとなるメタデータ <core-metadata>` フィールド: :ref:`Requires-Dist <core-metadata-requires-dist>` および :ref:`Provides-Extra <core-metadata-provides-extra>`
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Requires-Dist <core-metadata-requires-dist>` e :ref:`Provides-Extra <core-metadata-provides-extra>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Requires-Dist <core-metadata-requires-dist>` и :ref:`Provides-Extra <core-metadata-provides-extra>`
ta: தொடர்புடைய: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: ref: `தேவைப்படுகிறது <கோர்-மெட்டாடேட்டா-வேண்டுகோள்-டிச்ட்>` மற்றும்: குறிப்பு: `வழங்குகிறது-எக்ச்ட்ரா <கோர்-மெட்டாடேட்டா-எக்ச்ட்ரா>`

source: The (optional) dependencies of the project.
eo: La (nedevigaj) dependecoj de la projektoj.
ja: (必須ではない) プロジェクトの依存関係。
pt_br: As dependências (opcionais) do projeto.
ru: Зависимости проекта (необязательно).
ta: திட்டத்தின் (விருப்ப) சார்புநிலைகள்.

source: For ``dependencies``, it is a key whose value is an array of strings. Each string represents a dependency of the project and MUST be formatted as a valid :pep:`508` string. Each string maps directly to a :ref:`Requires-Dist <core-metadata-requires-dist>` entry.
eo: Por ``dependencies``, ĝi estas ŝlosilo, kies valoro estas listo de signoĉenoj. Ĉiu signoĉeno prezentas dependecon de la projekto kaj DEVAS esti valida laŭ :pep:`508`. Ĉiu signoĉeno rekte respondas al ero :ref:`Requires-Dist <core-metadata-requires-dist>`.
ja: ``dependencies`` には、文字列の配列が値であるようなキーです。それぞれの文字列がそのプロジェクトの依存関係を表現していて、正当な :pep:`508` の文字列としてフォーマットされていなければなりません。それぞれの文字列は、 :ref:`Requires-Dist <core-metadata-requires-dist>` エントリに直接にマップしています。
pt_br: Para ``dependencies``, é uma chave cujo valor é um array de strings. Cada string representa uma dependência do projeto e DEVE ser formatada como uma string válida :pep:`508`. Cada string mapeia diretamente para um :ref:`Requires-Dist <core-metadata-requires-dist>`.
ru: Для ``зависимостей`` это ключ, значением которого является массив строк. Каждая строка представляет зависимость проекта и ДОЛЖНА быть отформатирована как корректная строка :pep:`508`. Каждая строка сопоставляется непосредственно с записью :ref:`Requires-Dist <core-metadata-requires-dist>`.
ta: `` சார்புகள்` `க்கு, இது ஒரு முக்கிய அம்சமாகும், அதன் மதிப்பு சரங்களின் வரிசை. ஒவ்வொரு சரமும் திட்டத்தின் சார்புநிலையைக் குறிக்கிறது மற்றும் செல்லுபடியாகும் என வடிவமைக்கப்பட வேண்டும்: PEP: `508` சரம். ஒவ்வொரு சரம் நேரடியாக A: ref: `தேவை-டிச்ட் <கோர்-மெட்டாடேட்டா-வேண்டுகோள்-டிச்ட்>` நுழைவு தேவை.

source: For ``optional-dependencies``, it is a table where each key specifies an extra and whose value is an array of strings. The strings of the arrays must be valid :pep:`508` strings. The keys MUST be valid values for :ref:`Provides-Extra <core-metadata-provides-extra>`. Each value in the array thus becomes a corresponding :ref:`Requires-Dist <core-metadata-requires-dist>` entry for the matching :ref:`Provides-Extra <core-metadata-provides-extra>` metadata.
ja: ``optional-dependencies`` は、それぞれのキーが追加物で、その値が文字列の配列であるようなテーブルです。文字列の配列は正当な :pep:`508` の文字列でなければなりません。キーは :ref:`Provides-Extra <core-metadata-provides-extra>` としてみた時に正当な値でなければなりません。従って、配列の中のそれぞれの値は、一致する :ref:`Provides-Extra <core-metadata-provides-extra>` メタデータに対応する :ref:`Requires-Dist <core-metadata-requires-dist>` のエントリになります。
pt_br: Para ``optional-dependencies``, é uma tabela onde cada chave especifica um extra e cujo valor é um vetor de strings. As strings dos vetores devem ser strings válidas da :pep:`508`. As chaves DEVEM ser valores válidos para :ref:`Provides-Extra <core-metadata-provides-extra>`. Cada valor no vetor torna-se assim uma entrada correspondente de :ref:`Requer-Dist <core-metadata-requires-dist>` para os metadados correspondentes de :ref:`Provides-Extra <core-metadata-provides-extra>`.
ru: Для ``optional-dependencies`` это таблица, в которой каждый ключ указывает на дополнительное значение, а значение представляет собой массив строк. Строки массивов должны быть действительными строками :pep:`508`. Ключи ДОЛЖНЫ быть допустимыми значениями для :ref:`Provides-Extra <core-metadata-provides-extra>`. Таким образом, каждое значение в массиве становится соответствующей записью :ref:`Requires-Dist <core-metadata-requires-dist>` для соответствующего метаданного :ref:`Provides-Extra <core-metadata-provides-extra>`.
ta: `` விருப்ப-சார்புநிலைகளுக்கு`` க்கு, இது ஒரு அட்டவணை, ஒவ்வொரு விசையும் கூடுதல் என்பதைக் குறிப்பிடுகிறது மற்றும் அதன் மதிப்பு சரங்களின் வரிசை. வரிசைகளின் சரங்கள் செல்லுபடியாகும்: PEP: `508` சரங்கள். விசைகள் இதற்கான செல்லுபடியாகும் மதிப்புகளாக இருக்க வேண்டும்: ref: `வழங்குகிறது-எக்ச்ட்ரா <கோர்-மெட்டாடேட்டா-வழங்கும்-எக்ச்ட்ரா>`. வரிசையில் உள்ள ஒவ்வொரு மதிப்பும் தொடர்புடையது: ref: `தேவைப்படுகிறது <கோர்-மெட்டாடேட்டா-வேண்டுகோள்-டிச்ட்>` பொருத்தத்திற்கான நுழைவு: ref: `வழங்கும்-எக்ச்ட்ரா <கோர்-மெட்டாடேட்டா-வழங்கும்-எக்ச்ட்ரா>` மேனிலை தரவு.

source: TOML_ type: array of string
eo: Tipo de TOML_: listo de signoĉenoj
ja: TOML_ 型: 文字列の配列
pt_br: Tipo TOML_: vetor de string
ru: Тип TOML_: массив строк
ta: TOML_ வகை: சரத்தின் வரிசை

source: Corresponding :ref:`core metadata <core-metadata>` field: :ref:`Dynamic <core-metadata-dynamic>`
eo: Respondanta :ref:`kerna metadatena <core-metadata>` kampo: :ref:`Dynamic <core-metadata-dynamic>`
ja: :ref:`コアとなるメタデータ <core-metadata>` フィールドに対応する: :ref:`ダイナミック <core-metadata-dynamic>` フィールド
pt_br: Campo correspondente dos :ref:`metadados principais <core-metadata>`: :ref:`Dynamic <core-metadata-dynamic>`
ru: Соответствующее поле :ref:`core metadata <core-metadata>`: :ref:`Dynamic <core-metadata-dynamic>`
ta: தொடர்புடைய: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` புலம் :: குறிப்பு: `டைனமிக் <கோர்-மெட்டாடேட்டா-டைனமிக்>`

source: Specifies which keys listed by this PEP were intentionally unspecified so another tool can/will provide such metadata dynamically. This clearly delineates which metadata is purposefully unspecified and expected to stay unspecified compared to being provided via tooling later on.
eo: Listigas tiujn ŝlosiloj en ĉi tiu PEP, kiuj estis intence nespecifitaj kaj aŭtomate provizotaj de alia ilo dinamike. Per tio, oni klare distingas intence nespecifitajn metadatenojn ne provizotajn far ilo, de metadatenoj poste provizotaj far ilo.
ja: この PEP に列挙されたキーのどれを意図的に指定しないままにすることで他のツールが動的にそのようなメタデータを準備することができる/しようとするかを規定します。後述するツールによる設定に比較して、どのメタデータが目的を持って未指定にされていて未指定のままであることを期待されているのかについて明確に描き出します。
pt_br: Especifica quais chaves listadas por esta PEP foram intencionalmente não especificadas para que outra ferramenta possa/vai fornecer tais metadados dinamicamente. Isso delineia claramente quais metadados são propositalmente não especificados e espera-se que permaneçam não especificados em comparação a serem fornecidos por meio de ferramentas posteriormente.
ru: Указывает, какие ключи, перечисленные в этом PEP, были намеренно не определены, чтобы другой инструмент может/должен предоставить такие метаданные динамически. Это четко определяет, какие метаданные намеренно не определены и, как ожидается, останутся неопределенными по сравнению с тем, что будет предоставлено с помощью инструментов позже.
ta: இந்த PEP ஆல் பட்டியலிடப்பட்ட எந்த விசைகள் வேண்டுமென்றே குறிப்பிடப்படவில்லை என்பதைக் குறிப்பிடுகிறது, எனவே மற்றொரு கருவி அத்தகைய மெட்டாடேட்டாவை மாறும் வகையில் வழங்க முடியும். இது எந்த மேனிலை தரவு வேண்டுமென்றே குறிப்பிடப்படவில்லை மற்றும் பின்னர் கருவி மூலம் வழங்கப்படுவதை ஒப்பிடும்போது குறிப்பிடப்படாமல் இருக்கும் என்று எதிர்பார்க்கப்படுகிறது.

source: A build back-end MUST honour statically-specified metadata (which means the metadata did not list the key in ``dynamic``).
eo: Konstrua malfasado DEVAS observi statike specifitan metadatenon (de ŝlosilo ne en ``dynamic``).
ja: ビルド用のバックエンドは、静的に指定されたメタデータ (つまり ``dynamic`` 内に列挙されたキーではないメタデータ) を尊重しなければなりません。
pt_br: Um backend de construção DEVE respeitar metadados especificados estaticamente (o que significa que os metadados não listam a chave em ``dynamic``).
ru: Бэкэнд сборки ДОЛЖЕН почитать статически заданные метаданные (это означает, что в метаданных не указан ключ в ``динамическом``).
ta: ஒரு உருவாக்க பின்-இறுதி-குறிப்பிட்ட மெட்டாடேட்டாவை மதிக்க வேண்டும் (அதாவது மேனிலை தரவு விசையை `` டைனமிக்`` இல் பட்டியலிடவில்லை).

source: A build back-end MUST raise an error if the metadata specifies ``name`` in ``dynamic``.
eo: Konstrua malfasado DEVAS sciigi pri eraro, se la metadatenoj specifas ``name`` en ``dynamic``.
ja: メタデータで ``dynamic`` 内に ``name`` が指定されている場合には、ビルド用バックエンドがエラーを発生させなければなりません。
pt_br: Um backend de construção DEVE gerar um erro se os metadados especificarem ``name`` em ``dynamic``.
ru: Внутренний модуль сборки ДОЛЖЕН выдать ошибку, если в метаданных указано ``имя`` в ``dynamic``.
ta: மேனிலை தரவு `` பெயர்`` இல் `` டைனமிக்`` ஐக் குறிப்பிடினால் ஒரு கட்டமைப்பை பின்-முடிவு பிழையை உயர்த்த வேண்டும்.

source: If the :ref:`core metadata <core-metadata>` specification lists a field as "Required", then the metadata MUST specify the key statically or list it in ``dynamic`` (build back-ends MUST raise an error otherwise, i.e. it should not be possible for a required key to not be listed somehow in the ``[project]`` table).
ja: :ref:`コアとなるメタデータ <core-metadata>` の仕様において、あるキーが "必須である" ものとして挙げられている場合には、メタデータはそのキーを静的に指定するか、または、 ``dynamic`` 内に指定するかしなければなりません (どちらでもない場合にはビルドバックエンドがエラーを発生させなければなりません、すなわち、必須のフィールドが ``[project]`` テーブルの中にどんな形でも存在していないということは不可能であるべきです)。
pt_br: Se a especificação de :ref:`metadados principais <core-metadata>` lista um campo como "Required", então os metadados DEVEM especificar a chave estaticamente ou listá-la em ``dynamic`` (backends de construção DEVEM gerar um erro, caso contrário , ou seja, não deve ser possível que uma chave obrigatória não seja listada de alguma forma na tabela ``[project]``).
ru: Если в спецификации :ref:`core metadata <core-metadata>` указано поле как "Required", то метаданные ДОЛЖНЫ указывать ключ статически или перечислять его в ``dynamic`` (сборка бэкендов ДОЛЖНА выдавать ошибку в противном случае, т.е. не должно быть возможности, чтобы требуемый ключ не был как-то указан в таблице ``[project]``).
ta: : Ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` விவரக்குறிப்பு ஒரு துறையை "தேவை" என்று பட்டியலிடுகிறது என்றால், மேனிலை தரவு விசையை சட்டப்பூர்வமாக குறிப்பிட வேண்டும் அல்லது அதை `` டைனமிக்`` இல் பட்டியலிட வேண்டும் (பின்-முனைகளை உருவாக்குங்கள் இல்லையெனில் பிழையை உயர்த்த வேண்டும் , அதாவது `` [திட்டம்] `` அட்டவணை) எப்படியாவது பட்டியலிடப்படாமல் இருக்க முடியாது.

source: If the :ref:`core metadata <core-metadata>` specification lists a field as "Optional", the metadata MAY list it in ``dynamic`` if the expectation is a build back-end will provide the data for the key later.
eo: Se la specifo de :ref:`kernaj metadatenoj <core-metadata>` priskribas kampon kiel «Nedeviga», do la metadateno POVAS meti ĝin en ``dynamic``, se oni atendas, ke konstrua malfasado poste provizos la datenon pri la ŝlosilo.
ja: :ref:`コアとなるメタデータ <core-metadata>` の仕様で、あるキーを "必須ではない" ものとして挙げている場合には、後でビルド用バックエンドがそのキー用のデータを提供するという期待が持てるのであればメタデータではそのキーを ``dynamic`` の中に挙げても構いません。
pt_br: Se a especificação de :ref:`metadados principais <core-metadata>` listar um campo como "Optional", os metadados PODEM listá-lo em ``dynamic`` se a expectativa for um backend de construção fornecerá os dados para a chave mais tarde.
ru: Если в спецификации :ref:`core metadata <core-metadata>` поле указано как "Optional", метаданные МОГУТ указывать его в ``dynamic``, если предполагается, что сборка бэкенда предоставит данные для ключа позже.
ta: The: ref: `கோர் மேனிலை தரவு <கோர்-மெட்டாடேட்டா>` விவரக்குறிப்பு ஒரு துறையை "விருப்பமானது" என்று பட்டியலிடுகிறது, மேனிலை தரவு அதை `` டைனமிக்`` இல் பட்டியலிடலாம் என்றால், எதிர்பார்ப்பு ஒரு கட்டமைப்பை உருவாக்கினால் விசைக்கான தரவை வழங்கும் பின்னர்.

source: Build back-ends MUST raise an error if the metadata specifies a key statically as well as being listed in ``dynamic``.
eo: Konstrua malfasado DEVAS sciigi pri eraro, se la metadatenoj specifas unu ŝlosilon kaj statike kaj en ``dynamic``.
ja: メタデータ内で、あるキーが静的に指定されていて、かつ、 ``dynamic`` にも挙げてある場合には、ビルド用バックエンドはエラーを発生させなければなりません。
pt_br: Os backends de construção DEVEM levantar um erro se os metadados especificarem uma chave estaticamente, além de serem listados em ``dynamic``.
ru: Внутренние компоненты сборки ДОЛЖНЫ выдать ошибку, если метаданные указывают ключ статически, а также перечислены в ``динамических``.
ta: மேனிலை தரவு ஒரு விசையை நிலையான முறையில் குறிப்பிடினால், `` டைனமிக்`` இல் பட்டியலிடப்பட்டால் பின்-முனைகளை உருவாக்குங்கள் பிழையை உயர்த்த வேண்டும்.

source: If the metadata does not list a key in ``dynamic``, then a build back-end CANNOT fill in the requisite metadata on behalf of the user (i.e. ``dynamic`` is the only way to allow a tool to fill in metadata and the user must opt into the filling in).
eo: Se la metadatenoj ne enhavas ŝlosilon en ``dynamic``, konstrua malfasado DEVAS NE plenigi la medatenon por la uzanto (alivorte, ``dynamic`` estas la ununura maniero por permesi al ilo plenigi metadatenojn, kaj la uzanto devas eksplici la aŭtomatan plenigadon).
ja: メタデータ内で、あるキーを ``dynamic`` の中に挙げなかった場合は、ビルド用バックエンドがユーザに代わって必要なメタデータを挿入することはできません (すなわち、ツールがメタデータを挿入できるのは ``dynamic`` の中だけであり、かつ、ユーザがそうするようにオプトインしていなければならないということです) 。
pt_br: Se os metadados não listam uma chave em ``dynamic``, então um backend de construção NÃO PODE preencher os metadados necessários em nome do usuário (ou seja, ``dynamic`` é a única maneira de permitir que uma ferramenta preencha metadados e o usuário deve optar pelo preenchimento).
ru: Если в метаданных не указан ключ в ``dynamic``, то бэкэнд сборки не сможет заполнить необходимые метаданные от имени пользователя (т.е. ``dynamic`` - это единственный способ позволить инструменту заполнить метаданные, и пользователь должен согласиться на заполнение).
ta: மேனிலை தரவு ஒரு விசையை `` டைனமிக்`` இல் பட்டியலிடவில்லை என்றால், பயனரின் சார்பாக தேவையான மெட்டாடேட்டாவை ஒரு கட்டமைப்பால் நிரப்ப முடியாது (அதாவது மெட்டாடேட்டாவை நிரப்ப ஒரு கருவியை அனுமதிப்பதற்கான ஒரே வழி `` டைனமிக்`` மற்றும் பயனர் நிரப்பப்பட வேண்டும்).

source: Build back-ends MUST raise an error if the metadata specifies a key in ``dynamic`` but the build back-end was unable to determine the data for it (omitting the data, if determined to be the accurate value, is acceptable).
eo: Konstrua malfasado DEVAS sciigi eraron, se la metadatenoj specifas ŝlosilon en ``dynamic`` sed la konstrua malfasado ne povis determini ĝian datenon (estas akcepteble, se la ilo determinas, ke la dateno manku).
ja: あるキーが ``dynamic`` の中で指定されたメタデータで、しかし、ビルド用バックエンドがそこに挿入するべきデータを決定することができない時は、ビルド用バックエンドはエラーを発生させなければなりません (正確な値であると判断した場合はデータを省略することが許容されます) 。
pt_br: Os backends de construção DEVEM levantar um erro se os metadados especificarem uma chave em ``dynamic``, mas o backend de construção não foi capaz de determinar os dados para ele (omitir os dados, se determinado como o valor exato, é aceitável) .
ru: Бэкэнд сборки ДОЛЖЕН выдать ошибку, если в метаданных указан ключ в ``dynamic``, но бэкэнд сборки не смог определить данные для него (опускание данных, если определено, что это точное значение, допустимо).
ta: மேனிலை தரவு ஒரு விசையை `` டைனமிக்`` இல் குறிப்பிடினால், பின்-முனைகளை உருவாக்க வேண்டும், ஆனால் அதற்கான தரவைத் தீர்மானிக்க முடியவில்லை (தரவைத் தவிர்ப்பது, துல்லியமான மதிப்பாக தீர்மானிக்கப்பட்டால், ஏற்றுக்கொள்ளத்தக்கது) .

source: Arbitrary tool configuration: the ``[tool]`` table
eo: Ĉiaj ilaj agordoj: la tabelo ``[tool]``
ja: 任意のツールの設定: ``[tool]`` テーブル
ru: Произвольная конфигурация инструментов: таблица ``[tool]``
ta: தன்னிச்சையான கருவி உள்ளமைவு: `` [கருவி] `` அட்டவணை

source: The ``[tool]`` table is where any tool related to your Python project, not just build tools, can have users specify configuration data as long as they use a sub-table within ``[tool]``, e.g. the `flit <https://pypi.python.org/pypi/flit>`_ tool would store its configuration in ``[tool.flit]``.
eo: En subtabelo de la tabelo ``[tool]``, iu ajn ilo rilata al via Python-projekto (ne nur konstruilo) povas havi agordojn. Ekzemple, la ilo `flit <https://pypi.python.org/pypi/flit>`_ konservus siajn agordojn en ``[tool.flit]``.
ja: ``[tool]`` テーブルは、ビルドツールに限らずその Python プロジェクトに関係するツールであれば何であっても、 ``[tool]`` 内のサブテーブルを使う限りはユーザが設定データを指定することができるもので、例えば `flit <https://pypi.python.org/pypi/flit>`_ ツールならその設定を ``[tool.flit]`` に格納しておくでしょう。
ru: Таблица ``[tool]`` - это место, где любой инструмент, связанный с вашим Python-проектом, не только инструменты сборки, может иметь пользователей, указывающих конфигурационные данные, если они используют подтаблицу в ``[tool]``, например, инструмент `flit <https://pypi.python.org/pypi/flit>`_ будет хранить свою конфигурацию в ``[tool.flit]``.
ta: `` [கருவி] `` அட்டவணை என்பது உங்கள் பைதான் திட்டத்துடன் தொடர்புடைய எந்தவொரு கருவியும், கருவிகளை உருவாக்குவது மட்டுமல்லாமல், பயனர்கள் `` [கருவி] ``, எ.கா. `flit <https://pypi.python.org/pypi/flit> _ கருவி அதன் உள்ளமைவை` `[கருவி.ஃப்ளிட்]` `இல் சேமிக்கும்.

source: A mechanism is needed to allocate names within the ``tool.*`` namespace, to make sure that different projects do not attempt to use the same sub-table and collide. Our rule is that a project can use the subtable ``tool.$NAME`` if, and only if, they own the entry for ``$NAME`` in the Cheeseshop/PyPI.
ja: ``tool.*`` という名前空間の中に名称を確保するには、他のプロジェクトが同じサブテーブルを使おうと試みて衝突してしまうようなことにならないようにするメカニズムが必要です。我々のルールは、あるプロジェクトが Cheeseshop/PyPI に ``$NAME`` というエントリを保有している場合、その場合に限って、 ``tool.$NAME`` なるサブテーブルを使うことができるというものです。
ru: Необходим механизм для распределения имен в пространстве имен ``tool.*``, чтобы убедиться, что разные проекты не пытаются использовать одну и ту же подтаблицу и не сталкиваются. Наше правило заключается в том, что проект может использовать подтаблицу ``tool.$NAME`` тогда и только тогда, когда он владеет записью для ``$NAME`` в Cheeseshop/PyPI.
ta: A mechanism is needed பெறுநர் allocate names within the ``tool.*`` namespace, பெறுநர் make sure that different திட்டங்கள் do not attempt பெறுநர் use the same sub-table and collide. Our விதி is that a திட்டம் can use the subtable ``tool.$NAME`` if, and only if, they own the நுழைவு க்கு ``$NAME`` in the Cheeseshop/PyPI.

source: May 2016: The initial specification of the ``pyproject.toml`` file, with just a ``[build-system]`` containing a ``requires`` key and a ``[tool]`` table, was approved through :pep:`518`.
eo: Majo 2016: La unua specifo pri la dosiero ``pyproject.toml``, kun nur ``[build-system]`` enhavanta ŝlosilon ``requires`` kaj tabelon ``[tool]``, estis aprobita per :pep:`518`.
ja: 2016年5月: :pep:`518` を通じて、 ``pyproject.toml`` ファイルの初期の仕様、つまり、 ``[build-system]`` が ``requires`` キーと ``[tool]`` テーブルしか含んでいないものが承認されました。
ru: Май 2016 г: Первоначальная спецификация файла ``pyproject.toml``, содержащая только ``[build-system]``, содержащую ключ ``requires`` и таблицу ``[tool]``, была одобрена через :pep:`518``.
ta: மே 2016: `` [பில்ட்-சிச்டம்] `` `` தேவை` `` விசையும் ஒரு `` [கருவி] `அட்டவணை, ஒரு` `[பில்ட்-சிச்டம்]` `` அட்டவணை ஆகியவற்றைக் கொண்ட `` pyproject.toml`` கோப்பின் ஆரம்ப விவரக்குறிப்பு அங்கீகரிக்கப்பட்டது மூலம்: PEP: `518`.

source: November 2020: The specification of the ``[project]`` table was approved through :pep:`621`.
eo: Novembro 2020: La specifo de la tabelo ``[project]`` estis aprobita per :pep:`621`.
ja: 2020年11月: :pep:`621` を通じて、 ``[project]`` テーブルの仕様が承認されました。
ru: Ноябрь 2020 года: Спецификация таблицы ``[проект]`` была утверждена через :pep:`621``.
ta: நவம்பர் 2020: `` [திட்டம்] `` அட்டவணையின் விவரக்குறிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `621`.

source: December 2024: The ``license`` key was redefined, the ``license-files`` key was added and ``License::`` classifiers were deprecated through :pep:`639`.
eo: Decembro 2024: La ŝlosilo ``license`` estis redifinita, la ŝlosilo ``license-files`` estis aldonita, kaj la klasigiloj ``License::`` estis evitindigitaj per :pep:`639`.
ru: Декабрь 2024 года: Ключ ``license`` был переопределен, ключ ``license-files`` был добавлен, а классификаторы ``License::`` были устаревшими через :pep:`639`.
ta: டிசம்பர் 2024: `` உரிமம்`` விசை மறுவரையறை செய்யப்பட்டது, `` உரிம-கோப்புகள்`` விசை சேர்க்கப்பட்டு `` உரிமம் :: `` வகைப்படுத்திகள் நீக்கப்பட்டன: பெப்: `639`.

source: Recording installed projects
eo: Registri instalitajn projektojn
ja: インストール済みのプロジェクトを記録する
pt_br: Gravando projetos instalados
ru: Запись установленных проектов
ta: நிறுவப்பட்ட திட்டங்களை பதிவு செய்தல்
