Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: For comparison purposes, the names should be :ref:`normalized <name-normalization>` before comparing.
eo: Por komparado, la nomoj estu :ref:`normigitaj <name-normalization>` antaŭ komparado.
ja: 比較の目的のためにも、名前は比較の前に :ref:`正規化 <name-normalization>` されているべきです。
pt_br: Para propósitos de comparação, os nomes devem ser :ref:`normalizados <name-normalization>` antes da comparação.
ru: Для сравнения имена должны быть :ref:`нормализованы <имя-нормализация>` перед сравнением.
ta: ஒப்பீட்டு நோக்கங்களுக்காக, பெயர்கள் இருக்க வேண்டும்: குறிப்பு: `இயல்பாக்கப்பட்ட <பெயர்-இயல்பாக்கம்>` ஒப்பிடுவதற்கு முன்.

source: A string containing the distribution's version number. This field must be in the format specified in the :ref:`Version specifier specification <version-specifiers>`.
eo: Signoĉeno enhavanta la versian numero de la distribuo. Tiu kampo devas esti en la formo specifita en la :ref:`specifo pri versio-specifiloj <version-specifiers>`.
ja: 配布物のバージョン番号を格納する文字列。このフィールドは :ref:`バージョン指定子仕様 <version-specifiers>` で規定されるフォーマットでなければなりません。
pt_br: Uma string contendo o número da versão da distribuição. Este campo deve estar no formato especificado na :ref:`especificação de especificadores de versão <version-specifiers>`.
ru: Строка, содержащая номер версии дистрибутива. Это поле должно быть в формате, указанном в :ref:`Спецификация спецификатора версии <version-specifiers>`.
ta: விநியோகத்தின் பதிப்பு எண்ணைக் கொண்ட ஒரு சரம். இந்த புலம்: ref: `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>` இல் குறிப்பிடப்பட்டுள்ள வடிவத்தில் இருக்க வேண்டும்.

source: Dynamic (multiple use)
eo: Dynamic (plurfoje uzebla)
ja: Dyanamic (複数回の使用可)
pt_br: Dynamic (vários usos)
ru: Динамический (многократное использование)
ta: மாறும் (பல பயன்பாடு)

source: A string containing the name of another core metadata field. The field names ``Name``, ``Version``, and ``Metadata-Version`` may not be specified in this field.
eo: Signoĉeno enhavanta la nomon de alia kerna metadatena kampo. La kamponomoj ``Name``, ``Version`` kaj ``Metadata-Version`` devas esti ne specifitaj en ĉi tiu kampo.
ja: 別のコアとなるメタデータのフィールドの名前を包含した文字列。フィールド名の ``Name`` ・ ``Version`` ・ ``Metadata-Version`` をこのフィールドに指定してはなりません。
pt_br: Uma string contendo o nome de outro campo de metadados principal. Os nomes dos campos ``Name``, ``Version`` e ``Metadata-Version`` não podem ser especificados neste campo.
ru: Строка, содержащая имя другого поля метаданных ядра. Имена полей ``Name``, ``Version`` и ``Metadata-Version`` не могут быть указаны в этом поле.
ta: மற்றொரு கோர் மேனிலை தரவு புலத்தின் பெயரைக் கொண்ட ஒரு சரம். புல பெயர்கள் `` பெயர்``, `` பதிப்பு``, மற்றும் `` மெட்டாடேட்டா-பதிப்பு`` இந்த துறையில் குறிப்பிடப்படாமல் இருக்கலாம்.

source: When found in the metadata of a source distribution, the following rules apply:
eo: Se ĝi troviĝas en la metadatenoj de fonta distribuo, efektivas la jenaj reguloj:
ja: ソースコード配布物のメタデータ中に見つかった場合には、以下の規則を適用します:
pt_br: Quando encontrados nos metadados de uma distribuição fonte, as seguintes regras se aplicam:
ru: При нахождении в метаданных исходного дистрибутива действуют следующие правила:
ta: மூல விநியோகத்தின் மெட்டாடேட்டாவில் காணப்படும்போது, பின்வரும் விதிகள் பொருந்தும்:

source: If a field is *not* marked as ``Dynamic``, then the value of the field in any wheel built from the sdist MUST match the value in the sdist. If the field is not in the sdist, and not marked as ``Dynamic``, then it MUST NOT be present in the wheel.
eo: Se kampo *ne* estas markita kiel ``Dynamic``, do la valoro de la kampo en ajna wheel konstruita el la fonta distribuo DEVAS egali la valoron en la fonta distribuo. Se la kampo mankas en la fonta distribuo kaj ne estas markita kiel ``Dynamic``, do ĝi DEVAS NE ekzisti en la wheel.
ja: フィールドが ``Dynamic`` と *マークされていない* 場合は、 sdist からビルドされたどの wheel であっても、そのフィールドの値が sdist での値と一致しなければなりません。そのフィールドが sdist には存在せず、かつ、 ``Dynamic`` とマークされていない場合には、そのようなフィールドは wheel に出現してはなりません。
pt_br: Se um campo *não* estiver marcado como ``Dynamic``, então o valor do campo em qualquer wheel construído a partir do sdist DEVE corresponder ao valor do sdist. Se o campo não estiver no sdist e não estiver marcado como ``Dynamic``, ele NÃO DEVE estar presente no wheel.
ru: Если поле *не* помечено как ``динамическое'', то значение этого поля в любом колесе, построенном из sdist, ДОЛЖНО совпадать со значением в sdist. Если поле отсутствует в sdist и не помечено как ``динамическое'', то оно НЕ ДОЛЖНО присутствовать в колесе.
ta: ஒரு புலம் * `` டைனமிக்`` எனக் குறிக்கப்படவில்லை என்றால், SDIST இலிருந்து கட்டப்பட்ட எந்த சக்கரத்திலும் புலத்தின் மதிப்பு SDIST இல் உள்ள மதிப்புடன் பொருந்த வேண்டும். புலம் SDIST இல் இல்லை என்றால், `` டைனமிக்`` எனக் குறிக்கப்படவில்லை என்றால், அது சக்கரத்தில் இருக்கக்கூடாது.

source: If a field is marked as ``Dynamic``, it may contain any valid value in a wheel built from the sdist (including not being present at all).
eo: Se kampo estas markita kiel ``Dynamic``, ĝi povas enhavi iun ajn validan valoron en wheel konstruita el la fonta distribuo (inkluzive de manko de valoro).
ja: フィールドが ``Dynamic`` とマークされている場合、 (ひとつも存在しない場合も含めて) sdist からビルドされた wheel 内のどんな正当な値を取っても構いません。
pt_br: Se um campo for marcado como ``Dynamic``, ele pode conter qualquer valor válido em um wheel construído a partir do sdist (incluindo não estar presente).
ru: Если поле помечено как ``динамическое'', оно может содержать любое допустимое значение в колесе, собранном из sdist (в том числе не присутствовать вообще).
ta: ஒரு புலம் `` டைனமிக்`` எனக் குறிக்கப்பட்டால், அதில் SDIST இலிருந்து கட்டப்பட்ட சக்கரத்தில் எந்த சரியான மதிப்பும் இருக்கலாம் (இல்லை உட்பட).

source: If the sdist metadata version is older than version 2.2, then all fields should be treated as if they were specified with ``Dynamic`` (i.e. there are no special restrictions on the metadata of wheels built from the sdist).
eo: Se la metadatenoj de la fonta distribuo havas version malpli novan ol 2.2, do oni pritraktu ĉiujn kampojn, kvazaŭ ili estus markitaj per ``Dynamic`` (alivorte, kvazaŭ ne ekzistus speciala limigo pri la metadatenoj de wheel konstruita el la fonta distribuo).
ja: sdist のメタデータバージョンがバージョン 2.2 よりも古い場合には、すべてのフィールドが ``Dynamic`` であると指定されたかのように (つまり、その sdist からビルドされた wheel のメタデータに何も特別な制約がないかのように) 取り扱うべきです。
pt_br: Se a versão dos metadados sdist for anterior à versão 2.2, todos os campos devem ser tratados como se tivessem sido especificados com ``Dynamic`` (ou seja, não há restrições especiais sobre os metadados dos wheels construídos a partir do sdist).
ru: Если версия метаданных sdist старше версии 2.2, то все поля должны рассматриваться так, как если бы они были указаны с ``Dynamic`` (т.е. нет никаких специальных ограничений на метаданные колес, собранных из sdist).
ta: SDIST மேனிலை தரவு பதிப்பு பதிப்பு 2.2 ஐ விட பழையதாக இருந்தால், எல்லா புலங்களும் `` டைனமிக்`` உடன் குறிப்பிடப்பட்டதைப் போல கருதப்பட வேண்டும் (அதாவது, SDIST இலிருந்து கட்டப்பட்ட சக்கரங்களின் மெட்டாடேட்டாவில் சிறப்பு கட்டுப்பாடுகள் எதுவும் இல்லை).

source: In any context other than a source distribution, ``Dynamic`` is for information only, and indicates that the field value was calculated at wheel build time, and may not be the same as the value in the sdist or in other wheels for the project.
eo: En ĉiu kunteksto krom fonta distribuo, ``Dynamic`` estas nur informa kaj indikas, ke la valoro de la kampo estis komputita dum konstruado de wheel kaj eble ne egalas la valoron en la fonta distribuo en alia wheel por la projekto.
ja: ソースコード配布物を除くすべての文脈で、 ``Dynamic`` は情報提供の目的のみであり、そのフィールドの値がビルドの際に計算されたものであって、 sdist や同じプロジェクトでも他の wheel ファイルでは異なる場合があることを示します。
pt_br: Em qualquer contexto que não seja uma distribuição fonte, ``Dynamic`` é apenas para informação e indica que o valor do campo foi calculado no tempo de construção do wheel, e pode não ser o mesmo que o valor no sdist ou em outros wheels para o projeto.
ru: В любом контексте, кроме дистрибутива исходного кода, ``Dynamic'' используется только для информации и указывает, что значение поля было вычислено во время сборки колеса, и может не совпадать со значением в sdist или в других колесах для проекта.
ta: மூல விநியோகத்தைத் தவிர வேறு எந்த சூழலிலும், `` டைனமிக்`` என்பது தகவல்களுக்கு மட்டுமே, மற்றும் புல மதிப்பு சக்கர உருவாக்கும் நேரத்தில் கணக்கிடப்பட்டதைக் குறிக்கிறது, மேலும் இது SDIST இல் உள்ள மதிப்புக்கு அல்லது பிற சக்கரங்களில் இருக்காது திட்டம்.

source: Full details of the semantics of ``Dynamic`` are described in :pep:`643`.
eo: Plenaj detaloj pri la semantiko de ``Dynamic`` troviĝas en :pep:`643`.
ja: ``Dynamic`` の詳細かつ完全な意味は :pep:`643` に記述されています。
pt_br: Detalhes completos da semântica de ``Dynamic`` são descritos na :pep:`643`.
ru: Полные подробности семантики ``Dynamic`` описаны в :pep:`643`.
ta: `` டைனமிக்`` இன் சொற்பொருளின் முழு விவரங்கள் இதில் விவரிக்கப்பட்டுள்ளன: PEP: `643`.

source: Platform (multiple use)
eo: Platform (plurfoje uzebla)
ja: Platform (複数回の使用可)
pt_br: Platform (vários usos)
ru: Platform (можно использовать несколько раз)
ta: தளம் (பல பயன்பாடு)

source: A Platform specification describing an operating system supported by the distribution which is not listed in the "Operating System" Trove classifiers. See "Classifier" below.
eo: Platforma specifo priskribanta mastruman sistemon subtenatan de la distribuo kaj ne en la listo de la Trove-klasigilo «Operating System». Vidu «Klasigilon» ĉi-sube.
ja: Platform の仕様は、その配布物がサポートするオペレーティングシステムを記述したもので、 "Operating System" Trove 分類子には記載されていないもの。後述の "分類子 <Classifier>" を見てください。
pt_br: Uma especificação da plataforma que descreve um sistema operacional suportado pela distribuição que não está listado nos classificadores Trove de "Operating System". Veja "Classifier" abaixo.
ru: Спецификация платформы, описывающая операционную систему, поддерживаемую дистрибутивом, которая не указана в классификаторах Trove "Операционная система". См. раздел "Классификатор" ниже.
ta: "இயக்க முறைமை" ட்ரோவ் வகைப்படுத்திகளில் பட்டியலிடப்படாத விநியோகத்தால் ஆதரிக்கப்படும் இயக்க முறைமையை விவரிக்கும் ஒரு இயங்குதள விவரக்குறிப்பு. கீழே உள்ள "வகைப்படுத்தி" ஐப் பார்க்கவும்.

source: Examples::
eo: Ekzemploj::
ja: 例::
pt_br: Exemplos::
ru: Примеры::
ta: எடுத்துக்காட்டுகள் ::

source: Supported-Platform (multiple use)
eo: Supported-Platform (plurfoje uzebla)
ja: Supported-Platform (複数回の使用可)
pt_br: Supported-Platform (vários usos)
ru: Supported-Platform (можно использовать несколько раз)
ta: ஆதரவு-தளம் (பல பயன்பாடு)

source: Binary distributions containing a PKG-INFO file will use the Supported-Platform field in their metadata to specify the OS and CPU for which the binary distribution was compiled. The semantics of the Supported-Platform field are not specified in this PEP.
eo: Duuma distribuo enhavanta dosieron :file:`PKG-INFO` enhavos la kampon ``Supported-Platform`` en metadatenoj specifantan la mastruman sistemon kaj ĉefprocesoron, por kiu la duuma distribuo estis tradukita. Ĉi tiu PEP ne difinas la semantikon de la kampo ``Supported-Platform``.
ja: PKG-INFO ファイルを含むバイナリ配布物は、内包するメタデータの中の Supported-Platform フィールドを使って当該バイナリ配布物がどの OS や CPU 向けにコンパイルされたかを指定することになるでしょう。 Supported-Platform フィールドのセマンティクスは PEP には定義されたものがありません。
pt_br: As distribuições binárias contendo um arquivo PKG-INFO usarão o campo Supported-Platform em seus metadados para especificar o sistema operacional e a CPU para os quais a distribuição binária foi compilada. A semântica do campo Supported-Platform não é especificada nesta PEP.
ru: Бинарные дистрибутивы, содержащие файл PKG-INFO, будут использовать поле Supported-Platform в своих метаданных для указания ОС и CPU, для которых был скомпилирован бинарный дистрибутив. Семантика поля Supported-Platform не определена в данном PEP.
ta: பி.கே.சி-இன்ஃபோ கோப்பைக் கொண்ட பைனரி விநியோகங்கள் பைனரி வழங்கல் தொகுக்கப்பட்ட OS மற்றும் சிபியு ஐக் குறிப்பிட அவற்றின் மெட்டாடேட்டாவில் ஆதரவு-தளம் புலத்தைப் பயன்படுத்தும். ஆதரிக்கப்பட்ட-தளம் புலத்தின் சொற்பொருள் இந்த PEP இல் குறிப்பிடப்படவில்லை.

source: A one-line summary of what the distribution does.
eo: Unulinia resumo pri la funkcioj de la distribuo.
ja: その配布物が何をするものかを１行で記述した要約。
pt_br: Um resumo de uma linha do que a distribuição faz.
ru: Однострочная сводка того, что делает дистрибутив.
ta: வழங்கல் என்ன செய்கிறது என்பதற்கான ஒரு வரி சுருக்கம்.

source: This field may be specified in the message body instead.
eo: Ĉi tiu kampo estas anstataŭe specifebla en la mesaĝa korpo.
ja: このフィールドの代わりにメッセージ本体で指定しても構いません。
pt_br: Este campo pode ser especificado no corpo da mensagem.
ru: Это поле может быть указано в теле сообщения.
ta: இந்த புலம் அதற்கு பதிலாக செய்தி உடலில் குறிப்பிடப்படலாம்.

source: A longer description of the distribution that can run to several paragraphs. Software that deals with metadata should not assume any maximum size for this field, though people shouldn't include their instruction manual as the description.
eo: Pli longa priskribo de la distribuo, kiu povas esti pluraj paragrafoj. Programo uzanta metadatenojn ne supozu ajnan maksimumon por tiu kampo, kvankam oni ne inkluzivu plenan manlibron kiel la priskribon.
ja: 配布物に関する長めの説明文で、いくつかの段落に渡ってもかまいません。取扱説明書並みの記述をするべきではありませんが、メタデータを扱うソフトウェアはこのフィールドに最大長さがあるものと仮定すべきではありません。
pt_br: Uma descrição mais longa da distribuição que pode ter vários parágrafos. Software que lida com metadados não deve presumir nenhum tamanho máximo para este campo, embora as pessoas não devam incluir seu manual de instruções como a descrição.
ru: Более длинное описание дистрибутива, которое может состоять из нескольких абзацев. Программы, работающие с метаданными, не должны устанавливать максимальный размер этого поля, однако людям не стоит включать в описание инструкцию по эксплуатации.
ta: பல பத்திகளுக்கு இயங்கக்கூடிய விநியோகத்தின் நீண்ட விளக்கம். மெட்டாடேட்டாவைக் கையாளும் மென்பொருள் இந்தத் துறைக்கு எந்த அதிகபட்ச அளவையும் கருதக்கூடாது, இருப்பினும் மக்கள் தங்கள் அறிவுறுத்தல் கையேட்டை விளக்கமாக சேர்க்கக்கூடாது.

source: The contents of this field can be written using reStructuredText markup [1]_. For programs that work with the metadata, supporting markup is optional; programs can also display the contents of the field as-is. This means that authors should be conservative in the markup they use.
eo: La enhavo de tiu kampo povas uzi la marklingvon reStructuredText [1]_. Programo uzanta la metadatenojn ne devas kompreni la marklingvon kaj rajtas anstataŭe montri la kampon krude. Tio signifas, ke aŭtoro estu konservativa pri la uzata marklingvo.
ja: このフィールドの内容は、 reStructuredText マークアップ [1]_ を使って書いても構いません。メタデータを取り扱うプログラムの側ではマークアップをサポートしてもしなくてもかまわず、サポートしない場合にはこのフィールドの内容をそのまま表示することも可能です。つまり、作者の側は、自分が採用するマークアップ言語については保守的であるべきだということになります。
pt_br: O conteúdo deste campo pode ser escrito usando a marcação reStructuredText [1]_. Para programas que funcionam com metadados, o suporte à marcação é opcional; os programas também podem exibir o conteúdo do campo como está. Isso significa que os autores devem ser conservadores na marcação que usam.
ru: Содержимое этого поля может быть записано с помощью разметки reStructuredText [1]_. Для программ, работающих с метаданными, поддерживающая разметка необязательна; программы могут отображать содержимое поля как есть. Это означает, что авторы должны быть консервативны в используемой ими разметке.
ta: இந்த புலத்தின் உள்ளடக்கங்களை மறுசீரமைப்பு மார்க்அப் [1] _ ஐப் பயன்படுத்தி எழுதலாம். மெட்டாடேட்டாவுடன் பணிபுரியும் திட்டங்களுக்கு, மார்க்அப்பை ஆதரிப்பது விருப்பமானது; நிரல்கள் புலத்தின் உள்ளடக்கங்களையும் காண்பிக்க முடியும். இதன் பொருள் ஆசிரியர்கள் அவர்கள் பயன்படுத்தும் மார்க்அப்பில் பழமைவாதமாக இருக்க வேண்டும்.

source: To support empty lines and lines with indentation with respect to the RFC 822 format, any CRLF character has to be suffixed by 7 spaces followed by a pipe ("|") char. As a result, the Description field is encoded into a folded field that can be interpreted by RFC822 parser [2]_.
ja: 空行および RFC 822 に従う字下げをサポートするために、すべての CRLF 文字には７個の空白文字と１個のパイプ文字 ("|") がこの順に並ぶ文字列が後続しなければなりません。その結果として、Description フィールドが RFC 822 構文解析器 [2]_ で解析可能な形の改行可能なフィールドにエンコードされます。
pt_br: Para oferecer suporte a linhas vazias e linhas com indentação em relação ao formato do RFC 822, qualquer caractere CRLF deve ser sufixado por 7 espaços seguidos por um caractere de encadeamento ou pipe ("|"). Como resultado, o campo Description é codificado em um campo dobrado que pode ser interpretado pelo analisador RFC822 [2]_.
ru: Для поддержки пустых строк и строк с отступами в соответствии с форматом RFC 822 любой символ CRLF должен быть дополнен 7 пробелами, за которыми следует символ pipe ("|"). В результате поле Description кодируется в свернутое поле, которое может быть интерпретировано синтаксическим анализатором RFC822 [2]_.
ta: RFC 822 வடிவமைப்பைப் பொறுத்து உள்தள்ளலுடன் வெற்று கோடுகள் மற்றும் கோடுகளை ஆதரிக்க, எந்தவொரு சி.ஆர்.எல்.எஃப் எழுத்தும் 7 இடைவெளிகளால் பின்னொட்டு செய்யப்பட வேண்டும், அதைத் தொடர்ந்து குழாய் ("|") கரி. இதன் விளைவாக, விளக்க புலம் ஒரு மடிந்த புலத்தில் குறியாக்கம் செய்யப்படுகிறது, இது RFC822 பாகுபடுத்தி [2] _ ஆல் விளக்கப்படலாம்.

source: This encoding implies that any occurrences of a CRLF followed by 7 spaces and a pipe char have to be replaced by a single CRLF when the field is unfolded using a RFC822 reader.
eo: Tiu kodado implicas, ke ajna okazo de CRLF sekvita de 7 spacetoj kaj vertikalo devas esti anstataŭigita per unu CRLF, kiam la kampo estas maldensigita per realigaĵo de RFC822.
ja: このエンコーディングが意味するところは、その折り畳まれたフィールドをRFC822 読み取り器で読み取る時には、CRLF と７個の空白文字とそれに引き続くパイプ文字が出現するたびにそれを単独の CRLF に置き換えなければならないということです。
pt_br: Esta codificação implica que quaisquer ocorrências de um CRLF seguido por 7 espaços e um caractere pipe devem ser substituídos por um único CRLF quando o campo é desdobrado usando um leitor de RFC822.
ru: Эта кодировка подразумевает, что все случаи, когда за CRLF следуют 7 пробелов и символ pipe, должны быть заменены одним CRLF, когда поле разворачивается с помощью устройства чтения RFC822.
ta: இந்த குறியாக்கம் ஒரு சி.ஆர்.எல்.எஃப் இன் எந்தவொரு நிகழ்வுகளும் 7 இடைவெளிகளும் ஒரு பைப் கரி ஒரு சி.ஆர்.எல்.எஃப் மூலம் மாற்றப்பட வேண்டும், இது ஒரு ஆர்.எஃப்.சி 822 ரீடரைப் பயன்படுத்தி புலம் வெளிவரும் போது.

source: Alternatively, the distribution's description may instead be provided in the message body (i.e., after a completely blank line following the headers, with no indentation or other special formatting necessary).
eo: Alternative, la priskribo de la distribuo povas esti en la enhavo de la mesaĝo (t.e. post plene malplena linio post la ĉapoj, sen krommarĝeno aŭ alia speciala aranĝado).
ja: 代替策として、配布物に関する説明を代わりにメッセージボディに書く (つまり、字下げやその他の特別なフォーマットを使わずに、ヘッダの並びの後の完全な空行に続けて書く) こともできます。
pt_br: Alternativamente, a descrição da distribuição pode ser fornecida no corpo da mensagem (ou seja, após uma linha completamente em branco após os cabeçalhos, sem recuo ou outra formatação especial necessária).
ru: В качестве альтернативы описание дистрибутива может быть представлено в теле сообщения (т. е. после полностью пустой строки, следующей за заголовками, без отступов или другого специального форматирования).
ta: மாற்றாக, விநியோகத்தின் விளக்கம் அதற்கு பதிலாக செய்தி உடலில் வழங்கப்படலாம் (அதாவது, தலைப்புகளைப் பின்பற்றி முற்றிலும் வெற்று வரிக்குப் பிறகு, உள்தள்ளல் அல்லது பிற சிறப்பு வடிவங்கள் தேவையில்லை).

source: Description-Content-Type
ta: விளக்கம்-உள்ளடக்க வகை

source: A string stating the markup syntax (if any) used in the distribution's description, so that tools can intelligently render the description.
eo: Signoĉeno pri la marklingva sintakso (se iu ekzistas) de la priskribo de la distribuo, por inteligenta montrado de la priskribo far iloj.
ja: 配布物の説明で使われるマークアップ構文 (もしあれば) を述べる文字列で、ツールの側が頭の良いやり方で説明を表示することができます。
pt_br: Uma string informando a sintaxe de marcação (se houver) usada na descrição da distribuição, para que as ferramentas possam renderizar a descrição de maneira inteligente.
ru: Строка, указывающая синтаксис разметки (если таковая имеется), используемый в описании дистрибутива, чтобы инструменты могли грамотно отобразить описание.
ta: விநியோகத்தின் விளக்கத்தில் பயன்படுத்தப்படும் மார்க்அப் தொடரியல் (ஏதேனும் இருந்தால்) குறிப்பிடும் ஒரு சரம், இதனால் கருவிகள் புத்திசாலித்தனமாக விளக்கத்தை வழங்க முடியும்.
