Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: At a glance, you might wonder if wheels are really needed for "plain and basic" pure Python projects. Keep in mind that due to the flexibility of sdists, installers like pip cannot install from sdists directly -- they need to first build a wheel, by invoking the :term:`build backend` that the sdist specifies (the build backend may do all sorts of transformations while building the wheel, such as compiling C extensions). For this reason, even for a pure Python project, you should always upload *both* an sdist and a wheel to PyPI or other package indices. This makes installation much faster for your users, since a wheel is directly installable. By only including files that must be installed, wheels also make for smaller downloads.
eo: Vi eble scivolas, ĉu wheel estas vere necesa por «simpla kaj baza» pure Python-a projekto. Pro la fleksebleco de fonta distribuo, instalilo kiel pip ne povas rekte instali fontan distribuon – ĝi devas unue konstrui wheel per :term:`konstrua malfasado <build backend>` specifita de la fonta distribuo (la konstrua malfasado povas ĉiel transformi konstruante la wheel, kiel ekzemple traduki C-etendaĵojn). Tial, eĉ por pure Python-a projekto, vi ĉiam alŝutu kaj fontan distribuon kaj wheel al PyPI aŭ alia pakindekso. Tio multe plirapidigas instaladon por uzantoj, ĉar wheel estas rekte instalebla. Inkluzivante nur instalendajn dosierojn, wheel ankaŭ estas malpli granda por elŝuti.
ja: 一見したところでは、 wheel こそが "単純かつ基本的な" 純 Python プロジェクトに必要なものではないかと思うかもしれません。 sdist の自由度が大きいために pip のようなインストーラは sdist から直接にインストールすることができないということを覚えておいてください -- まず sdist が指定する :term:`ビルドバックエンド <build backend>` を起動することで (ビルドバックエンドはビルドして wheel を作成している間に C 言語拡張のコンパイルのようなあらゆる種類の変形をすべて行います) wheel をビルドする必要があるのです。こう言う理由で、たとえ純 Python のプロジェクトであっても、PyPI やその他のパッケージインデックスには常に sdist と wheel の *両方* をアップロードしておくべきなのです。こうすることで、wheel なら直接にインストールできるので、ユーザにとってはインストールがとても素早く行えることになります。インストールされるファイルだけを含むという wheel の性質は、ダウンロードのサイズが小さくなることにもつながります。
pt_br: À primeira vista, você pode se perguntar se wheels são realmente necessários para projetos "simples e básicos" de Python puro. Tenha em mente que devido à flexibilidade dos sdists, instaladores como o pip não podem instalar diretamente a partir dos sdists -- eles precisam primeiro construir um wheel, invocando o :term:`backend de construção` que o sdist especifica (o backend de construção pode fazer todo tipo de transformações durante a construção do wheel, como compilar extensões C). Por esse motivo, mesmo para um projeto Python puro, você deve sempre enviar *ambos* sdist e wheel para o PyPI ou outros índices de pacotes. Isso torna a instalação muito mais rápida para seus usuários, já que um wheel pode ser instalado diretamente. Ao incluir apenas os arquivos que devem ser instalados, os wheels também permitem downloads menores.
ru: На первый взгляд, вы можете задаться вопросом, действительно ли колеса нужны для "простых и базовых" проектов на чистом Python. Имейте в виду, что из-за гибкости sdist'ов такие программы установки, как pip, не могут устанавливать из sdist'ов напрямую - им нужно сначала собрать колесо, вызвав :term:`build backend`, указанный в sdist'е (build backend может выполнять всевозможные преобразования при создании колеса, например, компилировать расширения C). По этой причине, даже для чисто Python-проекта, вы всегда должны загружать *обои* sdist и wheel в PyPI или другие индексы пакетов. Это значительно ускорит установку для ваших пользователей, так как колесо можно установить напрямую. Включая только те файлы, которые должны быть установлены, колеса также уменьшают объем загружаемых файлов.
ta: ஒரு பார்வையில், "வெற்று மற்றும் அடிப்படை" தூய பைதான் திட்டங்களுக்கு சக்கரங்கள் உண்மையில் தேவையா என்று நீங்கள் ஆச்சரியப்படலாம். SDIST களின் நெகிழ்வுத்தன்மை காரணமாக, PIP போன்ற நிறுவிகள் SDISTS இலிருந்து நேரடியாக நிறுவ முடியாது என்பதை நினைவில் கொள்ளுங்கள் - அவை முதலில் ஒரு சக்கரத்தை உருவாக்க வேண்டும், இதைச் செயல்படுத்துவதன் மூலம்: கால: `பின்தளத்தில் உருவாக்குங்கள்` SDIST குறிப்பிடுகிறது (கட்டர் பின்தளத்தில் அனைத்தையும் செய்யலாம் சி நீட்டிப்புகளை தொகுத்தல் போன்ற சக்கரத்தை உருவாக்கும் போது மாற்றங்கள்). இந்த காரணத்திற்காக, தூய பைதான் திட்டத்திற்கு கூட, நீங்கள் எப்போதும் * ஒரு SDIST மற்றும் PYPI அல்லது பிற தொகுப்பு குறியீடுகளுக்கு ஒரு சக்கரம் இரண்டையும் பதிவேற்ற வேண்டும். ஒரு சக்கரம் நேரடியாக நிறுவக்கூடியதாக இருப்பதால், இது உங்கள் பயனர்களுக்கு நிறுவலை மிக வேகமாக செய்கிறது. நிறுவப்பட வேண்டிய கோப்புகளை மட்டுமே சேர்ப்பதன் மூலம், சக்கரங்கள் சிறிய பதிவிறக்கங்களையும் உருவாக்குகின்றன.

source: On the technical level, a wheel is a ZIP archive (unlike sdists which are TAR archives). You can inspect its contents by unpacking it as a normal ZIP archive, e.g., using ``unzip`` on UNIX platforms like Linux and macOS, ``Expand-Archive`` in Powershell on Windows, or :ref:`the command line interface of Python's zipfile module <python:zipfile-commandline>`. This can be very useful to check that the wheel includes all the files you need it to.
eo: Teĥnike, wheel estas ZIP-arĥivo (malkiel fonta distribuo, kiu estas TAR-arĥivo). Oni povas inspekti la enhavojn malpakante ĝin kiel ordinaran ZIP-arĥivon, ekz., per ``unzip`` sur Uniksaj platformoj kiel Linux kaj macOS, ``Expand-Archive`` en Powershell sur Windows aŭ :ref:`la komandlinia fasado de la modulo zipfile de Python <python:zipfile-commandline>`. Tio povas esti utilega por kontroli, ĉu rado inkluzivas ĉiujn dosierojn bezonatajn.
ja: 技術的なレベルでは、 wheel は (sdist が TAR アーカイブであるのとは違って) ZIP アーカイブです。例えば Linux や macOS のような UNIX 系プラットフォームなら ``unzip`` 、 Windows 上の PowerShell 内なら ``Expand-Archive`` 、あるいは Python の zipfile モジュールのコマンドライン <python:zipfile-commandline>` を使って通常の ZIP アーカイブとして展開することで、内容を検査することができます。これは、 wheel ファイルが必要なすべてのファイルを内包していることを確認するのにとても便利です。
pt_br: No nível técnico, um wheel é um arquivo ZIP (ao contrário dos sdists que são arquivos TAR). Você pode inspecionar seu conteúdo descompactando-o como um arquivo ZIP normal, por exemplo, usando ``unzip`` em plataformas UNIX como Linux e macOS, ``Expand-Archive`` no PowerShell no Windows, ou :ref:`a linha de comando interface do módulo zipfile do Python <python:zipfile-commandline>`. Isso pode ser muito útil para verificar se o wheel inclui todos os arquivos necessários.
ru: С технической точки зрения, колесо - это ZIP-архив (в отличие от sdists, которые являются TAR-архивами). Вы можете проверить его содержимое, распаковав его как обычный ZIP-архив, например, с помощью ``unzip`` на UNIX платформах, таких как Linux и macOS, ``Expand-архив`` в Powershell на Windows, или : ссылка:``интерфейс командной строки модуля zipfile в Python <python:zipfile-коммандная строка>`. Это может быть очень полезно для проверки того, что колесо включает все необходимые файлы.
ta: தொழில்நுட்ப மட்டத்தில், ஒரு சக்கரம் ஒரு சிப் காப்பகம் (தார் காப்பகங்கள் SDISTS போலல்லாமல்). லினக்ச் மற்றும் மேகோச் போன்ற யூனிக்ச் இயங்குதளங்களில் `` அன்சிப்`` ஐப் பயன்படுத்தி, எ.கா. பைத்தானின் சிப்ஃபைல் தொகுதியின் இடைமுகம் <பைதான்: சிப்ஃபைல்-கமாண்ட்லைன்> `. சக்கரம் உங்களுக்குத் தேவையான அனைத்து கோப்புகளையும் உள்ளடக்கியுள்ளதா என்பதைச் சரிபார்க்க இது மிகவும் பயனுள்ளதாக இருக்கும்.

source: Inside a wheel, you will find the package's files, plus an additional directory called :samp:`{package_name}-{version}.dist-info`. This directory contains various files, including a ``METADATA`` file which is the equivalent of ``PKG-INFO`` in sdists, as well as ``RECORD``. This can be useful to ensure no files are missing from your wheels.
eo: Ene de wheel troviĝas la dosieroj de la pako kaj ekstra dosierujo nomita :samp:`{paknomo}-{versio}.dist-info`. Tiu dosierujo enhavas diversajn dosierojn, inkluzive de dosiero ``METADATA``, kiu ekvivalentas ``PKG-INFO`` en fonta dstribuo, kaj ``RECORD``. Tio utilas por certigi, ke neniu dosiero mankas en wheel.
ja: wheel の中には、パッケージのファイル群と :samp:`{package_name}-{version}.dist-info` と呼ばれる追加のディレクトリがあります。このディレクトリには、 sdist における ``PKG-INFO`` に相当する ``METADATA`` ファイルや ``RECORD`` などのさまざまなファイルを含みます。これは、wheel 内のファイルがひとつも欠けていないことを保証するのに役立ちます。
pt_br: Dentro de um wheel, você encontrará os arquivos do pacote, além de um diretório adicional chamado :samp:`{nome_do_pacote}-{versão}.dist-info`. Este diretório contém vários arquivos, incluindo um arquivo ``METADATA`` que é equivalente a ``PKG-INFO`` em sdists, bem como ``RECORD``. Isso pode ser útil para garantir que nenhum arquivo esteja faltando em suas rodas.
ru: Внутри колеса вы найдете файлы пакета, а также дополнительный каталог под названием :samp:`{имя_пакета}-{версия}.dist-info`. Этот каталог содержит различные файлы, включая файл ``METADATA``, который является эквивалентом ``PKG-INFO`` в sdists, а также ``RECORD``. Это может быть полезно для того, чтобы убедиться, что в ваших колесах нет недостающих файлов.
ta: ஒரு சக்கரத்தின் உள்ளே, நீங்கள் தொகுப்பின் கோப்புகளையும், கூடுதல் கோப்பகத்தையும் காணலாம்: SAMP: `{package_name}-{version} .dist-info`. இந்த கோப்பகத்தில் `` மெட்டாடேட்டா`` கோப்பு உள்ளிட்ட பல்வேறு கோப்புகள் உள்ளன, இது Sdists இல் `` pkg-info`` க்கு சமமானதாகும், அத்துடன் `` பதிவு``. உங்கள் சக்கரங்களில் இருந்து கோப்புகள் எதுவும் இல்லை என்பதை உறுதிப்படுத்த இது பயனுள்ளதாக இருக்கும்.

source: The file name of a wheel (ignoring some rarely used features) looks like this: :samp:`{package_name}-{version}-{python_tag}-{abi_tag}-{platform_tag}.whl`. This naming convention identifies which platforms and Python versions the wheel is compatible with. For example, the name ``pip-23.3.1-py3-none-any.whl`` means that:
eo: La dosiernomo de wheel (ignorante kelkajn maloftajn trajtojn) aspektas jene: :samp:`{nomo_de_pako}-{versio}-{python_etikedo}-{abi_etikedo}-{platforma_etikedo}.whl`. Tiu nomada konvencio identigas tiujn platformojn kaj Python-versiojn, kun kiuj la wheel kongruas. Ekzemple, la nomo ``pip-23.3.1-py3-none-any.whl`` signifas la jenon:
ja: wheel のファイル名は (ほとんど使われることのない幾つかの機能を除けば) このように見えます: :samp:`{package_name}-{version}-{python_tag}-{abi_tag}-{platform_tag}.whl` 。この命名規則によって、その wheel がどのプラットフォームでどの Python バージョンと互換性を持つのかを識別することができます。例えば、 ``pip-23.3.1-py3-none-any.whl`` という名前は次のことを意味します:
pt_br: O nome do arquivo de um wheel (ignorando alguns recursos raramente usados) é assim: :samp:`{nome_do_pacote}-{versão}-{tag_python}-{tag_abi}-{tag_plataforma}.whl`. Esta convenção de nomenclatura identifica com quais plataformas e versões do Python a roda é compatível. Por exemplo, o nome ``pip-23.3.1-py3-none-any.whl`` significa que:
ru: Имя файла колеса (без учета некоторых редко используемых функций) выглядит так: :samp:`{имя_пакета}-{версия}-{python_tag}-{abi_tag}-{платформа_tag}.whl`. Это соглашение об именовании определяет, с какими платформами и версиями Python совместимо колесо. Например, имя ``pip-23.3.1-py3-none-any.whl`` означает, что:
ta: ஒரு சக்கரத்தின் கோப்பு பெயர் (அரிதாகவே பயன்படுத்தப்படும் சில அம்சங்களை புறக்கணித்து) இதுபோன்று தெரிகிறது :: SAMP: `{package_name}-{version}-{python_tag}-{abi_tag}-{platform_tag} .whl`. இந்த பெயரிடும் மாநாடு எந்த தளங்கள் மற்றும் பைதான் பதிப்புகள் சக்கரம் இணக்கமானது என்பதை அடையாளம் காட்டுகிறது. எடுத்துக்காட்டாக, `` பிஐபி -23.3.1-பய் 3-none-yn.whl`` என்ற பெயர் இதன் பொருள்:

source: (``py3``) This wheel can be installed on any implementation of Python 3, whether CPython, the most widely used Python implementation, or an alternative implementation like PyPy_;
eo: (``py3``) Ĉi tiu wheel estas instalebla sur ajna realigo de Python 3, ĉu CPython, la plej ĝenerale uzata realigo de Python, aŭ alternativa realigo kiel PyPy_;
ja: (``py3``) CPython、最も広く使われている Python 実装、あるいは PyPy_ のような代替実装でも、 Python 3 の実装があればどこでも、この wheel をインストールすることができます;
pt_br: (``py3``) Este wheel pode ser instalado em qualquer implementação do Python 3, seja CPython, a implementação Python mais usada, ou uma implementação alternativa como PyPy_;
ru: (``py3``) Это колесо может быть установлено на любую реализацию Python 3, будь то CPython, наиболее широко используемая реализация Python, или альтернативная реализация, например PyPy_;
ta: (``py3``) This wheel can be installed on any implementation of பைதான் 3, whether CPython, the பெரும்பாலானவை widely used பைதான் implementation, or an alternative implementation like PyPy_;

source: (``none``) It does not depend on the Python version;
eo: (``none``) Ĝi ne dependas de la versio de Python;
ja: (``none``) Python のバージョンには依存しません;
pt_br: (``none``) Não depende da versão do Python;
ru: (``нет``) Не зависит от версии Python;
ta: (`` எதுவுமில்லை``) இது பைதான் பதிப்பைப் பொறுத்தது அல்ல;

source: (``any``) It does not depend on the platform.
eo: (``any``) Ĝi ne dependas de la platformo.
ja: (``any``) プラットフォームには依存しません。
pt_br: (``qualquer``) Não depende da plataforma.
ru: (``любой``) Это не зависит от платформы.
ta: (`` ஏதேனும்``) இது தளத்தை சார்ந்தது அல்ல.

source: The pattern ``py3-none-any`` is common for pure Python projects. Packages with extension modules typically ship multiple wheels with more complex tags.
eo: La patroneo ``py3-none-any`` estas ofta por puraj Python-projektoj. Pakoj kun etendaĵaj moduloj ofte eldonas plurajn wheel-ojn de pli komplikaj etikedoj.
ja: ``py3-none-any`` というパターンは、純 Python のプロジェクトに広く見られます。拡張モジュールを伴うパッケージは、典型的に、もっと複雑なタグ群を持つ複数の wheel を出荷します。
pt_br: O padrão ``py3-none-any`` é comum para projetos Python puros. Pacotes com módulos de extensão normalmente enviam vários wheels com tags mais complexas.
ru: Шаблон ``py3-none-any`` характерен для проектов на чистом Python. Пакеты с модулями расширения обычно поставляют несколько колес с более сложными тегами.
ta: தூய பைதான் திட்டங்களுக்கு `` py3-none-any-`` முறை பொதுவானது. நீட்டிப்பு தொகுதிகள் கொண்ட தொகுப்புகள் பொதுவாக பல சக்கரங்களை மிகவும் சிக்கலான குறிச்சொற்களுடன் அனுப்புகின்றன.

source: All technical details on the wheel format can be found in the :ref:`wheel specification <binary-distribution-format>`.
eo: Ĉiaj teĥnikaj detaloj pri la dosierformo wheel troviĝas en la :ref:`specifo pri wheel <binary-distribution-format>`.
ja: wheel のフォーマットに関するすべての技術的な詳細は、 :ref:`wheel 仕様 <binary-distribution-format>` で見つかるでしょう。
pt_br: Todos os detalhes técnicos sobre o formato do wheel podem ser encontrados na :ref:`especificação de wheels <binary-distribution-format>`.
ru: Все технические подробности о формате колеса можно найти в спецификации : ссылка:`спецификация колеса <бинарный-распределительный-формат>`.
ta: சக்கர வடிவத்தில் உள்ள அனைத்து தொழில்நுட்ப விவரங்களையும் இதில் காணலாம்: ref: `சக்கர விவரக்குறிப்பு <பைனரி-டிச்ட்ரிபியூசன்-ஃபார்மாட்>`.

source: What about eggs?
eo: Kio pri egg?
ja: egg って何？
pt_br: E quanto a eggs?
ru: А как насчет яиц?
ta: முட்டைகள் பற்றி என்ன?

source: "Egg" is an old package format that has been replaced with the wheel format. It should not be used anymore. Since August 2023, PyPI `rejects egg uploads <pypi-eggs-deprecation_>`_.
eo: «Egg» estas malnova pakformo anstataŭigita per la formo wheel. Ĝi ne plu estu uzata. Ekde la Aŭgusto de 2023, PyPI `malakceptas alŝuton de egg <pypi-eggs-deprecation_>`_.
ja: "Egg" は、 wheel によって置き換えられた古いパッケージフォーマットです。もはや使用されるべきではありません。 2023 年 8 月以降、 PyPI は `egg のアップロードを拒絶 <pypi-eggs-deprecation_>`_ しています。
pt_br: "Egg" é um formato de pacote antigo que foi substituído pelo formato de wheels. Não deve mais ser usado. Desde agosto de 2023, o PyPI `rejeita envios de eggs <pypi-eggs-deprecation_>`_.
ru: "Egg" - это старый формат пакетов, который был заменен форматом wheel. Его больше не следует использовать. С августа 2023 года PyPI `отклоняет яичные загрузки <pypi-eggs-deprecation_>`_.
ta: "முட்டை" என்பது ஒரு பழைய தொகுப்பு வடிவமாகும், இது சக்கர வடிவத்துடன் மாற்றப்பட்டுள்ளது. இதை இனி பயன்படுத்தக்கூடாது. ஆகச்ட் 2023 முதல், பைபி `முட்டை பதிவேற்றங்களை நிராகரிக்கிறது <பைபி-எக்ச்-டி.இ.பி.

source: Here's a breakdown of the important differences between wheel and egg.
eo: Jen la gravaj diferencoj inter wheel kaj egg.
ja: wheelと egg の重要な差異について以下にまとめます。
pt_br: Aqui está uma análise das diferenças importantes entre wheel e egg.
ru: Вот основные различия между колесом и яйцом.
ta: சக்கரத்திற்கும் முட்டைக்கும் இடையிலான முக்கியமான வேறுபாடுகளின் முறிவு இங்கே.

source: The egg format was introduced by :ref:`setuptools` in 2004, whereas the wheel format was introduced by :pep:`427` in 2012.
eo: La formo egg estis enkondukita de :ref:`setuptools` en 2004, dum la formo wheel estis enkondukita de :pep:`427` en 2012.
ja: egg のフォーマットは、2004年に:ref:`setuptools`によって、また、wheel のフォーマットは2012年に :pep:`427` によって導入されました。
pt_br: O formato egg foi introduzido pelo :ref:`setuptools` em 2004, enquanto o formato wheel foi introduzido pela :pep:`427` em 2012.
ru: Формат яйца был представлен :ref:`setuptools` в 2004 году, а формат колеса был представлен :pep:`427` в 2012 году.
ta: முட்டையின் வடிவம் அறிமுகப்படுத்தப்பட்டது: ref: `setuptools` 2004 இல், சக்கர வடிவம் அறிமுகப்படுத்தப்பட்டது: PEP:` 427` 2012 இல்.

source: Wheel has an :doc:`official standard specification </specifications/binary-distribution-format>`. Egg did not.
eo: Wheel havas :doc:`oficialan norman specifon </specifications/binary-distribution-format>`. Specifo ne ekzistis pri Egg.
ja: Wheel には :doc:`公式の標準仕様 </specifications/binary-distribution-format>` が存在します。 Egg にはありません。
pt_br: Wheel tem uma :doc:`especificação de padrão oficial </specifications/binary-distribution-format>`. Egg não tinha.
ru: У колеса есть : документ:`официальная стандартная спецификация </спецификации/бинарный формат распределения>`. У Egg ее нет.
ta: சக்கரத்தில் ஒரு: டாக்: `அதிகாரப்பூர்வ தரநிலை விவரக்குறிப்பு </விவரக்குறிப்புகள்/பைனரி-விநியோக வடிவங்கள்>`. முட்டை அவ்வாறு செய்யவில்லை.

source: Wheel is a :term:`distribution <Distribution Package>` format, i.e a packaging format. [#wheel-importable]_ Egg was both a distribution format and a runtime installation format (if left zipped), and was designed to be importable.
eo: Wheel estas :term:`distribua <Distribution Package>` formo, alivorte pakada formo. [#wheel-importable]_ Egg estis kaj distribua formo kaj rultempa instala formo (se ĝi restis zip-densigita) kaj estis intence importebla.
ja: Wheel は :term:`配布物 <Distribution Package>`のフォーマット、つまり、パッケージングのフォーマットです [#wheel-importable]_ 。 Egg は配布物のフォーマットでもあり、かつ、(もし圧縮されたままであれば)実行時のインストールフォーマットであって、 importができるように設計されています。
pt_br: Wheel é um formato de :term:`distribuição <Distribution Package>`, ou seja, um formato de empacotamento. [#wheel-importable]_ Egg era um formato de distribuição e um formato de instalação em tempo de execução (se deixado compactado), e foi projetado para ser importável.
ru: Колесо - это : термин:`дистрибутив <дистрибутивный пакет>`, т.е. формат упаковки. [#колесо-импортируемое]_ Egg был одновременно и форматом дистрибутива, и форматом установки во время выполнения (если его оставить запечатанным), и был разработан для импорта.
ta: சக்கரம் ஒரு: கால: `விநியோக <விநியோக தொகுப்பு>` வடிவம், அதாவது பேக்கேசிங் வடிவம். .

source: Wheel archives do not include ``.pyc`` files. Therefore, when the distribution only contains Python files (i.e. no compiled extensions), and is compatible with Python 2 and 3, it's possible for a wheel to be "universal", similar to an :term:`sdist <Source Distribution (or "sdist")>`.
eo: Wheel-arĥivo ne inkluzivas ``.pyc``-dosierojn. Tial, se la distribuo nur enhavas Python-dosierojn (kaj ne tradukitajn etendaĵojn), kaj kongruas kun Python 2 kaj 3, ĝi povas esti «universala» simile al :term:`fonta distribuo <Source Distribution (or "sdist")>`.
ja: Wheel 形式のファイルには ``.pyc`` ファイルが含まれていません。従って、Pythonファイルだけが配布物に含まれている (即ちコンパイル済みの拡張がない) 場合、かつ、 Python 2 および 3 と互換性を持つ時、その wheel ファイルは、 :term:`sdist <Source Distribution (or "sdist">` と同様に "汎用 <universal>" である可能性があります。
pt_br: Os arquivos wheel não incluem arquivos ``.pyc``. Portanto, quando a distribuição contém apenas arquivos Python (ou seja, sem extensões compiladas) e é compatível com Python 2 e 3, é possível que um wheel seja "universal", semelhante a um :term:`sdist <Source Distribution (or "sdist")>`.
ru: Архивы колеса не содержат файлов ``.pyc``. Поэтому, если дистрибутив содержит только файлы Python (т.е. не содержит скомпилированных расширений) и совместим с Python 2 и 3, то колесо может быть "универсальным", подобно :term:`sdist <Источник дистрибутива (или "sdist")>`.
ta: சக்கர காப்பகங்களில் `` .பிசி`` கோப்புகள் இல்லை. ஆகையால், விநியோகத்தில் பைதான் கோப்புகள் மட்டுமே இருக்கும்போது (அதாவது தொகுக்கப்பட்ட நீட்டிப்புகள் இல்லை), மற்றும் பைத்தான் 2 மற்றும் 3 உடன் இணக்கமானது sdist ")>`.

source: Wheel uses standard :ref:`.dist-info directories <recording-installed-packages>`. Egg used ``.egg-info``.
eo: Wheel uzas la norman :ref:`dosierujon .dist-info <recording-installed-packages>`. Egg uzis ``.egg-info``.
ja: Wheel は、:ref:`.dist-info ディレクトリ <recording-installed-packages>` を使います。 Egg は ``.egg-info`` を使います。
pt_br: Wheel usa :ref:`diretórios .dist-info <recording-installed-packages>` padrões. Egg usava ``.egg-info``.
ru: Колесо использует стандартные : ссылка:``.dist-info директории <запись-установленных-пакетов>`. Egg использует ``.egg-info``.
ta: வீல் தரநிலையைப் பயன்படுத்துகிறது: ref: `.டிச்ட்-இன்ஃபோ கோப்பகங்கள் <பதிவு-நிறுவப்பட்ட-பேக்கேச்கள்>`. முட்டை `` .egg-info``.

source: Wheel has a :ref:`richer file naming convention <wheel-file-name-spec>`. A single wheel archive can indicate its compatibility with a number of Python language versions and implementations, ABIs, and system architectures.
eo: Wheel havas :ref:`pli riĉan dosiernoman konvencion <wheel-file-name-spec>`. Unu wheel-arĥivo povas indiki sian kongruecon kun pluraj versioj de la lingvo Python, de realigoj de Python, de ABI-oj kaj de sistemaj arĥitekturoj.
ja: Wheel には :ref:`多彩なファイル命名慣行 <wheel-file-name-spec>`が存在します。単独のwheelアーカイブはPython言語のバージョンや実装、ABI、そしてシステムのアーキテクチャとの互換性を表示することができます。
pt_br: Wheel tem uma :ref:`convenção de nomenclatura de arquivo mais rica <wheel-file-name-spec>`. Um único arquivo de wheel pode indicar sua compatibilidade com várias versões e implementações da linguagem Python, ABIs e arquiteturas de sistema.
ru: Колесо имеет соглашение об именовании файлов <wheel-file-name-spec>`. Один архив колес может указывать на свою совместимость с несколькими версиями и реализациями языка Python, ABI и системными архитектурами.
ta: சக்கரத்தில் ஒரு: குறிப்பு உள்ளது: `பணக்கார கோப்பு பெயரிடும் மாநாடு <சக்கர-கோப்பு-பெயர்-ச்பெக்>`. ஒரு ஒற்றை சக்கர காப்பகம் பல பைதான் மொழி பதிப்புகள் மற்றும் செயலாக்கங்கள், ABIS மற்றும் கணினி கட்டமைப்புகளுடன் அதன் பொருந்தக்கூடிய தன்மையைக் குறிக்கலாம்.

source: Wheel is versioned. Every wheel file contains the version of the wheel specification and the implementation that packaged it.
eo: Wheel estas versihava. Ĉiu wheel-dosiero enhavas la versiojn de la wheel-specifo kaj la realigon pakinte ĝin.
ja: Wheel はバージョン付けされています。それぞれのwheelファイルは、wheelの仕様のバージョンやパッケージングに使われた実装のバージョンを保持しています。
pt_br: Wheel é versionado. Cada arquivo wheel contém a versão da especificação wheel e a implementação que a empacotou.
ru: Wheel версионирован. Каждый файл wheel содержит версию спецификации wheel и реализации, в которую он упакован.
ta: சக்கரம் பதிக்கப்பட்டுள்ளது. ஒவ்வொரு சக்கர கோப்பிலும் சக்கர விவரக்குறிப்பின் பதிப்பு மற்றும் அதை தொகுத்த செயல்படுத்தல் உள்ளது.
