Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: In order to use Appveyor to build Windows wheels for your project, you must have an account on the service. Instructions on setting up an account are given in `the Appveyor documentation <https://www.appveyor.com/docs/>`__. The free tier of account is perfectly adequate for open source projects.
eo: Por uzi Appveyor por konstrui wheel por Windows por via projekto, oni devas havi konton ĉe Appveyor. La `dokumentaro de Appveyor <https://www.appveyor.com/docs/>`__ priskribas instrukciojn por krei konton. La senkosta konto sufiĉas por malfermitkoda projekto.
ja: Appveyor を用いてプロジェクトの Windows 向けの wheel をビルドするためには、このサービスのアカウントを持っていなければなりません。アカウントの設定に関する説明は `the Appveyor documentation <https://www.appveyor.com/docs/>`__ にあります。オープンソースプロジェクトには無料アカウントで十分です。
pt_br: Para usar o Appveyor para construir wheels de Windows para o seu projeto, você deve ter uma conta no serviço. As instruções sobre como configurar uma conta são fornecidas `na documentação do Appveyor <https://www.appveyor.com/docs/>`__. O nível de conta grátis é perfeitamente adequado para projetos de código aberto.
ru: Чтобы использовать Appveyor для сборки Windows-колес для вашего проекта, вы должны иметь учетную запись на этом сервисе. Инструкции по настройке учетной записи приведены в документации Appveyor <https://www.appveyor.com/docs/>`__. Бесплатный уровень учетной записи вполне подходит для проектов с открытым исходным кодом.
ta: உங்கள் திட்டத்திற்கான சாளரங்கள் சக்கரங்களை உருவாக்க AppWeyor ஐப் பயன்படுத்த, சேவையில் உங்களிடம் ஒரு கணக்கு இருக்க வேண்டும். ஒரு கணக்கை அமைப்பதற்கான வழிமுறைகள் `AppVeior ஆவணத்தில் <https://www.appweyor.com/docs/> __ __ இல் கொடுக்கப்பட்டுள்ளன. திறந்த மூல திட்டங்களுக்கு கணக்கின் இலவச அடுக்கு போதுமானது.

source: Appveyor provides integration with `GitHub`_ and `Bitbucket`_, so as long as your project is hosted on one of those two services, setting up Appveyor integration is straightforward.
eo: Appveyor integriĝas kun `GitHub`_ kaj `Bitbucket`_. Se via projekto estas gastigata en unu el tiuj du servoj, ekstarigo de Appveyor facilas.
ja: Appveyor では `GitHub`_ や `BitBucket`_ との統合運用ができるので、プロジェクトがこれらのうちのいずれかにホストされている限りは Appveyor から統合運用する設定は簡単にできます。
pt_br: O Appveyor fornece integração com `GitHub`_ e `Bitbucket`_, portanto, desde que seu projeto esteja hospedado em um desses dois serviços, configurar a integração do Appveyor é simples.
ru: Appveyor обеспечивает интеграцию с `GitHub`_ и `Bitbucket`_, поэтому, если ваш проект размещен на одном из этих двух сервисов, настройка интеграции с Appveyor не составит труда.
ta: AppVeyor `github`_ மற்றும்` BitBucket`_ உடன் ஒருங்கிணைப்பை வழங்குகிறது, எனவே உங்கள் திட்டம் அந்த இரண்டு சேவைகளில் ஒன்றில் புரவலன் செய்யப்படும் வரை, AppWeair ஒருங்கிணைப்பை அமைப்பது நேரடியானது.

source: Once you have set up your Appveyor account and added your project, Appveyor will automatically build your project each time a commit occurs. This behaviour will be familiar to users of Travis.
eo: Post starigo de konto ĉe Appveyor kaj agordado de la projekto, Appveyor aŭtomate konstruos la projekton post ĉiu modifo. Tiu konduto similas al Travis.
ja: Appveyor のアカウントの設定とプロジェクトの追加が終われば、コミットが発生するたびに Appveyor が自動的にプロジェクトをビルドするようになります。Travis のユーザはこのような動作に慣れていることでしょう。
pt_br: Depois de configurar sua conta do Appveyor e adicionar seu projeto, o Appveyor construirá automaticamente seu projeto cada vez que ocorrer um commit. Esse comportamento será familiar para os usuários do Travis.
ru: После того, как вы настроили свой аккаунт Appveyor и добавили проект, Appveyor будет автоматически собирать ваш проект каждый раз, когда происходит коммит. Такое поведение будет знакомо пользователям Travis.
ta: உங்கள் ஆப்சேயர் கணக்கை அமைத்து, உங்கள் திட்டத்தைச் சேர்த்தவுடன், ஒவ்வொரு முறையும் ஒரு கமிட் நிகழும் போது AppWeyor தானாகவே உங்கள் திட்டத்தை உருவாக்கும். இந்த நடத்தை டிராவிசின் பயனர்களுக்கு தெரிந்திருக்கும்.

source: Adding Appveyor support to your project
eo: Aldoni subtenon por Appveyor al via projekto
ja: プロジェクトに Appveyor サポートを追加する
pt_br: Adicionando suporte a Appveyor ao seu projeto
ru: Добавление поддержки Appveyor в ваш проект
ta: உங்கள் திட்டத்தில் AppWeyor ஆதரவைச் சேர்ப்பது

source: In order to define how Appveyor should build your project, you need to add an :file:`appveyor.yml` file to your project. The full details of what can be included in the file are covered in the Appveyor documentation. This guide will provide the details necessary to set up wheel builds.
eo: Por difini la tielan manieron, kiel Appveyor konstruos vian projekton, oni aldonu dosieron :file:`appveyor.yml` al via projekto. La plenaj detaloj pri la dosiero troviĝas en la dokumentaro de Appveyor. Ĉi tiu gvidilo provizas tiajn detalojn, kiaj necesas por konstrui wheel-on.
ja: Appveyor がプロジェクトをビルドする方法を定義するためには、 :file:`appveyor.yml` ファイルをプロジェクトに追加する必要があります。このファイルに書くことができる項目の完全な細部は、 Appveyor の説明文書で説明されています。このガイドでは、wheel のビルドに必要な部分に限って細部を説明します。
pt_br: Para definir como o Appveyor deve construir seu projeto, você precisa adicionar um arquivo :file:`appveyor.yml` ao seu projeto. Os detalhes completos do que pode ser incluído no arquivo são cobertos na documentação do Appveyor. Este guia fornecerá os detalhes necessários para configurar a configuração dos wheels.
ru: Для того чтобы определить, как Appveyor должен собирать ваш проект, вам необходимо добавить в проект файл :file:`appveyor.yml`. Все подробности о том, что может быть включено в этот файл, описаны в документации Appveyor. В этом руководстве мы расскажем о том, как настроить сборку колес.
ta: உங்கள் திட்டத்தை Appveyor எவ்வாறு உருவாக்க வேண்டும் என்பதை வரையறுக்க, உங்கள் திட்டத்தில் ஒரு: கோப்பு: `appweyear.yml` கோப்பைச் சேர்க்க வேண்டும். கோப்பில் என்ன சேர்க்கப்படலாம் என்பதற்கான முழு விவரங்களும் AppWayor ஆவணத்தில் உள்ளன. இந்த வழிகாட்டி சக்கர கட்டமைப்புகளை அமைக்க தேவையான விவரங்களை வழங்கும்.

source: Appveyor includes by default all of the compiler toolchains needed to build extensions for Python. For Python 2.7, 3.5+ and 32-bit versions of 3.3 and 3.4, the tools work out of the box. But for 64-bit versions of Python 3.3 and 3.4, there is a small amount of additional configuration needed to let distutils know where to find the 64-bit compilers. (From 3.5 onwards, the version of Visual Studio used includes 64-bit compilers with no additional setup).
eo: Appveyor apriore inkluzivas ĉiujn tradulkilĉenojn necesajn por konstrui etendaĵojn por Python. Por Python 2.7, 3.5+ kaj 32-bitaj versioj de 3.3 kaj 3.4, la iloj funkcias senmodife. Sed por 64-bitaj versioj de Python 3.3 kaj 3.4, oni devas iomete agordi por sciigi distutils pri la loko de la 64-bita tradukilo. (Ekde versio 3.5, la uzata versio de Visual Studio inkluzivas 64-bitan tradukilon sen plia agordo.)
ja: Appveyor は、Python 向けの拡張モジュールをビルドするために必要なすべてのコンパイラ・ツールチェーンをデフォルトで含んでいます。 Python 2.7 ・ 3.5+ 、および 32 ビット版の 3.3 と 3.4 向けであれば、このツールはそのままで動作します。しかし、 64 ビット版の 3.3 と 3.4 では、 distutils が 64 ビット版のコンパイラを検出できるように少量の追加的な設定が必要です。( 3.5 以降については、追加の設定をしなくても Visual Studio の各バージョンに含まれている 64 ビット版コンパイラを使います)。
pt_br: O Appveyor inclui por padrão todos os conjuntos de ferramentas do compilador necessários para construir extensões para Python. Para Python 2.7, 3.5+ e versões de 32 bits de 3.3 e 3.4, as ferramentas funcionam prontamente. Mas para as versões de 64 bits do Python 3.3 e 3.4, há uma pequena quantidade de configuração adicional necessária para permitir que os distutils saibam onde encontrar os compiladores de 64 bits. (De 3.5 em diante, a versão do Visual Studio usada inclui compiladores de 64 bits sem configuração adicional).
ru: Appveyor по умолчанию включает в себя все цепочки инструментов компилятора, необходимые для создания расширений для Python. Для Python 2.7, 3.5+ и 32-битных версий 3.3 и 3.4 инструменты работают из коробки. Но для 64-битных версий Python 3.3 и 3.4 требуется небольшая дополнительная настройка, чтобы distutils знал, где найти 64-битные компиляторы. (Начиная с версии 3.5, используемая версия Visual Studio включает 64-битные компиляторы без дополнительных настроек).
ta: பைத்தானுக்கான நீட்டிப்புகளை உருவாக்க தேவையான அனைத்து கம்பைலர் கருவித்தொகுப்புகளையும் இயல்பாகவே AppWeyor அடங்கும். 3.3 மற்றும் 3.4 இன் பைதான் 2.7, 3.5+ மற்றும் 32-பிட் பதிப்புகளுக்கு, கருவிகள் பெட்டியின் வெளியே செயல்படுகின்றன. ஆனால் பைதான் 3.3 மற்றும் 3.4 இன் 64-பிட் பதிப்புகளுக்கு, 64-பிட் கம்பைலர்களை எங்கு கண்டுபிடிப்பது என்பதை தொலைதூரங்களுக்கு தெரியப்படுத்த ஒரு சிறிய அளவு கூடுதல் உள்ளமைவு தேவை. (3.5 முதல், பயன்படுத்தப்படும் விசுவல் ச்டுடியோவின் பதிப்பில் கூடுதல் அமைப்பு இல்லாத 64-பிட் கம்பைலர்கள் உள்ளன).

source: appveyor.yml
ru: :file:`appveyor.yml`
ta: appweyor.yml

source: This file can be downloaded from `here <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/appveyor.yml>`__.
eo: Tiu dosiero estas elŝutebla `ĉi tie <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/appveyor.yml>`__.
ja: このファイルは `ここ <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/appveyor.yml>`__ からダウンロードすることができます。
pt_br: Este arquivo pode ser baixado `daqui <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/appveyor.yml>`__.
ru: Этот файл можно скачать отсюда <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appveyor-sample/appveyor.yml>`__.
ta: இந்த கோப்பை `இங்கே <https://raw.githubusercontent.com/pypa/python-packaging-user-guide/master/source/guides/appweyor-sample/appweyor.yml> __.

source: The :file:`appveyor.yml` file must be located in the root directory of your project. It is in ``YAML`` format, and consists of a number of sections.
eo: La dosiero :file:`appveyor.yml` devas situi en la radika dosiero de via projekto. Ĝi estas en la dosierformo ``YAML`` kaj konsistas el kelkaj sekcioj.
ja: :file:`appveyor.yml` ファイルは、プロジェクトのルートディレクトリに置かなければなりません。このファイルは ``YAML`` フォーマットで書かれていて、数多くのセクションから構成されています。
pt_br: O arquivo :file:`appveyor.yml` deve estar localizado no diretório raiz do seu projeto. Está no formato ``YAML`` e consiste em várias seções.
ru: Файл :file:`appveyor.yml` должен находиться в корневом каталоге вашего проекта. Он имеет формат ``YAML`` и состоит из нескольких секций.
ta: தி: கோப்பு: `appveyor.yml` கோப்பு உங்கள் திட்டத்தின் ரூட் கோப்பகத்தில் இருக்க வேண்டும். இது `` யம்ல்` `வடிவத்தில் உள்ளது, மேலும் பல பிரிவுகளைக் கொண்டுள்ளது.

source: The ``environment`` section is the key to defining the Python versions for which your wheels will be created. Appveyor comes with Python 2.6, 2.7, 3.3, 3.4 and 3.5 installed, in both 32-bit and 64-bit builds. The example file builds for all of these environments except Python 2.6. Installing for Python 2.6 is more complex, as it does not come with pip included. We don't support 2.6 in this document (as Windows users still using Python 2 are generally able to move to Python 2.7 without too much difficulty).
eo: La sekcio ``environment`` gravas por difini tiujn versiojn de Python, por kiuj wheel-oj kreiĝos. La Python-versioj 2.6, 2.7, 3.3, 3.4 kaj 3.5, en kaj 32-bitaj kaj 64-bitaj konstruoj, estas apriore instalitaj en Appveyor. La ekzempla dosiero konstruas por ĉiuj el tiuj medioj krom Python 2.6. Instalado por Python 2.6 estas pli komplika, ĉar pip ne estas apriore inkluzivita. Ni ne subtenas 2.6 en ĉi tiu dokumento (uzanto de Windows ankoraŭ uzanta Python 2 ordinare povas facile migri al Python 2.7).
ja: ``environment`` は、どのバージョンの Python 向けに wheel を生成するかを定義する鍵となるセクションです。 Appveyor には 32 ビット版と 64 ビット版の両方の Python 2.6, 2.7, 3.3, 3.4, 3.5 が予めインストールされています。例示したファイルでは、 Python 2.6 を除くこれらすべての環境向けにビルドするようになっています。 Python 2.6 は pip を含まないので、これをインストールすることはより複雑です。このドキュメントでは、 Python 2.6 はサポートしません (Windows ユーザでまだ Python 2 を使っているユーザであれば、大抵は大した困難に遭遇せずに Python 2.7 へ移行できるからです) 。
pt_br: A seção ``environment`` é a chave para definir as versões Python para as quais seus wheels serão criados. O Appveyor vem com Python 2.6, 2.7, 3.3, 3.4 e 3.5 instalados, em compilações de 32 e 64 bits. O arquivo de exemplo é criado para todos esses ambientes, exceto Python 2.6. A instalação do Python 2.6 é mais complexa, pois não vem com o pip incluído. Não oferecemos suporte ao 2.6 neste documento (já que os usuários do Windows que ainda usam o Python 2 geralmente são capazes de migrar para o Python 2.7 sem muita dificuldade).
ru: Раздел ``окружение`` - это ключ к определению версий Python, для которых будут создаваться ваши колеса. Appveyor поставляется с установленным Python 2.6, 2.7, 3.3, 3.4 и 3.5, как в 32-битных, так и в 64-битных сборках. Файл примера собирается для всех этих сред, кроме Python 2.6. Установка для Python 2.6 более сложна, так как в комплект поставки не входит pip. Мы не поддерживаем 2.6 в этом документе (поскольку пользователи Windows, все еще использующие Python 2, обычно могут перейти на Python 2.7 без особых проблем).
ta: உங்கள் சக்கரங்கள் உருவாக்கப்படும் பைதான் பதிப்புகளை வரையறுப்பதற்கான முக்கிய நற்பொருத்தம் `` சூழல்`` பிரிவு. 32-பிட் மற்றும் 64-பிட் கட்டமைப்புகளில் பைதான் 2.6, 2.7, 3.3, 3.4 மற்றும் 3.5 நிறுவப்பட்ட பைதான் 2.6, நிறுவப்பட்டுள்ளது. பைதான் 2.6 தவிர இந்த சூழல்கள் அனைத்திற்கும் எடுத்துக்காட்டு கோப்பு உருவாகிறது. பைதான் 2.6 க்கு நிறுவுவது மிகவும் சிக்கலானது, ஏனெனில் இது பிஐபி சேர்க்கப்படவில்லை. இந்த ஆவணத்தில் நாங்கள் 2.6 ஐ ஆதரிக்கவில்லை (விண்டோச் பயனர்கள் இன்னும் பைதான் 2 ஐப் பயன்படுத்துவதால் பொதுவாக பைதான் 2.7 க்கு அதிக தொல்லை இல்லாமல் செல்ல முடியும்).

source: The ``install`` section uses pip to install any additional software that the project may require. The only requirement for building wheels is the ``wheel`` project, but projects may wish to customise this code in certain circumstances (for example, to install additional build packages such as ``Cython``, or test tools such as ``tox``).
ja: ``install`` セクションは、プロジェクトが必要とする追加的なソフトウェアを pip を使ってインストールするのに使われます。 wheel をビルドするために必要なものは ``wheel`` プロジェクトだけですが、プロジェクトによっては特定の環境下ではこの項をカスタマイズしたいと思うかもしれません (例えば、 ``Cython`` のような追加的なビルド用パッケージないし ``tox`` のようなテストツールをインストールするために)。
pt_br: A seção ``install`` usa pip para instalar qualquer software adicional que o projeto possa exigir. O único requisito para a construção de wheels é o projeto ``wheel``, mas os projetos podem desejar personalizar este código em certas circunstâncias (por exemplo, para instalar pacotes de construção adicionais, como ``Cython``, ou ferramentas de teste como ``tox``).
ru: В разделе ``install`` используется pip для установки любого дополнительного программного обеспечения, которое может потребоваться проекту. Единственным требованием для сборки колес является проект ``wheel``, но проекты могут захотеть изменить этот код в определенных обстоятельствах (например, для установки дополнительных пакетов сборки, таких как ``Cython``, или инструментов тестирования, таких как ``tox``).
ta: திட்டத்திற்குத் தேவைப்படும் கூடுதல் மென்பொருளை நிறுவ `` நிறுவல்` பிரிவு PIP ஐப் பயன்படுத்துகிறது. சக்கரங்களை உருவாக்குவதற்கான ஒரே தேவை `` சக்கரம்`` திட்டமாகும், ஆனால் திட்டங்கள் இந்த குறியீட்டை சில சூழ்நிலைகளில் தனிப்பயனாக்க விரும்பலாம் (எடுத்துக்காட்டாக, `` சைதான்`` போன்ற கூடுதல் பில்ட் தொகுப்புகளை நிறுவ அல்லது `` போன்ற சோதனைக் கருவிகளை நிறுவவும் விரும்பலாம் நச்சு``).

source: The ``build`` section simply switches off builds - there is no build step needed for Python, unlike languages like ``C#``.
eo: La sekcio ``build`` simple malŝaltas konstruadon – neniu konstrua paŝo necesas por Python malkiel ekzemple ``C#``.
ja: ``build`` セクションでは単純にビルドのスイッチを切りましょう - ``C#`` のような言語とは異なり、Python にはビルドする段階は不要なのです。
pt_br: A seção ``build`` simplesmente desativa as construções -- não há etapa de construção necessária para Python, ao contrário de linguagens como ``C#``.
ru: Секция ``build`` просто отключает сборку - в отличие от таких языков, как ``C#``, для Python не требуется никаких действий по сборке.
ta: `` பில்ட்`` பிரிவு வெறுமனே கட்டமைப்பை அணைக்க வேண்டும் - பைத்தானுக்கு எந்த கட்டமைப்பும் தேவையில்லை, `` சி#`` போன்ற மொழிகளைப் போலல்லாமல்.

source: The main sections that will need to be tailored to your project are ``test_script`` and ``after_test``.
eo: La ĉefaj sekcioj adaptendaj al via projekto estas ``test_script`` kaj ``after_test``.
ja: 個々のプロジェクト向けに整える必要のある主なセクションは、 ``test_script`` と ``after_test`` です。
pt_br: As principais seções que precisarão ser adaptadas ao seu projeto são ``test_script`` e ``after_test``.
ru: Основные секции, которые необходимо адаптировать под ваш проект, - это ``тестовый_скрипт`` и ``после_теста``.
ta: உங்கள் திட்டத்திற்கு ஏற்ப வடிவமைக்க வேண்டிய முக்கிய பிரிவுகள் `` டெச்ட்_ச்கிரிப்ட்`` மற்றும் `` பிறகு_டெச்ட்``.

source: The ``test_script`` section is where you will run your project's tests. The supplied file runs your test suite using ``setup.py test``. If you are only interested in building wheels, and not in running your tests on Windows, you can replace this section with a dummy command such as ``echo Skipped Tests``. You may wish to use another test tool, such as ``nose`` or :file:`py.test`. Or you may wish to use a test driver like ``tox`` - however if you are using ``tox`` there are some additional configuration changes you will need to consider, which are described below.
eo: La sekcio ``test_script`` estas la loko, kie oni rulas la testojn de la projekto. La donita dosiero rulas la testaron per ``setup.py test``. Se oni nur interesiĝas pri konstruado de wheel-oj kaj ne pri rulado de testoj sur Windows, oni povas anstataŭigi tiun sekcion per neniaĵo kiel ``echo Preterpasis Testojn``. Oni eble deziras uzi alian testilon kiel ``nose`` aŭ :file:`py.test`. Aŭ oni deziras uzi testozorgilon kiel ``tox`` – tamen, se oni uzas ``tox``, oni konsideru la ĉi-subajn pliajn ŝanĝojn pri agordoj.
ja: ``test_script`` セクションは、プロジェクトのテストを走らせる場所です。与えられたファイルを使って ``setup.py test`` を走らせることで一連のテストを行います。wheel ファイルをビルドすることだけに興味があるのであれば、そして、 Windows でテストをしないのであれば、このセクションに ``echo Skipped Tests`` のようなダミーコマンドを書いておけば良いでしょう。 ``nose`` や :file:`py.test` のような他のテストツールを使いたい場合があるかもしれません。あるいは、 ``tox`` のようなテストドライバを使いたいと思うかもしれません - しかしながら、 ``tox`` を使う場合には、後述の通り、もう少し追加の設定変更を検討する必要があることでしょう。
pt_br: A seção ``test_script`` é onde você executará os testes do seu projeto. O arquivo fornecido executa seu conjunto de testes usando ``setup.py test``. Se você está interessado apenas em construir wheels, e não em executar seus testes no Windows, você pode substituir esta seção por um comando fictício, como ``echo Skipped Tests``. Você pode querer usar outra ferramenta de teste, como ``nose`` ou :file:`py.test`. Ou você pode desejar usar um driver de teste como o ``tox`` -- entretanto, se você estiver usando o ``tox``, existem algumas alterações de configuração adicionais que você precisará considerar, que são descritas abaixo.
ru: Раздел ``тест_скрипт`` - это место, где вы будете запускать тесты вашего проекта. В прилагаемом файле набор тестов запускается с помощью команды ``setup.py test``. Если вас интересует только сборка колес, а не запуск тестов под Windows, вы можете заменить этот раздел фиктивной командой, например ``echo Skipped Tests``. Возможно, вы захотите использовать другой инструмент тестирования, например ``nose`` или :file:`py.test``. Или вы можете использовать тестовый драйвер, например ``tox`` - однако если вы используете ``tox``, вам придется внести некоторые дополнительные изменения в конфигурацию, которые описаны ниже.
ta: உங்கள் திட்டத்தின் சோதனைகளை இயக்கும் இடம் `` டெச்ட்_ச்கிரிப்ட்`` பிரிவு. வழங்கப்பட்ட கோப்பு `` setup.py test`` ஐப் பயன்படுத்தி உங்கள் சோதனை தொகுப்பை இயக்குகிறது. நீங்கள் சக்கரங்களை உருவாக்குவதில் மட்டுமே ஆர்வமாக இருந்தால், சாளரங்களில் உங்கள் சோதனைகளை இயக்குவதில் அல்ல, இந்த பகுதியை `` எதிரொலி தவிர்க்கப்பட்ட சோதனைகள்` போன்ற போலி கட்டளையுடன் மாற்றலாம். `` மூக்கு`` அல்லது: கோப்பு: `py.test` போன்ற மற்றொரு சோதனை கருவியைப் பயன்படுத்த விரும்பலாம். அல்லது `` டாக்ச்`` போன்ற சோதனை இயக்கியைப் பயன்படுத்த விரும்பலாம் - இருப்பினும் நீங்கள் `` டோக்ச்`` ஐப் பயன்படுத்துகிறீர்கள் என்றால், நீங்கள் கருத்தில் கொள்ள வேண்டிய சில கூடுதல் உள்ளமைவு மாற்றங்கள் உள்ளன, அவை கீழே விவரிக்கப்பட்டுள்ளன.

source: The ``after_test`` runs once your tests have completed, and so is where the wheels should be built. Assuming your project uses the recommended tools (specifically, ``setuptools``) then the ``setup.py bdist_wheel`` command will build your wheels.
eo: La ``after_test`` ruliĝas post fino de la testoj; tial oni konstruas la wheel tie. Supozante, ke via projekto uzas la rekomendatajn ilojn (specife ``setuptools``), do la komando ``setup.py bdist_wheel`` konstruos la wheel.
ja: ``after_test`` は、テストが完了したあとに一度だけ走り、したがって、ここで wheel ファイルを生成するべきです。あなたのプロジェクトで推奨ツール (とりわけ ``setuptools``) を使っているなら、 ``setup.py bdist_wheel`` コマンドで wheel ファイルを生成できます。
pt_br: O ``after_test`` é executado uma vez que seus testes foram concluídos, e então é onde os wheels devem ser construídos. Presumindo que seu projeto usa as ferramentas recomendadas (especificamente, ``setuptools``) então o comando ``setup.py bdist_wheel`` irá construir seus wheels.
ru: Команда ``after_test`` запускается после завершения тестов, и именно в ней должны быть собраны колеса. Если ваш проект использует рекомендуемые инструменты (в частности, ``setuptools``), то команда ``setup.py bdist_wheel'' соберет ваши колеса.
ta: உங்கள் சோதனைகள் முடிந்ததும் `` after_test`` இயங்கும், அவ்வாறே சக்கரங்கள் கட்டப்பட வேண்டும். உங்கள் திட்டம் பரிந்துரைக்கப்பட்ட கருவிகளைப் பயன்படுத்துகிறது (குறிப்பாக, `` setuptools``) பின்னர் `` setup.py.py bdist_wheel`` கட்டளை உங்கள் சக்கரங்களை உருவாக்கும்.

source: Note that wheels will only be built if your tests succeed. If you expect your tests to fail on Windows, you can skip them as described above.
eo: Notu, ke wheel konstruiĝos nur, se la testoj sukcesos. Se oni atendas malsukceson de testoj sur Windows, oni povas preterpasi ilin laŭ la maniero ĉi-supra.
ja: テストが成功した場合にだけ wheel ファイルが生成されるという点に留意してください。 Windows ではテストが失敗するとわかっているなら、前述の通り、それを省略することができます。
pt_br: Observe que os wheels só serão construídos se seus testes forem bem-sucedidos. Se você espera que seus testes falhem no Windows, você pode pulá-los conforme descrito acima.
ru: Обратите внимание, что колеса будут собраны только в том случае, если ваши тесты пройдут успешно. Если вы ожидаете, что ваши тесты не пройдут под Windows, вы можете пропустить их, как описано выше.
ta: உங்கள் சோதனைகள் செய் பெற்றால் மட்டுமே சக்கரங்கள் கட்டப்படும் என்பதை நினைவில் கொள்க. சாளரங்களில் உங்கள் சோதனைகள் தோல்வியடையும் என்று நீங்கள் எதிர்பார்த்தால், மேலே விவரிக்கப்பட்டபடி அவற்றைத் தவிர்க்கலாம்.

source: Support script
eo: Helpa programeto
ja: サポートスクリプト
pt_br: Script de suporte
ru: Скрипт поддержки
ta: ச்கிரிப்ட் உதவி
