Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: A bdist format that implements this scheme should include the expanded tags in bdist-specific metadata. This compression scheme can generate large numbers of unsupported tags and "impossible" tags that are supported by no Python implementation e.g. "cp33-cp31u-win64", so use it sparingly.
ja: このスキームを実装する bdist フォーマットは、拡張されたタグ群を bdist に特有のメタデータの中に含んでいるべきです。この圧縮スキームは、サポートされていないタグや例えば "cp33-cp31u-win64" のようにいかなる Python 実装においてもサポートされていない "不可能な" タグを大量に生成すると思われるので、控えめに使うようにしてください。
ru: Формат bdist, реализующий эту схему, должен включать расширенные теги в метаданные, специфичные для bdist. Эта схема сжатия может генерировать большое количество неподдерживаемых тегов и "невозможных" тегов, которые не поддерживаются ни одной реализацией Python, например, "cp33-cp31u-win64", поэтому используйте ее осторожно.
ta: இந்த திட்டத்தை செயல்படுத்தும் ஒரு BDIST வடிவத்தில் BDIST- குறிப்பிட்ட மெட்டாடேட்டாவில் விரிவாக்கப்பட்ட குறிச்சொற்கள் இருக்க வேண்டும். இந்த சுருக்கத் திட்டம் அதிக எண்ணிக்கையிலான ஆதரிக்கப்படாத குறிச்சொற்கள் மற்றும் பைதான் செயல்படுத்தல் இல்லாத "சாத்தியமற்ற" குறிச்சொற்களை உருவாக்க முடியும் எ.கா. "CP33-CP31U-WIN64", எனவே அதை குறைவாகப் பயன்படுத்துங்கள்.

source: What tags are used by default?
eo: Kiuj etikedoj uziĝas implicite?
ja: デフォルトではどんなタグが使われますか？
pt_br: Quais etiquetas são utilizadas por padrão?
ru: Какие теги используются по умолчанию?
ta: முன்னிருப்பாக என்ன குறிச்சொற்கள் பயன்படுத்தப்படுகின்றன?

source: Tools should use the most-preferred architecture dependent tag e.g. ``cp33-cp33m-win32`` or the most-preferred pure python tag e.g. ``py33-none-any`` by default. If the packager overrides the default it indicates that they intended to provide cross-Python compatibility.
eo: Ilo apriore uzu la plej preferata arĥitekturo-dependa etikedo, ekz. ``cp33-cp33m-win32``, aŭ la plej preferata pure Python-a etikedo, ekz. ``py33-none-any``. Se la pakanto modifis la aprioron, tio signifas, ke inter-Python-a kongrueco estas intencita.
ja: ツール類は、 ``cp33-cp33m-win32`` のようなアーキテクチャへの依存を示すタグや ``py33-none-any`` のような純 Python タグの中で最も好ましいものをデフォルトで採用するべきです。パッケージ製作者がデフォルトをオーバーライドしていたとすれば、それは彼らが異なる Python 間での互換性を提供しようという意図があったことを示しています。
ru: По умолчанию инструменты должны использовать наиболее предпочтительный тег, зависящий от архитектуры, например, ``cp33-cp33m-win32`` или наиболее предпочтительный тег чистого python, например, ``py33-none-any``. Если упаковщик переопределяет значение по умолчанию, это указывает на то, что он намерен обеспечить кросс-Python совместимость.
ta: கருவிகள் மிகவும் விரும்பிய கட்டமைப்பு சார்ந்த குறிச்சொல்லைப் பயன்படுத்த வேண்டும் எ.கா. `` CP33-CP33M-WIN32`` அல்லது மிகவும் விரும்பப்படும் தூய பைதான் குறிச்சொல் எ.கா. `` py33-none-any-wone`` இயல்பாக. பேக்கேசர் இயல்புநிலையை மீறினால், அவை குறுக்கு-பைத்தான் பொருந்தக்கூடிய தன்மையை வழங்க விரும்பியதைக் குறிக்கிறது.

source: What tag do I use if my distribution uses a feature exclusive to the newest version of Python?
eo: Kiun etikedon mi uzu, se mia distribuo uzas funkcion nur en la nova versio de Python?
ja: 自分の配布物が最新版の Python と相容れない機能を使っているとしたら、どんなタグを使いますか？
ru: Какой тег мне использовать, если в моем дистрибутиве используется функция, эксклюзивная для новейшей версии Python?
ta: எனது வழங்கல் பைத்தானின் புதிய பதிப்பிற்கு பிரத்யேகமான அம்சத்தைப் பயன்படுத்தினால் நான் என்ன குறிச்சொல்லைப் பயன்படுத்துகிறேன்?

source: Compatibility tags aid installers in selecting the *most compatible* build of a *single version* of a distribution. For example, when there is no Python 3.3 compatible build of ``beaglevote-1.2.0`` (it uses a Python 3.4 exclusive feature) it may still use the ``py3-none-any`` tag instead of the ``py34-none-any`` tag. A Python 3.3 user must combine other qualifiers, such as a requirement for the older release ``beaglevote-1.1.0`` that does not use the new feature, to get a compatible build.
eo: Etikedoj pri kongrueco helpas instalilojn elekti la *plej kongruan* konstruon de *unu versio* de distribuo. Ekzemple, se ne ekzistas Python-3.3-kongruan konstruon de ``beaglevote-1.2.0`` (ĉar ĝi uzas funkcion nur en 3.4), ĝi tamen povas uzi la etikedon ``py3-none-any`` anstataŭ la etikedo ``py34-none-any``. Uzanto de Python 3.3 devas kombini aliajn kvalifikilojn kiel postulon por la malnova eldono ``beaglevote-1.1.0`` ne uzanta la novan funkcion, por akiri kongruan konstruon.
ja: 互換性タグは、インストーラがある配布物の *単一のバージョン* の *最も互換性がある* ビルドを選択する際に助けとなります。例えば、 (Python 3.4 に特有の機能を使っている) ``beaglevote-1.2.0``には Python 3.3 と互換性を持つビルドがひとつもないという場合でも、 ``py34-none-any`` タグの代わりに ``py3-none-any`` タグを使っても構いません。 Python 3.3 のユーザが互換性のあるビルドを得るためには、新しい機能を使う前のリリースである ``beaglevote-1.1.0`` 用の要求 (requirement) などを他の指定子を組み合わせなければなりません。
ru: Теги совместимости помогают установщикам выбрать *наиболее совместимую* сборку *одной версии* дистрибутива. Например, когда не существует сборки ``beaglevote-1.2.0``, совместимой с Python 3.3 (она использует эксклюзивную возможность Python 3.4), можно использовать тег ``py3-none-any`` вместо тега ``py34-none-any``. Пользователь Python 3.3 должен комбинировать другие квалификаторы, например, требовать более старый выпуск ``beaglevote-1.1.0``, который не использует новую возможность, чтобы получить совместимую сборку.
ta: பொருந்தக்கூடிய குறிச்சொற்கள் ஒரு விநியோகத்தின் * ஒற்றை பதிப்பின் * மிகவும் இணக்கமான * கட்டமைப்பைத் தேர்ந்தெடுப்பதில் நிறுவிகளுக்கு உதவுகின்றன. எடுத்துக்காட்டாக, பைதான் 3.3 இல்லாதபோது `` பீக்லெவோட் -1.2.0`` (இது ஒரு பைதான் 3.4 பிரத்தியேக அம்சத்தைப் பயன்படுத்துகிறது) இது `` py3-none-any- `` குறிச்சொல்லைப் பயன்படுத்தலாம் py34-none-any` குறிச்சொல். ஒரு பைதான் 3.3 பயனர் பழைய வெளியீட்டுக்கான தேவை போன்ற பிற தகுதிகளை இணைக்க வேண்டும் `` பீகிள்வோட் -1.1.0`` இது புதிய அம்சத்தைப் பயன்படுத்தாதது, இணக்கமான கட்டமைப்பைப் பெற.

source: Why isn't there a ``.`` in the Python version number?
eo: Kial mankas ``.`` en la versia numero de Python?
ja: Python のバージョン番号に ``.`` がないのはなぜですか?
ru: Почему в номере версии Python нет ``.``?
ta: பைதான் பதிப்பு எண்ணில் ஏன் `` .`` இல்லை?

source: CPython has lasted 20+ years without a 3-digit major release. This should continue for some time. Other implementations may use _ as a delimiter, since both - and . delimit the surrounding filename.
eo: CPython daŭris pli ol 20 jarojn sen tricifera maĵora eldono. Tio daŭros longe. Alia realigo povas uzi ``_`` kiel apartigilon, ĉar kaj ``-`` kaj ``.`` apartigas la ĉirkaŭan dosiernomon.
ja: CPython は、数字３個のメジャーリリースなしで 20 年以上にわたって存続してきました。これはしばらくの間は続くに違いありません。 - や . が周辺のファイル名を区切る役割を果たしているので、他の実装では _ を区切り子として使っても構いません。
ru: CPython продержался 20 с лишним лет без трехзначного мажорного релиза. Это должно продолжаться еще некоторое время. Другие реализации могут использовать _ в качестве разделителя, поскольку и -, и . разграничивают окружающее имя файла.
ta: 3 இலக்க பெரிய வெளியீடு இல்லாமல் CPyThon 20+ ஆண்டுகள் நீடித்தது. இது சிறிது நேரம் தொடர வேண்டும். மற்ற செயலாக்கங்கள் _ இரண்டையும் ஒரு டிலிமிட்டராகப் பயன்படுத்தலாம் - மற்றும். சுற்றியுள்ள கோப்பு பெயரை வரையறுக்கவும்.

source: Why normalise hyphens and other non-alphanumeric characters to underscores?
eo: Kial normigi streketojn kaj aliajn ne literciferajn signojn al substrekoj?
ja: ハイフンやその他の英数字以外の文字をアンダースコアに正規化するのはなぜですか?
ru: Зачем приводить дефисы и другие неалфавитные символы в соответствие с символами подчеркивания?
ta: ஐபன்கள் மற்றும் பிற ஆல்பனுமெரிக் அல்லாத எழுத்துக்களை அடிக்கோடிட்டுக் காட்டுவது ஏன்?

source: To avoid conflicting with the ``.`` and ``-`` characters that separate components of the filename, and for better compatibility with the widest range of filesystem limitations for filenames (including being usable in URL paths without quoting).
eo: Por averti konfliktojn kun la signoj ``.`` kaj ``-`` apartigantaj komponantojn de la dosiernomo, kaj por kongrueco kun tiom da dosiersistemaj limigoj kiom eblas (inkluzive de uzebleco en retadreso sen kodŝanĝado).
ja: ファイル名の部分部分を区分けする ``.`` 文字や ``-`` 文字との干渉を避けるために、かつ、 (クォートすることなく URL パス内で使用可能であることを含む) 数多あるファイルシステムのファイル名に対する制限事項との間のより良い互換性のために。
ru: Чтобы избежать конфликта с символами ``.`` и ``-``, разделяющими компоненты имени файла, а также для лучшей совместимости с широким спектром ограничений файловой системы для имен файлов (включая возможность использования в URL-путях без кавычек).
ta: கோப்பு பெயரின் கூறுகளை பிரிக்கும் `` .` மற்றும் `` --`` எழுத்துக்களுடன் முரண்படுவதைத் தவிர்ப்பதற்கும், கோப்பு பெயர்களுக்கான பரந்த அளவிலான கோப்பு முறைமை வரம்புகளுடன் சிறந்த பொருந்தக்கூடிய தன்மைக்கும் (மேற்கோள் காட்டாமல் முகவரி பாதைகளில் பயன்படுத்தக்கூடியது உட்பட).

source: Why not use special character <X> rather than ``.`` or ``-``?
eo: Kial ne uzi iun specialan signon alian ol ``.`` aŭ ``-``?
ja: 何故、 ``.`` や ``-`` の代わりに特殊な文字 <X> を使わないのですか？
ru: Почему бы не использовать специальный символ <X>, а не ``.`` или ``-``?
ta: `` .` அல்லது `` -`` ஐ விட சிறப்பு எழுத்தை <x> ஏன் பயன்படுத்தக்கூடாது?

source: Either because that character is inconvenient or potentially confusing in some contexts (for example, ``+`` must be quoted in URLs, ``~`` is used to denote the user's home directory in POSIX), or because the advantages weren't sufficiently compelling to justify changing the existing reference implementation for the wheel format defined in :pep:`427` (for example, using ``,`` rather than ``.`` to separate components in a compressed tag).
ja: それは、その文字が不便であるかコンテクストによっては潜在的に混乱を招きやすい (例えば ``+`` は URL 内ではクォートしなければなりませんし、 ``~`` は POSIX でユーザのホームディレクトリを示すために使われます) から、あるいは、 :pep:`427` で定義された wheel フォーマットを参照して作成された既存の参照実装を変更すること (例えば、圧縮タグで部分部分を分割するのに ``.`` ではなく ``,`` を使うようにすること) を正当化するに足りるだけのアドバンテージがないから、のいずれかです。
ru: Либо потому, что этот символ неудобен или потенциально запутан в некоторых контекстах (например, ``+`` должен быть заключен в кавычки в URL, ``~`` используется для обозначения домашнего каталога пользователя в POSIX), либо потому, что преимущества не были достаточно убедительными, чтобы оправдать изменение существующей реализации ссылки на формат колеса, определенный в :pep:`427` (например, использование ``,`` вместо ``.`` для разделения компонентов в сжатом теге).
ta: அந்த தன்மை சில சூழல்களில் சிரமமாக அல்லது குழப்பமானதாக இருப்பதால் (எடுத்துக்காட்டாக, ``+`` முகவரி களில் மேற்கோள் காட்டப்பட வேண்டும், `` `` பயனரின் வீட்டு கோப்பகத்தை POSIX இல் குறிக்கப் பயன்படுகிறது), அல்லது 4 டாலர், PERATER க்குள் மாற்றுவதற்கு போதுமானதாக இல்லை என்பதால், `` `பயன்படுத்தப்படுகிறது. சுருக்கப்பட்ட குறிச்சொல்லில் கூறுகளை பிரிக்க `` `.` ஐ விட` `).

source: Who will maintain the registry of abbreviated implementations?
eo: Kiu mastrumas la registron de mallongigitaj realigoj?
ja: 誰が実装に関する短縮形のレジストリの維持管理をしているのですか？
ru: Кто будет вести реестр сокращенных реализаций?
ta: சுருக்கமான செயலாக்கங்களின் பதிவேட்டை யார் பராமரிப்பார்கள்?

source: New two-letter abbreviations can be requested on the python-dev mailing list. As a rule of thumb, abbreviations are reserved for the current 4 most prominent implementations.
eo: Oni povas peti novan duliteran mallongigon ĉe la dissendolisto ``python-dev``. Ordinare, mallongigoj estas rezervataj por la aktuale plej famaj kvar realigoj.
ja: python-dev メーリングリストで要求することで、新しい２文字省略形の割り当てを受けることができるでしょう。経験上は、その時点で最も卓越した４個の実装のために省略形が予約されています。
ru: Новые двухбуквенные аббревиатуры можно запросить в списке рассылки python-dev. Как правило, аббревиатуры сохраняются для 4 наиболее известных реализаций.
ta: பைதான்-டெவ் அஞ்சல் பட்டியலில் புதிய இரண்டு-எழுத்து சுருக்கங்களை கோரலாம். கட்டைவிரல் விதியாக, தற்போதைய 4 மிக முக்கியமான செயலாக்கங்களுக்கு சுருக்கங்கள் ஒதுக்கப்பட்டுள்ளன.

source: Does the compatibility tag go into METADATA or PKG-INFO?
eo: Ĉu la kongrueca etikedo troviĝas en METADATA aŭ PKG-INFO?
ja: 互換性タグは METADATA に含まれるのか、あるいは PKG-INFO か？
ru: Тег совместимости помещается в METADATA или PKG-INFO?
ta: பொருந்தக்கூடிய குறிச்சொல் மேனிலை தரவு அல்லது பி.கே.சி-இன்ஃபோவுக்குச் செல்கிறதா?

source: No. The compatibility tag is part of the built distribution's metadata. METADATA / PKG-INFO should be valid for an entire distribution, not a single build of that distribution.
eo: Ne. La etikedo pri kongrueco estas larto de la metadatenoj de la konstruita distribuo. METADATA kaj PKG-INFO estu validaj por la tuta distribuo, ne nur unu konstruo de tiu distribuo.
ja: 否。互換性タグはビルド済み配布物のメタデータの一部です。METADATA / PKG-INFO は、その配布物の単一のビルドではなく配布物の全体にとって正当なものであるべきです。
ru: Нет. Метка совместимости является частью метаданных собранного дистрибутива. METADATA / PKG-INFO должны быть действительны для всего дистрибутива, а не для одной его сборки.
ta: இல்லை. பொருந்தக்கூடிய குறிச்சொல் கட்டப்பட்ட விநியோகத்தின் மெட்டாடேட்டாவின் ஒரு பகுதியாகும். மேனிலை தரவு / பி.கே.சி-இன்ஃபோ ஒரு முழு விநியோகத்திற்கும் செல்லுபடியாகும், அந்த விநியோகத்தின் ஒரு கட்டமைப்பும் கூட இல்லை.

source: Why didn't you mention my favorite Python implementation?
eo: Kial vi ne menciis mian preferatan realigon de Python?
ja: どうして私のお気に入りの Python 実装について言及しなかったの？
ru: Почему вы не упомянули мою любимую реализацию Python?
ta: எனக்கு பிடித்த பைதான் செயல்படுத்தலை ஏன் குறிப்பிடவில்லை?

source: The abbreviated tags facilitate sharing compiled Python code in a public index. Your Python implementation can use this specification too, but with longer tags. Recall that all "pure Python" built distributions just use ``py``.
eo: La mallongigitaj etikedoj faciligas kunhavigadon de tradukita Python-kodo ĉe publika indekso. Via Python-realigo povas uzi ĉi tiun specifon ankaŭ, sed kun pli longaj etikedoj. Rememoru, ke ĉiu «pure Python-a» konstruita distribuo simple uzas ``py``.
ja: 省略形タグは、コンパイル済みの Python コードを公開のインデックスでシェアすることを促進します。あなたの Python 実装においてもこの仕様を使うことができますが、しかしもっと長いタグになってしまうことでしょう。すべての "純 Python" なビルド済み配布物が単に ``py`` を使うだけであることを思い出してください。
ru: Сокращенные теги облегчают обмен скомпилированным кодом Python в публичном индексе. Ваша реализация Python тоже может использовать эту спецификацию, но с более длинными тегами. Напомним, что все дистрибутивы, построенные на "чистом Python", просто используют ``py``.
ta: சுருக்கமான குறிச்சொற்கள் ஒரு பொது குறியீட்டில் தொகுக்கப்பட்ட பைதான் குறியீட்டைப் பகிர்வதற்கு உதவுகின்றன. உங்கள் பைதான் செயல்படுத்தல் இந்த விவரக்குறிப்பையும் பயன்படுத்தலாம், ஆனால் நீண்ட குறிச்சொற்களுடன். அனைத்து "தூய பைதான்" கட்டப்பட்ட விநியோகங்களும் `` py`` ஐப் பயன்படுத்துகின்றன என்பதை நினைவில் கொள்க.

source: Why is the ABI tag (the second tag) sometimes "none" in the reference implementation?
eo: Kial la ABI-etikedo (la dua etikedo) estas kelkfoje «none» en la referenca realigo?
ja: どうして参照実装における ABI タグ (第２のタグ) は時々 "none" なのですか？
ru: Почему в эталонной реализации тег ABI (второй тег) иногда имеет значение "none"?
ta: குறிப்பு செயல்படுத்தலில் அபி குறிச்சொல் (இரண்டாவது குறிச்சொல்) சில நேரங்களில் "எதுவுமில்லை"?

source: Since Python 2 does not have an easy way to get to the SOABI (the concept comes from newer versions of Python 3) the reference implementation at the time of writing guesses "none". Ideally it would detect "py27(d|m|u)" analogous to newer versions of Python, but in the meantime "none" is a good enough way to say "don't know".
eo: Ĉar Python 2 ne faciligas akiri la SOABI (la koncepto nur ekekzistis en novaj versioj de Python 3), la nuntempa referenca realigo divenas ``none``. Ideale ĝi detektus ``py27(d|m|u)`` simile al novaj versioj de Python, sed ``none`` sufiĉas por indiki nekonatecon.
ja: Python 2 では SOABI (より新しい版の Python 3 から来た概念) を作成する簡単な方法がないので、本稿執筆時点の参照実装は "none" なのです。理想的には、それはもっと新しい版の Python に相似の "py27(d|m|u)" を検出するようになるでしょうが、それまでの間は "知られていない" ことを示すのに "none" とすることが必要十分な方法なのです。
ru: Поскольку в Python 2 нет простого способа добраться до SOABI (эта концепция пришла из более новых версий Python 3), эталонная реализация на момент написания статьи выдает "none". В идеале она должна определять "py27(d|m|u)" по аналогии с новыми версиями Python, но пока что "none" - достаточно хороший способ сказать "не знаю".
ta: பைதான் 2 க்கு சோபிக்குச் செல்ல எளிதான வழி இல்லை என்பதால் (இந்த கருத்து பைத்தானின் புதிய பதிப்புகளிலிருந்து வருகிறது 3) "எதுவுமில்லை" என்ற யூகங்களை எழுதும் நேரத்தில் குறிப்பு செயல்படுத்தல். வெறுமனே இது பைத்தானின் புதிய பதிப்புகளுக்கு ஒத்த "PY27 (D | M | U)" ஐக் கண்டறியும், ஆனால் இதற்கிடையில் "எதுவுமில்லை" என்பது "தெரியாது" என்று சொல்வதற்கு போதுமான வழி.

source: February 2013: The original version of this specification was approved through :pep:`425`.
eo: Februaro 2013: La originala versio de ĉi tiu specifo estis aprobita per :pep:`425`.
ja: 2013年2月: :pep:`425` を通じてこの仕様の元々のバージョンが承認されました。
ru: Февраль 2013 г: Первоначальная версия этой спецификации была одобрена через :pep:`425`.
ta: பிப்ரவரி 2013: இந்த விவரக்குறிப்பின் அசல் பதிப்பு மூலம் அங்கீகரிக்கப்பட்டது: PEP: `425`.

source: January 2016: The ``manylinux1`` tag was approved through :pep:`513`.
eo: Januaro 2016: La etikedo ``manylinux1`` estis aprobita per :pep:`513`.
ja: 2016年1月: :pep:`513` を通じて ``manylinux1`` タグが承認されました。
ru: Январь 2016 г: Метка ``manylinux1`` была одобрена через :pep:`513``.
ta: சனவரி 2016: `` மேனிலினக்ச் 1`` குறிச்சொல் மூலம் அங்கீகரிக்கப்பட்டது: PEP: `513`.

source: April 2018: The ``manylinux2010`` tag was approved through :pep:`571`.
eo: Aprilo 2018: La etikedo ``manylinux2010`` estis aprobita per :pep:`571`.
ja: 2018年4月: :pep:`571` を通じて ``manylinux2010`` タグが承認されました。
ru: Апрель 2018 г: Метка ``manylinux2010`` была одобрена через :pep:`571``.
ta: ஏப்ரல் 2018: `` மேனிலினக்ச் 2010`` குறிச்சொல் மூலம் அங்கீகரிக்கப்பட்டது: PEP: `571`.

source: July 2019: The ``manylinux2014`` tag was approved through :pep:`599`.
eo: Julio 2019: La etikedo ``manylinux2014`` estis aprobita per :pep:`599`.
ja: 2019年7月: :pep:`599` を通じて ``manylinux2014`` タグが承認されました。
ru: Июль 2019: Метка ``manylinux2014`` была одобрена через :pep:`599``.
ta: சூலை 2019: `` மேனிலினக்ச் 2014`` குறிச்சொல் மூலம் அங்கீகரிக்கப்பட்டது: PEP: `599`.

source: November 2019: The ``manylinux_x_y`` perennial tag was approved through :pep:`600`.
eo: Novembro 2019: La ĉiama etikedo ``manylinux_x_y`` estis aprobita per :pep:`600`.
ja: 2019年11月: :pep:`600` を通じて多年性の ``manylinux_x_y`` タグが承認されました。
ru: Ноябрь 2019: Многолетний тег ``manylinux_x_y`` был одобрен через :pep:`600`.
ta: நவம்பர் 2019: `` Manylinux_x_y`` வற்றாத குறிச்சொல் மூலம் அங்கீகரிக்கப்பட்டது: PEP: `600`.

source: April 2021: The ``musllinux_x_y`` tag was approved through :pep:`656`.
eo: Aprilo 2021: La etikedo ``musllinux_x_y`` estis aprobita per :pep:`656`.
ja: 2021年4月: :pep:`656` を通じて ``musllinux_x_y`` タグが承認されました。
ru: Апрель 2021 года: Метка ``musllinux_x_y`` была одобрена через :pep:`656``.
ta: ஏப்ரல் 2021: `` musllinux_x_y`` குறிச்சொல் மூலம் அங்கீகரிக்கப்பட்டது: PEP: `656`.

source: The :file:`.pypirc` file
eo: La dosiero :file:`.pypirc`
ja: :file:`.pypirc` ファイル
pt_br: O arquivo :file:`.pypirc`
ru: Файл :file:`.pypirc`
ta: தி: கோப்பு: `.pypirc` கோப்பு

source: A :file:`.pypirc` file allows you to define the configuration for :term:`package indexes <Package Index>` (referred to here as "repositories"), so that you don't have to enter the URL, username, or password whenever you upload a package with :ref:`twine` or :ref:`flit`.
eo: Dosiero :file:`.pypirc` agordas la :term:`pakindekson <Package Index>` (ĉi tie nomitan «deponejo»), por ke oni ne bezonas tajpi la retadreson, salutnomon aŭ pasvorton ĉiun fojon, kiam oni alŝutas pakon per :ref:`twine` aŭ :ref:`flit`.
ja: :file:`.pypirc` ファイルを使うと、 :term:`パッケージインデックス <Package Index>` (ここでは "リポジトリ" と呼びます) 向けの設定を定義しておけば、 :ref:`twine` や :ref:`flit` でパッケージをアップロードする際に URL ・ユーザ名・パスワードなどの入力を省くことができます。
pt_br: Um arquivo :file:`.pypirc` permite que você defina a configuração para :term:`índices de pacotes <Índice de Pacotes>` (referido aqui como "repositórios"), para que você não precise inserir a URL, nome de usuário ou senha sempre que você enviar um pacote com :ref:`twine` ou :ref:`flit`.
ru: Файл :file:`.pypirc` позволяет определить конфигурацию для :term:`индексов пакетов <Package Index>` (называемых здесь "репозиториями"), так что вам не придется вводить URL, имя пользователя или пароль всякий раз, когда вы загружаете пакет с помощью :ref:`twine` или :ref:`flit`.
ta: ப: கோப்பு: `.pypirc` கோப்பு இதற்கான உள்ளமைவை வரையறுக்க உங்களை அனுமதிக்கிறது: கால:` தொகுப்பு குறியீடுகள் <தொகுப்பு குறியீட்டு> `(இங்கே" களஞ்சியங்கள் "என்று குறிப்பிடப்படுகிறது), இதனால் நீங்கள் முகவரி, பயனர்பெயரை உள்ளிட வேண்டியதில்லை , அல்லது கடவுச்சொல் நீங்கள் ஒரு தொகுப்பைப் பதிவேற்றும்போதெல்லாம்: குறிப்பு: `ட்வைன்` அல்லது: குறிப்பு:` ஃபிளிட்`.

source: The format (originally defined by the :ref:`distutils` package) is:
eo: Jen la formo (origine difinita de la pako :ref:`distutils`):
ja: (元々は :ref:`distutils` パッケージで定義された) フォーマットは:
pt_br: O formato (originalmente definido pelo pacote :ref:`distutils`) é:
ru: Формат (первоначально определенный пакетом :ref:`distutils`) таков:
ta: வடிவம் (முதலில் வரையறுக்கப்படுகிறது: ref: `தொலைதூரங்கள்` தொகுப்பு):

source: The ``distutils`` section defines an ``index-servers`` field that lists the name of all sections describing a repository.
eo: La sekcio ``distutils`` difinas kampon ``index-servers`` listigantan la nomojn de ĉiuj sekcioj priskribantaj deponejojn.
ja: ``distutils`` の節では、リポジトリを説明するようなすべての節の名前を列挙する ``index-servers`` フィールドを定義しています。
pt_br: A seção ``distutils`` define um campo ``index-servers`` que lista o nome de todas as seções descrevendo um repositório.
ru: Раздел ``distutils`` определяет поле ``index-servers``, в котором перечислены имена всех разделов, описывающих репозиторий.
ta: `` தொலைதூரங்கள்`` பிரிவு ஒரு `` குறியீட்டு-சேவையகங்கள்` துறையை வரையறுக்கிறது, இது ஒரு களஞ்சியத்தை விவரிக்கும் அனைத்து பிரிவுகளின் பெயரையும் பட்டியலிடுகிறது.

source: Each section describing a repository defines three fields:
eo: Ĉiu sekcio priskribanta deponejon difinas tri kampojn:
ja: リポジトリを記述する各節では、３個のフィールドを定義しています:
pt_br: Cada seção descrevendo um repositório define três campos:
ru: В каждом разделе, описывающем хранилище, определены три поля:
ta: ஒரு களஞ்சியத்தை விவரிக்கும் ஒவ்வொரு பகுதியும் மூன்று புலங்களை வரையறுக்கிறது:

source: ``repository``: The URL of the repository.
eo: ``repository``: La retadreso de la deponejo.
ja: ``repository``: リポジトリの URL。
pt_br: ``repository``: A URL do repositório.
ru: ``репозиторий``: URL-адрес репозитория.
ta: `` களஞ்சியம்``: களஞ்சியத்தின் முகவரி.

source: ``username``: The registered username on the repository.
eo: ``username``: La registrita salutnomo ĉe la deponejo.
ja: ``username``: リポジトリで登録済みのユーザ名。
pt_br: ``username``: O nome de usuário registrado no repositório.
ru: ``имя пользователя``: Зарегистрированное имя пользователя в репозитории.
ta: `` பயனர்பெயர்``: களஞ்சியத்தில் பதிவுசெய்யப்பட்ட பயனர்பெயர்.

source: ``password``: The password that will used to authenticate the username.
eo: ``password``: La pasvorto por aŭtentikigi la salutnomon.
ja: ``password``: ユーザ名を認証するために使われるパスワード。
pt_br: ``password``: A senha que será usada para autenticar o nome de usuário.
ru: ``пароль``: Пароль, который будет использоваться для аутентификации имени пользователя.
ta: `` கடவுச்சொல்``: பயனர்பெயரை அங்கீகரிக்க பயன்படுத்தப்படும் கடவுச்சொல்.
