Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: `Docs <https://hashdist.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/hashdist/hashdist/>`__
eo: `Dokumentaro <https://hashdist.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/hashdist/hashdist/>`__
ja: `説明文書 <https://hashdist.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/hashdist/hashdist/>`__
pt_br: `Documentação <https://hashdist.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/hashdist/hashdist/>`__
ru: `Документы <https://hashdist.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/hashdist/hashdist/>`__
ta: `டாக்ச் <https://hashdist.readthedocs.io/en/latest/> __ | `Github <https://github.com/hashdist/hashdist/> ____ __

source: Hashdist is a library for building non-root software distributions. Hashdist is trying to be “the Debian of choice for cases where Debian technology doesn’t work”. The best way for Pythonistas to think about Hashdist may be a more powerful hybrid of :ref:`virtualenv` and :ref:`buildout`. It is aimed at solving the problem of installing scientific software, and making package distribution stateless, cached, and branchable. It is used by some researchers but has been lacking in maintenance since 2016.
eo: Hashdist estas biblioteko por konstrui neradikan programan distribuon. Hashdist celas esti «la Debiano por tiuj kazoj, en kiuj Debiano ne taŭgas». Python-uzanto pensu pri Hashdist kiel potenca hibrido de :ref:`virtualenv` kaj :ref:`buildout`. Ĝi celas solvi la problemon de instalado de scienca programo kaj igi distribuadon de pakoj senstata, enkaŝmemorigita kaj branĉebla. Ĝi estas uzata de kelkaj esploristoj, sed ne estas prizorgata ekde 2016.
ja: Hashdist は、非特権ユーザソフトウェアの配布物をビルドするためのライブラリです。 Hashdist は、「Debian 技術が動作していない場合の Debian のような選択肢」になろうとしています。 Python 支持者 (Pythonista) にとっては、 :ref:`virtualenv` と :ref:`buildout` のより強力な混合物が Hashdist だと考えるのが一番でしょう。科学計算分野のソフトウェアをインストールする際の問題を解決し、パッケージ配布物をステートレスでキャッシュ可能かつ分岐可能にすることを目指しています。一部の研究者が使っていますが、2016 年以降は保守されていません。
pt_br: Hashdist é uma biblioteca para construir distribuições de software que não dependem do root. Hashdist está tentando ser "o preferido do Debian para os casos em que a tecnologia Debian não funciona". A melhor maneira para Pythonistas pensarem sobre Hashdist pode ser um híbrido mais poderoso de :ref:`virtualenv` e :ref:`buildout`. Ele tem como objetivo resolver o problema de instalação de software científico e tornar a distribuição de pacotes sem estado, com cache e com capacidade de distribuição. É usado por alguns pesquisadores, mas não tem manutenção desde 2016.
ru: Hashdist - это библиотека для создания дистрибутивов программного обеспечения без рута. Hashdist пытается стать "выбором Debian для случаев, когда технология Debian не работает". Pythonистам лучше всего думать о Hashdist как о более мощном гибриде :ref:`virtualenv` и :ref:`buildout`. Он нацелен на решение проблемы установки научного программного обеспечения и делает распространение пакетов нестационарным, кэшируемым и ветвящимся. Используется некоторыми исследователями, но с 2016 года не поддерживается.
ta: ஆச்டிச்ட் என்பது ரூட் அல்லாத மென்பொருள் விநியோகங்களை உருவாக்குவதற்கான ஒரு நூலகமாகும். ஆச்டிச்ட் "டெபியன் தொழில்நுட்பம் வேலை செய்யாத நிகழ்வுகளுக்கான தேர்வுக்கான டெபியன்" ஆக முயற்சிக்கிறார். பைத்தோனிச்டாக்கள் ஆச்டிச்ட்டைப் பற்றி சிந்திக்க சிறந்த வழி மிகவும் சக்திவாய்ந்த கலப்பினமாக இருக்கலாம்: குறிப்பு: `மெய்நிகர்என்வ்` மற்றும்: குறிப்பு:` பில்ட்அவுட்`. இது விஞ்ஞான மென்பொருளை நிறுவுவதில் சிக்கலைத் தீர்ப்பதையும், தொகுப்பு விநியோகத்தை நிலையற்ற, தற்காலிக சேமிப்பு மற்றும் கிளைத்தன்மையடிப்பதையும் நோக்கமாகக் கொண்டுள்ளது. இது சில ஆராய்ச்சியாளர்களால் பயன்படுத்தப்படுகிறது, ஆனால் 2016 முதல் பராமரிப்பு குறைவு.

source: `Docs <https://www.maturin.rs>`__ | `GitHub <https://github.com/PyO3/maturin>`__
eo: `Dokumentaro <https://www.maturin.rs>`__ | `GitHub <https://github.com/PyO3/maturin>`__
ja: `説明文書 <https://www.maturin.rs>`__ | `GitHub <https://github.com/PyO3/maturin>`__
pt_br: `Documentação <https://www.maturin.rs>`__ | `GitHub <https://github.com/PyO3/maturin>`__
ru: `Документы <https://www.maturin.rs>`__ | `GitHub <https://github.com/PyO3/maturin>`__
ta: `டாக்ச் <https://www.maturin.rs> __ | `Github <https://github.com/pyo3/maturin>` __

source: Maturin is a build backend for Rust extension modules, also written in Rust. It supports building wheels for python 3.7+ on Windows, Linux, macOS and FreeBSD, can upload them to PyPI and has basic PyPy and GraalPy support.
eo: Maturin estas konstrua malfasado por etendaĵo-modulo verkita en Rust, kaj estas mem verkita en Rust. Ĝi subtenas konstrui wheel por Python 3.7+ sur Windows, Linux, macOS kaj FreeBSD. Ĝi povas alŝuti wheel al PyPI kaj ankaŭ baze subtenas PyPY kaj GraalPy.
ja: Maturin は Rust 拡張モジュール用のビルドバックエンドで、Rust で書かれています。Windows ・ Linux ・ macOS および FreeBSD 上で python 3.7+ の wheel をビルドすることができ、それを PyPI にアップロードすることができ、また、 PyPy と GraalPy に対する基本的なサポートもあります。
pt_br: Maturin é um backend de construção para módulos de extensão Rust, também escrito em Rust. Ele oferece suporte à construção de rodas para python 3.7+ em Windows, Linux, macOS e FreeBSD, pode enviá-las para PyPI e tem suporte básico a PyPy e GraalPy.
ru: Maturin - это бэкенд для сборки модулей расширения Rust, также написанный на Rust. Он поддерживает сборку колес для python 3.7+ под Windows, Linux, macOS и FreeBSD, может загружать их в PyPI и имеет базовую поддержку PyPy и GraalPy.
ta: மாதுரின் என்பது துரு நீட்டிப்பு தொகுதிகளுக்கான ஒரு கட்டமைப்பை உருவாக்குகிறது, இது துருவில் எழுதப்பட்டுள்ளது. இது சாளரங்கள், லினக்ச், மேகோச் மற்றும் ஃப்ரீ.பி.எச்.டி ஆகியவற்றில் பைதான் 3.7+ க்கான சக்கரங்களை உருவாக்குகிறது, அவற்றை பைபியில் பதிவேற்றலாம் மற்றும் அடிப்படை பைபி மற்றும் கிரால்பி ஆதரவைக் கொண்டுள்ளது.

source: meson-python
ta: மெசன்-பைதான்

source: `Docs <https://meson-python.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/mesonbuild/meson-python>`__
eo: `Dokumentaro <https://meson-python.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/mesonbuild/meson-python>`__
ja: `説明文書 <https://meson-python.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/mesonbuild/meson-python>`__
pt_br: `Documentação <https://meson-python.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/mesonbuild/meson-python>`__
ru: `Документы <https://meson-python.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/mesonbuild/meson-python>`__
ta: `டாக்ச் <https://meson-python.readthedocs.io/en/latest/>` __ | `Github <https://github.com/mesonbuild/meson-python> ____ __ __

source: ``meson-python`` is a build backend that uses the Meson_ build system. It enables Python package authors to use Meson_ as the build system for their package. It supports a wide variety of languages, including C, and is able to fill the needs of most complex build configurations.
eo: ``meson-python`` estas konstrua malfasado uzanta la konstrusistemon Meson_. Ĝi permesas al aŭtoroj de Python-pakoj uzi Meson_ kiel la konstrusistemon de sia pako. Ĝi subtenas diversajn lingvojn inkluzive de C kaj povas plenumi la bezonojn de plej komplikaj konstruagordoj.
ja: ``meson-python`` は、 Meson_ ビルドシステムを使うビルドバックエンドです。これによって、 Python パッケージの作者が自分のパッケージ向けに Meson_ をビルドシステムとして使うことを可能にします。これは C 言語を含む広範囲の言語をサポートしており、最も複雑なビルド設定を記述することが可能になります。
pt_br: ``meson-python`` é um backend de compilação que usa o sistema de compilação Meson_. Ele permite que os autores de pacotes Python usem o Meson_ como o sistema de compilação para seus pacotes. Ele oferece suporte a uma ampla variedade de linguagens, incluindo C, e é capaz de atender às necessidades das configurações de compilação mais complexas.
ru: ``meson-python`` - это бэкенд сборки, использующий систему сборки Meson_. Он позволяет авторам пакетов Python использовать Meson_ в качестве системы сборки для своего пакета. Он поддерживает широкий спектр языков, включая C, и способен удовлетворить потребности большинства сложных конфигураций сборки.
ta: `` மீசன்-பைதான்`` என்பது மீசான்_ உருவாக்க முறையைப் பயன்படுத்தும் ஒரு கட்டமைப்பை உருவாக்குகிறது. இது பைதான் தொகுப்பு ஆசிரியர்கள் தங்கள் தொகுப்புக்கான உருவாக்க அமைப்பாக மீசான்_ ஐப் பயன்படுத்த உதவுகிறது. இது சி உள்ளிட்ட பல்வேறு வகையான மொழிகளை ஆதரிக்கிறது, மேலும் மிகவும் சிக்கலான கட்டமைப்பின் தேவைகளை நிறைவு செய்ய முடியும்.

source: multibuild
ta: மல்டிபில்ட்

source: `GitHub <https://github.com/multi-build/multibuild>`__
ta: `Ginsub <https://githubub.com/multi-build/multibuild>` __

source: Multibuild is a set of CI scripts for building and testing Python :term:`wheels <Wheel>` for Linux, macOS, and (less flexibly) Windows. Also see :ref:`cibuildwheel`.
eo: Multibuild estas kontinuintegrada programaro por konstrui kaj testi Python-:term:`wheel <Wheel>` por Linux, macOS, kaj (malpli flekseble) Windows. Ankaŭ vidu :ref:`cibuildwheel`.
ja: Multibuild は、Linux ・ macOS 向けや (柔軟性は落ちるが) Windows 向けの Python :term:`wheels <Wheel>` をビルドしテストする一揃いの CI スクリプトです。 :ref:`cibuildwheel` も見てください。
pt_br: Multibuild é um conjunto de scripts de CI para construir e testar Python :term:`wheels <Wheel>` para Linux, macOS e (menos flexível) Windows. Veja também :ref:`cibuildwheel`.
ru: Multibuild - это набор CI-скриптов для сборки и тестирования Python :term:`wheels <Wheel>` для Linux, macOS и (менее гибко) Windows. Также смотрите :ref:`cibuildwheel`.
ta: மல்டிபில்ட் என்பது பைத்தானை உருவாக்குவதற்கும் சோதிப்பதற்கும் தொஒ ச்கிரிப்ட்களின் தொகுப்பாகும்: கால: `சக்கரங்கள் <hewhel>` லினக்ச், மேகோச் மற்றும் (குறைவான நெகிழ்வான) விண்டோசிற்கான. மேலும் காண்க: குறிப்பு: `cibuildwheel`.

source: nginx_pypi_cache is a :term:`package index <Package Index>` caching proxy using `nginx <https://nginx.org/en/>`_.
eo: nginx_pypi_cache estas :term:`pakindeksa <Package Index>` kaŝmemora perilo per `nginx <https://nginx.org/en/>`_.
ja: nginx_pypi_cache は、 `nginx <https://nginx.org/en/>`_ を用いた :term:`パッケージインデックス <Package Index>` のキャッシュ機能付きプロクシです。
ru: nginx_pypi_cache - это : термин:`пакетный индекс <пакетный индекс>` кэширующего прокси, использующего `nginx <https://nginx.org/en/>`_.
ta: nginx_pypi_cache என்பது ஒரு: சொல்: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` `nginx <https://nginx.org/en/> _ _ ஐப் பயன்படுத்தி ப்ராக்சியை கேச்சிங் செய்யும் ப்ராக்சியை.

source: pdm
ta: பி.டி.எம்

source: `Docs <https://pdm.fming.dev/>`__ | `GitHub <https://github.com/pdm-project/pdm/>`__ | `PyPI <https://pypi.org/project/pdm>`__
eo: `Dokumentaro <https://pdm.fming.dev/>`__ | `GitHub <https://github.com/pdm-project/pdm/>`__ | `PyPI <https://pypi.org/project/pdm>`__
ja: `説明文書 <https://pdm.fming.dev/>`__ | `GitHub <https://github.com/pdm-project/pdm/>`__ | `PyPI <https://pypi.org/project/pdm>`__
pt_br: `Documentação <https://pdm.fming.dev/>`__ | `GitHub <https://github.com/pdm-project/pdm/>`__ | `PyPI <https://pypi.org/project/pdm>`__
ru: `Документы <https://pdm.fming.dev/>`__ | `GitHub <https://github.com/pdm-project/pdm/>`__ | `PyPI <https://pypi.org/project/pdm>`__
ta: `டாக்ச் <https://pdm.fming.dev/> __ | `Github <https://github.com/pdm-project/pdm/> __ | `Pypi <https://pypi.org/project/pdm> ____

source: PDM is a modern Python package manager. It uses :term:`pyproject.toml` to store project metadata as defined in :pep:`621`.
eo: PDM estas moderna Python-pakadministrilo. Ĝi uzas :term:`pyproject.toml` por konservi projektajn metadatenojn laŭ :pep:`621`.
ja: PDM は近代的な Python パッケージ管理ソフトです。 :pep:`621` で定義されている形でプロジェクトのメタデータを :term:`pyproject.toml` に保存します。
pt_br: PDM é um gerenciador de pacotes Python moderno. Ele também usa :term:`pyproject.toml` para armazenar metadados do projeto conforme definido em :pep:`621`.
ru: PDM - это современный менеджер пакетов Python. Он использует :term:`pyproject.toml` для хранения метаданных проекта, как определено в :pep:`621`.
ta: பி.டி.எம் ஒரு நவீன பைதான் தொகுப்பு மேலாளர். இது பயன்படுத்துகிறது: கால: `pyproject.toml` திட்ட மெட்டாடேட்டாவை வரையறுக்கப்பட்டுள்ளபடி சேமிக்க: PEP:` 621`.

source: `Docs <https://pex.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/pantsbuild/pex/>`__ | `PyPI <https://pypi.org/project/pex>`__
eo: `Dokumentaro <https://pex.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/pantsbuild/pex/>`__ | `PyPI <https://pypi.org/project/pex>`__
ja: `説明文書 <https://pex.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/pantsbuild/pex/>`__ | `PyPI <https://pypi.org/project/pex>`__
pt_br: `Documentação <https://pex.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/pantsbuild/pex/>`__ | `PyPI <https://pypi.org/project/pex>`__
ru: `Документы <https://pex.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/pantsbuild/pex/>`__ | `PyPI <https://pypi.org/project/pex>`__
ta: `டாக்ச் <https://pex.readthedocs.io/en/latest/> __ | `Github <https://github.com/pantsbuild/pex/> __ | `Pypi <https://pypi.org/project/pex> ____

source: Pex is a tool for generating :file:`.pex` (Python EXecutable) files, standalone Python environments in the spirit of :ref:`virtualenv`. PEX files are :doc:`zipapps <python:library/zipapp>` that make deployment of Python applications as simple as ``cp``. A single PEX file can support multiple target platforms and can be created from standard :ref:`pip`-resolvable requirements, a lockfile generated with ``pex3 lock ...`` or even another PEX. PEX files can optionally have tools embedded that support turning the PEX file into a standard venv, graphing dependencies and more.
eo: Pex estas ilo por generi :file:`.pex` (Python EXecutable)-dosierojn, kiuj estas memstaraj Python-medioj similaj al :ref:`virtualenv`. PEX-dosiero estas :doc:`zipapp <python:library/zipapp>`, igante disponigon de Python-programo tiel simpla kiel ``cp``. Unu PEX-dosiero povas subteni plurajn celajn platformojn kaj estas kreebla el normaj :ref:`pip`-solveblaj postuloj, lockfile generita per ``pex3 lock …`` aŭ eĉ alia PEX. PEX-dosiero ankaŭ povas havi inkluzivitajn ilojn estigante la PEX-dosieron ordinara virtuala medio, grafigi dependecojn, ktp.
ja: Pex は、 :ref:`virtualenv` を使った独立した Python 環境をに表現した :file:`.pex` (Python EXecutable) ファイルを生成するためのツールです。 PEX ファイルは、 ``cp`` のような単純な Python アプリケーションをデプロイする :doc:`zipapps <python:library/zipapp>` です。単独の PEX ファイルで複数のターゲットプラットフォームをサポートすることができ、標準の :ref:`pip` で解決できる要求事項、つまり ``pex3 lock ...`` で生成されるロックファイルや別の PEX からであっても作成することができます。 PEX ファイルは、オプションとして PEX ファイルを標準の venv に変換したり依存関係をグラフ化したり、あるいはもっと多くをサポートするツールを内蔵することもできます。
ru: Pex - это инструмент для генерации :file:`.pex` (Python EXecutable) файлов, автономных окружений Python в духе :ref:`virtualenv`. Файлы PEX - это :doc:`zipapps <python:library/zipapp>`, которые делают развертывание приложений Python таким же простым, как ``cp``. Один PEX-файл может поддерживать несколько целевых платформ и может быть создан из стандартных :ref:`pip`-разрешаемых требований, файла блокировки, созданного с помощью ``pex3 lock ...`` или даже другого PEX. В PEX-файлы могут быть встроены инструменты, поддерживающие превращение PEX-файла в стандартный venv, построение графиков зависимостей и многое другое.
ta: PEX என்பது உருவாக்குவதற்கான ஒரு கருவியாகும்: கோப்பு: `.பெக்ச்` (பைதான் இயங்கக்கூடிய) கோப்புகள், ஆவி: ref:` Virtualenv`. PEX கோப்புகள்: DOC: `zipapps <python: நூலகம்/சிபாப்>` அவை பைதான் பயன்பாடுகளை `` cp`` போன்ற எளிமையாக பயன்படுத்துகின்றன. ஒரு ஒற்றை PEX கோப்பு பல இலக்கு தளங்களை ஆதரிக்கலாம் மற்றும் தரநிலையிலிருந்து உருவாக்கப்படலாம்: ref: `PIP`-தீர்க்கக்கூடிய தேவைகள்,` `PEX3 பூட்டு ...` `அல்லது மற்றொரு PEX உடன் உருவாக்கப்பட்ட ஒரு பூட்டுப் கோப்பை. PEX கோப்புகளை விருப்பமாக உட்பொதித்த கருவிகள் இருக்கலாம், அவை PEX கோப்பை ஒரு நிலையான WENV ஆக மாற்றுவது, வரைபட சார்புகளை வரைபடமாக்குகின்றன.

source: pip-tools
ru: pip-инструменты
ta: குழாய்-கருவிகள்

source: `Docs <https://pip-tools.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/jazzband/pip-tools/>`__ | `PyPI <https://pypi.org/project/pip-tools/>`__
eo: `Dokumentaro <https://pip-tools.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/jazzband/pip-tools/>`__ | `PyPI <https://pypi.org/project/pip-tools/>`__
ja: `説明文書 <https://pip-tools.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/jazzband/pip-tools/>`__ | `PyPI <https://pypi.org/project/pip-tools/>`__
pt_br: `Documentação <https://pip-tools.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/jazzband/pip-tools/>`__ | `PyPI <https://pypi.org/project/pip-tools/>`__
ru: `Документы <https://pip-tools.readthedocs.io/en/latest/>`__ | `GitHub <https://github.com/jazzband/pip-tools/>`__ | `PyPI <https://pypi.org/project/pip-tools/>`__
ta: `டாக்ச் <https://pip-tools.readthedocs.io/en/latest/> __ | `Github <https://github.com/jazzband/pip-tools/> __ | `Pypi <https://pypi.org/project/pip-tools/> ____ __

source: pip-tools is a suite of tools meant for Python system administrators and release managers who particularly want to keep their builds deterministic yet stay up to date with new versions of their dependencies. Users can specify particular release of their dependencies via hash, conveniently make a properly formatted list of requirements from information in other parts of their program, update all dependencies (a feature :ref:`pip` currently does not provide), and create layers of constraints for the program to obey.
eo: pip-tools estas ilaro por tiuj sistemadministrantoj kaj eldonmastrumistoj de Python, kiuj volas determinisman konstruadon kaj ĝisdatajn versiojn de dependecoj. Uzanto povas specifi iun eldono de dependeco per haketaĵo, facile fari liston de postuloj el informoj en aliaj partoj de la programo, ĝisdatigi ĉiujn dependecojn (jen funkcio mankanta en :ref:`pip` aktuale), kaj krei tavolojn da limigoj obeotaj de la programo.
ja: pip-tools は、Python システムの管理者やリリースマネージャで、特にビルドが必ずできるように保ちたいけれども依存先の新バージョンに追随して最新の状態にもしておきたいという人々のための一揃いのツール群です。ユーザはハッシュ値を与えることで依存先の特定のリリースを指定することや、そのプログラムの他の部分にある情報から適切な書式の requirements を簡単に作成すること、すべての依存先を更新すること (これは現時点の :ref:`pip` にはない機能です) 、プログラムが従うべき制約条件の層を作成することができます。
pt_br: pip-tools é um conjunto de ferramentas destinadas aos administradores de sistema Python e gerentes de lançamento que desejam manter suas compilações determinísticas e, ao mesmo tempo, manter-se atualizado com as novas versões de suas dependências. Os usuários podem especificar a liberação particular de suas dependências por meio de hash, fazer convenientemente uma lista devidamente formatada de requisitos de informações em outras partes de seu programa, atualizar todas as dependências (um recurso :ref:`pip` atualmente não fornece) e criar camadas de restrições para o programa obedecer.
ru: pip-tools - это набор инструментов, предназначенных для системных администраторов Python и менеджеров релизов, которые особенно хотят сохранить детерминированность своих сборок и при этом быть в курсе новых версий своих зависимостей. Пользователи могут указать конкретный релиз своих зависимостей через хэш, удобно составить правильно оформленный список требований из информации в других частях своей программы, обновить все зависимости (функция, которую :ref:`pip` в настоящее время не предоставляет), а также создать слои ограничений, которым должна подчиняться программа.
ta: பிப்-டூல்ச் என்பது பைதான் சிச்டம் நிர்வாகிகளுக்கான கருவிகளின் தொகுப்பாகும், குறிப்பாக தங்கள் கட்டடங்களை நிர்ணயிக்க விரும்பும் மேலாளர்களுக்கான வெளியீட்டு மேலாளர்கள், ஆனால் அவர்களின் சார்புகளின் புதிய பதிப்புகளுடன் புதுப்பித்த நிலையில் இருங்கள். பயனர்கள் தங்கள் சார்புகளின் குறிப்பிட்ட வெளியீட்டை ஆச் வழியாக குறிப்பிடலாம், அவற்றின் திட்டத்தின் பிற பகுதிகளில் உள்ள தகவல்களிலிருந்து ஒழுங்காக வடிவமைக்கப்பட்ட தேவைகளின் பட்டியலை வசதியாக உருவாக்கலாம், எல்லா சார்புகளையும் புதுப்பிக்கவும் (ஒரு அம்சம்: `பிப்` தற்போது வழங்கவில்லை) மற்றும் அடுக்குகளை உருவாக்கவும் நிரலுக்குக் கீழ்ப்படியும் தடைகள்.

source: pip2pi is a :term:`package index <Package Index>` server where specific packages are manually synchronised.
eo: pip2pi estas :term:`pakindeksa <Package Index>` servilo, je kiu specifaj pakoj estas malaŭtomate sinkronigitaj.
ja: pip2pi は、特定のパッケージ群が手動で同期される :term:`パッケージインデックス <Package Index>` です。
ru: pip2pi - это сервер : термин:`индекс пакетов <Индекс пакетов>`, на котором вручную синхронизируются определенные пакеты.
ta: PIP2PI என்பது ஒரு: கால: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` குறிப்பிட்ட தொகுப்புகள் கைமுறையாக ஒத்திசைக்கப்படும் சேவையகம்.

source: piwheels
ta: பிவீல்ச்

source: `Website <https://www.piwheels.org/>`__ | :doc:`Docs <piwheels:index>` | `GitHub <https://github.com/piwheels/piwheels/>`__
eo: `Retejo <https://www.piwheels.org/>`__ | :doc:`Dokumentaro <piwheels:index>` | `GitHub <https://github.com/piwheels/piwheels/>`__
ja: `Web サイト <https://www.piwheels.org/>`__ | :doc:`説明文書 <piwheels:index>` | `GitHub <https://github.com/piwheels/piwheels/>`__
pt_br: `Site <https://www.piwheels.org/>`__ | :doc:`Documentação <piwheels:index>` | `GitHub <https://github.com/piwheels/piwheels/>`__
ru: Веб-сайт <https://www.piwheels.org/>`__ | :doc:`Docs <piwheels:index>` | `GitHub <https://github.com/piwheels/piwheels/>`__
ta: `வலைத்தளம் <https://www.piwheels.org/>` __ | : டாக்: `டாக்ச் <PIWHEELS: INDEX>` | `Github <https://github.com/piwheels/piwheels/> ____ __

source: piwheels is a website, and software underpinning it, that fetches source code distribution packages from PyPI and compiles them into binary wheels that are optimized for installation onto Raspberry Pi computers. Raspberry Pi OS pre-configures pip to use piwheels.org as an additional index to PyPI.
eo: piwheels estas retejo, kaj programo funkciiganta la retejon, kiu elŝutas fontajn distribuajn pakojn el PyPI kaj tradukas ilin al duumaj wheel-oj optimumigitaj por komputiloj Raspberry Pi. La mastruma sistemo Raspberry Pi OS apriore agordas pip por uzi piwheels.org kiel ekstran indekson kune kun PyPI.
ja: piwheels は、ソースコード配布物パッケージを PyPI から取得して Raspberry Pi 計算機へのインストールに最適化されたバイナリ wheel ファイルにコンパイルするような Web サイトであり、それを支えるソフトウェアです。 Raspberry Pi OS では、 pip が PyPI に加えて piwheel.org を追加のインデックスとして使うように予め設定されています。
pt_br: piwheels é um site, e o software que o sustenta, que busca pacotes de distribuição de código-fonte do PyPI e os compila em wheels binários que são otimizadas para instalação em computadores Raspberry Pi. O Raspberry Pi OS pré-configura pip para usar piwheels.org como um índice adicional para PyPI.
ru: piwheels - это веб-сайт и программное обеспечение, лежащее в его основе, которое собирает пакеты дистрибутива исходного кода с PyPI и компилирует их в бинарные диски, оптимизированные для установки на компьютеры Raspberry Pi. В Raspberry Pi OS предварительно настроен pip на использование piwheels.org в качестве дополнительного индекса к PyPI.
ta: பிவீல்ச் என்பது ஒரு வலைத்தளம், மற்றும் மென்பொருள் அதை அடிப்படையாகக் கொண்டது, இது PYPI இலிருந்து மூலக் குறியீடு விநியோக தொகுப்புகளைப் பெற்று அவற்றை பைனரி சக்கரங்களில் தொகுக்கிறது, அவை ராச்பெர்ரி பை கணினிகளில் நிறுவ உகந்ததாக இருக்கும். ராச்பெர்ரி பை ஓஎச் ப்ரீ-இன்ஃபிகர்ச் பிஐபிஐக்கு கூடுதல் குறியீடாக piwheels.org ஐப் பயன்படுத்த PIP.

source: poetry
ru: поэзия
ta: பா

source: `Docs <https://python-poetry.org/>`__ | `GitHub <https://github.com/python-poetry/poetry>`__ | `PyPI <https://pypi.org/project/poetry/>`__
eo: `Dokumentaro <https://python-poetry.org/>`__ | `GitHub <https://github.com/python-poetry/poetry>`__ | `PyPI <https://pypi.org/project/poetry/>`__
ja: `説明文書 <https://python-poetry.org/>`__ | `GitHub <https://github.com/python-poetry/poetry>`__ | `PyPI <https://pypi.org/project/poetry/>`__
pt_br: `Documentação <https://python-poetry.org/>`__ | `GitHub <https://github.com/python-poetry/poetry>`__ | `PyPI <https://pypi.org/project/poetry/>`__
ru: `Документы <https://python-poetry.org/>`__ | `GitHub <https://github.com/python-poetry/poetry>`__ | `PyPI <https://pypi.org/project/poetry/>`__
ta: `டாக்ச் <https://python-poetry.org/> __ | `Github <https://github.com/python-poetry/poetry>` __ | `Pypi <https://pypi.org/project/poetry/> ____ __
