Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Giving us a rule for name based requirements::
eo: Jen la regulo pri nomo-baza postulo::
ja: 私たちに名前に基づいた要求仕様を与えてください::
pt_br: Fornecendo uma regra para requisitos baseados em nome ::
ru: Предоставляем правило для требований, основанных на именах::
ta: பெயர் அடிப்படையிலான தேவைகளுக்கு ஒரு விதியை எங்களுக்கு வழங்குதல் ::

source: And a rule for direct reference specifications::
eo: Kaj regulo pri rekta referenca specifo::
ja: そして、直接参照に用いる要求仕様のための規則はこちら::
pt_br: E uma regra para especificações de referência direta ::
ru: И правило для спецификаций с прямыми ссылками::
ta: மற்றும் நேரடி குறிப்பு விவரக்குறிப்புகளுக்கான விதி ::

source: Leading to the unified rule that can specify a dependency.::
eo: Kaj la unuigita regulo pri specifo de dependeco::
ja: 依存関係を指定することができる統一規則への案内はこちら::
pt_br: Levando à regra unificada que pode especificar uma dependência.::
ru: Приводит к единому правилу, которое может указывать на зависимость.::
ta: சார்புநிலையைக் குறிப்பிடக்கூடிய ஒருங்கிணைந்த விதிக்கு வழிவகுக்கிறது. ::

source: Whitespace
eo: Blanka spaco
ja: 空白文字 <Whitespace>
pt_br: Espaço em branco
ru: Пробел
ta: வைட்ச்பேச்

source: Non line-breaking whitespace is mostly optional with no semantic meaning. The sole exception is detecting the end of a URL requirement.
eo: Ne-linifina blanka spaco estas plejparte nedeviga sen semantiko. La sola escepto estas trovi la finon de retadresa postulo.
ja: 行を分割するものではない空白文字には特に意味はなく、ほとんどの場合には必須ではないものです。唯一の例外は、 URL による要求事項の末尾を検出するためのものです。
pt_br: O espaço em branco sem quebra de linha é principalmente opcional, sem significado semântico. A única exceção é detectar o fim de um requisito de URL.
ru: Неразрывные пробельные символы в большинстве случаев являются необязательными и не имеют смыслового значения. Единственным исключением является определение конца требования URL.
ta: வரி உடைக்கும் இடைவெளி பெரும்பாலும் சொற்பொருள் பொருள் இல்லாமல் விருப்பமானது. ஒரே விதிவிலக்கு ஒரு முகவரி தேவையின் முடிவைக் கண்டறிவது.

source: Names
eo: Nomoj
ja: 名前 <Names>
pt_br: Nomes
ru: Имена
ta: பெயர்கள்

source: Python distribution names are currently defined in :pep:`345`. Names act as the primary identifier for distributions. They are present in all dependency specifications, and are sufficient to be a specification on their own. However, PyPI places strict restrictions on names - they must match a case insensitive regex or they won't be accepted. Accordingly, in this document we limit the acceptable values for identifiers to that regex. A full redefinition of name may take place in a future metadata PEP. The regex (run with re.IGNORECASE) is::
eo: Nomoj de Python-distribuo estas aktuale difinitaj en :pep:`345`. Nomo estas la ĉefidentigilo de distribuo. Ĝi ekzistas en ĉiuj specifoj pri dependecoj kaj sufiĉas por sia propra specifo. Tamen, PyPI restrikegas nomojn — nomo devas kongrui kun usklecblinda regula esprimo; alie ĝi malakceptiĝos. Tial ĉi tiu dokumento limigas la akcepteblajn identigilojn al tiu regula esprimo. Plena redifino de nomo povas okazi en verkota metadatena PEP. Jen la regula esprimo (rulu kun ``re.IGNORECASE``)::
ja: Python の配布物の名前は、現時点では :pep:`345` で定義されています。名前は配布物の最も基本的な識別子として働きます。(名前は) あらゆる依存関係の指定に出現し、それだけで十分に指定することができます。しかしながら、 PyPI では名前に厳密な制約を課しています - 名前は大文字小文字を区別しない正規表現に合致しなければ受け入れられません。従って、この説明文書では、その正規表現に合致する識別子だけを受け入れ可能な値として扱うことにしましょう。名前の完全な再定義はメタデータ PEP として将来に出現するかもしれません。ここでいう (re.IGNORECASE とともに評価されるべき) 正規表現とは、次のようなものです::
pt_br: Nomes de distribuição Python são atualmente definidos na :pep:`345`. Os nomes atuam como o identificador primário para distribuições. Eles estão presentes em todas as especificações de dependência e são suficientes para serem uma especificação por conta própria. No entanto, PyPI impõe restrições estritas aos nomes: eles devem corresponder a uma regex que não diferencie maiúsculas de minúsculas ou não serão aceitos. Assim, neste documento, limitamos os valores aceitáveis para identificadores a essa regex. Uma redefinição completa do nome pode ocorrer em um futuro PEP de metadados. A regex (executada com re.IGNORECASE) é ::
ru: Имена дистрибутивов Python в настоящее время определены в :pep:`345`. Имена выступают в качестве основного идентификатора дистрибутивов. Они присутствуют во всех спецификациях зависимостей, и их достаточно, чтобы быть самостоятельной спецификацией. Однако PyPI накладывает строгие ограничения на имена - они должны соответствовать регистронезависимому регексу, иначе они не будут приняты. Соответственно, в этом документе мы ограничиваем допустимые значения для идентификаторов этим regex. Полное переопределение имени может произойти в будущем PEP для метаданных. Регекс (выполняется с re.IGNORECASE) выглядит так::
ta: பைதான் விநியோக பெயர்கள் தற்போது வரையறுக்கப்பட்டுள்ளன: PEP: `345`. விநியோகங்களுக்கான முதன்மை அடையாளங்காட்டியாக பெயர்கள் செயல்படுகின்றன. அவை அனைத்து சார்பு விவரக்குறிப்புகளிலும் உள்ளன, மேலும் அவை சொந்தமாக ஒரு விவரக்குறிப்பாக இருக்க போதுமானவை. இருப்பினும், பைபி பெயர்களில் கடுமையான கட்டுப்பாடுகளை வைக்கிறது - அவை ஒரு வழக்கு உணர்வற்ற ரெசெக்சுடன் பொருந்த வேண்டும் அல்லது அவை ஏற்றுக்கொள்ளப்படாது. அதன்படி, இந்த ஆவணத்தில் அந்த ரீசெக்சுக்கு அடையாளங்காட்டிகளுக்கான ஏற்றுக்கொள்ளக்கூடிய மதிப்புகளை நாங்கள் கட்டுப்படுத்துகிறோம். பெயரின் முழு மறுவரையறை எதிர்கால மேனிலை தரவு பெப்பில் நடைபெறலாம். ரீசெக்ச் (RE.IGNORECASE உடன் இயக்கவும்) ::

source: Extras
eo: Ekstraĵoj
ja: 追加物 <Extras>
ru: Дополнительно
ta: கூடுதல்

source: An extra is an optional part of a distribution. Distributions can specify as many extras as they wish, and each extra results in the declaration of additional dependencies of the distribution **when** the extra is used in a dependency specification. For instance::
eo: Ekstraĵo estas nedeviga parto de distribuo. Distribuo povas specifi tiom da ekstraĵoj kiom necesas, kaj ĉiu ekstraĵo kaŭzas la deklaron de pliaj dependecoj de la distribuo **kiam** la ekstraĵo estas uzata en depenceco-specifo. Ekzemple::
ja: 追加物とは、配布物の必須ではない部分のことです。配布物では追加物を幾つでも指定することができ、追加物が依存関係の指定場所で使われた **場合** には、それぞれの追加物が配布物の追加的な依存関係を宣言する結果になります。例えば::
pt_br: Um extra é uma parte opcional de uma distribuição. As distribuições podem especificar quantos extras desejarem, e cada extra resulta na declaração de dependências adicionais da distribuição **quando** o extra é usado em uma especificação de dependência. Por exemplo ::
ru: Экстра - это необязательная часть дистрибутива. Дистрибутивы могут указывать столько дополнений, сколько захотят, и каждое дополнение приводит к объявлению дополнительных зависимостей дистрибутива, **когда** дополнение используется в спецификации зависимостей. Например::
ta: கூடுதல் என்பது ஒரு விநியோகத்தின் விருப்ப பகுதியாகும். விநியோகங்கள் அவர்கள் விரும்பும் பல கூடுதல்வற்றைக் குறிப்பிடலாம், மேலும் ஒவ்வொரு கூடுதல் கூடுதல் விநியோகத்தின் கூடுதல் சார்புகளை அறிவிப்பதில் ** ** கூடுதல் சார்பு விவரக்குறிப்பில் பயன்படுத்தப்படும்போது. உதாரணமாக ::

source: Extras union in the dependencies they define with the dependencies of the distribution they are attached to. The example above would result in requests being installed, and requests own dependencies, and also any dependencies that are listed in the "security" extra of requests.
ja: 追加物 <extras> の依存関係の合併とは、その追加物が添付されている配布物 <distribution> の依存関係と一緒に定義されることです。上に示した例では、結果として requests がインストールされることになり、requests は自身の依存関係を持つので requests の "security" 追加物 <extra> に列挙されたすべての依存関係 (先) もインストールされることになります。
pt_br: União de extras nas dependências que definem com as dependências da distribuição à qual estão anexados. O exemplo acima resultaria na instalação de solicitações e nas próprias dependências das solicitações, além de quaisquer dependências listadas no extra de "security" das solicitações.
ru: Дополнения объединяют зависимости, которые они определяют, с зависимостями дистрибутива, к которому они присоединены. Приведенный выше пример приведет к установке requests, собственных зависимостей запросов, а также любых зависимостей, перечисленных в дополнении запросы "безопасности".
ta: எக்ச்ட்ராச் யூனியன் அவர்கள் இணைக்கப்பட்டுள்ள விநியோகத்தின் சார்புகளுடன் அவர்கள் வரையறுக்கும் சார்புகளில். மேலே உள்ள எடுத்துக்காட்டு கோரிக்கைகள் நிறுவப்படும், மேலும் கோரிக்கைகள் சொந்த சார்புகளையும், "பாதுகாப்பு" கூடுதல் கோரிக்கைகளில் பட்டியலிடப்பட்டுள்ள எந்தவொரு சார்புகளும்.

source: If multiple extras are listed, all the dependencies are unioned together.
eo: Se pluraj ekstraĵoj estas listigitaj, ĉiuj dependaĵoj estas kunigitaj.
ja: 複数の追加物 <extra> が列挙されている場合には、すべての依存関係の合併集合が依存関係になります。
pt_br: Se vários extras forem listados, todas as dependências serão unidas.
ru: Если перечислено несколько дополнений, все зависимости объединяются вместе.
ta: பல கூடுதல் பட்டியலிடப்பட்டால், அனைத்து சார்புகளும் ஒன்றிணைக்கப்படுகின்றன.

source: Versions
eo: Versioj
ja: バージョン指定子
pt_br: Versões
ru: Версии
ta: பதிப்புகள்

source: See the :ref:`Version specifier specification <version-specifiers>` for more detail on both version numbers and version comparisons. Version specifications limit the versions of a distribution that can be used. They only apply to distributions looked up by name, rather than via a URL. Version comparison are also used in the markers feature. The optional brackets around a version are present for compatibility with :pep:`345` but should not be generated, only accepted.
ja: バージョン番号やその比較方法について、詳しくは :ref:`バージョン指定子仕様 <version-specifiers>` をみてください。バージョン仕様は、配布物のバージョンとして使うことができる範囲を定めています。これは、名前によって参照される配布物にのみ適用されるのであって、URL を通じて指定されるものには該当しません。バージョン番号の比較は、また、マーカー機能においても使われます。バージョンの周囲にある必須でない括弧は :pep:`345` との互換性を保つために存在していますが、そのようなものを生成すべきではなくて受容するだけにとどめるべきです。
pt_br: Consulte a :ref:`especificação de especificadores de versão <version-specifiers>` para obter mais detalhes sobre números de versão e comparações de versões. As especificações de versão limitam as versões de uma distribuição que podem ser usadas. Elas se aplicam apenas a distribuições pesquisadas pelo nome, e não por meio de uma URL. A comparação de versões também é usada no recurso de marcadores. Os colchetes opcionais em torno de uma versão estão presentes para compatibilidade com :pep:`345`, mas não devem ser gerados, apenas aceitos.
ru: Более подробно о номерах версий и их сравнении см. в :ref:`Спецификация спецификаторов версий <version-specifiers>`. Спецификаторы версий ограничивают версии дистрибутива, которые могут быть использованы. Они применяются только к дистрибутивам, которые ищутся по имени, а не по URL. Сравнение версий также используется в функции маркеров. Необязательные скобки вокруг версии присутствуют для совместимости с :pep:`345`, но не должны генерироваться, а только приниматься.
ta: பதிப்பு எண்கள் மற்றும் பதிப்பு ஒப்பீடுகள் இரண்டிலும் மேலும் விவரங்களுக்கு `பதிப்பு விவரக்குறிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>` ஐப் பார்க்கவும். பதிப்பு விவரக்குறிப்புகள் பயன்படுத்தக்கூடிய விநியோகத்தின் பதிப்புகளைக் கட்டுப்படுத்துகின்றன. அவை முகவரி வழியாக இல்லாமல், பெயரால் பார்க்கப்படும் விநியோகங்களுக்கு மட்டுமே பொருந்தும். பதிப்பு ஒப்பீடு குறிப்பான்கள் அம்சத்திலும் பயன்படுத்தப்படுகிறது. ஒரு பதிப்பைச் சுற்றியுள்ள விருப்ப அடைப்புக்குறிகள் பொருந்தக்கூடிய தன்மைக்கு உள்ளன: PEP: `345` ஆனால் உருவாக்கப்படக்கூடாது, ஏற்றுக்கொள்ளப்பட்டது.

source: Environment Markers
eo: Mediaj Markoj
ja: 環境マーカ
pt_br: Marcadores de ambiente
ru: Маркеры окружающей среды
ta: சுற்றுச்சூழல் குறிப்பான்கள்

source: Environment markers allow a dependency specification to provide a rule that describes when the dependency should be used. For instance, consider a package that needs argparse. In Python 2.7 argparse is always present. On older Python versions it has to be installed as a dependency. This can be expressed as so::
eo: Medio-markilo permesas al dependeco-specifo provizi regulon pri tiam, kiam la dependaĵo estu uzata. Ekzemple, konsideru pakon dependantan de ``argparse``. En Python 2.7, ``argparse`` ĉiam ekzistas. Sur pli malnova versio de Python, ĝi devas esti instalita kiel dependeco. Oni esprimas tion jene::
ja: 環境マーカは、依存関係の指定においてその依存関係がいつ使われるべきであるかを記述する規則を提供します。例えば、あるパッケージが argparse を必要とするとしましょう。Python 2.7 では argparse は常に存在します。もっと古いバージョンの Python では依存関係としてインストールされなければなりません。これは次のように表現することができます::
pt_br: Os marcadores de ambiente permitem que uma especificação de dependência forneça uma regra que descreva quando a dependência deve ser usada. Por exemplo, considere um pacote que precisa de argparse. No Python 2.7, o argparse está sempre presente. Em versões mais antigas Python, ele deve ser instalado como uma dependência. Isso pode ser expresso como ::
ru: Маркеры окружения позволяют спецификации зависимости предоставить правило, описывающее, когда зависимость должна быть использована. Например, рассмотрим пакет, которому нужен argparse. В Python 2.7 argparse присутствует всегда. В более старых версиях Python он должен быть установлен как зависимость. Это можно выразить так::
ta: சுற்றுச்சூழல் குறிப்பான்கள் ஒரு சார்பு விவரக்குறிப்பை சார்புநிலை எப்போது பயன்படுத்த வேண்டும் என்பதை விவரிக்கும் ஒரு விதியை வழங்க அனுமதிக்கின்றன. உதாரணமாக, ஆர்க்பர்ச் தேவைப்படும் ஒரு தொகுப்பைக் கவனியுங்கள். பைத்தானில் 2.7 ஆர்க்பர்ச் எப்போதும் இருக்கும். பழைய பைதான் பதிப்புகளில் இது ஒரு சார்புநிலையாக நிறுவப்பட வேண்டும். இதை அவ்வாறு வெளிப்படுத்தலாம் ::

source: A marker expression evaluates to either True or False. When it evaluates to False, the dependency specification should be ignored.
eo: La valoro de marka esprimo estas aŭ ``True`` aŭ ``False``. Se la valoro estas ``False``, oni ignoru la dependecan specifon.
ja: マーカ表現は評価されると真か偽に帰着します。偽と評価された場合には、その依存関係の指定は無視されなければなりません。
pt_br: Uma expressão de marcador é avaliada como True ou False. Quando for avaliado como False, a especificação de dependência deve ser ignorada.
ru: Маркерное выражение оценивается либо в True, либо в False. Если оно имеет значение False, спецификация зависимости должна быть проигнорирована.
ta: ஒரு மார்க்கர் வெளிப்பாடு உண்மை அல்லது பொய்யை மதிப்பிடுகிறது. இது பொய்யை மதிப்பிடும்போது, சார்பு விவரக்குறிப்பு புறக்கணிக்கப்பட வேண்டும்.

source: The marker language is inspired by Python itself, chosen for the ability to safely evaluate it without running arbitrary code that could become a security vulnerability. Markers were first standardised in :pep:`345`. This document fixes some issues that were observed in the design described in :pep:`426`.
ja: マーカ言語は Python そのものに触発されたもので、セキュリティ上の脆弱性になりかねない任意コードの実行を伴わずに安全に評価を行うことができるので選ばれました。マーカは:pep:`345` で初めて標準化されました。この説明文書では、 :pep:`426` に記述されたデザインに見られるいくつかの問題点を修正しています。
pt_br: A linguagem do marcador é inspirada no próprio Python, escolhido pela capacidade de avaliá-lo com segurança sem executar código arbitrário que pode se tornar uma vulnerabilidade de segurança. Os marcadores foram padronizados pela primeira vez na :pep:`345`. Este documento corrige alguns problemas que foram observados no projeto descrito em :pep:`426`.
ru: Язык маркеров вдохновлен самим Python и выбран за возможность безопасной оценки без запуска произвольного кода, который может стать уязвимостью безопасности. Впервые маркеры были стандартизированы в :pep:`345`. В этом документе исправлены некоторые проблемы, которые были замечены в конструкции, описанной в :pep:`426`.
ta: மார்க்கர் மொழி பைத்தானால் ஈர்க்கப்பட்டு, பாதுகாப்பு பாதிப்பாக மாறக்கூடிய தன்னிச்சையான குறியீட்டை இயக்காமல் பாதுகாப்பாக மதிப்பீடு செய்யும் திறனுக்காக தேர்ந்தெடுக்கப்படுகிறது. குறிப்பான்கள் முதலில் தரப்படுத்தப்பட்டன: PEP: `345`. இந்த ஆவணம் விவரிக்கப்பட்ட வடிவமைப்பில் காணப்பட்ட சில சிக்கல்களை சரிசெய்கிறது: PEP: `426`.

source: User supplied constants are always encoded as strings with either ``'`` or ``"`` quote marks. Note that backslash escapes are not defined, but existing implementations do support them. They are not included in this specification because they add complexity and there is no observable need for them today. Similarly we do not define non-ASCII character support: all the runtime variables we are referencing are expected to be ASCII-only.
ja: ユーザ側から供給された定数は、常に ``'`` または ``"`` なる引用記号を伴った文字列として符号化されます。バックスラッシュによるエスケープは定義されていませんが、現存する実装ではサポートされているということを忘れないでください。この仕様には (バックスラッシュエスケープは) 含まれていませんが、それは、複雑性を増加させてしまうことと、現時点では目に見えるほどの必要性がないことが理由です。同様に、非 ASCII 文字のサポートも定義していません: 我々が参照するようなランタイムのすべての変数は、 ASCII 文字のみで構成されているものと期待されています。
pt_br: As constantes fornecidas pelo usuário são sempre codificadas como strings com as aspas ``'`` ou ``"``. Observe que os escapes de barra invertida não são definidos, mas as implementações existentes os suportam. Eles não estão incluídos nesta especificação porque adicionam complexidade e não há nenhuma necessidade observável para eles hoje.Da mesma forma, não definimos suporte a caracteres não-ASCII: espera-se que todas as variáveis de tempo de execução às quais nos referimos sejam somente ASCII.
ru: Пользовательские константы всегда кодируются как строки с кавычками ````` или `````````. Обратите внимание, что экранирование обратной косой черты не определено, но существующие реализации поддерживают его. Они не включены в эту спецификацию, потому что добавляют сложности, и в настоящее время в них нет видимой необходимости. Точно так же мы не определяем поддержку символов, отличных от ASCII: все переменные времени выполнения, на которые мы ссылаемся, должны быть только ASCII.
ta: பயனர் வழங்கப்பட்ட மாறிலிகள் எப்போதுமே `` '`` அல்லது `" "` `` மேற்கோள் மதிப்பெண்களுடன் சரங்களாக குறியாக்கம் செய்யப்படுகின்றன. பின்வாங்கல் தப்பித்தல் வரையறுக்கப்படவில்லை, ஆனால் தற்போதுள்ள செயலாக்கங்கள் அவற்றை ஆதரிக்கின்றன. அவை இந்த விவரக்குறிப்பில் சேர்க்கப்படவில்லை, ஏனெனில் அவை சிக்கலான தன்மையைச் சேர்க்கின்றன இன்று அவற்றைக் காணக்கூடிய தேவை இல்லை. ASCII- மட்டும்.

source: The variables in the marker grammar such as "os_name" resolve to values looked up in the Python runtime. With the exception of "extra" all values are defined on all Python versions today - it is an error in the implementation of markers if a value is not defined.
ja: "os_name" のようなマーカの文法内の変数は、 Python のランタイム内でルックアップすることで値へと解決されます。 "extra" を例外として、すべての値は現在のすべてのバージョンの Python で定義されています - もし値が定義されていなければ、それはマーカの実装のエラーです。
pt_br: As variáveis na gramática do marcador, como "os_name", resolvem os valores pesquisados no tempo de execução do Python. Com exceção de "extra" todos os valores são definidos em todas as versões Python hoje -- é um erro na implementação de marcadores se um valor não for definido.
ru: Переменные в грамматике маркеров, такие как "os_name", разрешаются в значения, которые ищутся во времени выполнения Python. За исключением "extra", все значения определены во всех современных версиях Python - если значение не определено, это ошибка в реализации маркеров.
ta: "OS_NAME" போன்ற மார்க்கர் இலக்கணத்தில் உள்ள மாறிகள் மதிப்புகளுக்குத் தீர்கின்றன, பைதான் இயக்க நேரத்தில் பார்க்கப்படுகின்றன. "கூடுதல்" தவிர அனைத்து மதிப்புகளும் இன்று அனைத்து பைதான் பதிப்புகளிலும் வரையறுக்கப்பட்டுள்ளன - ஒரு மதிப்பு வரையறுக்கப்படாவிட்டால் குறிப்பான்களை செயல்படுத்துவதில் பிழை.

source: Unknown variables must raise an error rather than resulting in a comparison that evaluates to True or False.
eo: Nekonata variablo devas kaŭzi eraro, ne rezultigante komparon de valoro ``True`` aŭ ``False``.
ja: 未知の変数は、評価して真 <True> か偽 <False> となる比較の結果を返すのではなく、エラーを生成しなければなりません。
pt_br: Variáveis desconhecidas devem gerar um erro em vez de resultar em uma comparação avaliada como True ou False.
ru: Неизвестные переменные должны вызывать ошибку, а не приводить к сравнению, которое оценивается как True или False.
ta: அறியப்படாத மாறிகள் உண்மை அல்லது பொய்யை மதிப்பிடும் ஒப்பீட்டை விட பிழையை எழுப்ப வேண்டும்.

source: Variables whose value cannot be calculated on a given Python implementation should evaluate to ``0`` for versions, and an empty string for all other variables.
eo: Variablo ne komputebla sur iu realigo de Python estu ``0`` por versioj kaj malplena signoĉeno por aliaj variabloj.
ja: 特定の Python 実装で値を計算することができない変数は、バージョンについては ``0`` として、その他のすべての変数については空文字列として評価されるべきです。
pt_br: As variáveis cujo valor não pode ser calculado em uma determinada implementação do Python devem ser avaliadas como ``0`` para versões e uma string vazia para todas as outras variáveis.
ru: Переменные, значение которых не может быть вычислено в данной реализации Python, должны оцениваться как ``0`` для версий, и как пустая строка для всех остальных переменных.
ta: கொடுக்கப்பட்ட பைதான் செயல்படுத்தலில் மதிப்பைக் கணக்கிட முடியாத மாறிகள் பதிப்புகளுக்கு `` 0`` ஆகவும், மற்ற எல்லா மாறிகளுக்கும் வெற்று சரம் என்றும் மதிப்பீடு செய்ய வேண்டும்.

source: The "extra" variable is special. It is used by wheels to signal which specifications apply to a given extra in the wheel ``METADATA`` file, but since the ``METADATA`` file is based on a draft version of :pep:`426`, there is no current specification for this. Regardless, outside of a context where this special handling is taking place, the "extra" variable should result in an error like all other unknown variables.
ja: "extra" 変数は、扱いが特別です。それは wheel ファイルにおいて、その wheel の ``METADATA`` ファイル内の特定の追加物 <extra> にどの仕様を適用するべきであるかを知らせるために使われますが、 ``METADATA`` ファイルの様式が :pep:`426` のドラフトバージョンに基づいているので、現時点ではその仕様が存在していないのです。それにも関わらず、この特別な扱いが行われる場所ではない文脈においては、 "extra" 変数はその他の未知の変数と同様にエラーに帰着するべきです。
pt_br: A variável "extra" é especial. É usada pelo wheels para sinalizar quais especificações se aplicam a um determinado extra no arquivo ``METADATA`` do wheel, mas como o arquivo ``METADATA`` é baseado em uma versão de rascunho da :pep:`426`, não há especificação atual para isso. Independentemente disso, fora de um contexto em que esse tratamento especial esteja ocorrendo, a variável "extra" deve resultar em um erro como todas as outras variáveis desconhecidas.
ru: Переменная "extra" - особенная. Она используется колесами для сигнализации о том, какие спецификации применяются к данной extra в файле ``METADATA`` колеса, но поскольку файл ``METADATA`` основан на черновой версии :pep:`426``, текущей спецификации для этого не существует. Независимо от этого, вне контекста, где происходит такая специальная обработка, переменная "extra" должна приводить к ошибке, как и все остальные неизвестные переменные.
ta: "கூடுதல்" மாறி சிறப்பு. சக்கரத்தில் கொடுக்கப்பட்ட கூடுதல் விவரக்குறிப்புகள் `` மெட்டாடேட்டா`` கோப்பில் எந்த விவரக்குறிப்புகள் பொருந்தும் என்பதைக் குறிக்க இது சக்கரங்களால் பயன்படுத்தப்படுகிறது, ஆனால் `` மெட்டாடேட்டா`` கோப்பு ஒரு வரைவு பதிப்பை அடிப்படையாகக் கொண்டது என்பதால்: PEP: `426`, இல்லை இதற்கான தற்போதைய விவரக்குறிப்பு. பொருட்படுத்தாமல், இந்த சிறப்பு கையாளுதல் நடைபெறும் ஒரு சூழலுக்கு வெளியே, "கூடுதல்" மாறி மற்ற அனைத்து அறியப்படாத மாறிகள் போன்ற பிழையை ஏற்படுத்தும்.

source: Marker
eo: Marko
ja: マーカ <Marker>
pt_br: Marcador
ru: Маркер
ta: மார்க்கர்

source: Python equivalent
eo: Python-ekvivalentaĵo
ja: Python 同等物
pt_br: Equivalente no Python
ru: Эквивалент Python
ta: பைதான் சமமான

source: Type
eo: Tipo
ta: வகை

source: Sample values
eo: Ekzemplaj valoroj
ja: 値の例
pt_br: Valores de amostra
ru: Образцовые значения
ta: மாதிரி மதிப்புகள்

source: :py:data:`os.name`
ru: :py: данные:`ос. название`
ta: : PY: தரவு: `os.name`

source: ``posix``, ``java``
ta: `` posix``, `` சாவா``

source: :py:data:`sys.platform`
ru: :py: данные:`sys. платформа`
ta: : PY: தரவு: `sys.platform`

source: ``linux``, ``linux2``, ``darwin``, ``java1.8.0_51`` (note that "linux" is from Python3 and "linux2" from Python2)
eo: ``linux``, ``linux2``, ``darwin``, ``java1.8.0_51`` (notu, ke «linux» estas de Python3 kaj «linux2» de Python2)
ja: ``linux``, ``linux2``, ``darwin``, ``java1.8.0_51`` ("linux" は Python3 から、"linux2" は Python2 からであることに注意してください)
pt_br: ``linux``, ``linux2``, ``darwin``, ``java1.8.0_51`` (observe que "linux" é do Python3 e "linux2" do Python2)
ru: ``linux``, ``linux2``, ``darwin``, ``java1.8.0_51`` (обратите внимание, что "linux" - из Python3, а "linux2" - из Python2)
ta: `` லினக்ச்``, `` லினக்ச் 2``, `` டார்வின்``, `` `சாவா 1.8.0_51`` (" லினக்ச் "பைதான் 3 இலிருந்து மற்றும் பைதான் 2 இலிருந்து" லினக்ச் 2 "என்பதை நினைவில் கொள்க)

source: ``platform_machine``
ru: ``платформа_машины``
ta: `` இயங்குதள_மச்சின்``
