Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Unlike other backends on this list, Poetry-core does not support the standard :ref:`[project] table <writing-pyproject-toml>` (it uses a different format, in the ``[tool.poetry]`` table).
eo: Malkiel aliaj malfasadoj en ĉi tiu listo, Poetry-core ne subtenas la norman :ref:`tabelon [project] <writing-pyproject-toml>` (ĝi uzas alian formon, en la tabelo ``[tool.poetry]``).
ja: このリストの他のバックエンドとは異なって、 Poetry-core は標準的な :ref:`[project] table <writing-pyproject-toml>` をサポートしていません (``[tool.poetry]`` テーブル内に別のフォーマットで書くことはできます)。
ru: В отличие от других бэкендов в этом списке, Poetry-core не поддерживает стандартную : ссылка:`[проект] таблица <writing-pyproject-toml>` (он использует другой формат, в таблице ``[ инструмент.поэзия]``).
ta: இந்த பட்டியலில் உள்ள மற்ற பின்தளத்தில் போலல்லாமல், கவிதை-கோர் தரத்தை ஆதரிக்காது: ref: `[திட்டம்] அட்டவணை <எழுதுதல்-பைபிரோசெக்ட்-டாம்>` (இது `` [கருவி.பொயெட்ரி] `` அட்டவணை ஆகியவற்றில் வேறு வடிவத்தைப் பயன்படுத்துகிறது ).

source: :ref:`setuptools`, which used to be the only build backend. Supports plugins.
eo: :ref:`setuptools`, kiu iam estis la ununura konstrua malfasado. Subtenas kromprogramojn.
ja: :ref:`setuptools` は、以前は唯一のビルドバックエンドでした。プラグインをサポート。
ru: : ссылка:`setuptools`, который раньше был единственным бэкендом сборки. Поддерживает плагины.
ta: . செருகுநிரல்களை ஆதரிக்கிறது.

source: If you use setuptools, please be aware that some features that predate standardisation efforts are now deprecated and only *temporarily kept* for compatibility.
eo: Se vi uzas setuptools, atentu, ke kelkaj funkcioj estiĝintaj antaŭ normigado estas nun evitindaj kaj nur *provizore ekzistantaj* pro kongrueco.
ja: setuptools を使うのであれば、標準化の努力が為される前の幾つかの機能が今では非推奨になっていて互換性を保つために *一時的に継続使用* しているだけであることを忘れないでください。
ru: Если вы используете setuptools, пожалуйста, имейте в виду, что некоторые функции, появившиеся до стандартизации, теперь устарели и сохраняются только *временно* для совместимости.
ta: நீங்கள் செட்ப்டூல்களைப் பயன்படுத்தினால், தரப்படுத்தல் முயற்சிகளுக்கு முன்னறிவிக்கும் சில நற்பொருத்தங்கள் இப்போது நீக்கப்பட்டுள்ளன, மேலும் * தற்காலிகமாக * மட்டுமே பொருந்தக்கூடிய தன்மைக்காக வைக்கப்பட்டுள்ளன என்பதை நினைவில் கொள்க.

source: In particular, do **not** use direct ``python setup.py`` invocations. On the other hand, configuring setuptools with a :file:`setup.py` file is still fully supported, although it is recommended to use the modern :ref:`[project] table in pyproject.toml <writing-pyproject-toml>` (or :file:`setup.cfg`) whenever possible and keep :file:`setup.py` only if programmatic configuration is needed. See :ref:`setup-py-deprecated`.
eo: Specife, **ne** rekte uzu ``python setup.py``. Tamen, agordi setuptools per dosiero :file:`setup.py` estas ankoraŭ plene subtenate, kvankam estas rekomendate uzi la modernan :ref:`tabelon [project] en pyproject.toml <writing-pyproject-toml>` (aŭ :file:`setup.cfg`) tiam ajn, kiam tio eblas, kaj uzi :file:`setup.py` nur se oni bezonas programan agordadon. Vidu :ref:`setup-py-deprecated`.
ja: とりわけ、 ``python setup.py`` のように直接に起動しては *いけません* 。他方で、可能であればいつでも近代的な :ref:`[project] table in pyproject.toml <writing-pyproject-toml>` (または :file:`setup.cfg`) を使うことや、プログラム的な設定が必要とされる場合にのみ :file:`setup.py` を使い続けることが推奨されてはいますが、 :file:`setup.py` を使って setuptools に設定を渡すことは今も完全にサポートされています。 :ref:`setup-py-deprecated` を見てください。
ru: В частности, **не** используйте прямые вызовы ``python setup.py``. С другой стороны, настройка setuptools с помощью файла : файл:`setup.py` по-прежнему полностью поддерживается, хотя рекомендуется использовать современную таблицу : ссылка:`[ проект] в pyproject.toml <запись-pyproject-toml>` (или :файл:`setup.cfg`), когда это возможно, и сохранять :файл:`setup.py` только в случае необходимости программной настройки. Смотрите : ссылка:`setup-py-deprecated`.
ta: குறிப்பாக, ** செய்ய வேண்டாம் ** நேரடி `` பைதான் setup.py`` அழைப்புகளை பயன்படுத்தவும். மறுபுறம், செடிப்டூல்களை ஒரு: கோப்பு: `setup.py` கோப்பு இன்னும் முழுமையாக ஆதரிக்கப்படுகிறது, இருப்பினும் நவீனத்தைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது: குறிப்பு:` [திட்டம்] பைபிரொசெக்ட். `(அல்லது: கோப்பு:` setup.cfg`) முடிந்த போதெல்லாம் மற்றும் வைத்திருங்கள்: கோப்பு: `setup.py` நிரல் உள்ளமைவு தேவைப்பட்டால் மட்டுமே. காண்க: ref: `setup-py- deprecated`.

source: Other examples of deprecated features you should **not** use include the ``setup_requires`` argument to ``setup()`` (use the :ref:`[build-system] table <pyproject-guide-build-system-table>` in :file:`pyproject.toml` instead), and the ``easy_install`` command (cf. :ref:`pip vs easy_install`).
eo: Jen aliaj evitindaj trajtoj, kiujn oni **ne** uzu: la argumento ``setup_requires`` de ``setup()`` (anstataŭe uzu :ref:`la tabelon [build-system] <pyproject-guide-build-system-table>` en :file:`pyproject.toml`), kaj la komando ``easy_install`` (vidu :ref:`pip vs easy_install`).
ja: 非推奨となった機能の他の例としては、 ``setup()`` の ``setup_requires`` 引数を使うべきではなく (代わりに :file:`pyproject.toml` 内の :ref:`[build-system] テーブル <pyproject-guide-build-system-table>` を使ってください) 、また、 ``easy_install`` コマンドを使うことも非推奨になっています (cf. :ref:`pip vs easy_install`) 。
ru: Другие примеры устаревших функций, которые не следует **не** использовать, включают аргумент ``setup_requires`` для ``setup()`` (вместо него используйте : ссылка:`[ сборка-системы] таблица <pyproject-guide-build-system-table>` в :файл:`pyproject.toml``), и команду ``easy_install`` (ср. :ссылка:`pip против easy_install``).
ta: நீங்கள் நீக்கப்பட்ட அம்சங்களின் பிற எடுத்துக்காட்டுகள் ** அல்ல ** பயன்பாடு `` setup_requires`` வாதத்தை `` அமைவு () `` (பயன்படுத்தவும்: ref: `[பில்ட்-சிச்டம்] அட்டவணை <pyproject-guide-கட்டளை அமைப்பு -table> `இல்: கோப்பு:` pyproject.toml` அதற்கு பதிலாக), மற்றும் `` Ease_install`` கட்டளை (cf. : Ref: `PIP vs Ease_install`).

source: Do **not** use :ref:`distutils`, which is deprecated, and has been removed from the standard library in Python 3.12, although it still remains available from setuptools.
eo: **Ne** uzu :ref:`distutils`, kiu estas evitinda kaj forigita el la norma biblioteko en Python 3.12, kvankam ĝi estas ankoraŭ disponebla per setuptools.
ja: :ref:`distutils` を *使わないで* ください、というのも、これは非推奨になっていますし、まだ setuptools から利用可能ではありますが Python 3.12 で標準ライブラリから取り除かれたものです。
ru: Не используйте : ссылка:`distutils`, который устарел и был удален из стандартной библиотеки в Python 3.12, хотя он по-прежнему доступен из setuptools.
ta: செய்யுங்கள் ** அல்ல ** பயன்பாடு: குறிப்பு: `டிச்டிடில்ச்`, இது நீக்கப்பட்டது, மேலும் பைத்தான் 3.12 இல் உள்ள நிலையான நூலகத்திலிருந்து அகற்றப்பட்டது, இருப்பினும் இது இன்னும் செட்டுப்டூல்களிலிருந்து கிடைக்கிறது.

source: For packages with :term:`extension modules <extension module>`, it is best to use a build system with dedicated support for the language the extension is written in, for example:
eo: Por pako kun :term:`etendaĵa modulo <extension module>`, oni uzu konstrusistemon subtenantan la lingvon de la etendaĵo. Ekzemple:
ja: :term:`拡張モジュール <extension module>` を伴うパッケージについては、その拡張が書かれた言語用の専用サポートのあるビルドシステムを使うのが最善です、例えば:
ru: Для пакетов с : термин:`модули расширения <модуль расширения>`, лучше всего использовать систему сборки с поддержкой языка, на котором написано расширение, например:
ta: இதில் தொகுப்புகளுக்கு: கால: `நீட்டிப்பு தொகுதிகள் <நீட்டிப்பு தொகுதி>`, நீட்டிப்பு எழுதப்பட்ட மொழிக்கு பிரத்யேக ஆதரவுடன் ஒரு உருவாக்க முறையைப் பயன்படுத்துவது நல்லது, எடுத்துக்காட்டாக:

source: :ref:`setuptools` -- natively supports C and C++ (with third-party plugins for Go and Rust),
eo: :ref:`setuptools` -- indiĝene subtenas C kaj C++ (kun triapartiaj kromaĵoj por Go kaj Rust),
ja: :ref:`setuptools` -- C 言語および C++ 言語をネイティブにサポート (サードパーティのプラグインで Go 言語と Rust 言語も)、
ru: : ссылка:`setuptools` - изначально поддерживает C и C++ (со сторонними плагинами для Go и Rust),
ta: :ref:`setuptools` -- natively supports C and C++ (with third-party செருகுநிரல்கள் க்கு Go and Rust),

source: :ref:`meson-python` -- C, C++, Fortran, Rust, and other languages supported by Meson,
eo: :ref:`meson-python` -- C, C++, Fortrano, Rust, kaj aliaj lingvoj subtenataj de Meson,
ja: :ref:`meson-python` -- C 言語・ C++ 言語・ Fortran ・ Rust およびその他の言語が Meson によってサポートされています、
ru: : ссылка:`meson-python` -- C, C++, Fortran, Rust и другие языки, поддерживаемые Meson,
ta: :ref:`meson-python` -- C, C++, Fortran, Rust, and மற்றொன்று மொழிகள் supported by Meson,

source: :ref:`scikit-build-core` -- C, C++, Fortran, and other languages supported by CMake,
eo: :ref:`scikit-build-core` -- C, C++, Fortrano, kaj aliaj lingvoj subtenataj de CMake,
ja: :ref:`scikit-build-core` -- C 言語・ C++ 言語・ Fortran やその他の言語が CMake によってサポートされています、
ru: : ссылка:`scikit-build-core` -- C, C++, Fortran и другие языки, поддерживаемые CMake,
ta: :ref:`scikit-build-core` -- C, C++, Fortran, and மற்றொன்று மொழிகள் supported by CMake,

source: :ref:`maturin` -- Rust, via Cargo.
eo: :ref:`maturin` -- Rust, per Cargo.
ja: :ref:`maturin` -- Rust 、 Cargo を経由して。
ru: : ссылка:`maturin` - Rust, через Cargo.
ta: : ref: `` Maturin` - ரச்ட், சரக்கு வழியாக.

source: Building distributions
eo: Konstrui distribuojn
ja: 配布物をビルドする
ru: Распределение зданий
ta: கட்டிட வழங்கல்

source: The standard tool to build :term:`source distributions <source distribution (or "sdist")>` and :term:`wheels <wheel>` for uploading to PyPI is :ref:`build`. It will invoke whichever build backend you :ref:`declared <pyproject-guide-build-system-table>` in :file:`pyproject.toml`.
eo: La norma ilo por konstrui :term:`fontan distribuon <source distribution (or "sdist")>` kaj :term:`wheel <wheel>` alŝuteblajn al PyPI estas :ref:`build`. Ĝi rulas la malfasadon :ref:`deklaritan <pyproject-guide-build-system-table>` en :file:`pyproject.toml`.
ja: PyPI へアップロードするために :term:`ソースコード配布物 <source distribution (or "sdist">` や :term:`wheels <wheel>` をビルドするための標準ツールは、 :ref:`build` です。:file:`pyproject.toml` 内で `宣言された <pyptoject-guide-build-system-table>` ビルドバックエンドが何であれ、それを起動することになります。
ru: Стандартным инструментом для сборки : термин:`источник дистрибутива <источник дистрибутива (или "sdist")>` и :термин:`колеса <колесо>` для загрузки на PyPI является : ссылка:`build`. Он будет вызывать тот бэкенд сборки, который вы : ссылка:`декларировали <pyproject-guide-build-system-table>` в :файл:`pyproject.toml`.
ta: உருவாக்குவதற்கான நிலையான கருவி: கால: `மூல வழங்கல் <மூல வழங்கல் (அல்லது" SDIST ")>` மற்றும்: கால: `சக்கரங்கள் <hewhel>` PYPI இல் பதிவேற்றுவதற்கு: ref: `build`. இது உங்களை பின்தளத்தில் கட்டியெழுப்புவதைத் தூண்டும்: குறிப்பு: `அறிவிக்கப்பட்ட <pyproject-guide-கட்டளை-அமைப்பு-அட்டவணை>` இல்: கோப்பு: `pyproject.toml`.

source: Do **not** use ``python setup.py sdist`` and ``python setup.py bdist_wheel`` for this task. All direct invocations of :file:`setup.py` are :ref:`deprecated <setup-py-deprecated>`.
eo: **Ne** uzu ``python setup.py sdist`` nek ``python setup.py bdist_wheel`` por tiu tasko. Ĉia rekta alvoko de :file:`setup.py` estas :ref:`evitinda <setup-py-deprecated>`.
ja: この作業のために ``python setup.py sdist`` や ``python setup.py bdist_wheel`` を *使わないで* ください。:file:`setup.py` を直接に起動することは :ref:`非推奨 <setup-py-deprecated>` になっています。
ru: Не используйте для этой задачи ``python setup.py sdist`` и ``python setup.py bdist_wheel``. Все прямые вызовы : файл:`setup.py` являются :ссылка:`утратившими актуальность <setup-py-deprecated>`.
ta: ** செய்ய வேண்டாம் ** இந்த பணிக்கு `` பைதான் அமைவு. அனைத்து நேரடி அழைப்புகளும்: கோப்பு: `setup.py`: ref:` நீக்கப்பட்ட <setup-py- deprecated> `.

source: If you have :term:`extension modules <extension module>` and want to distribute wheels for multiple platforms, use :ref:`cibuildwheel` as part of your CI setup to build distributable wheels.
eo: Se vi havas :term:`etendaĵan modulo <extension module>` kaj volas distribui wheel-ojn por pluraj platformoj, uzu :ref:`cibuildwheel` kiel parton de via kontinua integrado por konstrui distribueblajn wheel-ojn.
ja: もし、 :term:`拡張モジュール <extension module>` を使っていて複数のプラットフォーム向けに wheel ファイルを配布したいと考えているなら、配布可能な wheel ファイルをビルドする CI 環境の一部として :ref:`cibuildwheel` を使いましょう。
ru: Если у вас есть : термин:`модули расширения <модуль расширения>` и вы хотите распространять колеса для нескольких платформ, используйте : ссылка:`cibuildwheel` как часть вашей настройки CI для сборки распространяемых колес.
ta: உங்களிடம் இருந்தால்: சொல்: `நீட்டிப்பு தொகுதிகள் <நீட்டிப்பு தொகுதி>` மற்றும் பல தளங்களுக்கான சக்கரங்களை விநியோகிக்க விரும்பினால், பயன்படுத்தவும்: ref: `cibuildwheel` உங்கள் தொஒ அமைப்பின் ஒரு பகுதியாக விநியோகிக்கக்கூடிய சக்கரங்களை உருவாக்க.

source: Uploading to PyPI
eo: Alŝuti al PyPI
ja: PyPIにアップロードする
ru: Загрузка на PyPI
ta: PYPI இல் பதிவேற்றுகிறது

source: For projects hosted on or published via supported CI/CD platforms, it is recommended to use the :ref:`Trusted Publishing <trusted-publishing>`, which allows the package to be securely uploaded to PyPI from a CI/CD workflow without a manually configured API token.
ru: Для проектов, размещенных на поддерживаемых CI/CD платформах или опубликованных с их помощью, рекомендуется использовать :ref:`Trusted Publishing <trusted-publishing>`, который позволяет безопасно загрузить пакет в PyPI из CI/CD рабочего процесса без ручной настройки API-токена.
ta: ஆதரிக்கப்பட்ட சிஐ/சிடி இயங்குதளங்கள் வழியாக புரவலன் செய்யப்பட்ட அல்லது வெளியிடப்பட்ட திட்டங்களுக்கு, பயன்படுத்த பரிந்துரைக்கப்படுகிறது: rew: `நம்பகமான வெளியீடு <நம்பகமான-வெளியீட்டு>`, இது ஒரு சிஐ/சிடி பணிப்பாய்வுகளிலிருந்து பைபிக்கு பாதுகாப்பாக பதிவேற்ற அனுமதிக்கிறது கைமுறையாக கட்டமைக்கப்பட்ட பநிஇ கிள்ளாக்கு.

source: As of November 2024, PyPI supports the following platforms as Trusted Publishing providers:
eo: Je la Novembro de 2024, PyPI subtenas la jenajn platformojn kiel provizantojn de Fidata Eldonado:
ru: По состоянию на ноябрь 2024 года PyPI поддерживает следующие платформы в качестве доверенных поставщиков публикаций:
ta: நவம்பர் 2024 நிலவரப்படி, நம்பகமான வெளியீட்டு வழங்குநர்களாக பின்வரும் தளங்களை PYPI ஆதரிக்கிறது:

source: GitHub Actions (on ``https://github.com``)
eo: GitHub Actions (ĉe ``https://github.com``)
ru: Действия на GitHub (на ``https://github.com``)
ta: Github செயல்கள் (`` https: // github.com`` இல்)

source: GitLab CI/CD (on ``https://gitlab.com``)
eo: GitLab CI/CD (ĉe ``https://gitlab.com``)
ru: GitLab CI/CD (на ``https://gitlab.com``)
ta: Gitlab ci/cd (`https: // gitlab.com` இல்)

source: ActiveState
ta: செயல்பாட்டு

source: Google Cloud
ta: கூகிள் முகில்

source: The other available method is to upload the package manually using :ref:`twine`.
eo: La alia havebla metodo estas alŝuti la pakon malaŭtomate per :ref:`twine`.
ja: 利用可能なもうひとつの方法は、 :ref:`twine` を用いて手動でパッケージをアップロードすることです。
ru: Другой доступный способ - загрузить пакет вручную с помощью : ссылка:`twine`.
ta: கிடைக்கக்கூடிய மற்ற முறை, தொகுப்பை கைமுறையாகப் பயன்படுத்துவதே: ref: `கயிறு`.

source: **Never** use ``python setup.py upload`` for this task. In addition to being :ref:`deprecated <setup-py-deprecated>`, it is insecure.
eo: **Neniam** uzu ``python setup.py upload`` por tiu tasko. Ĝi estas :ref:`evitinda <setup-py-deprecated>` kaj malseksura.
ja: このタスクを行うために ``python setup.py upload`` を使うことは *絶対にやめて* ください。 :ref:`非推奨 <setup-py-deprecated>` であることに加えて、危険 <insecure> です。
ru: **Никогда** не используйте ``python setup.py upload`` для этой задачи. Помимо того, что он является : ссылка:`утратившим актуальность <setup-py-deprecated>`, он еще и небезопасен.
ta: ** ஒருபோதும் ** இந்த பணிக்கு `` பைதான் அமைவு. இருப்பதற்கு கூடுதலாக: ref: `நீக்கப்பட்ட <setup-py- deprecated>`, இது பாதுகாப்பற்றது.

source: Workflow tools
eo: Laborfluiloj
ja: ワークフローツール
ru: Инструменты рабочего процесса
ta: பணிப்பாய்வு கருவிகள்

source: These tools are environment managers that automatically manage virtual environments for a project. They also act as "task runners", allowing you to define and invoke tasks such as running tests, compiling documentation, regenerating some files, etc. Some of them provide shortcuts for building distributions and uploading to PyPI, and some support lock files for applications. They often call the tools mentioned above under the hood. In alphabetical order:
ja: これらのツール群は、プロジェクトの仮想環境を自動的に管理する環境マネージャです。これらは、テストを走らせたり、説明文書をコンパイルしたり、何らかのファイルを再生成したり、その他のタスクを定義して起動するための "タスク実行係" としても動作します。これらのうちのいくつかは配布物をビルドしたり PyPI にアップロードするためのショートカットを提供しますし、あるいは、アプリケーション向けのロックファイルをサポートしています。これらは、往々にして、先述のツール群を内部的に呼び出しています。アルファベット順に:
ru: Эти инструменты представляют собой менеджеры окружения, которые автоматически управляют виртуальными средами для проекта. Они также выступают в роли "бегунков задач", позволяя вам определять и вызывать такие задачи, как запуск тестов, компиляция документации, регенерация некоторых файлов и т. д. Некоторые из них предоставляют ярлыки для сборки дистрибутивов и загрузки в PyPI, а некоторые поддерживают блокировку файлов для приложений. Часто они вызывают инструменты, упомянутые выше под капотом. В алфавитном порядке:
ta: இந்த கருவிகள் ஒரு திட்டத்திற்கான மெய்நிகர் சூழல்களை தானாக நிர்வகிக்கும் சுற்றுச்சூழல் மேலாளர்கள். அவை "பணி ஓட்டப்பந்தய வீரர்களாகவும்" செயல்படுகின்றன, சோதனைகளை இயக்குதல், ஆவணங்களை தொகுத்தல், சில கோப்புகளை மீண்டும் உருவாக்குதல் போன்ற பணிகளை வரையறுக்கவும், செயல்படுத்தவும் உங்களை அனுமதிக்கிறது. அவற்றில் சில விநியோகங்களை உருவாக்குவதற்கும் PYPI இல் பதிவேற்றுவதற்கும் குறுக்குவழிகளை வழங்குகின்றன, மேலும் பயன்பாடுகளுக்கான சில உதவி பூட்டு கோப்புகள் . அவர்கள் பெரும்பாலும் மேலே குறிப்பிட்ட கருவிகளை பேட்டை கீழ் அழைக்கிறார்கள். அகர வரிசைப்படி:

source: :ref:`Hatch`,
ru: :ссылка:`Hatch`,
ta: : ref: `அட்ச்`,

source: :ref:`Pipenv`,
ru: :ссылка:`Pipenv`,
ta: : ref: `பைபென்வ்`,

source: :ref:`Poetry`,
ru: :ссылка:`Поэзия`,
ta: : ref: `கவிதை`,

source: :doc:`tox <tox:index>`.
ru: : документ:`токсический <токсический:индекс>`.
ta: : டாக்: `டாக்ச் <டோக்ச்: குறியீட்டு>`.

source: Including files in source distributions with ``MANIFEST.in``
eo: Inkluzivi dosierojn en fontajn distribuojn per ``MANIFEST.in``
ja: ``MANIFEST.in`` を使ってソースコード配布物にファイルを含める
pt_br: Incluindo arquivos em distribuições de código-fonte com ``MANIFEST.in``
ru: Включение файлов в исходные дистрибутивы с помощью ``MANIFEST.in``
ta: `` Manifest.in`` உடன் மூல விநியோகங்களில் உள்ள கோப்புகளை உள்ளடக்கியது

source: The information on this page has moved to :doc:`setuptools:userguide/miscellaneous` in the setuptools documentation.
eo: La informoj sur ĉi tiu paĝo moviĝis al :doc:`setuptools:userguide/miscellaneous` en la dokumentaro de setuptools.
ja: このページの情報は、setuptools 説明文書の中の :doc:`setuptools:userguide/miscellaneous` に移されました。
pt_br: As informações nesta página foram movidas para :doc:`setuptools:userguide/miscellaneous` na documentação do setuptools.
ru: Информация на этой странице была перемещена в :doc:`setuptools:userguide/miscellaneous` в документации по setuptools.
ta: இந்தப் பக்கத்தில் உள்ள தகவல்கள் நகர்ந்தன: DOC: `Setuptools: USerguide/Miscelliveane`` செட்டுப்லூல்ச் ஆவணத்தில்.

source: ``TestPyPI`` is a separate instance of the :term:`Python Package Index (PyPI)` that allows you to try out the distribution tools and process without worrying about affecting the real index. TestPyPI is hosted at `test.pypi.org <https://test.pypi.org>`_
eo: Prova PyPI estasa aparta servilo de la :term:`Python-Pakindekso <Python Package Index (PyPI)>` permesanta al vi elprovi la distribuadajn ilojn kaj procezojn sen perturbado de la reala indekso. Prova PyPI troviĝas ĉe `test.pypi.org <https://test.pypi.org>`_
ja: ``TestPyPI`` は :term:`Python パッケージインデックス <Python Package Index (PyPI)>` とは別のインスタンスで、本番環境に影響を与えてしまう心配をせずに配布ツールやプロセスを試してみることができます。 TestPyPI は `test.pypi.org <https://test.pypi.org>`_ にホストされています
pt_br: ``Test PyPI`` é uma instância separada do :term:`Python Package Index (PyPI)` que permite que você experimente as ferramentas de distribuição e o processo sem se preocupar em afetar o índice real. O TestPyPI está hospedado em `test.pypi.org <https://test.pypi.org>`_
ru: ``TestPyPI`` - это отдельный экземпляр :term:``Python Package Index (PyPI)``, который позволяет вам опробовать инструменты и процесс распространения, не беспокоясь о том, что это повлияет на настоящий индекс. TestPyPI размещен по адресу `test.pypi.org <https://test.pypi.org>`_
ta: `` TestPypi`` என்பது ஒரு தனி நிகழ்வு: கால: `பைதான் தொகுப்பு குறியீட்டு (PYPI)` இது உண்மையான குறியீட்டை பாதிப்பதைப் பற்றி கவலைப்படாமல் விநியோக கருவிகளை முயற்சிக்கவும் செயல்முறையாகவும் உங்களை அனுமதிக்கிறது. TestPypi `test.pypi.org <https://test.pypi.org> _ _ இல் புரவலன் செய்யப்படுகிறது

source: Registering your account
eo: Registri vian konton
ja: アカウントを登録する
pt_br: Registrando sua conta
ru: Регистрация учётной записи
ta: உங்கள் கணக்கை பதிவு செய்தல்

source: Because TestPyPI has a separate database from the live PyPI, you'll need a separate user account specifically for TestPyPI. Go to https://test.pypi.org/account/register/ to register your account.
eo: Ĉar Prova PyPI havas datenbankon apartan de la vera PyPI, oni bezonas apartan konton specifan por Prova PyPI. Iru al https://test.pypi.org/account/register/ por registri vin mem.
ja: TestPyPI は PyPI とは別のデータベースで運用されているので、 TestPyPI 専用のユーザアカウントを作成する必要があります。 https://test.pypi.org/account/register/ へ行ってアカウントを登録しましょう。
pt_br: Como o TestPyPI tem um banco de dados separado do PyPI real, você precisará de uma conta de usuário separada especificamente para o TestPyPI. Vá para https://test.pypi.org/account/register/ para registrar sua conta.
ru: Поскольку TestPyPI имеет отдельную базу данных от живого PyPI, вам понадобится отдельная учетная запись пользователя специально для TestPyPI. Перейдите на https://test.pypi.org/account/register/, чтобы зарегистрировать свою учетную запись.
ta: டெச்ட்பிஐ லைவ் PYPI இலிருந்து ஒரு தனி தரவுத்தளத்தைக் கொண்டிருப்பதால், டெச்ட்பிஐக்கு குறிப்பாக ஒரு தனி பயனர் கணக்கு தேவைப்படும். உங்கள் கணக்கை பதிவு செய்ய https://test.pypi.org/account/register/ க்குச் செல்லவும்.

source: The database for TestPyPI may be periodically pruned, so it is not unusual for user accounts to be deleted.
eo: La datenbanko de la Prova PyPI estas periode reduktata; tial, konto de uzanto ofte estas forigita.
ja: TestPyPI 用のデータベースは定期的に刈り込まれるので、往々にしてユーザアカウントが削除されることがあります。
pt_br: O banco de dados do TestPyPI pode ser apagado periodicamente, portanto, não é incomum que contas de usuário sejam excluídas.
ru: База данных TestPyPI может периодически подвергаться обрезке, поэтому нередко учетные записи пользователей удаляются.
ta: டெச்ட்பிஐவுக்கான தரவுத்தளம் அவ்வப்போது கத்தரிக்கப்படலாம், எனவே பயனர் கணக்குகள் நீக்கப்படுவது வழக்கத்திற்கு மாறானதல்ல.

source: Using TestPyPI with Twine
eo: Uzi TestPyPI kun Twine
ja: Twine を使って TestPyPI を使う
pt_br: Usando TestPyPI com Twine
ru: Использование TestPyPI вместе с Twine
ta: கயிறுடன் டெச்ட்பை பயன்படுத்துதல்

source: You can upload your distributions to TestPyPI using :ref:`twine` by specifying the ``--repository`` flag:
eo: Vi povas alŝuti viajn distribuojn al Prova PyPI per :ref:`twine` uzante la flagon ``--repository``:
ja: :ref:`twine` に ``--repository`` フラグを指定して使うことで、配布物を TestPyPI にアップロードすることができます:
pt_br: Você pode enviar suas distribuições para TestPyPI usando :ref:`twine` especificando o sinalizador ``--repository``:
ru: Вы можете загрузить свои дистрибутивы в TestPyPI с помощью :ref:`twine`, указав флаг ``--repository``:
ta: `` --Repository`` கொடியைக் குறிப்பிடுவதன் மூலம் ref: `ட்வைன்` உங்கள் விநியோகங்களை டெச்ட்பைட்டில் பதிவேற்றலாம்:
