Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Implicit pre-release number
eo: Implicita antaŭeldona numero
ja: 明示しないプレリリース番号
pt_br: Número de pré-lançamento implícito
ru: Неявный номер предварительного выпуска
ta: மறைமுகத்திற்கு முந்தைய வெளியீடு எண்

source: Pre releases allow omitting the numeral in which case it is implicitly assumed to be ``0``. The normal form for this is to include the ``0`` explicitly. This allows versions such as ``1.2a`` which is normalized to ``1.2a0``.
eo: Antaŭeldono permesas forlasi la numeron, kio implicas ``0``. La norma formo eksplicas ``0``. Tio permesas versiojn kiel ``1.2a``, kies norma formo estas ``1.2a0``.
ja: プレリリースでは、数字部分を省略することが許容されており、その場合には暗黙のうちに ``0`` が想定されます。この場合の標準形式は、 ``0`` を明示的に含めておく形です。これによって、標準化すれば ``1.2a0`` になる ``1.2a`` のようなバージョン番号を許容します。
ru: В предыдущих версиях допускается опускать цифру, в этом случае она неявно принимается за ``0``. Нормальной формой для этого является явное указание ``0``. Это позволяет использовать такие версии, как ``1.2a``, которые нормализуются до ``1.2a0``.
ta: முன் வெளியீடுகள் எண்களைத் தவிர்ப்பதற்கு அனுமதிக்கின்றன, இந்த விசயத்தில் அது `` 0`` என்று மறைமுகமாக கருதப்படுகிறது. இதற்கான சாதாரண வடிவம் `` 0`` வெளிப்படையாக சேர்க்க வேண்டும். இது `` 1.2a`` போன்ற பதிப்புகளை அனுமதிக்கிறது, இது `` 1.2A0`` க்கு இயல்பாக்கப்படுகிறது.

source: Post release separators
eo: Posteldonaj disigiloj
ja: ポストリリースのセパレータ
pt_br: Separadores de pós lançamento
ru: Сепараторы после выпуска
ta: வெளியீட்டு பிரிப்பான்கள் இடுகை

source: Post releases allow a ``.``, ``-``, or ``_`` separator as well as omitting the separator all together. The normal form of this is with the ``.`` separator. This allows versions such as ``1.2-post2`` or ``1.2post2`` which normalize to ``1.2.post2``. Like the pre-release separator this also allows an optional separator between the post release signifier and the numeral. This allows versions like ``1.2.post-2`` which would normalize to ``1.2.post2``.
eo: Posteldono permesas la apartigilojn ``.``, ``-`` aŭ ``_``, aŭ eĉ la mankon de apartigilo. La norma formo uzas la apartigilon ``.``. Tio permesas versiojn kiel ``1.2-post2`` aŭ ``1.2post2``, kies norma formo estas ``1.2.post2``. Simile al apartigilo de antaŭeldono, tio ankaŭ permesas nedevigan apartigilon inter la posteldono-specifilo kaj la numero. Tio permesas versiojn kiel ``1.2.post-2``, kies norma formo estas ``1.2.post2``.
ja: ポストリリースは、セパレータとして ``.`` ・ ``-`` や ``_`` を許容し、また、セパレータを全部省略することも許容します。これの標準形式は、 ``.`` セパレータです。これによって、標準化すれば ``1.2.post2`` となる ``1.2-post2`` や ``1.2post2`` のようなバージョン番号を許容します。プレリリースでのセパレータと同様に、これによって、ポストリリースの記号と数字の間にオプションとしてのセパレータを置くことを許容します。これによって、標準化すれば ``1.2.post2`` となるであろう ``1.2.port-2`` のようなバージョン番号を許容します。
ru: В релизах Post допускается использование разделителя ``.``, ``-`` или ``_``, а также полное отсутствие разделителя. Обычная форма - с разделителем ``.``. Это позволяет использовать такие версии, как ``1.2-post2`` или ``1.2post2``, которые нормализуются до ``1.2.post2``. Как и в случае с предрелизным разделителем, здесь также допускается необязательный разделитель между обозначением пострелиза и цифрой. Это позволяет использовать версии типа ``1.2.post-2``, которые нормализуются до ``1.2.post2``.
ta: போச்ட் வெளியீடுகள் ஒரு `` .``, `` --``, அல்லது `` _`` பிரிப்பான் மற்றும் பிரிப்பான் அனைத்தையும் ஒன்றாகத் தவிர்ப்பதை அனுமதிக்கின்றன. இதன் இயல்பான வடிவம் `` .`` பிரிப்பான். இது `` 1.2-post2`` அல்லது `1.2 போச்ட் 2`` போன்ற பதிப்புகளை` `1.2.post2`` க்கு இயல்பாக்குகிறது. முன் வெளியீட்டு பிரிப்பானைப் போலவே இது இடுகை வெளியீட்டு அடையாளத்திற்கும் எண்களுக்கும் இடையில் விருப்பமான பிரிப்பான் அனுமதிக்கிறது. இது `` 1.2.post-2`` போன்ற பதிப்புகளை அனுமதிக்கிறது, இது `` 1.2.post2`` க்கு இயல்பாக்கும்.

source: Post release spelling
eo: Posteldona literumado
ja: ポストリリースの綴り方
ru: Написание после выпуска
ta: வெளியீட்டு எழுத்துப்பிழை இடுகை

source: Post-releases allow the additional spellings of ``rev`` and ``r``. This allows versions such as ``1.0-r4`` which normalizes to ``1.0.post4``. As with the pre-releases the additional spellings should be considered equivalent to their normal forms.
eo: Posteldono ankaŭ permesas la literumaĵojn ``rev`` kaj ``r``. Tio permesas versiojn kiel ``1.0-r4``, kies normigita formo estas ``1.0.post4``. Same kiel antaŭeldono, la ekstraj literumaĵoj ekvivalentas la normigitajn formojn.
ja: ポストリリースは、追加の綴り方である ``rev`` や ``r`` を許容します。これによって、標準化すれば ``1.0.post4`` になるであろう ``1.0-r4`` のようなバージョン番号を許容します。プレリリースでの追加の綴り方と同様に、その標準形式と同等のものと見做されるべきです。
ru: Пост-релизы допускают дополнительные написания ``rev`` и ``r``. Это позволяет использовать такие версии, как ``1.0-r4``, которые нормализуются до ``1.0.post4``. Как и в предыдущих версиях, дополнительные написания следует считать эквивалентными их нормальным формам.
ta: பிந்தைய உறவுகள் `` rev`` மற்றும் `` r`` ஆகியவற்றின் கூடுதல் எழுத்துப்பிழைகளை அனுமதிக்கின்றன. இது `` 1.0-R4`` போன்ற பதிப்புகளை `` 1.0.post4`` க்கு இயல்பாக்குகிறது. முன் வெளியீடுகளைப் போலவே கூடுதல் எழுத்துப்பிழைகள் அவற்றின் சாதாரண வடிவங்களுக்கு சமமானதாக கருதப்பட வேண்டும்.

source: Implicit post release number
eo: Implicita posteldona numero
ja: 明示されないポストリリース番号
pt_br: Número implícito de pós lançamento
ru: Неявный номер после выпуска
ta: மறைமுகமான இடுகை வெளியீட்டு எண்

source: Post releases allow omitting the numeral in which case it is implicitly assumed to be ``0``. The normal form for this is to include the ``0`` explicitly. This allows versions such as ``1.2.post`` which is normalized to ``1.2.post0``.
eo: Posteldono permesas forlasi la numeron, kio implicas ``0``. La norma formo eksplicas ``0``. Tio permesas versiojn kiel ``1.2post``, kies norma formo estas ``1.2post0``.
ja: ポストリリース番号では、数字部分を省略することが許容されていて、その場合には暗黙の裡に ``0`` であるものと仮定されます。これの標準形式は、明示的に ``0`` を含めることです。これによって、標準化すれば ``1.2.post0`` となる ``1.2.post`` のようなバージョン番号を許容します。
ru: Пост-релизы позволяют опускать цифру, в этом случае она неявно принимается за ``0``. Нормальной формой для этого является явное указание ``0``. Это позволяет использовать такие версии, как ``1.2.post``, которые нормализуются до ``1.2.post0``.
ta: போச்ட் வெளியீடுகள் எண்களைத் தவிர்ப்பதற்கு அனுமதிக்கின்றன, இந்த விசயத்தில் அது `` 0`` என்று மறைமுகமாக கருதப்படுகிறது. இதற்கான சாதாரண வடிவம் `` 0`` வெளிப்படையாக சேர்க்க வேண்டும். `` 1.2.post0`` க்கு இயல்பாக்கப்பட்ட `` 1.2.post`` போன்ற பதிப்புகளை இது அனுமதிக்கிறது.

source: Implicit post releases
eo: Implicitaj posteldonoj
ja: 暗黙裡のポストリリース
pt_br: Pós lançamentos implícitos
ru: Неявные пост-релизы
ta: மறைமுகமான இடுகை வெளியீடுகள்

source: Post releases allow omitting the ``post`` signifier all together. When using this form the separator MUST be ``-`` and no other form is allowed. This allows versions such as ``1.0-1`` to be normalized to ``1.0.post1``. This particular normalization MUST NOT be used in conjunction with the implicit post release number rule. In other words, ``1.0-`` is *not* a valid version and it does *not* normalize to ``1.0.post0``.
eo: Posteldono permesas la mankon de la signifilo ``post``. Por tiu formo, la apartigilo DEVAS esti ``-``; neniu alia formo estas permesata. Tio permesas versiojn kiel ``1.0-1``, kies norma formo estas ``1.0.post1``. Oni DEVAS NE uzi tion kune kun la regulo de implicita posteldona numero. Alivorte, ``1.0-`` *ne* validas, kaj ĝia norma formo *ne* estas ``1.0.post0``.
ja: ポストリリースは、 ``post`` 記号を全く省略することを許容します。この形式を使う時には、セパレータは ``-`` でなければならず、他の形式は許されません。これによって、標準化すれば ``1.0.post1`` となる ``1.0-1`` のようなバージョン番号が許容されます。この標準化方法は、暗黙裡のポストリリース番号のルールと同時に使われてはなりません。換言すれば、 ``1.0-`` は正当なバージョン番号では *なく* 、 ``1.0.post0`` へ標準化されることも *ありません* 。
ru: Релизы Post позволяют полностью отказаться от обозначения ``post``. При использовании этой формы разделитель ДОЛЖЕН быть ``-`` и никакая другая форма не допускается. Это позволяет нормализовать такие версии, как ``1.0-1``, до ``1.0.post1``. Эта конкретная нормализация НЕ ДОЛЖНА использоваться в сочетании с правилом неявного номера релиза. Другими словами, ``1.0-`` - это *не* допустимая версия, и она *не* нормализуется до ``1.0.post0``.
ta: பிந்தைய வெளியீடுகள் `` போச்ட்`` அடையாளங்காட்டியைத் தவிர்ப்பதற்கு அனுமதிக்கின்றன. இந்த வடிவத்தைப் பயன்படுத்தும் போது பிரிப்பான் `` --`` ஆக இருக்க வேண்டும், வேறு எந்த வடிவமும் அனுமதிக்கப்படவில்லை. இது `` 1.0-1`` போன்ற பதிப்புகளை `` 1.0.post1`` க்கு இயல்பாக்க அனுமதிக்கிறது. இந்த குறிப்பிட்ட இயல்பாக்கம் மறைமுகமான இடுகை வெளியீட்டு எண் விதியுடன் இணைந்து பயன்படுத்தப்படக்கூடாது. வேறு வார்த்தைகளில் கூறுவதானால், `` 1.0 -`` என்பது * சரியான பதிப்பாக இல்லை, மேலும் இது * `1.0.post0`` க்கு * இயல்பாக்கப்படாது.

source: Development release separators
eo: Disigiloj de evoluada eldono
ja: 開発リリース番号のセパレータ
pt_br: Separadores de versões de desenvolvimento
ru: Сепараторы для выпуска продукции
ta: வளர்ச்சி வெளியீட்டு பிரிப்பான்கள்

source: Development releases allow a ``.``, ``-``, or a ``_`` separator as well as omitting the separator all together. The normal form of this is with the ``.`` separator. This allows versions such as ``1.2-dev2`` or ``1.2dev2`` which normalize to ``1.2.dev2``.
eo: Evoluada eldono permesas la apartigilojn ``.``, ``-``, aŭ ``_``, aŭ eĉ la mankon de apartigilo. La norma formo uzas la apartigilon ``.``. Tio permesas versiojn kiel ``1.2-dev2`` aŭ ``1.2dev2``, kies norma formo estas ``1.2dev2``.
ja: 開発リリースでは、セパレータとして ``.`` ・ ``-`` ・ ``_`` を許容し、また、一切のセパレータを省力することを許容します。これの標準形式は、 ``.`` セパレータを使う形です。これによって、標準化すれば ``1.2.dev2`` になるであろう ``1.2-dev2`` や ``1.2dev2`` のようなバージョン番号を許容します。
ru: В релизах разработки допускается использование разделителя ``.``, ``-`` или ``_``, а также полное отсутствие разделителя. Обычная форма - с разделителем ``.``. Это позволяет использовать такие версии, как ``1.2-dev2`` или ``1.2dev2``, которые нормализуются до ``1.2.dev2``.
ta: வளர்ச்சி வெளியீடுகள் ஒரு `` .``, `` --``, அல்லது ஒரு `` _`` பிரிப்பான் மற்றும் பிரிப்பான் அனைத்தையும் ஒன்றாகத் தவிர்ப்பதை அனுமதிக்கின்றன. இதன் இயல்பான வடிவம் `` .`` பிரிப்பான். இது `` 1.2-DEV2`` அல்லது `1.2dev2`` போன்ற பதிப்புகளை` `1.2.dev2`` க்கு இயல்பாக்குகிறது.

source: Implicit development release number
eo: Implicita evoluada eldona numero
ja: 暗黙裡の開発バージョン番号
pt_br: Número implícito de versão de desenvolvimento
ru: Номер выпуска неявной разработки
ta: மறைமுக வளர்ச்சி வெளியீட்டு எண்

source: Development releases allow omitting the numeral in which case it is implicitly assumed to be ``0``. The normal form for this is to include the ``0`` explicitly. This allows versions such as ``1.2.dev`` which is normalized to ``1.2.dev0``.
eo: Evoluada eldono permesas forlasi la numeron, kio implicas ``0``. La norma formo eksplicas ``0``. Tio permesas versiojn kiel ``1.2.dev``, kies norma formo estas ``1.2.dev0``.
ja: 開発リリースでは、数字部分を省略することができて、その場合には暗黙裡に ``0`` であるものと見做されます。これの標準形式は、明示的に ``0`` を含める形です。これによって、標準化すれば ``1.2.dev0`` となる ``1.2.dev`` のようなバージョン番号を許容します。
ru: В релизах разработки допускается опускать цифру, в этом случае она неявно принимается за ``0``. Нормальной формой для этого является явное указание ``0``. Это позволяет использовать такие версии, как ``1.2.dev``, которые нормализуются до ``1.2.dev0``.
ta: வளர்ச்சி வெளியீடுகள் எண்களைத் தவிர்ப்பதற்கு அனுமதிக்கின்றன, இந்த விசயத்தில் அது `` 0`` என்று மறைமுகமாக கருதப்படுகிறது. இதற்கான சாதாரண வடிவம் `` 0`` வெளிப்படையாக சேர்க்க வேண்டும். `` 1.2.dev0`` க்கு இயல்பாக்கப்பட்ட `` 1.2.dev`` போன்ற பதிப்புகளை இது அனுமதிக்கிறது.

source: Local version segments
eo: Lokaj versiaj segmentoj
ja: ローカルのバージョン番号構成部分
ru: Сегменты локальной версии
ta: உள்ளக பதிப்பு பிரிவுகள்

source: With a local version, in addition to the use of ``.`` as a separator of segments, the use of ``-`` and ``_`` is also acceptable. The normal form is using the ``.`` character. This allows versions such as ``1.0+ubuntu-1`` to be normalized to ``1.0+ubuntu.1``.
eo: Loka versio permesas, krom ``.`` kiel apartigilo de segmentoj, ankaŭ la apartigiloj ``-`` kaj ``_``. La norma formo uzas ``.``. Tio permesas versiojn kiel ``1.0+ubuntu-1``, kies norma formo estas ``1.0+ubuntu.1``.
ja: 構成部分のセパレータとして ``.`` を使うことに加えて、ローカルバージョン番号を使えば ``-`` や ``_`` の使用も受け入れ可能です。標準形式は、 ``.`` 文字を使うことです。これによって、標準化すれば ``1.0+ubuntu.1`` となる ``1.0+ubuntu-1`` のようなバージョン番号も許容されます。
ru: В локальной версии, помимо использования ``.`` в качестве разделителя сегментов, допустимо также использование ``-`` и ``_``. Нормальной формой является использование символа ``.``. Это позволяет нормализовать такие версии, как ``1.0+ubuntu-1``, до ``1.0+ubuntu.1``.
ta: ஒரு உள்ளக பதிப்போடு, பிரிவுகளின் பிரிப்பாளராக `` .`` பயன்படுத்துவதோடு கூடுதலாக, `` -`` மற்றும் `_`` ஆகியவற்றைப் பயன்படுத்துவதும் ஏற்றுக்கொள்ளத்தக்கது. சாதாரண வடிவம் `` .`` எழுத்தைப் பயன்படுத்துகிறது. இது `` 1.0+உபுண்டு -1`` போன்ற பதிப்புகளை `` 1.0+உபுண்டு 1`` க்கு இயல்பாக்க அனுமதிக்கிறது.

source: Preceding v character
eo: Prefiksa signo «v»
ja: 先駆する v の文字
pt_br: Caractere predecessor v
ru: Предшествующий символ v
ta: V எழுத்து முந்தையது

source: In order to support the common version notation of ``v1.0`` versions may be preceded by a single literal ``v`` character. This character MUST be ignored for all purposes and should be omitted from all normalized forms of the version. The same version with and without the ``v`` is considered equivalent.
ja: よくあるバージョン番号の表記方法である ``v1.0`` の形をサポートするために、バージョン番号は単独の ``v`` の文字が先行していても構いません。この文字は、あらゆる目的において無視されなければならず、バージョン番号の標準化された形式では省略されるべきです。 ``v`` の有無だけが異なるバージョン番号は、同一のものと見做されます。
ru: Для поддержки общепринятой нотации версий ``v1.0`` версии могут предваряться одним литеральным символом ``v``. Этот символ ДОЛЖЕН игнорироваться для всех целей и должен быть опущен во всех нормализованных формах версии. Одна и та же версия с ``v`` и без него считается эквивалентной.
ta: `` V1.0`` பதிப்புகளின் பொதுவான பதிப்பு குறியீட்டை ஆதரிப்பதற்காக, ஒரு நேரடி `v`` பாத்திரத்தால் முன்னதாக இருக்கலாம். இந்த பாத்திரம் அனைத்து நோக்கங்களுக்காகவும் புறக்கணிக்கப்பட வேண்டும் மற்றும் பதிப்பின் அனைத்து இயல்பாக்கப்பட்ட வடிவங்களிலிருந்தும் தவிர்க்கப்பட வேண்டும். `` வி`` உடன் மற்றும் இல்லாமல் அதே பதிப்பு சமமானதாகக் கருதப்படுகிறது.

source: Leading and Trailing Whitespace
eo: Komenca kaj Fina Blanka Spaco
ja: 先行する空白文字や後続する空白文字
ru: Ведущие и отслеживающие Белое пространство
ta: வழிநடத்தும் மற்றும் பின்தங்கிய இடைவெளி

source: Leading and trailing whitespace must be silently ignored and removed from all normalized forms of a version. This includes ``" "``, ``\t``, ``\n``, ``\r``, ``\f``, and ``\v``. This allows accidental whitespace to be handled sensibly, such as a version like ``1.0\n`` which normalizes to ``1.0``.
eo: Komenca kaj fina blankaj spacoj devas esti silente ignorata kaj forigita el ĉiuj normigitaj formoj de versio. Tio inkluzivas ``" "``, ``\t``, ``\n``, ``\r``, ``\f``, kaj ``\v``. Tio permesas racian pritraktadon de senintenca blanka spaco, kiel ``1.0\n``, kiu estas normigita al ``1.0``.
ja: 先行する空白文字や後続する空白文字は暗黙の裡に無視されなければならず、バージョン番号の標準化された形式では除去されなければなりません。これには ``""`` ・ ``\t`` ・ ``\n`` ・ ``\r`` ・ ``\f`` ・ ``\v`` が含まれます。これによって、標準化すれば ``1.0`` となる ``1.0\n`` のようなバージョン番号に見られる、偶然に入り込んだ空白文字を実用的に取り扱うことができます。
ru: Ведущие и завершающие пробельные символы должны молча игнорироваться и удаляться из всех нормализованных форм версии. Это включает в себя ``""``, ``\t``, ``\n``, ``\r``, ``\f`` и ``\v``. Это позволяет разумно обрабатывать случайные пробелы, например, версия ``1.0\n`` нормализуется до ``1.0``.
ta: ஒரு பதிப்பின் இயல்பாக்கப்பட்ட அனைத்து வடிவங்களிலிருந்தும் அமைதியாக புறக்கணிக்கப்பட்டு அகற்றப்பட வேண்டும். இதில் `` "" `` `,` `\ t``,` `\ n``,` `\ r``,` \ f``, மற்றும் `\ v`` ஆகியவை அடங்கும். `` 1.0 \ n`` போன்ற பதிப்பு போன்ற தற்செயலான இடைவெளியை விவேகத்துடன் கையாள இது அனுமதிக்கிறது, இது `` 1.0`` ஐ இயல்பாக்குகிறது.

source: Examples of compliant version schemes
eo: Ekzemploj de versiaj skemoj observantaj la regulojn
ja: 枠組みに合致したバージョン番号の例
ru: Примеры совместимых схем версий
ta: இணக்கமான பதிப்பு திட்டங்களின் எடுத்துக்காட்டுகள்

source: The standard version scheme is designed to encompass a wide range of identification practices across public and private Python projects. In practice, a single project attempting to use the full flexibility offered by the scheme would create a situation where human users had difficulty figuring out the relative order of versions, even though the rules above ensure all compliant tools will order them consistently.
ja: 標準のバージョン番号の枠組みは、公開・非公開の Python プロジェクトにおける識別の慣行を広い範囲で包含するように設計されています。実際上、ある単独のプロジェクトでこの枠組みが提供するあらゆる自由度を使おうと試みるなら、上述のルールに従うすべてのツールが首尾一貫して順序をつけることができる一方で、人間のユーザにとってはバージョン番号間の相対的な順序を解き明かすことに困難を感じることになるでしょう。
ru: Стандартная схема версий разработана таким образом, чтобы охватить широкий спектр методов идентификации в государственных и частных проектах Python. На практике один проект, пытающийся использовать всю гибкость, предлагаемую схемой, создаст ситуацию, когда пользователям будет трудно определить относительный порядок версий, хотя приведенные выше правила гарантируют, что все совместимые инструменты будут упорядочивать их последовательно.
ta: நிலையான பதிப்பு திட்டம் பொது மற்றும் தனியார் பைதான் திட்டங்களில் பரந்த அளவிலான அடையாள நடைமுறைகளை உள்ளடக்கியதாக வடிவமைக்கப்பட்டுள்ளது. நடைமுறையில், திட்டத்தால் வழங்கப்படும் முழு நெகிழ்வுத்தன்மையைப் பயன்படுத்த முயற்சிக்கும் ஒரு திட்டம் மனித பயனர்களுக்கு பதிப்புகளின் ஒப்பீட்டு வரிசையைக் கண்டுபிடிப்பதில் சிரமப்பட்ட ஒரு சூழ்நிலையை உருவாக்கும், மேலே உள்ள விதிகள் அனைத்து இணக்கமான கருவிகளும் தொடர்ந்து கட்டளையிடும் என்பதை உறுதிசெய்தாலும்.

source: The following examples illustrate a small selection of the different approaches projects may choose to identify their releases, while still ensuring that the "latest release" and the "latest stable release" can be easily determined, both by human users and automated tools.
ja: この後に、プロジェクトがそのリリースを識別するために選択するかもしれない異なるアプローチで、 "最新リリース" と "最新のステーブルリリース" を人間も自動化ツールも簡単に決定できることが保証されたもののいくつかの例を示します。
ru: Следующие примеры иллюстрируют небольшую подборку различных подходов, которые проекты могут выбрать для идентификации своих релизов, при этом гарантируя, что "последний релиз" и "последний стабильный релиз" могут быть легко определены как людьми, так и автоматизированными инструментами.
ta: பின்வரும் எடுத்துக்காட்டுகள் வெவ்வேறு அணுகுமுறைகளின் ஒரு சிறிய தேர்வு திட்டங்கள் அவற்றின் வெளியீடுகளை அடையாளம் காண தேர்வு செய்யலாம், அதே நேரத்தில் "அண்மைக் கால வெளியீடு" மற்றும் "அண்மைக் கால நிலையான வெளியீடு" ஆகியவற்றை மனித பயனர்கள் மற்றும் தானியங்கி கருவிகளால் எளிதில் தீர்மானிக்க முடியும் என்பதை உறுதிசெய்கிறது.

source: Simple "major.minor" versioning::
eo: Simpla «maĵora.minora» versiado::
ja: 単純な "メジャー.マイナー" バージョン付け::
ru: Простая версификация "major.minor" ::
ta: எளிய "மேசர்.மினோர்" பதிப்பு ::

source: Simple "major.minor.micro" versioning::
eo: Simpla «maĵora.minora.mikroa» versiado::
ja: 単純な "メジャー.マイナー.マイクロ" バージョン付け::
pt_br: Versionamento simples "major.minor.micro" ::
ru: Простая версия "major.minor.micro" ::
ta: எளிய "மேசர்.மினோர்.மிக்ரோ" பதிப்பு ::

source: "major.minor" versioning with alpha, beta and candidate pre-releases::
eo: «maĵora.minora» versiado kun alfa-, beta-, kaj kandidataj antaŭeldonoj::
ja: アルファ・ベータや公開候補 <candidate> のようなプレリリースを伴う "メジャー.マイナー" バージョン付け::
ru: Версии "major.minor" с предварительными выпусками альфа-версий, бета-версий и кандидатов::
ta: ஆல்பா, பீட்டா மற்றும் வேட்பாளர் முன் வெளியீடுகளுடன் "மேசர்.மினோர்" பதிப்பு ::

source: "major.minor" versioning with developmental releases, release candidates and post-releases for minor corrections::
eo: «maĵora.minora» versiado kun evoluaj eldonoj, eldonkandidatoj kaj posteldonoj por malgravaj korektoj::
ja: 開発リリース <developmental releases> 、リリース候補 <release candidates> やポストリリースのある "メジャー.マイナー" バージョン付け::
ru: «major.minor»-версия с релизами, кандидатами на выпуск и пост-релизами для незначительных исправлений ::
ta: மேம்பாட்டு வெளியீடுகளுடன் "மேசர்.மினோர்" பதிப்பு, வேட்பாளர்கள் மற்றும் சிறிய திருத்தங்களுக்கு பிந்தைய வெளியீடுகளை வெளியிடுங்கள் ::

source: Date based releases, using an incrementing serial within each year, skipping zero::
eo: Datobaza eldono, kun alkrementata numero en ĉiu jaro, sen nulo::
ja: ゼロを飛ばして各年の中で増加するシリアル値を使った日付ベースのリリース番号::
ru: Релизы, основанные на дате, с использованием возрастающей серии в пределах каждого года, пропуская нулевой::
ta: தேதி அடிப்படையிலான வெளியீடுகள், ஒவ்வொரு ஆண்டும் அதிகரிக்கும் சீரியலைப் பயன்படுத்தி, பூச்சியத்தைத் தவிர்ப்பது ::

source: Summary of permitted suffixes and relative ordering
eo: Resumo pri permesataj sufiksoj kaj relativa ordo
ja: 許容される接尾辞と相対的な順序付けのまとめ
ru: Краткое описание разрешенных суффиксов и относительного порядка
ta: அனுமதிக்கப்பட்ட பின்னொட்டுகளின் சுருக்கம் மற்றும் உறவினர் வரிசைப்படுத்தல்

source: This section is intended primarily for authors of tools that automatically process distribution metadata, rather than developers of Python distributions deciding on a versioning scheme.
eo: Ĉi tiu paragrafo estas por aŭtoroj de iloj aŭtomate pritraktantaj distribuajn metadatenojn, ne aŭtoroj de Python-distribuoj elektantaj versian skemon.
ja: この節では、バージョニング方法を決めようとしている Python 配布物の開発者向けというよりは、むしろ、一義的には配布物のメタデータを自動的に処理するツールの作者に向けて書かれています。
ru: Этот раздел предназначен в первую очередь для авторов инструментов, автоматически обрабатывающих метаданные дистрибутива, а не для разработчиков дистрибутивов Python, принимающих решение о выборе схемы версионирования.
ta: இந்த பிரிவு முதன்மையாக ஒரு பதிப்பு திட்டத்தை தீர்மானிக்கும் பைதான் விநியோகங்களின் டெவலப்பர்களைக் காட்டிலும், விநியோக மெட்டாடேட்டாவை தானாக செயலாக்கும் கருவிகளின் ஆசிரியர்களுக்காக வடிவமைக்கப்பட்டுள்ளது.

source: The epoch segment of version identifiers MUST be sorted according to the numeric value of the given epoch. If no epoch segment is present, the implicit numeric value is ``0``.
eo: La epoka segmento de versio-identigilo DEVAS esti ordigita laŭ la nombra valoro de la epoko. Se epoka segmento mankas, la implicita nombra valoro estas ``0``.
ja: バージョン識別子のエポック構成部分は、当該エポックの数値としての値に従って整序されなければなりません。エポック構成部分が存在しない場合には、暗黙のうちに ``0`` の値と解釈します。
ru: Сегмент эпохи в идентификаторах версий ДОЛЖЕН быть отсортирован в соответствии с числовым значением данной эпохи. Если сегмент эпохи отсутствует, неявное числовое значение равно ``0``.
ta: பதிப்பு அடையாளங்காட்டிகளின் சகாப்த பிரிவு கொடுக்கப்பட்ட சகாப்தத்தின் எண் மதிப்புக்கு ஏற்ப வரிசைப்படுத்தப்பட வேண்டும். எபோச் பிரிவு எதுவும் இல்லை என்றால், மறைமுகமான எண் மதிப்பு `` 0`` ஆகும்.

source: The release segment of version identifiers MUST be sorted in the same order as Python's tuple sorting when the normalized release segment is parsed as follows::
eo: La eldona segmento de versia identigilo DEVAS esti ordigita same kiel la ordo de opoj en Python, kiam la normigita eldona segmento estas analizita jene::
ja: バージョン識別子のリリース構成部分は、標準化されたリリース構成部分を解釈する時には以下のように Python のタプルソーティングと同じ順序で格納されていなければなりません::
ru: Сегмент выпуска идентификаторов версий ДОЛЖЕН быть отсортирован в том же порядке, что и сортировка кортежей в Python, когда нормализованный сегмент выпуска разбирается следующим образом::
ta: பதிப்பு அடையாளங்காட்டிகளின் வெளியீட்டுப் பிரிவு இயல்பாக்கப்பட்ட வெளியீட்டு பிரிவு பின்வருமாறு பாகுபடுத்தப்படும்போது பைதனின் டூப்பிள் வரிசையாக்கத்தின் அதே வரிசையில் வரிசைப்படுத்தப்பட வேண்டும் ::

source: All release segments involved in the comparison MUST be converted to a consistent length by padding shorter segments with zeros as needed.
eo: Ĉiuj eldono-segmentoj pri la komparo DEVAS esti samlongigitaj, metante nulojn antaŭ pli mallongaj segmentoj laŭbezone.
ja: 比較に関わるすべてのリリース構成部分は、必要に応じて不足する構成部分にゼロを補填することで長さを一致させなければなりません。
ru: Все сегменты релиза, участвующие в сравнении, ДОЛЖНЫ быть приведены к единой длине путем заполнения более коротких сегментов нулями по мере необходимости.
ta: ஒப்பீட்டில் ஈடுபட்டுள்ள அனைத்து வெளியீட்டு பிரிவுகளும் தேவைக்கேற்ப பூச்சியங்களுடன் குறுகிய பிரிவுகளைத் திணிப்பதன் மூலம் நிலையான நீளமாக மாற்றப்பட வேண்டும்.
