Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: In your project config file, enter your license expression under ``license`` (``[project]`` table of :file:`pyproject.toml`), or the equivalent for your packaging tool, and make sure to remove any legacy ``license`` table subkeys or ``License ::`` classifiers.
eo: En via projekta agorda dosiero, tajpu vian licenco-esprimon sub ``license`` (tabelo ``[project]`` en :file:`pyproject.toml`), aŭ la ekvivalentaĵon de via pakilo. Certigu, ke vi forigis ajnan malnovan subŝlosilojn de tabelo ``license`` aŭ klasigilojn ``License ::``.
ja: プロジェクトの設定ファイルで、 (:file:`pyproject.toml` の ``[project]`` テーブルの) ``license`` の下にライセンス表現を入れるか、または、使用しているパッケージングツールの同等物を入れるか、いずれかを行なって、旧来の ``license`` テーブルサブキーや ``License::`` 分類子を削除するのを忘れないでください。
ru: В файле конфигурации проекта введите выражение лицензии в ``license`` (таблица ``[project]`` в :file:`pyproject.toml`), или эквивалентное выражение для вашего инструмента упаковки, и убедитесь, что вы удалили все устаревшие подключи таблицы ``license`` или классификаторы ``License ::``.
ta: உங்கள் திட்ட கட்டமைப்பு கோப்பில், உங்கள் உரிம வெளிப்பாட்டை `` உரிமம்`` (`` [திட்டம்] `` அட்டவணை: கோப்பு: `pyproject.toml`), அல்லது உங்கள் பேக்கேசிங் கருவிக்கு சமமானதாக உள்ளிட்டு, எதையும் அகற்றுவதை உறுதிசெய்க மரபு `` உரிமம்`` அட்டவணை சப் கீச் அல்லது `` உரிமம் :: `` வகைப்படுத்திகள்.

source: Also, make sure you add the full license text of all the licenses as files somewhere in your project repository. List the relative path or glob patterns to each of them under ``license-files`` under ``[project]`` in :file:`pyproject.toml` (if your tool supports it), or else in your tool's configuration file.
ja: また、すべてのライセンスの全文をプロジェクトリポジトリのどこかにファイルの形で追加しておくのを忘れないでください。 (ツールが対応しているなら) :file:`pyproject.toml` 内の ``[project]`` の下の ``license-files`` の下に、それら一つひとつの相対パスか glob パターンを列挙するか、使用しているツールの設定ファイルに列挙して下さい。
ru: Также убедитесь, что вы добавили полный текст всех лицензий в виде файлов куда-то в репозиторий вашего проекта. Укажите относительный путь или glob-шаблоны к каждому из них в ``license-files`` в ``[project]`` в :file:`pyproject.toml` (если ваш инструмент поддерживает это), или в другом конфигурационном файле вашего инструмента.
ta: மேலும், உங்கள் திட்ட களஞ்சியத்தில் எங்காவது கோப்புகளாக அனைத்து உரிமங்களின் முழு உரிம உரையையும் சேர்ப்பதை உறுதிசெய்க. `` [திட்டம்] `` `இல்: கோப்பு:` pyproject.toml` (உங்கள் கருவி அதை ஆதரித்தால்), அல்லது உங்கள் கருவியின் உள்ளமைவில், அல்லது உங்கள் கருவியின் உள்ளமைவில், அவை ஒவ்வொன்றிற்கும் உறவினர் பாதை அல்லது குளோப் வடிவங்களை பட்டியலிடுங்கள் கோப்பு.

source: As an example, if your project was licensed MIT but incorporated a vendored dependency (say, ``packaging``) that was licensed under either Apache 2.0 or the 2-clause BSD, your license expression would be ``MIT AND (Apache-2.0 OR BSD-2-Clause)``. You might have a :file:`LICENSE.txt` in your repo root, and a :file:`LICENSE-APACHE.txt` and :file:`LICENSE-BSD.txt` in the :file:`_vendor/` subdirectory, so to include all of them, you'd specify ``["LICENSE.txt", "_vendor/packaging/LICENSE*"]`` as glob patterns, or ``["LICENSE.txt", "_vendor/LICENSE-APACHE.txt", "_vendor/LICENSE-BSD.txt"]`` as literal file paths.
eo: Ekzemple, se via projekto estus sub la licenco MIT sed inkluzivus dependaĵon (ekzemple ``packaging``) sub aŭ Apache 2.0 aŭ la dukondiĉa BSD, la licenco-esprimo estus ``MIT AND (Apache-2.0 OR BSD-2-Clause)``. Oni havus :file:`LICENSE.txt` en la deponeja radiko, kaj :file:`LICENSE-APACHE.txt` kaj :file:`LICENSE-BSD.txt` en la subdosierujo :file:`_vendor/`. Por inkluzivi ĉiujn, oni specifus aŭ la patroneon ``["LICENSE.txt", "_vendor/packaging/LICENSE*"]`` aŭ la dosierlokojn ``["LICENSE.txt", "_vendor/LICENSE-APACHE.txt", "_vendor/LICENSE-BSD.txt"]``.
ja: 例として、もしプロジェクトが MIT ライセンスを適用していて、しかし、他所から提供された依存関係 (ここでは ``packaging`` としましょう) が Apache 2.0 もしくは ２条項 BSD でライセンスされているなら、ライセンス表現は ``MIT AND (Apache-2.0 OR BSD-2-Clause)`` のようになるでしょう。すべてのライセンス全文をリポジトリに入れておくために、リポジトリのルートディレクトリに :file:`LICENSE.txt` を置き、 :file:`_vendor/` サブディレクトリの下に :file:`LICENSE-APACHE.txt` と :file:`LICENSE-BSD.txt` を置くでしょうし、 glob パターンとして ``["LICENSE.txt", "_vendor/packaging/LICENSE*"]`` のように指定するか、あるいは、リテラルのファイルパスとして ``["LICENSE.txt", "_vendor/LICENSE-APACHE.txt", "_vendor/LICENSE-BSD.txt"]`` のように指定することでしょう。
ru: Например, если ваш проект имеет лицензию MIT, но включает зависимость от поставщика (скажем, ``упаковку''), которая лицензируется либо под Apache 2.0, либо под BSD с двумя оговорками, ваше выражение лицензии будет ``MIT AND (Apache-2.0 OR BSD-2-Clause)``. У вас может быть :file:`LICENSE.txt` в корне репо, а также :file:`LICENSE-APACHE.txt` и :file:`LICENSE-BSD.txt` в подкаталоге :file:`_vendor/`, поэтому, чтобы включить их все, вы укажете ``["LICENSE. txt", "_vendor/packaging/LICENSE*"]`` как glob-шаблоны, или ``["LICENSE.txt", "_vendor/LICENSE-APACHE.txt", "_vendor/LICENSE-BSD.txt"]`` как буквальные пути к файлам.
ta: உதாரணமாக, உங்கள் திட்டம் எம்ஐடி உரிமம் பெற்றதாக இருந்தால், அப்பாச்சி 2.0 அல்லது 2-கைது பி.எச்.டி ஆகியவற்றின் கீழ் உரிமம் பெற்ற விற்பனையான சார்பு (சொல்லுங்கள், `` பேக்கேசிங்``) இணைத்தால், உங்கள் உரிம வெளிப்பாடு `` எம்ஐடி மற்றும் (அப்பாச்சி- 2.0 அல்லது பி.எச்.டி -2-அடைப்பு) ``. உங்கள் ரெப்போ ரூட்டில் `உரிமம். , எனவே அவை அனைத்தையும் சேர்க்க, நீங்கள் `` ["உரிமம். -Apache.txt "," _vendor/உரிமம்-bsd.txt "]` `நேரடி கோப்பு பாதைகளாக.

source: See a fully worked out :ref:`licensing-example-advanced` for an end-to-end application of this to a real-world complex project, with many technical details, and consult a `tutorial <spdxtutorial_>`__ for more help and examples using SPDX identifiers and expressions.
eo: Vidu :ref:`licensing-example-advanced` por plena ekzemplo de tio pri realeca komplika projekto,, kun multaj teĥnikaj detaloj. Vidu `lernilon <spdxtutorial_>`__ por pli da helpo kaj ekzemploj pri SPDX-identigiloj kaj esprimoj.
ja: これを現実世界の複雑なプロジェクト向けに完全に作業を尽くした、エンドトゥーエンドなアプリケーションのための :ref:`licensing-example-advanced` を、多くの技術面での詳細とともに見てほしいのと、さらなる手助けや SPDX の識別子と表現を使った例を `チュートリアル <spdxtutorial_>`__ で当たってみて下さい。
ru: Смотрите полностью проработанный пример :ref:`licensing-example-advanced` для комплексного применения этого метода в реальном сложном проекте, с множеством технических деталей, а также обратитесь к `учебнику <spdxtutorial_>`__ для получения дополнительной помощи и примеров использования идентификаторов и выражений SPDX.
ta: ஒரு முழுமையான வேலை: ref: `உரிமம்-எடுத்துக்காட்டு-மேம்பட்டது` இது ஒரு நிச உலக சிக்கலான திட்டத்திற்கு, பல தொழில்நுட்ப விவரங்களுடன் இதைப் பயன்படுத்துவதற்கு, மேலும் ஒரு `பயிற்சி <spdxtutorial_>` __ __ ஐ அணுகவும் SPDX அடையாளங்காட்டிகள் மற்றும் வெளிப்பாடுகளைப் பயன்படுத்தி உதவி மற்றும் எடுத்துக்காட்டுகள்.

source: Making a PyPI-friendly README
eo: Verki README-dosieron uzeblan por PyPI
ja: PyPI によく合う README を作る
pt_br: Criando um README amigável para PyPI
ru: Создание дружественного к PyPI файла README
ta: ஒரு பைபி நட்பு ரீட்மே தயாரித்தல்

source: README files can help your users understand your project and can be used to set your project's description on PyPI. This guide helps you create a README in a PyPI-friendly format and include your README in your package so it appears on PyPI.
eo: README-dosiero helpas uzantojn kompreni vian projekton kaj provizas priskribon pri via projekto ĉe PyPI. Ĉi tiu gvidilo helpas vin verki README en PyPI-kongrua formo kaj inkluzivi la README en la pakon por montri ĝin ĉe PyPI.
ja: README ファイルは、あなたのパッケージのユーザがプロジェクトを理解するのを助け、プロジェクトの説明をするのに使われています。このガイドでは、PyPI によく合う形で README を作成するのを助け、あなたのパッケージの README が PyPI で表示されるようにします。
pt_br: Os arquivos README podem ajudar seus usuários a entender o seu projeto e podem ser usados para definir a descrição do seu projeto no PyPI. Este guia ajuda a criar um README em um formato amigável ao PyPI e inclui seu README em seu pacote para que apareça no PyPI.
ru: Файлы README могут помочь вашим пользователям понять ваш проект и могут быть использованы для создания описания вашего проекта на PyPI. Это руководство поможет вам создать README в удобном для PyPI формате и включить README в ваш пакет, чтобы он появился на PyPI.
ta: உங்கள் திட்டத்தைப் புரிந்துகொள்ள உங்கள் பயனர்களுக்கு README கோப்புகள் உதவும், மேலும் உங்கள் திட்டத்தின் விளக்கத்தை PYPI இல் அமைக்க பயன்படுத்தலாம். இந்த வழிகாட்டி ஒரு பைபி-நட்பு வடிவத்தில் ஒரு README ஐ உருவாக்க உதவுகிறது மற்றும் உங்கள் தொகுப்பில் உங்கள் README ஐ சேர்க்கவும், எனவே இது PYPI இல் தோன்றும்.

source: Creating a README file
eo: Krei README-dosieron
ja: README ファイルを作成する
pt_br: Criando um arquivo README
ru: Создание файла :file:`README`
ta: README கோப்பை உருவாக்குதல்

source: README files for Python projects are often named ``README``, ``README.txt``, ``README.rst``, or ``README.md``.
eo: La README-dosieroj por Python-projektoj ofte nomiĝas ``README``, ``README.txt``, ``README.rst``, aŭ ``README.md``.
ja: Python プロジェクトにおける READMEファイルは、しばしば ``README`` ・ ``README.txt`` ・ ``README.rst`` ・ ``README.md`` などと命名されます。
pt_br: Arquivos README para projetos Python são frequentemente chamados de ``README``, ``README.txt``, ``README.rst`` ou ``README.md``.
ru: Файлы README для проектов Python часто называются ``README``, ``README.txt``, ``README.rst`` или ``README.md``.
ta: பைதான் திட்டங்களுக்கான README கோப்புகள் பெரும்பாலும் `` ReadMe``, `` readme.txt``, `` ReadMe.rst``, அல்லது `` Readme.md`` என்று பெயரிடப்படுகின்றன.

source: For your README to display properly on PyPI, choose a markup language supported by PyPI. Formats supported by `PyPI's README renderer <https://github.com/pypa/readme_renderer>`_ are:
eo: Por bona montrado de via README, elektu marklingvon subtenatan de PyPI. Jen la dosierformoj subtenataj de `la README-montrilo de PyPI <https://github.com/pypa/readme_renderer>`:
ja: あなたの README を PyPI で正しく表示するためには、PyPI がサポートするマークアップ言語を選択する必要があります。 `PyPI の README レンダラ <https://github.com/pypa/readme_renderer>`_ としてサポートされているのは:
pt_br: Para que seu README seja exibido corretamente no PyPI, escolha uma linguagem de marcação suportada pelo PyPI. Os formatos suportados pelo renderizador de README do `PyPI <https://github.com/pypa/readme_renderer>`_ são:
ru: Чтобы ваш README правильно отображался на PyPI, выберите язык разметки, поддерживаемый PyPI. Форматы, поддерживаемые `PyPI's README renderer <https://github.com/pypa/readme_renderer>`_, следующие:
ta: உங்கள் README PYPI இல் சரியாகக் காண்பிக்க, PYPI ஆல் ஆதரிக்கப்படும் மார்க்அப் மொழியைத் தேர்வுசெய்க. `பைபியின் ரீட்மே ரெண்டரர் <https://github.com/pypa/readme_renderer>` _ ஆகியவற்றால் ஆதரிக்கப்படும் வடிவங்கள்:

source: plain text
eo: ordinara teksto
ja: プレーンテキスト
pt_br: texto simples
ru: простой текст
ta: சாதாரண எழுத்து

source: `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ (without Sphinx extensions)
eo: `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ (sen etendaĵoj Sphinx)
ja: `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ (Sphinx 拡張なし)
pt_br: `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ (sem extensões do Sphinx)
ru: `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ (без расширений Sphinx)
ta: `மறுசீரமைக்கப்பட்ட டெக்ச்ட் <https://docutils.sourceforge.io/rst.html>` _ (ச்பின்க்ச் நீட்டிப்புகள் இல்லாமல்)

source: Markdown (`GitHub Flavored Markdown <https://github.github.com/gfm/>`_ by default, or `CommonMark <https://commonmark.org/>`_)
eo: Markdown (`GitHub-Stila Markdown <https://github.github.com/gfm/>`_ implicite, aŭ `CommonMark <https://commonmark.org/>`_)
ja: マークダウン (デフォルトでは `GitHub Flavored Markdown <https://github.github.com/gfm/>`_ 、あるいは `CommonMark <https://commonmark.org/>`_)
pt_br: Markdown (`GitHub Flavored Markdown <https://github.github.com/gfm/>`_ por padrão ou `CommonMark <https://commonmark.org/>`_)
ru: текст в формате Markdown (`GitHub Flavored Markdown <https://github.github.com/gfm/>`_ по умолчанию или `CommonMark <https://commonmark.org/>`_)
ta: மார்க் பேரூர் (`கிதுப் சுவையான மார்க் பேரூர் <https://github.github.com/gfm/>` _ இயல்பாக, அல்லது `காமன்மார்க் <https://commonmark.org/>` _))

source: It's customary to save your README file in the root of your project, in the same directory as your :file:`setup.py` file.
eo: Estas kutime meti la README-dosieron en la radiko de la projekto, en la sama dosierujo kiel la dosiero :file:`setup.py`.
ja: README ファイルについては、 :file:`setup.py` ファイルと同様にプロジェクトのルートディレクトリに置くのが慣習になっています。
pt_br: É comum salvar seu arquivo README na raiz de seu projeto, no mesmo diretório que seu arquivo :file:`setup.py`.
ru: Обычно файл README сохраняется в корне проекта, в той же директории, что и файл :file:`setup.py`.
ta: உங்கள் திட்டத்தின் மூலத்தில் உங்கள் README கோப்பை சேமிப்பது வழக்கம், உங்கள்: கோப்பு: `setup.py` கோப்பு.

source: Including your README in your package's metadata
eo: Inkluzivi vian README-dosieron en la metadatenojn de via pako
ja: README にパッケージのメタデータを含ませる
pt_br: Incluindo seu README nos metadados do seu pacote
ru: Включение файла README в метаданные вашего пакета
ta: உங்கள் தொகுப்பின் மெட்டாடேட்டாவில் உங்கள் README உட்பட

source: To include your README's contents as your package description, set your project's ``Description`` and ``Description-Content-Type`` metadata, typically in your project's :file:`setup.py` file.
eo: Por inkluzivi la enhavon de README kiel la priskribon de la pako, agordu la metadatenojn ``Description`` kaj ``Description-Content-Type``, ofte en la dosiero :file:`setup.py` de via projekto.
ja: README の内容をパッケージの説明として引用させるには、典型的にはプロジェクトの :file:`setup.py` ファイルに、プロジェクトの ``Description`` と ``Description-Content-Type`` のふたつのメタデータを設定しておきましょう。
pt_br: Para incluir o conteúdo do README como a descrição do pacote, defina os metadados ``Description`` e ``Description-Content-Type`` do seu projeto, normalmente no arquivo :file:`setup.py` do seu projeto.
ru: Чтобы включить содержимое README в описание пакета, установите метаданные проекта ``Description`` и ``Description-Content-Type``, обычно в файле проекта :file:`setup.py``.
ta: உங்கள் தொகுப்பு விளக்கமாக உங்கள் README இன் உள்ளடக்கங்களைச் சேர்க்க, உங்கள் திட்டத்தின் `` விளக்கம்`` மற்றும் `` விளக்கம்-உள்ளடக்க-வகை`` மெட்டாடேட்டாவை அமைக்கவும், பொதுவாக உங்கள் திட்டத்தின்: கோப்பு: `setup.py` கோப்பில்.

source: :ref:`description-optional`
ta: : Ref: `விளக்கம்-விருப்பத்தேர்வு`

source: :ref:`description-content-type-optional`
ta: : குறிப்பு: `விளக்கம்-உள்ளடக்க வகை-விருப்பத்தேர்வு`

source: For example, to set these values in a package's :file:`setup.py` file, use ``setup()``'s ``long_description`` and ``long_description_content_type``.
eo: Ekzemple, por agordi tiujn valorojn en la dosiero :file:`setup.py` de pako, uzu la argumentojn ``long_description`` kaj ``long_description_content_type`` de ``setup()``.
ja: 例えば、これらの値をパッケージの :file:`setup.py` ファイルに設定するためには、 ``setup()`` の ``long_description`` と ``long_description_content_type`` を使ってください。
pt_br: Por exemplo, para definir esses valores em um arquivo :file:`setup.py` do pacote, use ``long_description`` e ``long_description_content_type`` do ``setup()``.
ru: Например, чтобы установить эти значения в файле пакета :file:`setup.py`, используйте ``setup()`` ``long_description`` и ``long_description_content_type``.
ta: எடுத்துக்காட்டாக, இந்த மதிப்புகளை ஒரு தொகுப்பில் அமைக்க: கோப்பு: `setup.py` கோப்பில்,` `setup ()` 's `` long_description`` மற்றும் `` long_description_content_type`` ஐப் பயன்படுத்தவும்.

source: Set the value of ``long_description`` to the contents (not the path) of the README file itself. Set the ``long_description_content_type`` to an accepted ``Content-Type``-style value for your README file's markup, such as ``text/plain``, ``text/x-rst`` (for reStructuredText), or ``text/markdown``.
eo: Agordu la valoron de ``long_description`` al la enhavo (ne la dosierloko) de la dosiero README. Agordu ``long_description_content_type`` al akceptata ``Content-Type``-stila valoro por la marklingvo de via dosiero README, ekzemple ``text/plain``, ``text/x-rst`` (por reStructuredText), aŭ ``text/markdown``.
ja: ``long_desctription`` には README ファイルの内容それ自体 (パスではなく) を設定してください。 ``long_description_content_type`` には、README ファイルのマークアップの型を受け入れ可能な ``Content-Type`` 風の書き方、すなわち ``text/plain`` ・ ``text/x-rst`` (reStructuredText の場合) ・ ``text/markdown`` から選んで設定してください。
pt_br: Defina o valor de ``long_description`` para o conteúdo (não o caminho) do próprio arquivo README. Defina o ``long_description_content_type`` para um valor aceito no estilo ``Content-Type`` para a marcação do seu arquivo README, como ``text/plain``, ``text/t-rst`` (para reStructuredText) ou ``text/markdown``.
ru: Установите значение ``long_description`` в содержимое (не путь) самого файла README. Установите значение ``long_description_content_type`` в принятый стиль ``Content-Type`` для разметки вашего файла README, например ``text/plain``, ``text/x-rst`` (для reStructuredText) или ``text/markdown``.
ta: `` Long_description`` இன் மதிப்பை README கோப்பின் உள்ளடக்கங்களுக்கு (பாதை அல்ல) அமைக்கவும். `` உரை/வெற்று``, `` உரை/x-rst`` (மறுசீரமைப்புக்கு), `` long_description_content_type`` ஐ உங்கள் ரீட்மே கோப்பின் மார்க்அப்பிற்கு ஏற்றுக்கொள்ளப்பட்ட `` உள்ளடக்க-வகை``-ச்டைல் மதிப்புக்கு அமைக்கவும் அல்லது `` உரை/மார்க் டவுன்``.

source: If you're using GitHub-flavored Markdown to write a project's description, ensure you upgrade the following tools:
eo: Se vi uzas GitHub-stilan Markdown por priskribi projekton, certigu, ke vi ĝisdatigis la jenajn ilojn:
ja: プロジェクトの説明を GitHub 方言のマークダウンで書くのであれば、以下のツールを更新しておくことを忘れないでください:
pt_br: Se você estiver usando o Markdown do GitHub para escrever a descrição de um projeto, certifique-se de atualizar as seguintes ferramentas:
ru: Если для написания описания проекта вы используете Markdown со вкусом GitHub, убедитесь, что вы обновили следующие инструменты:
ta: திட்டத்தின் விளக்கத்தை எழுத நீங்கள் கிதுப்-சுவை மார்க் டவுனைப் பயன்படுத்துகிறீர்கள் என்றால், பின்வரும் கருவிகளை மேம்படுத்துவதை உறுதிசெய்க:

source: The minimum required versions of the respective tools are:
eo: Jen la minimumaj postulataj versioj de tiuj iloj:
ja: 各ツールは少なくとも次のバージョンでなければなりません:
pt_br: As versões mínimas exigidas das respectivas ferramentas são:
ru: Минимально необходимыми версиями соответствующих инструментов являются:
ta: அந்தந்த கருவிகளின் குறைந்தபட்ச தேவையான பதிப்புகள்:

source: It's recommended that you use ``twine`` to upload the project's distribution packages:
eo: Ni rekomendas, ke vi uzu ``twine`` por alŝuti la distribuajn pakojn de via projekto:
ja: プロジェクトの配布物パッケージをアップロードする時は ``twine`` を使うことを推奨します。
pt_br: É recomendado que você use ``twine`` para enviar pacotes de distribuição do projeto:
ru: Рекомендуется использовать ``twine`` для загрузки дистрибутивных пакетов проекта:
ta: திட்டத்தின் விநியோக தொகுப்புகளை பதிவேற்ற `` ட்வைன்`` ஐப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது:

source: For example, see this :file:`setup.py` file, which reads the contents of :file:`README.md` as ``long_description`` and identifies the markup as GitHub-flavored Markdown:
eo: Jen ekzempla dosiero :file:`setup.py` leganta :file:`README.md` kiel ``long_description`` kaj identiganta la marklingvon kiel GitHub-stilan Markdown:
ja: 例えば、この :file:`setup.py` ファイルでは、 :file:`README.md` の内容を読み取って ``long_description`` としていて、マークアップ方式は GitHub 方言のマークダウンを指定しています:
pt_br: Por exemplo, veja este arquivo :file:`setup.py`, que lê o conteúdo de :file:`README.md` como ``long_description`` e identifica a marcação como Markdown do GitHub:
ru: Например, смотрите этот файл :file:`setup.py`, который считывает содержимое :file:`README.md` как ``длинное_описание`` и идентифицирует разметку как GitHub-flavored Markdown:
ta: எடுத்துக்காட்டாக, இதைக் காண்க: கோப்பு: `setup.py` கோப்பு, இது உள்ளடக்கங்களைப் படிக்கிறது: கோப்பு:` readme.md` `` long_description`` மற்றும் மார்க்அப்பை கிட்அப்-சுவையான மார்க் பேரூர் என அடையாளம் காட்டுகிறது:

source: Validating reStructuredText markup
eo: Kontroli la validecon de reStructuredText
ja: reStructuredText マークアップを検証する
pt_br: Validando a marcação reStructuredText
ru: Проверка разметки reStructuredText
ta: மறுசீரமைப்பு மார்க்அப்பை சரிபார்க்கிறது

source: If your README is written in reStructuredText, any invalid markup will prevent it from rendering, causing PyPI to instead just show the README's raw source.
eo: Se via README estas en reStructuredText, ajna nevalida marklingvaĵo malhelpos montradon, kaŭzante la montradon de la kruda fonto ĉe PyPI.
ja: README を reStructuredText で書いている場合、無効なマークアップがひとつでもあると描画できないので、PyPI 上では README の生のソースコードを表示するだけになってしまいます。
pt_br: Se o seu README for escrito em reStructuredText, qualquer marcação inválida irá impedi-lo de renderizar, fazendo com que o PyPI mostre apenas o código-fonte não tratado do README.
ru: Если ваш README написан на reStructuredText, то любая некорректная разметка не позволит его отобразить, в результате чего PyPI просто покажет исходный текст README.
ta: உங்கள் README மறுசீரமைப்பு டெக்ச்டில் எழுதப்பட்டிருந்தால், எந்தவொரு தவறான மார்க்அப்பும் அதை வழங்குதல் செய்வதைத் தடுக்கும், இதனால் பைபி அதற்கு பதிலாக README இன் மூல மூலத்தைக் காண்பிக்கும்.

source: Note that Sphinx extensions used in docstrings, such as :doc:`directives <sphinx:usage/restructuredtext/directives>` and :doc:`roles <sphinx:usage/restructuredtext/roles>` (e.g., "``:py:func:`getattr```" or "``:ref:`my-reference-label```"), are not allowed here and will result in error messages like "``Error: Unknown interpreted text role "py:func".``".
eo: Notu, la Sphinx-etendaĵoj uzataj en docstring, kiel :doc:`direktivoj <sphinx:usage/restructuredtext/directives>` kaj :doc:`roloj <sphinx:usage/restructuredtext/roles>` (ekzemple «``:py:func:`getattr```» aŭ «``:ref:`mia-referenca-etikedo```») ne estas permesata ĉi tie kaj kaŭzos erarmesaĝojn kiel «``Error: Unknown interpreted text role "py:func".``».
ja: :doc:`ディレクティブ <sphinx:usage/restructuredtext/directives>` と :doc:`ロール <sphinx:usage/restructuredtext/roles>` (例えば "``:py:func:`getattr```" や "``:ref:`my-reference-label```") のように docstrings 内で使われる Sphinx 拡張はこの場所では使用を許されず、 ``Error: テキストロール "py:func" が見つかりません。<Unknown interpreted text role "py:func".>`` といったエラーメッセージを出すことになります。
pt_br: Observe que as extensões Sphinx usadas em docstrings, como :doc:`diretivas <sphinx:usage/restructuredtext/directives>` e :doc:`funções <sphinx:usage/restructuredtext/roles>` (por exemplo, "``:py:func:`getattr```" ou "``:ref:`my-reference-label```"), não são permitidas aqui e resultarão em mensagens de erro como "``Error: Unknown interpreted text role "py:func".``".
ru: Обратите внимание, что расширения Sphinx, используемые в документах, такие как :doc:`directives <sphinx:usage/restructuredtext/directives>` и :doc:`roles <sphinx:usage/restructuredtext/roles>` (например, "``:py:func:`getattr``" или "``:ref:`my-reference-label``"), здесь недопустимы и приведут к сообщениям об ошибках типа "``Ошибка: Неизвестная интерпретируемая текстовая роль "py:func".``".
ta: டாக்ச்ட்ரிங்சில் பயன்படுத்தப்படும் சூரரிமாச்சிலை நீட்டிப்புகள்: doc: `வழிமுறைகள் <Sphinx: பயன்பாடு/மறுசீரமைப்பு/கட்டளைகள்>` மற்றும்: டாக்: `பாத்திரங்கள் <SPHINX: பயன்பாடு/மறுசீரமைப்பு/பாத்திரங்கள்>` (எ.கா. func: `getattr```" அல்லது "` `: குறிப்பு:` எனது-குறிப்பு-லேபிள்```` "), இங்கே அனுமதிக்கப்படவில்லை, மேலும்" `` பிழை: அறியப்படாத விளக்கமளிக்கப்பட்ட உரை பாத்திரம் "py: func ".``".

source: You can check your README for markup errors before uploading as follows:
eo: Vi povas kontroli vian README pri marklingvaj erarojn antaŭ alŝutado jene:
ja: README ファイルのマークアップに関するエラーをアップロードする前に確認するには、次のようにします:
pt_br: Você pode verificar se há erros de marcação em seu README antes de enviar:
ru: Вы можете проверить свой README на наличие ошибок разметки перед загрузкой следующим образом:
ta: பதிவேற்றுவதற்கு முன் மார்க்அப் பிழைகளுக்கு உங்கள் README ஐ சரிபார்க்கலாம்:
