Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The file name of a sdist was standardised in :pep:`625`. The file name must be in the form ``{name}-{version}.tar.gz``, where ``{name}`` is normalised according to the same rules as for binary distributions (see :ref:`binary-distribution-format`), and ``{version}`` is the canonicalized form of the project version (see :ref:`version-specifiers`).
eo: La dosiernomo de fonta distribu estis normigita en :pep:`625`. La dosiernomo devas esti en la formo ``{nomo}-{versio}.tar.gz``, en kiu ``{nomo}`` estas normigita laŭ la samaj reguloj kiel por duumaj distribuoj (vidu :ref:`binary-distribution-format`), kaj ``{versio}`` estas la kanonigita formo de la projekta versio (vidu :ref:`version-specifiers`).
ja: sdist のファイル名は、 :pep:`625` で標準化されています。ファイル名は ``{name}-{version}.tar.gz`` の形をしていなければならず、この中の ``{name}`` はバイナリ配布物のファイル名に関するルールと同様のルールに従って正規化されていなければならず (:ref:`バイナリ配布物のフォーマット <binray-distribution-format>` を見てください) 、かつ、 ``{version}`` はプロジェクトのバージョンの形に正規化されていなければなりません (:ref:`バージョン指定子 <version-specifires>` を見てください) 。
pt_br: O nome do arquivo de um sdist foi padronizado na :pep:`625`. O nome do arquivo deve estar no formato ``{name}-{version}.tar.gz``, sendo ``{name}`` normalizado de acordo com as mesmas regras das distribuições binárias (veja :ref:`binary-distribution-format`) e ``{version}`` é a forma canonizada da versão do projeto (veja :ref:`version-specifiers`).
ru: Имя файла sdist было стандартизировано в :pep:`625`. Имя файла должно иметь вид ``{имя}-{версия}.tar.gz``, где ``{имя}`` нормализовано по тем же правилам, что и для бинарных дистрибутивов (см. :ref:`binary-distribution-format`), а ``{версия}`` - это канонизированная форма версии проекта (см. :ref:`version-specifiers`).
ta: ஒரு SDIST இன் கோப்பு பெயர் தரப்படுத்தப்பட்டது: PEP: `625`. கோப்பு பெயர் `{name}-{version} .tar.gz`` வடிவத்தில் இருக்க வேண்டும், அங்கு` `{name}` `பைனரி விநியோகங்களுக்கு அதே விதிகளின்படி இயல்பாக்கப்படுகிறது (பார்க்க: Ref:` பைனரி-டிச்ட்ரிபியூசன்-வடிவ), மற்றும் `{பதிப்பு-எச்.

source: The name and version components of the filename MUST match the values stored in the metadata contained in the file.
eo: La noma kaj versia komponantoj de la dosiernomo DEVAS kongrui kun la valoroj en la metadatenoj en la dosiero.
ja: ファイル名の name と version の部分は、ファイル内のメタデータに保存されている値に合致しなければなりません。
pt_br: O nome e os componentes da versão do nome do arquivo DEVEM corresponder aos valores armazenados nos metadados contidos no arquivo.
ru: Компоненты имени и версии в имени файла ДОЛЖНЫ соответствовать значениям, хранящимся в метаданных, содержащихся в файле.
ta: கோப்பு பெயரின் பெயர் மற்றும் பதிப்பு கூறுகள் கோப்பில் உள்ள மெட்டாடேட்டாவில் சேமிக்கப்பட்ட மதிப்புகளுடன் பொருந்த வேண்டும்.

source: Code that produces a source distribution file MUST give the file a name that matches this specification. This includes the ``build_sdist`` hook of a :term:`build backend <Build Backend>`.
eo: Kodo generanta fonto-distribuan dosieron DEVAS nomi la dosieron laŭ ĉi tiu specifo. Tio inkluzivas la hokon ``build_sdist`` de :term:`konstrua malfasado <Build Backend>`.
ja: ソースコード配布物のファイルを生成するコードは、この仕様に適合する名前をファイルに与えなければなりません。これは、 :term:`ビルドバックエンド <Build Backend>` の ``build_sdist`` フックにも当てはまります。
ru: Код, создающий дистрибутивный файл с исходным кодом, ДОЛЖЕН дать файлу имя, соответствующее этой спецификации. Это включает в себя крючок ``build_sdist`` в :term:`build backend <Build Backend>`.
ta: மூல விநியோக கோப்பை உருவாக்கும் குறியீடு கோப்பிற்கு இந்த விவரக்குறிப்புடன் பொருந்தக்கூடிய பெயரைக் கொடுக்க வேண்டும். இதில் `` Build_Sdist`` கொக்கி ஒரு: கால: `பின்தளத்தில் உருவாக்கு <பின்தளத்தில் உருவாக்கு>`.

source: Code that processes source distribution files MAY recognise source distribution files by the ``.tar.gz`` suffix and the presence of precisely *one* hyphen in the filename. Code that does this may then use the distribution name and version from the filename without further verification.
ja: ソースコード配布物を生成するソースコードは、 ``.tar.gz`` 拡張子がついていてファイル名の中に正確に *ひとつ* のハイフンが存在していることを以て、ソースコード配布物のファイルであると認識しても構いません。これを行うソースコードは、この場合には、ファイル名から得た配布物の名前とバージョンをそれ以上の検証をせずに使用しても構いません。
pt_br: Código que processa arquivos de distribuição fonte PODE reconhecer arquivos de distribuição fonte pelo sufixo ``.tar.gz`` e a presença de precisamente *um* hífen no nome do arquivo. O código que faz isso pode usar o nome e versão da distribuição a partir do nome do arquivo sem verificação adicional.
ru: Код, обрабатывающий файлы исходных дистрибутивов, МОЖЕТ распознать файлы исходных дистрибутивов по суффиксу ``.tar.gz`` и наличию *одного* дефиса в имени файла. Код, который это делает, может использовать имя дистрибутива и версию из имени файла без дополнительной проверки.
ta: மூல விநியோக கோப்புகளை செயலாக்கும் குறியீடு மூல விநியோக கோப்புகளை `` .tar.gz`` பின்னொட்டு மற்றும் கோப்பு பெயரில் துல்லியமாக * ஒன்று * ஐபன் மூலம் அங்கீகரிக்கலாம். இதைச் செய்யும் குறியீடு பின்னர் சரிபார்ப்பு இல்லாமல் கோப்பு பெயரில் இருந்து விநியோக பெயர் மற்றும் பதிப்பைப் பயன்படுத்தலாம்.

source: Source distribution file format
eo: Dosierformo de fonta distribuo
ja: ソースコード配布物のファイルフォーマット
pt_br: Formato de arquivo de distribuição fonte
ru: Формат файла исходного дистрибутива
ta: மூல விநியோக கோப்பு வடிவம்

source: A ``.tar.gz`` source distribution (sdist) contains a single top-level directory called ``{name}-{version}`` (e.g. ``foo-1.0``), containing the source files of the package. The name and version MUST match the metadata stored in the file. This directory must also contain a :file:`pyproject.toml` in the format defined in :ref:`pyproject-toml-spec`, and a :file:`PKG-INFO` file containing metadata in the format described in the :ref:`core-metadata` specification. The metadata MUST conform to at least version 2.2 of the metadata specification.
eo: Fonta distribuo ``.tar.gz`` (sdist) enhavas unu supranivelan dosierujon nomitan ``{nomo}-{versio}`` (ekz. ``foo-1.0``), enhavantan la fontajn dosierojn de la pako. La nomo kaj versio DEVAS kongrui kun la metadatenoj en la dosiero. Tiu dosiero devas ankaŭ enhavi :file:`pyproject.toml` observanta la formon difinitan en :ref:`pyproject-toml-spec`, kaj dosieron :file:`PKG-INFO` enhavantan metadatenojn laŭ la formo difinita en la normo :ref:`core-metadata`. La metadatenoj DEVAS konformi al almenaŭ versio 2.2 de la normo pri metadatenoj.
ru: Дистрибутив с исходным кодом ``.tar.gz`` (sdist) содержит один каталог верхнего уровня с именем ``{имя}-{версия}`` (например, ``foo-1.0``), содержащий исходные файлы пакета. Имя и версия ДОЛЖНЫ совпадать с метаданными, хранящимися в файле. Этот каталог также должен содержать :file:`pyproject.toml` в формате, определенном в :ref:`pyproject-toml-spec`, и :file:`PKG-INFO` файл, содержащий метаданные в формате, описанном в спецификации :ref:`core-metadata`. Метаданные ДОЛЖНЫ соответствовать, по крайней мере, версии 2.2 спецификации метаданных.
ta: ஒரு `` .tar.gz`` மூல வழங்கல் (SDIST) `` {name}-{version} `` (எ.கா. `` foo-1.0``) என்ற ஒற்றை உயர்மட்ட கோப்பகத்தைக் கொண்டுள்ளது. பெயர் மற்றும் பதிப்பு கோப்பில் சேமிக்கப்பட்ட மெட்டாடேட்டாவுடன் பொருந்த வேண்டும். இந்த கோப்பகத்தில் ஒரு: கோப்பு: `pyproject.toml` இல் வரையறுக்கப்பட்ட வடிவத்தில் இருக்க வேண்டும்: குறிப்பு: ref:` pyproject-toml-spec`, மற்றும் a: கோப்பு: `pkg-info` கோப்பு:` கோர்-மெட்டாடாட்டா` குறிப்பு. மேனிலை தரவு விவரக்குறிப்பின் குறைந்தபட்சம் பதிப்பு 2.2 க்கு மேனிலை தரவு இணங்க வேண்டும்.

source: If the metadata version is 2.4 or greater, the source distribution MUST contain any license files specified by the ``License-File`` field in the :file:`PKG-INFO` at their respective paths relative to the root directory of the sdist (containing the :file:`pyproject.toml` and the :file:`PKG-INFO` metadata).
eo: Se la metadatena versio estas almenaŭ 2.4, la fonta distribuo DEVAS enhavi ajnan licencan dosieron specifitan de la kampo ``License-File`` en :file:`PKG-INFO` ĉe la respektivaj lokoj relativaj al la radika dosierujo de la fonta distribuo (enhavanta la dosieron :file:`pyproject.toml` kaj la metadateno-dosieron :file:`PKG-INFO`).
ru: Если версия метаданных 2.4 или выше, исходный дистрибутив ДОЛЖЕН содержать все файлы лицензий, указанные в поле ``License-File`` в :file:`PKG-INFO`` по соответствующим путям относительно корневого каталога sdist (содержащего :file:`pyproject.toml`` и метаданные :file:`PKG-INFO``).
ta: மேனிலை தரவு பதிப்பு 2.4 அல்லது அதற்கு மேற்பட்டதாக இருந்தால், மூல விநியோகத்தில் `` உரிம-கோப்பு` `புலத்தால் குறிப்பிடப்பட்ட எந்த உரிமக் கோப்புகளும் இருக்க வேண்டும்: கோப்பு:` பி.கே.

source: No other content of a sdist is required or defined. Build systems can store whatever information they need in the sdist to build the project.
eo: Neniu alia enhavo de fonta distribuo estas postulata aŭ difinita. Konstrusistemo povas enmeti iajn ajn informojn bezonatajn en la fontan distribuon por konstrui la projekton.
ja: sdist の他の内容については必須でもなく定義もされていません。ビルドシステムは、プロジェクトをビルドするのに必要なものであればどんな情報でも sdist 内に保存しておくことができます。
pt_br: Nenhum outro conteúdo de um sdist é necessário ou definido. Os sistemas de construção podem armazenar qualquer informação necessária no sdist para construir o projeto.
ru: Никакое другое содержимое sdist не требуется и не определено. Системы сборки могут хранить в sdist любую информацию, необходимую им для сборки проекта.
ta: ஒரு SDIST இன் வேறு எந்த உள்ளடக்கமும் தேவையில்லை அல்லது வரையறுக்கப்படவில்லை. திட்டத்தை உருவாக்க SDIST இல் தங்களுக்குத் தேவையான எந்த தகவலையும் உருவாக்க முடியும்.

source: The tarball should use the modern POSIX.1-2001 pax tar format, which specifies UTF-8 based file names. In particular, source distribution files must be readable using the standard library tarfile module with the open flag 'r:gz'.
eo: La tar-arĥivo uzu la modernan pax-formon de POSIX.1-2001, kiu specifas UTF-8-bazajn dosiernomojn. Speciale, dosiero de fonta distribuo devas esti legebla per la norma biblioteka modulo ``tarfile`` kun la malferma flago ``'r:gz'``.
ja: tar ボールでは、ファイル名に UTF-8 を使える近代的な POSIX.1-2001 pax tar フォーマットを使用するべきです。とりわけ、ソースコード配布物のファイル群は、標準ライブラリの tarfile モジュールに open flag 'r:gz' を与えることで読み込めるものでなければなりません。
pt_br: O tarball deve usar o formato tar pax POSIX.1-2001 moderno, que especifica nomes de arquivo baseados em UTF-8. Em particular, os arquivos de distribuição fonte devem ser legíveis usando o módulo tarfile de biblioteca padrão com o sinalizador aberto 'r:gz'.
ru: В Таровом шарике должен использоваться современный формат POSIX.1-2001 pax tar, который определяет имена файлов в формате UTF-8. В частности, файлы исходных дистрибутивов должны быть читаемы с помощью модуля tarfile стандартной библиотеки с флагом open 'r:gz'.
ta: நாடாகாப்பகபந்து நவீன POSIX.1-2001 PAX கரிக்கீல் வடிவமைப்பைப் பயன்படுத்த வேண்டும், இது UTF-8 அடிப்படையிலான கோப்பு பெயர்களைக் குறிப்பிடுகிறது. குறிப்பாக, 'R: GZ' திறந்த கொடியுடன் நிலையான நூலக டார்ஃபைல் தொகுதியைப் பயன்படுத்தி மூல விநியோக கோப்புகள் படிக்கக்கூடியதாக இருக்க வேண்டும்.

source: Source distribution archive features
eo: Trajtoj de fontdistribua arĥivo
ja: ソースコード配布物アーカイブの機能
ru: Возможности архива распространения исходных текстов
ta: மூல விநியோக காப்பக நற்பொருத்தங்கள்

source: Because extracting tar files as-is is dangerous, and the results are platform-specific, archive features of source distributions are limited.
eo: Ĉar naiva malpakado de ``tar``-arĥivo danĝeras, kaj la rezultoj varias laŭ platformo, arĥivaj funkcioj de fontaj distribuoj estas limigitaj.
ja: tar ファイルをそのまま展開することは危険を伴うため、また、展開結果がプラットフォーム依存になるため、ソースコード配布物アーカイブの機能は制限されています。
ru: Поскольку извлекать tar-файлы как таковые опасно, а результаты зависят от платформы, возможности архивирования в исходных дистрибутивах ограничены.
ta: தார் கோப்புகளை பிரித்தெடுப்பது ஆபத்தானது, மற்றும் முடிவுகள் இயங்குதள-குறிப்பிட்டவை என்பதால், மூல விநியோகங்களின் காப்பக நற்பொருத்தங்கள் குறைவாகவே உள்ளன.

source: Unpacking with the data filter
eo: Malpaki kun la datenfiltrilo
ja: データフィルタしながらアンパックする
pt_br: Desempacotando com o filtro de dados
ru: Распаковка с помощью фильтра данных
ta: தரவு வடிப்பானுடன் திறக்க

source: When extracting a source distribution, tools MUST either use :py:func:`tarfile.data_filter` (e.g. :py:meth:`TarFile.extractall(..., filter='data') <tarfile.TarFile.extractall>`), OR follow the *Unpacking without the data filter* section below.
eo: Dum malpakado de fonta distribuo, ilo DEVAS uzi aŭ :py:func:`tarfile.data_filter` (ekz. :py:meth:`TarFile.extractall(..., filter='data') <tarfile.TarFile.extractall>`), AŬ sekvi la paragrafon *Malpaki sen la datenfiltrilo* ĉi-sube.
ja: ソースコード配布物を展開する時には、ツール類は、 :py:func:`tarfile.data_filter` (例えば :py:meth:`TarFile.extractall(..., filter='data') <tarfile.TarFile.extractall>`) か、あるいは、後述する *データフィルタなしでアンパックする<Unpacking without the data filter>* 節に従うか、いずれかを行わなければなりません。
ru: При извлечении исходного дистрибутива инструменты ДОЛЖНЫ либо использовать :py:func:`tarfile.data_filter` (например, :py:meth:`TarFile.extractall(..., filter='data') <tarfile.TarFile.extractall>`), либо следовать разделу *Распаковка без фильтра данных* ниже.
ta: ஒரு மூல விநியோகத்தைப் பிரித்தெடுக்கும் போது, கருவிகள் பயன்படுத்தப்பட வேண்டும்: PY: FUNC: `tarfile.data_filter` (எ.கா.

source: As an exception, on Python interpreters without :py:func:`hasattr(tarfile, 'data_filter') <tarfile.data_filter>` (:pep:`706`), tools that normally use that filter (directly on indirectly) MAY warn the user and ignore this specification. The trade-off between usability (e.g. fully trusting the archive) and security (e.g. refusing to unpack) is left up to the tool in this case.
eo: Escepte, sur Python-interpretilo sen :py:func:`hasattr(tarfile, 'data_filter') <tarfile.data_filter>` (:pep:`706`), ilo ordinare uzanta tiun filtrilon (rekte aŭ malrekte) POVAS averti la uzanton kaj ignori ĉi tiun normon. La ilo pesu uzeblecon (ekz. plene fidi la arĥivon) kaj sekurecon (e.g. rifuzi malpaki).
ja: 例外として、 :py:func:`hasattr(tarfile, 'data_filter') <tarfile.data_filter>` (:pep:`706`) を持たない Python インタープリタ上では、通常ならそのようなフィルタを使うはずのツール類はユーザに対して警告した上でこの仕様を無視しても構いません。利便性 (例えばアーカイブを完全に信頼すること) とセキュリティ (例えばアンパックすることを拒否すること) の間のトレードオフは、この場合にはツールに委ねられています。
ru: В качестве исключения, в интерпретаторах Python без :py:func:`hasattr(tarfile, 'data_filter') <tarfile.data_filter>` (:pep:`706`), инструменты, которые обычно используют этот фильтр (прямо или косвенно), МОГУТ предупредить пользователя и проигнорировать эту спецификацию. Компромисс между удобством использования (например, полное доверие к архиву) и безопасностью (например, отказ от распаковки) в этом случае остается на усмотрение инструмента.
ta: விதிவிலக்காக, பைதான் உரைபெயர்ப்பாளர்களில்: PY: FUNC: `hasattr (tarfile, 'data_filter') <tarfile.data_filter>` (: pep: `706`), பொதுவாக அந்த வடிப்பானைப் பயன்படுத்தும் கருவிகள் (நேரடியாக மறைமுகமாக) பயனரை எச்சரிக்கலாம் மற்றும் இந்த குறிப்பை புறக்கணிக்கலாம். பயன்பாட்டினுக்கு இடையிலான வணிகம் (எ.கா. காப்பகத்தை முழுமையாக நம்புதல்) மற்றும் பாதுகாப்பு (எ.கா. திறக்க மறுப்பது) இந்த விசயத்தில் கருவி வரை விடப்படுகிறது.

source: Unpacking without the data filter
eo: Malpaki sen la datenfiltrilo
ja: データフィルタなしでアンパックする
pt_br: Desempacotando sem o filtro de dados
ru: Распаковка без фильтра данных
ta: தரவு வடிகட்டி இல்லாமல் திறக்க

source: Tools that do not use the ``data`` filter directly (e.g. for backwards compatibility, allowing additional features, or not using Python) MUST follow this section. (At the time of this writing, the ``data`` filter also follows this section, but it may get out of sync in the future.)
eo: Ilo, kiu ne uzas la filtrilon ``data`` rekte (ekz. por retrokongrueco, por permesi pliajn funkciojn, aŭ ne uzanta Python) DEVAS obei ĉi tiun paragrafon. (Je la tempo de verkado, la filtrilo ``data`` ankaŭ obeas ĉi tiun paragrafon, sed tio povas eksvalidiĝi estontece.)
ja: (例えば、後方互換性のためであったり、追加的な機能を許容するためであったり、あるいは Python を使わない場合であったりで) ``データ <data>`` フィルタを直接には使わないツール類は、この節の内容に従わなければなりません。(執筆時点では、 ``データ <data>`` フィルタもこの節の内容に従うものになっていますが、将来にはこの同期が外れるかもしれません。)
ru: Инструменты, которые не используют фильтр ``data`` напрямую (например, для обратной совместимости, предоставления дополнительных возможностей или не использующие Python), ДОЛЖНЫ следовать этому разделу. (На момент написания этой статьи фильтр ``data`` также следует этому разделу, но в будущем они могут рассинхронизироваться)
ta: `` தரவு`` வடிகட்டியை நேரடியாகப் பயன்படுத்தாத கருவிகள் (எ.கா. பின்னோக்கி பொருந்தக்கூடிய தன்மைக்கு, கூடுதல் அம்சங்களை அனுமதிப்பது அல்லது பைத்தானைப் பயன்படுத்தாதது) இந்த பகுதியைப் பின்பற்ற வேண்டும். (இந்த எழுத்தின் போது, `` தரவு`` வடிகட்டியும் இந்த பகுதியைப் பின்பற்றுகிறது, ஆனால் அது எதிர்காலத்தில் ஒத்திசைவிலிருந்து வெளியேறக்கூடும்.)

source: The following files are invalid in an *sdist* archive. Upon encountering such an entry, tools SHOULD notify the user, MUST NOT unpack the entry, and MAY abort with a failure:
eo: La jenaj dosieroj ne validas en *fonta distribua* arĥivo. Trovante tian eron, ilo SCIIGU la uzanton, DEVAS NE malpaki la eron, kaj POVAS malsukcesi:
ja: 以下に述べるファイル群は、 *sdist* アーカイブの中に置くには不適格です。そのようなエントリに遭遇した場合には、ツール類はユーザに通知するべきであり、そのエントリをアンパックしてはならず、そして、エラー (failure) とともに処理を中断しても構いません:
ru: Следующие файлы недействительны в архиве *sdist*. При обнаружении такой записи инструменты ДОЛЖНЫ уведомить пользователя, НЕ ДОЛЖНЫ распаковывать запись и МОГУТ прервать работу с ошибкой:
ta: பின்வரும் கோப்புகள் * SDIST * காப்பகத்தில் செல்லாது. அத்தகைய உள்ளீட்டை எதிர்கொண்டவுடன், கருவிகள் பயனருக்கு அறிவிக்க வேண்டும், உள்ளீட்டைத் திறக்கக்கூடாது, தோல்வியுடன் நிறுத்தப்படலாம்:

source: Files that would be placed outside the destination directory.
eo: Dosieroj, kiuj estus metitaj ekster la cela dosierujo.
ja: 宛先となるディレクトリの外側に置かれるファイル群。
ru: Файлы, которые будут размещены за пределами каталога назначения.
ta: இலக்கு கோப்பகத்திற்கு வெளியே வைக்கப்படும் கோப்புகள்.

source: Links (symbolic or hard) pointing outside the destination directory.
eo: Ligilo (simbola aŭ malmola) al loko ekster la cela dosierujo.
ja: 宛先となるディレクトリの外側を指し示すリンク (シンボリックでもハードでも)。
ru: Ссылки (символические или жесткие), указывающие за пределы целевого каталога.
ta: இலக்கு கோப்பகத்திற்கு வெளியே சுட்டிக்காட்டும் இணைப்புகள் (குறியீட்டு அல்லது கடினமான).

source: Device files (including pipes).
eo: Aparatdosieroj (inkluzive de duktoj).
ja: デバイスファイル (パイプを含む)。
pt_br: Arquivos de dispositivo (incluindo pipes).
ru: Файлы устройств (включая pipes).
ta: சாதன கோப்புகள் (குழாய்கள் உட்பட).

source: The following are also invalid. Tools MAY treat them as above, but are NOT REQUIRED to do so:
eo: La ĉi-subaj estas ankaŭ nevalidaj. Ilo POVAS, sed NE DEVAS, pritrakti ilin same kiel la ĉi-supraĵojn:
ja: 以下に示すものもまた、不適格です。ツール類はこれらを上記のように扱っても構いませんが、そうすることを要求されているわけではありません:
ru: Следующие также недействительны. Инструменты МОГУТ обрабатывать их, как указано выше, но НЕ ОБЯЗАНЫ это делать:
ta: பின்வருவனையும் தவறானது. கருவிகள் மேலே கருதப்படலாம், ஆனால் அவ்வாறு செய்ய தேவையில்லை:

source: Files with a ``..`` component in the filename or link target.
eo: Dosieroj kun la komponanto ``..`` en la dosiernomo aŭ ligila celo.
ja: ファイル名の一部に ``..`` を含むファイルまたはリンクのターゲット。
ru: Файлы с компонентом ``...`` в имени файла или цели ссылки.
ta: கோப்பு பெயர் அல்லது இணைப்பு இலக்கில் `` ..` கூறு கொண்ட கோப்புகள்.

source: Links pointing to a file that is not part of the archive.
eo: Ligiloj al dosiero, kiu ne estas parto de la arĥivo.
ja: 当該アーカイブの一部ではないファイルを指し示すリンク。
ru: Ссылки, указывающие на файл, который не является частью архива.
ta: காப்பகத்தின் பகுதியாக இல்லாத ஒரு கோப்பை சுட்டிக்காட்டும் இணைப்புகள்.

source: Tools MAY unpack links (symbolic or hard) as regular files, using content from the archive.
eo: Ilo POVAS malpaki ligilon (simbolan aŭ malmolan) kiel ordinaran dosieron uzante enhavon de la arĥivo.
ja: ツール類は、アーカイブから得た内容を使って、リンク類 (シンボリックまたはハード) をアンパックしても構いません。
ru: Инструменты MAY распаковывают ссылки (символические или жесткие) как обычные файлы, используя содержимое архива.
ta: காப்பகத்திலிருந்து உள்ளடக்கத்தைப் பயன்படுத்தி, கருவிகள் வழக்கமான கோப்புகளாக இணைப்புகளை (குறியீட்டு அல்லது கடினமாக்கலாம்) திறக்கலாம்.

source: When extracting *sdist* archives:
eo: Dum maldensigo de *fontdistribuaj* arĥivoj:
ja: *sdist* アーカイブを展開する時:
ru: При извлечении архивов *sdist*:
ta: * Sdist * காப்பகங்களை பிரித்தெடுக்கும் போது:

source: Leading slashes in file names MUST be dropped. (This is nowadays standard behaviour for ``tar`` unpacking.)
eo: Komencaj suprenstrekoj en dosiernomo DEVAS esti senigitaj. (Tio estas nuntempe norma konduto pri malpakado de ``tar``.)
ja: ファイル名の先頭のスラッシュは、必ず削除しなければなりません。 (これは、 ``tar`` を展開する時の今日的な標準的な振る舞いです。)
ru: Ведущие косые черты в именах файлов ДОЛЖНЫ быть опущены. (В настоящее время это стандартное поведение для распаковки ``tar``)
ta: கோப்பு பெயர்களில் முன்னணி ச்லாச்கள் கைவிடப்பட வேண்டும். (இது இப்போதெல்லாம் `` tar`` திறக்கப்படுவதற்கான நிலையான நடத்தை.)

source: For each ``mode`` (Unix permission) bit, tools MUST either:
eo: Por ĉiu bito ``mode`` (de Unika permeso), ilo DEVAS:
ja: ``モード <mode>`` (UNIXでのパーミッション) の各ビットについて、ツール類は以下のうちのいずれかをしなければなりません:
ru: Для каждого бита ``мода`` (разрешения Unix) инструменты ДОЛЖНЫ либо:
ta: ஒவ்வொரு `` பயன்முறை`` (யூனிக்ச் அனுமதி) பிட்டிற்கும், கருவிகளும் இருக்க வேண்டும்:

source: use the platform's default for a new file/directory (respectively),
eo: aŭ uzi la aprioran valoron de la platformo por nova dosiero aŭ dosierujo (respektive),
ja: プラットフォームの既定値を新しく作るファイル/ディレクトリに (それぞれ) 適用するか、
ru: использовать значение платформы по умолчанию для нового файла/каталога (соответственно),
ta: புதிய கோப்பு/கோப்பகத்திற்கு (முறையே) தளத்தின் இயல்புநிலையைப் பயன்படுத்தவும்,

source: set the bit according to the archive, or
eo: aŭ agordi la biton laŭ la arĥivo,
ja: アーカイブにおける (パーミッション) ビットに従って設定するか、または、
ru: установить бит в соответствии с архивом, или
ta: காப்பகத்தின் படி பிட் அமைக்கவும், அல்லது

source: use the bit from ``rw-r--r--`` (``0o644``) for non-executable files or ``rwxr-xr-x`` (``0o755``) for executable files and directories.
eo: aŭ uzi la biton el ``rw-r--r--`` (``0o644``) por nerulebla dosiero aŭ ``rwxr-xr-x`` (``0o755``) por rulebla dosiero aŭ dosierujo.
ja: 非実行ファイルには ``rw-r--r--`` (``0o644``) の (パーミッション) ビットを設定し、実行ファイルとディレクトリには ``rwxr-xr-x`` (``0o755``) を設定する。
ru: используйте бит из ``rw-r--r--`` (``0o644``) для неисполняемых файлов или ``rwxr-xr-x`` (``0o755``) для исполняемых файлов и каталогов.
ta: செயல்படுத்தப்படாத கோப்புகளுக்கு `` rw-r-r --`` (`` 0o644``) அல்லது இயங்கக்கூடிய கோப்புகள் மற்றும் கோப்பகங்களுக்கு `` rwxr-Xr-X`` (`0o755``) ஆகியவற்றிலிருந்து பிட்டைப் பயன்படுத்தவும்.

source: High ``mode`` bits (setuid, setgid, sticky) MUST be cleared.
eo: La altaj bitoj ``mode`` (setuid, setgid, sticky) DEVAS esti malŝaltitaj.
ja: 特殊な ``モード <mode>`` ビット (setups, setgid, sticky) については、削除 (クリア) しなければなりません。
ru: Старшие биты ``режима'' (setuid, setgid, sticky) ДОЛЖНЫ быть очищены.
ta: உயர் `` பயன்முறை` `பிட்கள் (Setuid, setgid, ஒட்டும்) அழிக்கப்பட வேண்டும்.

source: It is RECOMMENDED to preserve the user *executable* bit.
eo: Oni REKOMENDAS konservi la biton pri rulebleco far la uzanto.
ja: ユーザ (多分オーナのこと) *実行* ビットについては、そのまま保存することが推奨されています。
ru: РЕКОМЕНДУЕТСЯ сохранять пользовательский *исполняемый* бит.
ta: பயனரை * இயங்கக்கூடிய * பிட் பாதுகாக்க பரிந்துரைக்கப்படுகிறது.

source: Further hints
eo: Pluaj konsiloj
ja: さらなるヒント
pt_br: Dicas adicionais
ru: Дополнительные подсказки
ta: மேலும் குறிப்புகள்

source: Tool authors are encouraged to consider how *hints for further verification* in ``tarfile`` documentation apply to their tool.
eo: NI instigas aŭtorojn de iloj pripensi kiel la *hints for further verification* en la dokumentaro de ``tarfile`` rilatas al la iloj.
ja: ツールの作成者は、自分たちのツールに適用する ``tarfile`` 説明文書の中に、*さらなる検証を行うためのヒント集* を含めることを検討するように推奨されています。
ru: Авторам инструментов рекомендуется рассмотреть, насколько *подсказки для дальнейшей проверки* в документации к ``tarfile`` применимы к их инструменту.
ta: `` டார்ஃபைல்`` ஆவணத்தில் மேலும் சரிபார்ப்புக்கான * குறிப்புகள் அவற்றின் கருவிக்கு எவ்வாறு பொருந்தும் என்பதைக் கருத்தில் கொள்ள கருவி ஆசிரியர்கள் ஊக்குவிக்கப்படுகிறார்கள்.
