Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: If your project contains any single-file Python modules that aren't part of a package, set ``py_modules`` to a list of the names of the modules (minus the ``.py`` extension) in order to make :ref:`setuptools` aware of them.
eo: Se via projekto enhavas ajnan unu-dosieran Python-modulon ne en pako, agordu ``py_modules`` al listo de la nomoj de tiaj moduloj (sen la dosiersufikso ``.py``) por sciigi :ref:`setuptools`.
ja: あなたのプロジェクトに、プロジェクトの一部ではない単一ファイルのPythonモジュールがあるなら、 :ref:`setuptools` に知らせるために、そのようなモジュールの(拡張子``.py``を削除した)名前を ``py_modules`` に列挙してください。
pt_br: Se o seu projeto contém qualquer módulo Python de arquivo único que não faz parte de um pacote, defina ``py_modules`` para uma lista dos nomes dos módulos (menos a extensão ``.py``) para fazer o :ref:`setuptools` ficar ciente deles.
ru: Если ваш проект содержит однофайловые модули Python, которые не являются частью пакета, установите ``py_modules`` в список имен модулей (за вычетом расширения ``.py``), чтобы :ref:`setuptools`` узнал о них.
ta: உங்கள் திட்டத்தில் ஏதேனும் ஒற்றை கோப்பு பைதான் தொகுதிகள் இருந்தால், ஒரு தொகுப்பின் பகுதியாக இல்லாத ஏதேனும் ஒரு பைதான் தொகுதிகள் இருந்தால், `` py_modules`` ஐ தொகுதிகளின் பெயர்களின் பட்டியலுக்கு அமைக்கவும் (`` .py`` நீட்டிப்பு) செய்ய: குறிப்பு: `செட்ப்டூல்ச்` அவர்களைப் பற்றி அறிந்திருக்கிறார்.

source: "install_requires" should be used to specify what dependencies a project minimally needs to run. When the project is installed by :ref:`pip`, this is the specification that is used to install its dependencies.
eo: Oni uzu ``install_requires`` por specifi la minimumajn dependecojn de projekto por rulado. Kiam :ref:`pip` instalas projekton, ĝi uzas tion por instali dependaĵojn.
ja: ``install_requires`` は、プロジェクトが動作するために最低限必要な依存関係を指定するのに使われます。プロジェクトが :ref:`pip` でインストールされる場合には、この指定を見て依存関係(訳註、にある他パッケージ)をインストールするために用いられます。
pt_br: "install_requires" deve ser usado para especificar quais dependências um projeto precisa minimamente para ser executado. Quando o projeto é instalado pelo :ref:`pip`, esta é a especificação que é usada para instalar suas dependências.
ru: "install_requires" следует использовать, чтобы указать, какие зависимости минимально необходимы проекту для запуска. Когда проект устанавливается с помощью :ref:`pip`, именно эта спецификация используется для установки его зависимостей.
ta: ஒரு திட்டம் குறைந்தபட்சமாக இயங்க வேண்டிய சார்புகளைக் குறிப்பிட "Install_requires" பயன்படுத்தப்பட வேண்டும். திட்டத்தை நிறுவும் போது: ref: `பிப்`, இது அதன் சார்புகளை நிறுவ பயன்படும் விவரக்குறிப்பு.

source: For more on using "install_requires" see :ref:`install_requires vs Requirements files`.
eo: Por pli pri «install_requires», vidu :ref:`install_requires kontraste al Postulo-dosiero <install_requires vs Requirements files>`.
ja: さらなる ``install_requires`` の使い方については :ref:`install_requires対Requirementsファイル <install_requires vs Requirements files>` を参照してください。
pt_br: Para mais informações sobre como usar "install_requires", veja :ref:`install_requires vs Arquivos de requisitos <install_requires vs Requirements files>`.
ru: Подробнее об использовании "install_requires" смотрите :ref:`install_requires vs Requirements files`.
ta: "Install_requires" ஐப் பயன்படுத்துவது பற்றி மேலும் அறிய: ref: `install_requires vs தேவைகள் கோப்புகள்`.

source: ``package_data``
ta: `` தொகுப்பு_டேட்டா``

source: Often, additional files need to be installed into a :term:`package <Import Package>`. These files are often data that’s closely related to the package’s implementation, or text files containing documentation that might be of interest to programmers using the package. These files are called "package data".
eo: Ofte oni devas instali pliajn dosierojn en :term:`pakon <Import Package>`. Tiaj dosieroj estas ofte datenoj rilataj al la kodo de la pako, aŭ tekstoj enhavantaj dokumentaron por programistoj uzantaj la pakon. Tiaj dosieroj nomiĝas «pakaj datenoj».
ja: 追加のファイルを :term:`パッケージ <Import Package>` にインストールする必要がある、というのはよくあることです。このようなファイルは、しばしば、そのパッケージの実装に深く関係していたり、パッケージを利用するプログラマの利益になるような説明を含んだテキストファイルであったりします。このようなファイルは「パッケージデータ」と呼ばれます。
pt_br: Frequentemente, arquivos adicionais precisam ser instalados em um :term:`pacote <Import Package>`. Esses arquivos geralmente são dados intimamente relacionados à implementação do pacote ou arquivos de texto contendo documentação que pode ser do interesse dos programadores que usam o pacote. Esses arquivos são chamados de "dados do pacote".
ru: Часто в :term:`пакет <Import Package>` необходимо установить дополнительные файлы. Эти файлы часто представляют собой данные, тесно связанные с реализацией пакета, или текстовые файлы, содержащие документацию, которая может быть интересна программистам, использующим пакет. Такие файлы называются "данными пакета".
ta: பெரும்பாலும், கூடுதல் கோப்புகள் ஒரு: கால: `தொகுப்பு <இறக்குமதி தொகுப்பு> இல் நிறுவப்பட வேண்டும். இந்த கோப்புகள் பெரும்பாலும் தொகுப்பின் செயல்படுத்தலுடன் நெருக்கமாக தொடர்புடைய தரவு அல்லது தொகுப்பைப் பயன்படுத்தி புரோகிராமர்களுக்கு ஆர்வமாக இருக்கும் ஆவணங்களைக் கொண்ட உரை கோப்புகள். இந்த கோப்புகள் "தொகுப்பு தரவு" என்று அழைக்கப்படுகின்றன.

source: The value must be a mapping from package name to a list of relative path names that should be copied into the package. The paths are interpreted as relative to the directory containing the package.
eo: La valoro devas esti mapigo de paknomoj al listoj de relativaj dosierlokoj kopiotaj en la pakojn. Dosierloko estas relativa al la dosierujo enhavanta la pakon.
ja: この引数に渡す値は、パッケージ名から、そのパッケージ内にコピーされるべきファイルの相対パス名を列挙したもののマッピングになっていなければなりません。パス名はパッケージを含むディレクトリからの相対パスとして解釈されます。
pt_br: O valor deve ser um mapeamento do nome do pacote para uma lista de nomes de caminhos relativos que devem ser copiados para o pacote. Os caminhos são interpretados como relativos ao diretório que contém o pacote.
ru: Значение должно представлять собой отображение имени пакета на список относительных имен путей, которые должны быть скопированы в пакет. Пути интерпретируются как относительные к директории, содержащей пакет.
ta: மதிப்பு தொகுப்பில் நகலெடுக்கப்பட வேண்டிய ஒப்பீட்டு பாதை பெயர்களின் பட்டியலுக்கு தொகுப்பு பெயரிலிருந்து மேப்பிங் செய்ய வேண்டும். பாதைகள் தொகுப்பைக் கொண்ட கோப்பகத்துடன் தொடர்புடையதாக விளக்கப்படுகின்றன.

source: For more information, see :std:doc:`Including Data Files <setuptools:userguide/datafiles>` from the :std:doc:`setuptools docs <setuptools:index>`.
eo: Por pliaj informoj, vidu la paragrafon :std:doc:`Inkluzivi Datenajn Dosierojn <setuptools:userguide/datafiles>` en la :std:doc:`dokumentaro de setuptools <setuptools:index>`.
ja: 詳しくは、 :std:doc:`setuptools説明文書 <setuptools:index>` の中の :std:doc:`データファイルを追加するには <1setuptools:userguide/datafiles>` を見てください。
pt_br: Para mais informações, veja :std:doc:`Incluindo arquivos de dados <setuptools:userguide/datafiles>` da :std:doc:`documentação do setuptools <setuptools:index>`.
ru: Дополнительную информацию см. в :std:doc:`Including Data Files <setuptools:userguide/datafiles>` из :std:doc:`setuptools docs <setuptools:index>`.
ta: மேலும் தகவலுக்கு, காண்க: எச்.டி.டி: டிஓசி: `தரவுக் கோப்புகள் <செட்டப்டூல்ச்: யு.எச்.இ.

source: Although configuring :ref:`Package Data` is sufficient for most needs, in some cases you may need to place data files *outside* of your :term:`packages <Import Package>`. The ``data_files`` directive allows you to do that. It is mostly useful if you need to install files which are used by other programs, which may be unaware of Python packages.
ja: :ref:`パッケージデータ <Package Data>` を設定すればほとんどの需要に応えられますが、あなたの :term:`パッケージ <Import Package>` の *外側* にデータファイルを置きたいこともあるでしょう。 ``data_files`` ディレクティブでそれができます。大抵は、Pythonのパッケージを認識しないような他のプログラムから利用するファイルをインストールする必要がある時に、これが役に立つでしょう。
pt_br: Embora configurar :ref:`Dados de pacote <Package Data>` seja suficiente para a maioria das necessidades, em alguns casos você pode precisar colocar arquivos de dados *fora* de seus :term:`pacotes <Import Package>`. A diretiva ``data_files`` permite que você faça isso. É mais útil se você precisar instalar arquivos que são usados por outros programas, que podem não ter conhecimento dos pacotes Python.
ru: Хотя конфигурирования :ref:`Package Data` достаточно для большинства потребностей, в некоторых случаях вам может понадобиться разместить файлы данных *вне* вашего :term:`packages <Import Package>`. Директива ``data_files`` позволяет это сделать. В основном она полезна, если вам нужно установить файлы, используемые другими программами, которые могут не знать о пакетах Python.
ta: உள்ளமைவு: ref: `தொகுப்பு தரவு` பெரும்பாலான தேவைகளுக்கு போதுமானது, சில சந்தர்ப்பங்களில் நீங்கள் தரவுக் கோப்புகளை * வெளியே * வைக்க வேண்டியிருக்கலாம்: உங்கள்: கால:` தொகுப்புகள் <இறக்குமதி தொகுப்பு> `. `` Data_files`` கட்டளை அதைச் செய்ய உங்களை அனுமதிக்கிறது. பிற நிரல்களால் பயன்படுத்தப்படும் கோப்புகளை நீங்கள் நிறுவ வேண்டுமானால் இது பெரும்பாலும் பயனுள்ளதாக இருக்கும், அவை பைதான் தொகுப்புகளைப் பற்றி அறியாமல் இருக்கலாம்.

source: Each ``(directory, files)`` pair in the sequence specifies the installation directory and the files to install there. The ``directory`` must be a relative path (although this may change in the future, see `wheel Issue #92 <https://github.com/pypa/wheel/issues/92>`_), and it is interpreted relative to the installation prefix (Python’s ``sys.prefix`` for a default installation; ``site.USER_BASE`` for a user installation). Each file name in ``files`` is interpreted relative to the :file:`setup.py` script at the top of the project source distribution.
ja: 設定値の中の ``(ディレクトリ, ファイル)`` の組は、それぞれインストール先のディレクトリとそこにインストールされるべきファイル(群)を指定しています。 ``ディレクトリ <directory>`` は相対パスでなければならず (これは将来変更されるかもしれません。 `wheel Issue #92 <https://github.com/pypa/wheel/issues/92>`_ を見てください)、インストール先プレフィクス(デフォルトではPythonの ``sys.prefix``、ないし、ユーザインストールでは ``site.USER_BASE`` )に対する相対パスとして解釈されます。 ``files`` 内のファイル名は、プロジェクトのソースコード配布物の最上位にある :file:`setup.py` スクリプトに対する相対パスとして解釈されます。
pt_br: Cada par ``(directory, files)`` na sequência especifica o diretório de instalação e os arquivos a serem instalados nele. O ``directory`` deve ser um caminho relativo (embora isso possa mudar no futuro, consulte `relatório de problema #92 do wheel <https://github.com/pypa/wheel/issues/92>`_) e é interpretado em relação ao prefixo de instalação (``sys.prefix`` do Python para uma instalação padrão; ``site.USER_BASE`` para uma instalação do usuário). Cada nome de arquivo em ``files`` é interpretado em relação ao script :file:`setup.py` no topo da distribuição do código-fonte do projeto.
ru: Каждая пара ``(директория, файлы)`` в последовательности указывает директорию установки и файлы для установки. Каталог ``directory`` должен быть относительным путем (хотя это может измениться в будущем, см. `wheel Issue #92 <https://github.com/pypa/wheel/issues/92>`_), и он интерпретируется относительно префикса установки (Python'овский ``sys.prefix`` для установки по умолчанию; ``site.USER_BASE`` для установки пользователем). Каждое имя файла в ``files`` интерпретируется относительно скрипта :file:`setup.py`` в верхней части исходного дистрибутива проекта.
ta: ஒவ்வொரு `` (அடைவு, கோப்புகள்) `` வரிசையில் உள்ள இணை நிறுவல் அடைவு மற்றும் அங்கு நிறுவ வேண்டிய கோப்புகளைக் குறிப்பிடுகிறது. `` அடைவு`` ஒரு உறவினர் பாதையாக இருக்க வேண்டும் (இது எதிர்காலத்தில் மாறக்கூடும் என்றாலும், `சக்கர சிக்கல் #92 <https://github.com/pypa/wheel/issues/92> _ _) ஐப் பார்க்கவும் நிறுவல் முன்னொட்டுடன் தொடர்புடையது (இயல்புநிலை நிறுவலுக்காக பைதனின் `` sys.prefix``; `` site.user_base`` ஒரு பயனர் நிறுவலுக்கு). `` கோப்புகள்`` இல் உள்ள ஒவ்வொரு கோப்பின் பெயரும் திட்ட மூல விநியோகத்தின் மேலே: `setup.py` ச்கிரிப்டுடன் தொடர்புடையது.

source: For more information see the distutils section on :ref:`Installing Additional Files <setuptools:distutils-additional-files>`.
eo: Por pliaj informoj, vidu la paragrafon pri distutils en :ref:`Installing Additional Files <setuptools:distutils-additional-files>`.
ja: さらに詳しくは、 :ref:`追加的なファイルをインストールするには <setuptools:distutils-additional-files>` の中のdistutilsの節を見てください。
pt_br: Para obter mais informações, consulte a seção distutils em :ref:`Instalando arquivos adicionais <setuptools:distutils-additional-files>`.
ru: Дополнительную информацию можно найти в разделе distutils на :ref:`Установка дополнительных файлов <setuptools:distutils-additional-files>`.
ta: மேலும் தகவலுக்கு, தொலைதூரப் பகுதியைப் பார்க்கவும்: ref: `கூடுதல் கோப்புகளை நிறுவுதல் <செட்டப்டூல்ச்: டிச்டிடில்ச்-அட்ரிசனல்-ஃபைல்கள்>`.

source: When installing packages as egg, ``data_files`` is not supported. So, if your project uses :ref:`setuptools`, you must use ``pip`` to install it. Alternatively, if you must use ``python setup.py``, then you need to pass the ``--old-and-unmanageable`` option.
eo: Dum instalado de pako kiel egg, ``data_files`` ne estas subtenata. Do, se projekto uzas :ref:`setuptools`, oni devas uzi ``pip`` por instali ĝin. Alternative, se oni devas uzi ``python setup.py``, oni devas uzi la flagon ``--old-and-unmanageable``.
ja: パッケージをeggとしてインストールする時には、 ``data_files`` はサポートされていません。だから、もしあなたのプロジェクトで :ref:`setuptools` を使っているならば ``pip`` でインストールしなければなりません。あるいは、 ``--old-and-unmanageable`` オプション付きの ``python setup.py`` を使わなければなりません。
pt_br: Ao instalar pacotes como ovo, ``data_files`` não é suportado. Então, se seu projeto usa :ref:`setuptools`, você deve usar ``pip`` para instalá-lo. Alternativamente, se você deve usar ``python setup.py``, então você precisa passar a opção ``--old-and-unmanageable``.
ru: При установке пакетов как яиц, ``data_files`` не поддерживается. Поэтому, если ваш проект использует :ref:`setuptools`, то для его установки необходимо использовать ``pip``. В противном случае, если вы должны использовать ``python setup.py``, то вам нужно передать опцию ``-old-and-unmanageable``.
ta: தொகுப்புகளை முட்டையாக நிறுவும் போது, `` data_files`` ஆதரிக்கப்படவில்லை. எனவே, உங்கள் திட்டம் பயன்படுத்தினால்: Ref: `setuptools`, அதை நிறுவ` `பிப்`` ஐப் பயன்படுத்த வேண்டும். மாற்றாக, நீங்கள் `` பைதான் setup.py`` ஐப் பயன்படுத்த வேண்டும் என்றால், நீங்கள் `` --old-and-unmanageable` விருப்பத்தை அனுப்ப வேண்டும்.

source: Although ``setup()`` supports a :ref:`scripts <setuptools:distutils-installing-scripts>` keyword for pointing to pre-made scripts to install, the recommended approach to achieve cross-platform compatibility is to use :ref:`console_scripts` entry points (see below).
eo: Kvankam ``setup()`` subtenas ŝlosilvorton :ref:`scripts <setuptools:distutils-installing-scripts>` por antaŭfarita instalota programeto, la rekomendata metodo por interplatforma kongrueco estas uzi enirpunktojn :ref:`console_scripts` (vidu ĉi-sube).
ja: ``setup()`` はあらかじめ作成されたスクリプトをインストールするために :ref:`scripts <setuptools:distutils-installing-scripts>` キーワードをサポートしていますが、異機種間の互換性を取るためのアプローチとして推奨されるのは :ref:`console_scripts` エントリーポイント(後述)を使うことです。
pt_br: Embora ``setup()`` tenha suporte a uma palavra-chave :ref:`scripts <setuptools:distutils-installing-scripts>` para apontar para scripts pré-fabricados para instalar, o recomendado A abordagem para obter compatibilidade entre plataformas é usar pontos de entrada :ref:`console_scripts` (veja abaixo).
ru: Хотя ``setup()`` поддерживает ключевое слово :ref:`scripts <setuptools:distutils-installing-scripts>` для указания на готовые скрипты для установки, рекомендуемый подход для достижения кроссплатформенной совместимости - использовать точки входа :ref:`console_scripts` (см. ниже).
ta: `` Setup () `` ஆதரிக்கிறது ஒரு: குறிப்பு: `ச்கிரிப்டுகள் <செட்டுப்லூல்கள்: டிச்ட்டில்ச்-இன்ச்டாலிங்-ச்கிரிப்டுகள்>` நிறுவுவதற்கு முன்பே தயாரிக்கப்பட்ட ச்கிரிப்ட்களை சுட்டிக்காட்டுவதற்கான முக்கிய சொல், குறுக்கு-தளம் பொருந்தக்கூடிய தன்மையை அடைய பரிந்துரைக்கப்பட்ட அணுகுமுறை: புதுப்பிப்பு: புதுப்பிப்பு : `Console_scripts` நுழைவு புள்ளிகள் (கீழே காண்க).

source: Choosing a versioning scheme
eo: Elekti versian skemon
ja: バージョン体系を選択する
pt_br: Escolhendo um esquema de versionamento
ru: Выбор схемы управления версиями
ta: பதிப்பு திட்டத்தைத் தேர்ந்தெடுப்பது

source: See :ref:`versioning` for information on common version schemes and how to choose between them.
eo: Vidu :ref:`versiadon <versioning>` por informoj pri oftaj versiaj skemoj kaj kiel elekti inter ili.
ja: よくあるバージョンを指定する枠組みにどんなものがあるかや、その中からひとつの枠組みを選択する方法については、 :ref:`バージョニング <versioning>` を見てください。
pt_br: Veja :ref:`versioning` para informações sobre esquemas de versões comuns e como escolher entre eles.
ru: Информацию о распространенных схемах версий и о том, как выбирать между ними, смотрите в : ссылка:`версионирование`.
ta: காண்க: குறிப்பு: பொதுவான பதிப்பு திட்டங்கள் மற்றும் அவற்றுக்கிடையே எவ்வாறு தேர்வு செய்வது என்பது பற்றிய தகவல்களுக்கு `பதிப்பு.

source: Working in "development mode"
eo: Labori en «programada reĝimo»
ja: 開発モードで作業する
pt_br: Trabalhando em "modo de desenvolvimento"
ru: Работа в «режиме разработки»
ta: "மேம்பாட்டு பயன்முறையில்" பணிபுரிதல்

source: You can install a project in "editable" or "develop" mode while you're working on it. When installed as editable, a project can be edited in-place without reinstallation: changes to Python source files in projects installed as editable will be reflected the next time an interpreter process is started.
eo: Vi povas instali projekton en «modifebla» aŭ «programada» reĝimo, kiam vi verkas ĝin. Se projekto estas modifeble instalita, ĝi estas modifebla enloke sen reinstalado: ŝanĝoj al Python-fontdosieroj en modifeble instalita projekto efektiviĝos, kiam la interpretila procezo relanĉiĝos.
ja: あなたがまだ作業している途中なら、プロジェクトを「編集可能」または「開発」モードでインストールすることができます。編集可能な状態でインストールされると、再インストールしなくてもプロジェクトをその場で編集することができます: 編集可能状態でインストールされたプロジェクトのPythonソースコードに変更を加えると、次にインタープリターのプロセスが開始された時に反映されます。
pt_br: Você pode instalar um projeto em modo "editável" ou "desenvolvedor" enquanto trabalha nele. Quando instalado como editável, um projeto pode ser editado no local sem reinstalação: alterações nos arquivos fonte Python em projetos instalados como editáveis serão refletidas na próxima vez que um processo de interpretador for iniciado.
ru: Вы можете установить проект в режиме "редактируемый" или "разрабатываемый", пока вы работаете над ним. Если проект установлен как редактируемый, его можно редактировать на месте без переустановки: изменения исходных файлов Python в проектах, установленных как редактируемые, будут отражены при следующем запуске процесса интерпретатора.
ta: நீங்கள் பணிபுரியும் போது ஒரு திட்டத்தை "திருத்தக்கூடிய" அல்லது "உருவாக்கு" பயன்முறையில் நிறுவலாம். திருத்தக்கூடியதாக நிறுவப்பட்டால், ஒரு திட்டத்தை மீண்டும் நிறுவாமல் இடத்திலேயே திருத்தலாம்: திருத்தக்கூடியதாக நிறுவப்பட்ட திட்டங்களில் பைதான் மூல கோப்புகளில் மாற்றங்கள் அடுத்த முறை ஒரு மொழிபெயர்ப்பாளர் செயல்முறை தொடங்கப்படும் போது பிரதிபலிக்கும்.

source: To install a Python package in "editable"/"development" mode Change directory to the root of the project directory and run:
eo: Por instali Python-pakan en «modifebla»/«evoluata» reĝimo, iru al la radiko de la projekta dosierujo, kaj rulu la jenon:
ja: Pythonのパッケージを「編集可能」/「開発」モードでインストールするには、そのプロジェクトのルートディレクトリへ移動して、次のコマンドを走らせてください:
pt_br: Para instalar um pacote Python no modo "editável"/"desenvolvedor" mude o diretório para a raiz do diretório do projeto e execute:
ru: Чтобы установить пакет Python в режиме "редактируемый"/"разработка", измените каталог на корень каталога проекта и выполните команду:
ta: ஒரு பைதான் தொகுப்பை "திருத்தக்கூடிய"/"மேம்பாட்டு" பயன்முறையில் திட்ட கோப்பகத்தின் வேருக்கு கோப்பகத்தை மாற்றவும் இயக்கவும்:

source: The pip command-line flag ``-e`` is short for ``--editable``, and ``.`` refers to the current working directory, so together, it means to install the current directory (i.e. your project) in editable mode. This will also install any dependencies declared with ``install_requires`` and any scripts declared with ``console_scripts``. Dependencies will be installed in the usual, non-editable mode.
eo: La komandlinia flago ``-e`` de pip estas mallongigo de ``--editable``, kaj ``.`` signifas la aktualan labordosierujon. Tial kune tio signifas instali la aktualan dosierujon (t.e. via projekto) en modifebla reĝimo. Tio ankaŭ instalos ajnajn dependaĵojn deklaritajn per ``install_requires`` kaj ajnajn programetojn deklaritajn per ``console_scripts``. Dependaĵoj instaliĝos en la ordinara nemodifebla reĝimo.
ja: pip のコマンドラインオプションの ``-e`` は ``--editable`` の省略形で、 ``.`` は現在作業をしているディレクトリのことですので、まとめると「現在のディレクトリ(つまりあなたのプロジェクト)に編集可能モードでインストールせよ」ということになります。また、このコマンドによって ``install_requires`` に宣言された依存先のパッケージや ``console_scripts`` に書かれたスクリプトもインストールされます。
pt_br: O sinalizador de linha de comando do pip ``-e`` é abreviação de ``--editable``, e ``.`` refere-se ao diretório de trabalho atual, então juntos, isso significa instalar o diretório atual (ou seja, seu projeto) em modo editável. Isso também instalará quaisquer dependências declaradas com ``install_requires`` e quaisquer scripts declarados com ``console_scripts``. As dependências serão instaladas no modo usual e não editável.
ru: Флаг командной строки pip ``-e`` - это сокращение от ``-editable``, а ``.`` означает текущий рабочий каталог, так что вместе это означает установку текущего каталога (т.е. вашего проекта) в режиме редактирования. При этом также будут установлены все зависимости, объявленные с помощью ``install_requires``, и все скрипты, объявленные с помощью ``console_scripts``. Зависимости будут установлены в обычном, нередактируемом режиме.
ta: பிஐபி கட்டளை-வரி கொடி `` -e`` ``-பொருத்தமற்ற`` க்கு குறுகியது, மற்றும் `` .` .` .`` இது தற்போதைய பணி கோப்பகத்தைக் குறிக்கிறது, எனவே ஒன்றாக, தற்போதைய கோப்பகத்தை நிறுவுவதாகும் (அதாவது உங்கள் திட்டத்தை ) திருத்தக்கூடிய பயன்முறையில். இது `` Install_requires`` உடன் அறிவிக்கப்பட்ட எந்தவொரு சார்புகளையும் நிறுவும் மற்றும் `` கன்சோல்_ச்கிரிப்ட்ச்`` உடன் அறிவிக்கப்பட்ட எந்த ச்கிரிப்டுகளையும் நிறுவும். சார்புநிலைகள் வழக்கமான, திருத்தப்படாத பயன்முறையில் நிறுவப்படும்.

source: You may want to install some of your dependencies in editable mode as well. For example, supposing your project requires "foo" and "bar", but you want "bar" installed from VCS in editable mode, then you could construct a requirements file like so::
eo: Oni eble volas ankaŭ instali kelkajn dependaĵon en modifebla reĝimo. Ekzemple, se onia projekto postulus «foo» kaj «bar», kaj oni volus instali «bar» el versikontrola sistemo en modifebla reĝimo, oni uzus la jenan postulo-dosieron::
ja: 依存先のプロジェクトも同様に編集可能モードでインストールしたい時があるかもしれません。例えば、あなたのプロジェクトが "foo" と "bar" というパッケージを要求していて、 "bar" についてはVCS (バージョンコントロールシステム) から編集可能モードでインストールしたい場合には、requirements ファイルを次のように構成すれば良いでしょう::
pt_br: Você também pode querer instalar algumas de suas dependências no modo editável. Por exemplo, supondo que seu projeto requer "foo" e "bar", mas você deseja "bar" instalado do VCS no modo editável, então você poderia construir um arquivo de requisitos como::
ru: Возможно, вы захотите установить некоторые из ваших зависимостей в редактируемом режиме. Например, предположим, что ваш проект требует "foo" и "bar", но вы хотите, чтобы "bar" устанавливался из VCS в редактируемом режиме, тогда вы можете создать файл требований следующим образом::
ta: உங்கள் சார்புகளில் சிலவற்றை திருத்தக்கூடிய பயன்முறையிலும் நிறுவ விரும்பலாம். எடுத்துக்காட்டாக, உங்கள் திட்டத்திற்கு "ஃபூ" மற்றும் "பார்" தேவை என்று கருதுகிறது, ஆனால் பகஅ இலிருந்து திருத்தக்கூடிய பயன்முறையில் நிறுவப்பட்ட "பார்" வேண்டும் என்று நீங்கள் விரும்புகிறீர்கள், பின்னர் நீங்கள் ஒரு தேவைகள் கோப்பை உருவாக்கலாம் ::
