Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Primarily, the wheel project offers the ``bdist_wheel`` :ref:`setuptools` extension for creating :term:`wheel distributions <Wheel>`. Additionally, it offers its own command line utility for creating and installing wheels.
eo: Precipe, la projekto wheel provizas la :ref:`setuptools`-etendaĵon ``bdist_wheel`` por krei :term:`wheel-distribuon <Wheel>`. Krome, ĝi provizas komandlinian ilaĵon por krei kaj instali wheel-on.
ja: wheel は、主として :term:`wheel 配布物 <Wheel>` を作成するための :ref:`setuptools` の拡張である ``bidet_wheel`` を提供するプロジェクトです。この他にも、wheel ファイルを作成しインストールするためのコマンドラインユーティリティを提供します。
pt_br: Primeiramente, o projeto wheel oferece a extensão ``bdist_wheel`` do :ref:`setuptools` para criar :term:`distribuições wheel <Wheel>`. Além disso, oferece seu próprio utilitário de linha de comando para criar e instalar wheels.
ru: В первую очередь, проект wheel предлагает расширение ``bdist_wheel`` :ref:`setuptools`` для создания дистрибутивов :term:`wheel <Wheel>`. Кроме того, он предлагает собственную утилиту командной строки для создания и установки колес.
ta: முதன்மையாக, சக்கர திட்டம் `` bdist_wheel``: ref: `setuptools` நீட்டிப்பை உருவாக்குகிறது: கால:` சக்கர வழங்கல் <hewhel> `. கூடுதலாக, இது சக்கரங்களை உருவாக்குவதற்கும் நிறுவுவதற்கும் அதன் சொந்த கட்டளை வரி பயன்பாட்டை வழங்குகிறது.

source: See also `auditwheel <https://github.com/pypa/auditwheel>`__, a tool that package developers use to check and fix Python packages they are making in the binary wheel format. It provides functionality to discover dependencies, check metadata for compliance, and repair the wheel and metadata to properly link and include external shared libraries in a package.
eo: Vidu ankaŭ `auditwheel <https://github.com/pypa/auditwheel>`__, kiu estas ilo por kontroli kaj ripari Python-pakon en la duuma formo wheel. Ĝi povas malkovri dependecojn, kontroli la observecon de metadatenoj, kaj ripari la wheel kaj metadatenojn, ligante kaj inkluzivante eksterajn komunajn bibliotekojn en pakon.
ja: パッケージ開発者がバイナリの wheel フォーマットで開発中の Python パッケージをチェックし問題を解決するためのツールである `auditwheel <https://github.com/pypa/auditwheel>`__ も見てください。このツールは、依存関係を検出し、法令遵守のためのメタデータを確認し、 wheel とメタデータがパッケージないの外部共有ライブラリに正しくリンクしインクルードするように修正する機能を提供します。
pt_br: Veja também `auditwheel <https://github.com/pypa/auditwheel>`__, uma ferramenta que os desenvolvedores de pacotes usam para verificar e corrigir pacotes Python que eles estão fazendo no formato de roda binária. Ele fornece funcionalidade para descobrir dependências, verificar a conformidade dos metadados e corrigir wheel e os metadados para vincular e incluir bibliotecas externas compartilhadas em um pacote.
ru: См. также `auditwheel <https://github.com/pypa/auditwheel>`__, инструмент, который разработчики пакетов используют для проверки и исправления пакетов Python, которые они создают в формате бинарного колеса. Он предоставляет функциональность для обнаружения зависимостей, проверки метаданных на соответствие, а также исправления колеса и метаданных для правильного связывания и включения внешних общих библиотек в пакет.
ta: `Utidwheel <https://github.com/pypa/auditwheel> __, பைனான் சக்கர வடிவத்தில் அவர்கள் உருவாக்கும் பைதான் தொகுப்புகளை சரிபார்த்து சரிசெய்ய உருவாக்குபவர்கள் பயன்படுத்தும் ஒரு கருவி. சார்புகளைக் கண்டறியவும், இணக்கத்திற்கான மெட்டாடேட்டாவை சரிபார்க்கவும், சக்கரத்தையும் மெட்டாடேட்டாவையும் சரிசெய்யவும், வெளிப்புற பகிரப்பட்ட நூலகங்களை ஒரு தொகுப்பில் சேர்க்கவும் இது செயல்பாட்டை வழங்குகிறது.

source: Non-PyPA Projects
eo: Projektoj ekster PyPA
ja: 非 PyPA プロジェクト
pt_br: Projetos não-PyPA
ru: Проекты, не связанные с PyPA
ta: பைபா அல்லாத திட்டங்கள்

source: buildout
ta: உருவாக்க

source: `Docs <http://www.buildout.org/en/latest/>`__ | `Issues <https://bugs.launchpad.net/zc.buildout>`__ | `PyPI <https://pypi.org/project/zc.buildout>`__ | `GitHub <https://github.com/buildout/buildout/>`__
eo: `Dokumentaro <http://www.buildout.org/en/latest/>`__ | `Cimoj <https://bugs.launchpad.net/zc.buildout>`__ | `PyPI <https://pypi.org/project/zc.buildout>`__ | `GitHub <https://github.com/buildout/buildout/>`__
ja: `説明文書 <http://www.buildout.org/en/latest/>`__ | `課題リスト <https://bugs.launchpad.net/zc.buildout>`__ | `PyPI <https://pypi.org/project/zc.buildout>`__ | `GitHub <https://github.com/buildout/buildout/>`__
pt_br: `Documentação <http://www.buildout.org/en/latest/>`__ | `Issues <https://bugs.launchpad.net/zc.buildout>`__ | `PyPI <https://pypi.org/project/zc.buildout>`__ | `GitHub <https://github.com/buildout/buildout/>`__
ru: `Документы <http://www.buildout.org/en/latest/>`__ | `Проблемы <https://bugs.launchpad.net/zc.buildout>`__ | `PyPI <https://pypi.org/project/zc.buildout>`__ | `GitHub <https://github.com/buildout/buildout/>`__
ta: `டாக்ச் <http://www.buildout.org/en/latest/>` __ | `சிக்கல்கள் <https://bugs.launchpad.net/zc.buildout>` __ | `Pypi <https://pypi.org/project/zc.buildout> __ | `Github <https://github.com/buildout/buildout/> ____

source: Buildout is a Python-based build system for creating, assembling and deploying applications from multiple parts, some of which may be non-Python-based. It lets you create a buildout configuration and reproduce the same software later.
eo: Buildout estas Python-baza konstrusistemo por krei, kombini kaj disponigi programon el pluraj partoj, eble ne-Python-bazaj. Verkinte agordon por buildout, oni povas reprodukti la saman programon poste.
ja: Buildout は Python ベースのビルドシステムで、非 Python ベースのものを含む複数の部品から構成されるアプリケーションの生成・組み立て・配置ができます。buildout の設定を作っておけば、後で同じソフトウェアを再生成することができます。
pt_br: Buildout é um sistema de construção baseado em Python para criar, montar e distribuir aplicações de várias partes, algumas das quais podem ser não baseadas em Python. Ele permite que você crie uma configuração de buildout e reproduza o mesmo software posteriormente.
ru: Buildout - это система сборки на основе Python для создания, сборки и развертывания приложений из нескольких частей, некоторые из которых могут быть не на основе Python. Она позволяет создать конфигурацию сборки и воспроизвести то же самое программное обеспечение позже.
ta: பில்ட்அவுட் என்பது பல பகுதிகளிலிருந்து பயன்பாடுகளை உருவாக்குவதற்கும், ஒன்றுகூடுவதற்கும், வரிசைப்படுத்துவதற்கும் ஒரு பைதான் அடிப்படையிலான பில்ட் சிச்டம் ஆகும், அவற்றில் சில பைதான் அல்லாதவை அல்ல. இது ஒரு கட்டமைப்பை உருவாக்கவும் அதே மென்பொருளை பின்னர் மீண்டும் உருவாக்கவும் உங்களை அனுமதிக்கிறது.

source: conda
ta: காண்டா

source: :doc:`Docs <conda:index>`
eo: :doc:`Dokumentaro <conda:index>`
ja: :doc:`説明文書 <conda:index>`
pt_br: :doc:`Documentação <conda:index>`
ru: :doc:`Документы <conda:index>`
ta: : டாக்: `டாக்ச் <காண்டா: குறியீட்டு>`

source: Conda is a package, dependency, and environment management system for any language — Python, R, Ruby, C/C++, Fortran, and more. It is written in Python and widely used in the Python scientific computing community, due to its support for non-Python compiled libraries and extensions. It is used as the basis of the `Anaconda <https://docs.anaconda.com/anaconda/>`__ Python distribution from Anaconda, Inc. It was originally aimed at the scientific community, but can also be used on its own, or with the :doc:`miniconda <conda:miniconda>`, `miniforge <https://github.com/conda-forge/miniforge>`_ or `pixi <https://pixi.sh/>`_ systems. It is available for Windows, Mac and Linux systems.
eo: Conda estas pako-, dependaĵo- kaj medio-administra sistemo por ajna lingvo – Python, R, Ruby, C/C++, Fortrano ktp. Ĝi estas verkita en Python kaj vaste uzata de la scienckomputa komunumo de Python, pro ĝia subteno de ne-Python-aj tradukitaj bibliotekoj kaj etendaĵoj. Ĝi estas uzata kiel la bazo de la Python-distribuo `Anaconda <https://docs.anaconda.com/anaconda/>`__ de Anaconda, Inc. Ĝi origine celis la sciencan komunumon, sed ankaŭ estas uzebla memstare aŭ kun la sistemoj :doc:`miniconda <conda:miniconda>`, `miniforge <https://github.com/conda-forge/miniforge>`_ aŭ `pixi <https://pixi.sh/>`_. Ĝi estas havebla por Windows, Mac kaj Linux.
ru: Conda - это система управления пакетами, зависимостями и окружением для любого языка - Python, R, Ruby, C/C++, Fortran и других. Она написана на языке Python и широко используется в сообществе научных вычислений на Python благодаря поддержке непитоновских компилируемых библиотек и расширений. На нем основан дистрибутив `Anaconda <https://docs.anaconda.com/anaconda/>`__ Python от Anaconda, Inc. Изначально он был ориентирован на научное сообщество, но также может использоваться самостоятельно или вместе с системами :doc:`miniconda <conda:miniconda>`, `miniforge <https://github.com/conda-forge/miniforge>`_ или `pixi <https://pixi.sh/>`_. Он доступен для систем Windows, Mac и Linux.
ta: காண்டா என்பது எந்தவொரு மொழிக்கும் ஒரு தொகுப்பு, சார்பு மற்றும் சுற்றுச்சூழல் மேலாண்மை அமைப்பு - பைதான், ஆர், ரூபி, சி/சி ++, ஃபோர்ட்ரான் மற்றும் பல. இது பைத்தானில் எழுதப்பட்டுள்ளது மற்றும் பைதான் சயின்டிஃபிக் கம்ப்யூட்டிங் சமூகத்தில் பரவலாகப் பயன்படுத்தப்படுகிறது, பைதான் அல்லாத தொகுக்கப்பட்ட நூலகங்கள் மற்றும் நீட்டிப்புகளுக்கு அதன் உதவி காரணமாக. இது `அனகோண்டா <https://docs.anaconda.com/anaconda/>` __ அனகோண்டா, இன்க் நிறுவனத்திடமிருந்து பைதான் வழங்கல் ஆகியவற்றின் அடிப்படையாகப் பயன்படுத்தப்படுகிறது. இது முதலில் விஞ்ஞான சமூகத்தை இலக்காகக் கொண்டது, ஆனால் அதன் சொந்தத்திலும் பயன்படுத்தப்படலாம் , or with the :doc:`miniconda <conda:miniconda>`, `miniforge <https://github.com/conda-forge/miniforge> `_ அல்லது` pixi <https://pixi.sh/> _ அமைப்புகள். இது சாளரங்கள், மேக் மற்றும் லினக்ச் அமைப்புகளுக்கு கிடைக்கிறது.

source: Conda is a completely separate tool from :ref:`pip`, virtualenv and wheel, but provides many of their combined features, such as package management, virtual environment management and deployment of binary extensions and other binary code.
eo: Conda estas komplete aparta de :ref:`pip`, virtualenv kaj wheel, sed provizas multajn el la funkcioj de tiuj, kiel administradon de pakoj, administradon de virtualaj medioj kaj disponigadon de duumaj etendaĵoj kaj alia duuma kodo.
ru: Conda является совершенно отдельным инструментом от :ref:`pip`, virtualenv и wheel, но предоставляет многие из их объединенных возможностей, таких как управление пакетами, управление виртуальным окружением и развертывание бинарных расширений и другого бинарного кода.
ta: காண்டா என்பது முற்றிலும் தனித்தனி கருவியாகும்: ref: `பிப்`, மெய்நிகர் மற்றும் சக்கரம், ஆனால் அவற்றின் ஒருங்கிணைந்த பல அம்சங்களான தொகுப்பு மேலாண்மை, மெய்நிகர் சுற்றுச்சூழல் மேலாண்மை மற்றும் பைனரி நீட்டிப்புகள் மற்றும் பிற பைனரி குறியீட்டைப் பயன்படுத்துதல் போன்ற பல அம்சங்களை வழங்குகிறது.

source: Conda does not install packages from PyPI -- it can only manage packages built specifically for conda, which can be made available on a "conda channel", such as those hosted on `anaconda.org <https://anaconda.org>`__, or a local (e.g. intranet) package server. In addition to the "default" channels managed by `Anaconda, Inc. <https://www.anaconda.com/>`__, there are a wide variety of packages from the community supported `conda-forge project <https://conda-forge.org/>`__
eo: Conda ne instalas pakojn el PyPI – ĝi povas nur administri pakojn specife por conda, disponeblajn ĉe «conda-kanalo», kiel tiujn sur `anaconda.org <https://anaconda.org>`__, aŭ ĉe loka (ekz. intrareta) pakservilo. Krom la «aprioraj» kanaloj administrataj de `Anaconda, Inc. <https://www.anaconda.com/>`__, ekzistas multaj pakoj en la komunume subtenata `projekto conda-forge <https://conda-forge.org/>`__
ru: Conda не устанавливает пакеты из PyPI - она может управлять только пакетами, созданными специально для conda, которые могут быть доступны на «канале conda», например, размещенном на `anaconda.org <https://anaconda.org>`__, или на локальном (например, интранет) сервере пакетов. В дополнение к каналам «по умолчанию», управляемым `Anaconda, Inc. <https://www.anaconda.com/>`__, существует широкий спектр пакетов из поддерживаемого сообществом проекта `conda-forge <https://conda-forge.org/>`__
ta: காண்டா PYPI இலிருந்து தொகுப்புகளை நிறுவாது - இது கான்டாவிற்காக கட்டப்பட்ட தொகுப்புகளை மட்டுமே நிர்வகிக்க முடியும், இது `anaconda.org <https://anaconda.org>` `anaconda.org <https://anaconda.org இல் புரவலன் செய்யப்பட்டவை போன்ற" காண்டா சேனலில் "கிடைக்க முடியும் __, அல்லது ஒரு உள்ளக (எ.கா. இன்ட்ராநெட்) தொகுப்பு சேவையகம். `அனகோண்டா, இன்க். <Https://www.anaconda.com/> __ __, சமூகத்திலிருந்து பலவிதமான தொகுப்புகள் உள்ளன` கான்டா-ஃபார்ச் திட்டம் <https:/ /conda-forge.org/>`__

source: Note that :ref:`pip` can be installed into, and work side-by-side with conda for managing :term:`distributions <Distribution Package>` from PyPI. It is also possible to build conda packages from Python source packages using tools such as `conda skeleton <https://docs.conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`__: a tool to automatically make conda packages from Python packages available on PyPI.
eo: Notu, ke oni povas instali :ref:`pip` en conda, funkciigante ĝin apud conda por administri :term:`distribuojn <Distribution Package>` el PyPI. Oni ankaŭ povas konstrui conda-pakon el Python-fontpako per ilo kiel `conda skeleton <https://docs.conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`__, kiu aŭtomate faras conda-pakon el Python-pako ĉe PyPI.
ru: Обратите внимание, что :ref:`pip` может быть установлен и работать бок о бок с conda для управления :term:`distributions <Distribution Package>` из PyPI. Также можно собирать пакеты conda из исходных пакетов Python с помощью таких инструментов, как `conda skeleton <https://docs.conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgs-skeleton.html>`__: инструмент для автоматического создания пакетов conda из пакетов Python, доступных на PyPI.
ta: குறிப்பு: குறிப்பு: `பிஐபி` இல் நிறுவப்படலாம், மேலும் நிர்வகிப்பதற்காக கான்டாவுடன் பக்கவாட்டாக வேலை செய்ய முடியும்: கால:` வழங்கல் <விநியோக தொகுப்பு> `பைபி. `காண்டா எலும்புக்கூடு <https://docs.conda.io/projects/conda-build/en/latest/user-guide/tutorials/build-pkgss- bolieton.html> `__: பைதான் தொகுப்புகளிலிருந்து காண்டா தொகுப்புகளை தானாகவே உருவாக்க ஒரு கருவி கிடைக்கிறது பைபி.

source: devpi
ta: தேவ்பி

source: `Docs <http://doc.devpi.net/latest/>`__ | :gh:`Issues <devpi/devpi/issues>` | `PyPI <https://pypi.org/project/devpi>`__
eo: `Dokumentaro <http://doc.devpi.net/latest/>`__ | :gh:`Issues <devpi/devpi/issues>` | `PyPI <https://pypi.org/project/devpi>`__
ja: `説明文書 <http://doc.devpi.net/latest/>`__ | :gh:`課題リスト <devpi/devpi/issues>` | `PyPI <https://pypi.org/project/devpi>`__
pt_br: `Documentação <http://doc.devpi.net/latest/>`__ | :gh:`Issues <devpi/devpi/issues>` | `PyPI <https://pypi.org/project/devpi>`__
ru: `Документы <http://doc.devpi.net/latest/>`__ | :gh:`Проблемы <devpi/devpi/issues>` | `PyPI <https://pypi.org/project/devpi>`__
ta: `டாக்ச் <http://doc.devpi.net/latest/>` __ | : GH: `சிக்கல்கள் <devpi/devpi/சிக்கல்கள்>` | `Pypi <https://pypi.org/project/devpi> ____

source: devpi features a powerful PyPI-compatible server and PyPI proxy cache with a complementary command line tool to drive packaging, testing and release activities with Python. devpi also provides a browsable and searchable web interface. devpi supports mirroring PyPI, multiple :term:`package indexes <Package Index>` with inheritance, syncing between these indexes, index replication and fail-over, and package upload.
ja: devpi は、 PyPI 互換の強力なサーバと PyPI プロクシキャッシュの機能を持っていて、 Python を使ったパッケージングやテスティングやリリース活動を推進するための補完的なコマンドラインツールを備えています。devpi は、また、閲覧と検索が可能なwebインタフェイスも備えています。devpi は、 PyPI のミラーを作成する機能、継承関係を持った複数の :term:`パッケージインデックス <Package Index>` を扱う機能、これらのインデックスの間の同期機能、インデックスの複製とフェイルオーバとパッケージのアップロードの機能を提供できます。
ru: devpi - это мощный PyPI-совместимый сервер и прокси-кэш PyPI с дополнительным инструментом командной строки для управления процессами упаковки, тестирования и выпуска на Python. devpi также предоставляет веб-интерфейс с возможностью просмотра и поиска. devpi поддерживает зеркалирование PyPI, несколько индексов пакетов <Пакетный индекс>` с наследованием, синхронизацию между этими индексами, репликацию индекса и восстановление после отказа, а также загрузку пакетов.
ta: பைதானுடன் பேக்கேசிங், சோதனை மற்றும் வெளியீட்டு நடவடிக்கைகளை இயக்க ஒரு நிரப்பு கட்டளை வரி கருவியுடன் டெவிபிஐ ஒரு சக்திவாய்ந்த பைபி-இணக்கமான சேவையகம் மற்றும் பைபி பதிலாள் கேச் ஆகியவற்றைக் கொண்டுள்ளது. DEVPI உலாவக்கூடிய மற்றும் தேடக்கூடிய வலை இடைமுகத்தையும் வழங்குகிறது. DEVPI பிரதிபலிக்கும் PYPI, பல: சொல்: `தொகுப்பு குறியீடுகள் <தொகுப்பு குறியீட்டு>` பரம்பரை, இந்த குறியீடுகளுக்கு இடையில் ஒத்திசைவு, குறியீட்டு பிரதி மற்றும் தோல்வி மற்றும் தொகுப்பு பதிவேற்றம்.

source: dumb-pypi
ta: ஊமை-பைபி

source: dumb-pypi is a simple :term:`package index <Package Index>` static file site generator, which then must be hosted by a static file webserver to become the package index. It supports serving the hash, core-metadata, and yank-status.
eo: dumb-pypi estas simpla :term:`pakindeksa <Package Index>` statikdosiera retejogenerilo, kies generitaj dosieroj devas esti gastigitaj de servilo de statikaj dosieroj por funkcii kiel pakindekso. Ĝi subtenas haketaĵojn, kernajn metadatenojn, kaj fortiritecon.
ja: dumb-pypi は簡潔な :term:`パッケージインデックス <Package Index>` の静的ファイルのサイトを構築するツールで、パッケージインデックスとして機能するためには静的ファイルをサポートするウェブサーバにホストされていなければなりません。ハッシュ、コアとなるメタデータ、そして yank ステータスをサポートしています。
ru: dumb-pypi - это простой : термин:`пакетный индекс <Пакетный индекс>` генератор статических файлов сайта, который затем должен быть размещен на статическом файловом веб-сервере, чтобы стать пакетным индексом. Он поддерживает обслуживание хэша, основных метаданных и yank-статуса.
ta: டம்ப்-பைபி ஒரு எளிய: சொல்: `தொகுப்பு குறியீட்டு <தொகுப்பு குறியீட்டு>` நிலையான கோப்பு தள செனரேட்டர், பின்னர் தொகுப்பு குறியீடாக மாற நிலையான கோப்பு வெப்சர்வர் வழங்க வேண்டும். இது ஆச், கோர்-மெட்டாடேட்டா மற்றும் யாங்க்-ச்டாட்டசுக்கு பணி செய்வதை ஆதரிக்கிறது.

source: enscons
ta: என்கான்ச்

source: :gh:`Source <dholth/enscons>` | :gh:`Issues <dholth/enscons/issues>` | `PyPI <https://pypi.org/project/enscons>`__
eo: :gh:`Fonto <dholth/enscons>` | :gh:`Cimoj <dholth/enscons/issues>` | `PyPI <https://pypi.org/project/enscons>`__
ja: :gh:`ソースコード <dholth/enscons>` | :gh:`課題リスト <dholth/enscons/issues>` | `PyPI <https://pypi.org/project/enscons>`__
pt_br: :gh:`Código-fonte <dholth/enscons>` | :gh:`Issues <dholth/enscons/issues>` | `PyPI <https://pypi.org/project/enscons>`__
ru: :gh:`Source <dholth/enscons>` | :gh:`Проблемы <dholth/enscons/issues>` | `PyPI <https://pypi.org/project/enscons>`__
ta: : சி.எச்: `மூல <தோல்ட்/என்ச்கான்ச்>` | : சி.எச்: `சிக்கல்கள் <தோல்ட்/என்ச்கான்ச்/சிக்கல்கள்>` | `Pypi <https://pypi.org/project/enscons> ____

source: Enscons is a Python packaging tool based on `SCons`_. It builds :ref:`pip`-compatible source distributions and wheels without using distutils or setuptools, including distributions with C extensions. Enscons has a different architecture and philosophy than :ref:`distutils`. Rather than adding build features to a Python packaging system, enscons adds Python packaging to a general purpose build system. Enscons helps you to build sdists that can be automatically built by :ref:`pip`, and wheels that are independent of enscons.
eo: Enscons estas pakilo por Python surbaze de `SCons`_. Ĝi konstruas fontajn distribuojn kaj wheel-ojn kongruajn kun :ref:`pip` sen uzado de distutils aŭ setuptools, eĉ por distribuoj kun C-etendaĵoj. La arĥitekturo kaj filozofio de Enscons diferencas de :ref:`distutils`. Anstataŭ aldoni funkcion por konstruado al Python-pakada sistemo, enscons aldonas Python-specifajn funkciojn al ĝeneralcela konstrusistemo. Enscons helpas konstrui fontan distribuon aŭtomate konstrueblan per :ref:`pip` kaj wheel-on sendependan de enscons.
ja: Enscons は、 `SCons`_ に基礎を置く Python パッケージングツールです。 C 言語拡張を含む配布物であっても distutils や setuptools を使うことなく :ref:`pip` 互換のソースコード配布物や wheel をビルドすることができます。 Enscons の構造と哲学は :ref:`distutils` のものとは異なります。 Python パッケージングシステムにビルド機能を追加するのではなく、 enscons では汎用のビルドシステムに Python パッケージング機能を追加しています。 Enscons は、 :ref:`pip` で自動的にビルドされた sdist や、enscons から独立した wheel をビルドすることを支援します。
pt_br: Enscons é uma ferramenta de empacotamento Python baseada em `SCons`_. Ele cria distribuições de código-fonte compatíveis com :ref:`pip` e wheels sem usar distutils ou setuptools, incluindo distribuições com extensões C. Enscons tem uma arquitetura e filosofia diferente de :ref:`distutils`. Em vez de adicionar recursos de compilação a um sistema de empacotamento Python, enscons adiciona empacotamento Python a um sistema de construção de propósito geral. Enscons ajuda você a construir sdists que podem ser construídos automaticamente por :ref:`pip`, e wheels que são independentes de enscons.
ru: Enscons - это инструмент для упаковки на Python, основанный на `SCons`_. Он собирает :ref:`pip`-совместимые исходные дистрибутивы и колеса без использования distutils или setuptools, включая дистрибутивы с расширениями C. Enscons имеет другую архитектуру и философию, чем :ref:`distutils`. Вместо того, чтобы добавлять функции сборки в систему упаковки Python, enscons добавляет упаковку Python в систему сборки общего назначения. Enscons помогает вам создавать sdists, которые могут быть автоматически собраны :ref:`pip`, и колеса, которые не зависят от enscons.
ta: என்ச்கான்ச் என்பது `ச்கான்ச்`_ ஐ அடிப்படையாகக் கொண்ட பைதான் பேக்கேசிங் கருவியாகும். இது உருவாக்குகிறது: குறிப்பு: சி நீட்டிப்புகளுடன் விநியோகங்கள் உட்பட தொலைதூரங்கள் அல்லது செட்டுப்டூல்களைப் பயன்படுத்தாமல் `பிப்`-இணக்கமான மூல வழங்கல் மற்றும் சக்கரங்கள். என்கான்ச் வேறுபட்ட கட்டிடக்கலை மற்றும் தத்துவத்தைக் கொண்டுள்ளது: ref: `distutils`. பைதான் பேக்கேசிங் அமைப்பில் உருவாக்க அம்சங்களைச் சேர்ப்பதற்குப் பதிலாக, என்கான்ச் ஒரு பொது நோக்கத்தை உருவாக்கும் அமைப்பில் பைதான் பேக்கேசிங் சேர்க்கிறது. தானாகவே கட்டமைக்கக்கூடிய SDIST களை உருவாக்க என்கான்ச் உங்களுக்கு உதவுகிறது: குறிப்பு: `பிப்`, மற்றும் என்ச்கான்களிலிருந்து சுயாதீனமான சக்கரங்கள்.

source: Flask-Pypi-Proxy
ta: பிளாச்க்-பைபி-ப்ராக்சி

source: `Docs <https://flask-pypi-proxy.readthedocs.io>`__ | :gh:`GitHub <tzulberti/Flask-PyPi-Proxy>` | `PyPI <https://pypi.org/project/Flask-Pypi-Proxy/>`__
eo: `Dokumentaro <https://flask-pypi-proxy.readthedocs.io>`__ | :gh:`GitHub <tzulberti/Flask-PyPi-Proxy>` | `PyPI <https://pypi.org/project/Flask-Pypi-Proxy/>`__
ja: `説明文書 <https://flask-pypi-proxy.readthedocs.io>`__ | :gh:`GitHub <tzulberti/Flask-PyPi-Proxy>` | `PyPI <https://pypi.org/project/Flask-Pypi-Proxy/>`__
ru: `документация <https://flask-pypi-proxy.readthedocs.io>`__ | :gh:`GitHub <tzulberti/Flask-PyPi-Proxy>` | `PyPI <https://pypi.org/project/Flask-Pypi-Proxy/>`__
ta: `டாக்ச் <https://flask-pypi-proxy.readthedocs.io> __ | :gh:`GitHub <tzulberti/Flask-PyPi-Proxy>` | `Pypi <https://pypi.org/project/flask-pypi-proxy/> ____ __ __

source: Not maintained, project archived
eo: Ne mastrumata, projekto enarĥivigita
ja: もはや保守されておらず、アーカイブされたプロジェクト
ru: Не поддерживается, проект сдан в архив
ta: பராமரிக்கப்படவில்லை, திட்ட காப்பகப்படுத்தப்பட்டது

source: Flask-Pypi-Proxy is a :term:`package index <Package Index>` as a cached proxy for PyPI.
eo: Flask-Pypi-Proxy estas :term:`pakindekso <Package Index>`, kiu estas kaŝmemora perilo por PyPI.
ja: Flask-PyPI-Proxy は PyPI に対するキャッシュ付きのプロクシという形の :term:`パッケージインデックス <Package Index>` です。
ru: Flask-Pypi-Proxy - это : термин:`индекс пакета <Индекс пакета>` в качестве кэшированного прокси для PyPI.
ta: பிளாச்க்-பைபி-ப்ராக்சி என்பது ஒரு: கால: `தொகுப்பு குறியீட்டு <தொகுப்பு அட்டவணை>` பைபிக்கு ஒரு தற்காலிக சேமிப்பு ப்ராக்சியாக.

source: Hashdist
ta: ஆச்டிச்ட்
