Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: Verifying an attestation object against a distribution file requires verification of each of the following:
eo: Konfirmi atestan objekton pri distribua dosiero postulas konfirmadon de ĉiuj el la jeno:
ru: Проверка объекта аттестации по файлу распространения требует проверки каждого из следующих параметров:
ta: ஒரு விநியோக கோப்புக்கு எதிராக ஒரு சான்றளிப்பு பொருளை சரிபார்க்க பின்வருவனவற்றில் சரிபார்ப்பு தேவைப்படுகிறது:

source: ``version`` is ``1``. The verifier **MUST** reject any other version.
eo: ``version`` estas ``1``. La konfirmilo **DEVAS** malakcepti ajnan alian version.
ru: ``версия`` - ``1``. Верификатор **МОЖЕТ** отклонить любую другую версию.
ta: `` பதிப்பு`` இது `` 1``. சரிபார்ப்பு ** ** வேறு எந்த பதிப்பையும் நிராகரிக்க வேண்டும்.

source: ``verification_material.certificate`` is a valid signing certificate, as issued by an *a priori* trusted authority (such as a root of trust already present within the verifying client).
eo: ``verification_material.certificate`` estas valida subskriba atestilo eldonita de *apriore* fidata aŭtoritato (kiel fidradiko jam ekzistanta en la kliento).
ru: ``verification_material.certificate`` - это действительный сертификат подписи, выданный *априори* доверенным органом (например, корнем доверия, который уже присутствует в проверяющем клиенте).
ta: `` சரிபார்ப்பு_மாட்டியல்.

source: ``verification_material.certificate`` identifies an appropriate signing subject, such as the machine identity of the Trusted Publisher that published the package.
eo: ``verification_material.certificate`` identigas taŭgan subskriban temon kiel la maŝinan identecon de la Fidata Eldonanto eldoninta la pakon.
ru: ``verification_material.certificate`` идентифицирует соответствующий субъект подписи, например, идентификатор машины доверенного издателя, опубликовавшего пакет.
ta: `` சரிபார்ப்பு_மாட்டியல்.

source: ``envelope.statement`` is a valid in-toto v1 Statement, with a subject and digest that **MUST** match the distribution's filename and contents. For the distribution's filename, matching **MUST** be performed by parsing using the appropriate source distribution or wheel filename format, as the statement's subject may be equivalent but normalized.
ru: ``envelope.statement`` - это корректный in-toto v1 Statement, с темой и дайджестом, которые **ДОЛЖНЫ** совпадать с именем и содержимым дистрибутива. Для имени дистрибутива соответствие **ДОЛЖНО** быть выполнено путем разбора с использованием соответствующего формата имени исходного дистрибутива или колеса, так как тема заявления может быть эквивалентной, но нормализованной.
ta: `` உறை. விநியோகத்தின் கோப்பு பெயருக்கு, பொருத்தமான ** பொருத்தமான மூல வழங்கல் அல்லது சக்கர கோப்பு பெயர் வடிவமைப்பைப் பயன்படுத்தி பாகுபடுத்துவதன் மூலம் ** செய்யப்பட வேண்டும், ஏனெனில் அறிக்கையின் பொருள் சமமாக இருக்கலாம் ஆனால் இயல்பாக்கப்படலாம்.

source: ``envelope.signature`` is a valid signature for ``envelope.statement`` corresponding to ``verification_material.certificate``, as reconstituted via the `v1 DSSE signature protocol <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md>`__.
eo: ``envelope.signature`` estas valida subskribo por ``envelope.statement`` respondanta al ``verification_material.certificate`` laŭ la `subskriba protokolo v1 DSSE <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md>`__.
ru: ``envelope.signature`` является действительной подписью для ``envelope.statement``, соответствующей ``verification_material.certificate``, как восстановлено по протоколу подписи `v1 DSSE <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md>`__.
ta: `` v1 dsse கையொப்பம் நெறிமுறை` `` உறை. <https://github.com/secure-systems-lab/dsse/blob/v1.0.0/protocol.md> __.

source: In addition to the above required steps, a verifier **MAY** additionally verify ``verification_material.transparency_entries`` on a policy basis, e.g. requiring at least one transparency log entry or a threshold of entries. When verifying transparency entries, the verifier **MUST** confirm that the inclusion time for each entry lies within the signing certificate's validity period.
ru: В дополнение к вышеперечисленным действиям верификатор **МОЖЕТ** дополнительно проверять ``материал_верификации.записи_прозрачности`` на основе политики, например, требуя по крайней мере одну запись журнала прозрачности или пороговое количество записей. При проверке записей о прозрачности верификатор **ДОЛЖЕН** подтвердить, что время включения каждой записи находится в пределах срока действия сертификата подписи.
ta: மேலே தேவையான படிகளுக்கு கூடுதலாக, ஒரு சரிபார்ப்பு ** ** கூடுதலாக கொள்கை அடிப்படையில் `` சரிபார்ப்பு_மாட்டியல். குறைந்தது ஒரு வெளிப்படைத்தன்மை பதிவு நுழைவு அல்லது உள்ளீடுகளின் நுழைவு தேவை. வெளிப்படைத்தன்மை உள்ளீடுகளை சரிபார்க்கும்போது, சரிபார்ப்பு ** ஒவ்வொரு நுழைவுக்கும் சேர்க்கும் நேரம் கையொப்பமிடும் சான்றிதழின் செல்லுபடியாகும் காலத்திற்குள் இருப்பதை உறுதிப்படுத்த வேண்டும்.

source: Appendix: Data models for Transparency Log Entries
eo: Apendico: Datenmodeloj por Eroj en Travidebleco-Protokolo
ru: Приложение: Модели данных для записей журнала прозрачности
ta: பின் இணைப்பு: வெளிப்படைத்தன்மை பதிவு உள்ளீடுகளுக்கான தரவு மாதிரிகள்

source: This appendix contains pseudocoded data models for transparency log entries in attestation objects. Each transparency log entry serves as a source of signed inclusion time, and can be verified either online or offline.
eo: Jen apendico enhavanta pseŭdokodajn datenmodelojn por protokoleroj de travidebleco-protokolo en atesta objekto. Ĉiu protokolero estas fonto de subskribita inkluziva tempo kaj estas konfirmebla konektite aŭ senkonekte.
ru: Это приложение содержит псевдокодированные модели данных для записей журнала прозрачности в объектах аттестации. Каждая запись журнала прозрачности служит источником подписанного времени включения и может быть проверена как онлайн, так и офлайн.
ta: இந்த பிற்சேர்க்கையில் சான்றளிப்பு பொருள்களில் வெளிப்படைத்தன்மை பதிவு உள்ளீடுகளுக்கான போலி தரவு மாதிரிகள் உள்ளன. ஒவ்வொரு வெளிப்படைத்தன்மை பதிவு நுழைவும் கையொப்பமிடப்பட்ட சேர்க்கை நேரத்தின் ஆதாரமாக செயல்படுகிறது, மேலும் ஆன்லைனில் அல்லது ஆஃப்லைனில் சரிபார்க்கலாம்.

source: Inline script metadata
eo: Enkorpigitaj programetaj metadatenoj
ja: インラインスクリプトのメタデータ
ru: Встроенные метаданные сценария
ta: இன்லைன் ச்கிரிப்ட் மேனிலை தரவு

source: This specification defines a metadata format that can be embedded in single-file Python scripts to assist launchers, IDEs and other external tools which may need to interact with such scripts.
eo: Jen specifo difinanta metadatenan formon enkorpigeblan en unudosiera Python-programo por helpi lanĉilojn, programadajn mediojn kaj aliajn eksterajn ilojn, kiuj interagas kun tiaj programoj.
ja: この仕様では、単一ファイルの Python スクリプトがそのようなスクリプトと相互作用するローンチャー・ IDE ・その他外部ツールを手助けするために、スクリプト内に埋め込むことができるメタデータフォーマットを定義しています。
ru: Эта спецификация определяет формат метаданных, которые могут быть встроены в однофайловые скрипты Python, чтобы помочь программам запуска, IDE и другим внешним инструментам, которым может понадобиться взаимодействовать с такими скриптами.
ta: இந்த விவரக்குறிப்பு ஒரு மேனிலை தரவு வடிவமைப்பை வரையறுக்கிறது, இது ஒற்றை கோப்பு பைதான் ச்கிரிப்ட்களில் உட்பொதிக்கப்படலாம், இதுபோன்ற ச்கிரிப்டுகளுடன் தொடர்பு கொள்ள வேண்டிய துவக்கிகள், ஐடிஇக்கள் மற்றும் பிற வெளிப்புற கருவிகளுக்கு உதவுகிறது.

source: This specification defines a metadata comment block format (loosely inspired by `reStructuredText Directives`__).
eo: Jen specifo difinanta metadatenan komentan blokan formon (parte inspirita de `direktivo de reStructuredText <reStructuredText Directives>`__).
ja: この仕様では、メタデータのコメントブロックの (`reStructuredText Directives`__ に大雑把に基づく) フォーマットを定義します。
ru: Эта спецификация определяет формат блока комментариев метаданных (в значительной степени вдохновленный `reStructuredText Directives`__).
ta: இந்த விவரக்குறிப்பு ஒரு மேனிலை தரவு கருத்து தொகுதி வடிவமைப்பை வரையறுக்கிறது (`மறுசீரமைப்பு டெக்ச்ட் டைரெக்டிவ்ச்`__ ஆல் ஈர்க்கப்பட்டது).

source: Any Python script may have top-level comment blocks that MUST start with the line ``# /// TYPE`` where ``TYPE`` determines how to process the content. That is: a single ``#``, followed by a single space, followed by three forward slashes, followed by a single space, followed by the type of metadata. Block MUST end with the line ``# ///``. That is: a single ``#``, followed by a single space, followed by three forward slashes. The ``TYPE`` MUST only consist of ASCII letters, numbers and hyphens.
eo: Ajna Python-programo povas havi supranivelajn komentajn blokojn, kiuj DEVAS komenciĝi per la linio ``# /// TIPO``, en kiu ``TIPO`` determinas kiel pritrakti la enhavon. Alivore: unu ``#``, sekvita de unu spaceto, sekvita de tri suprenstrekoj, sekvita de unu spaceto, sekvita de la tipo de metadatenoj. Bloko DEVAS finiĝi per la linio ``# ///``. Alivorte: unu ``#``, sekvita de unu spaceto, sekvita de tri suprenstrekoj. La ``TIPO`` DEVAS nur konsisti el Askiaj literoj, ciferoj kaj streketoj.
ja: すべての Python スクリプトについて、トップレベルのコメントブロックがあってもかまいませんが、 (そのようなコメントブロックは) ``TYPE`` によって内容物をどのように処理するべきかが決まるような ``# /// TYPE`` の行で始まらなければなりません。つまり: 単独の ``#`` 、これに後続する単独の空白文字、さらに後続する３個のスラッシュ文字 <forward slash> 、さらに空白文字、メタデータのタイプ。ブロックは ``# ///`` の行で終わらなければなりません。つまり: 単独の ``#`` 、後続する空白文字、３個のスラッシュ文字。 ``TYPE`` は、 ASCII 文字・数字・ハイフンだけで構成されていなければなりません。
ru: Любой скрипт Python может иметь блоки комментариев верхнего уровня, которые ДОЛЖНЫ начинаться со строки ``# /// TYPE``, где ``TYPE`` определяет, как обрабатывать содержимое. То есть: один ``#``, затем один пробел, затем три прямые косые черты, затем один пробел, затем тип метаданных. Блок ДОЛЖЕН заканчиваться строкой ``# ///``. То есть: один ``#``, за которым следует один пробел, а затем три прямые косые черты. ``TYPE`` ДОЛЖЕН состоять только из букв ASCII, цифр и дефисов.
ta: எந்தவொரு பைதான் ச்கிரிப்டும் உயர்-நிலை கருத்துத் தொகுதிகளைக் கொண்டிருக்கலாம், அவை ``# /// டைப்`` என்ற வரியுடன் தொடங்க வேண்டும், அங்கு உள்ளடக்கத்தை எவ்வாறு செயலாக்குவது என்பதை தீர்மானிக்கிறது. அதாவது: ஒரு ஒற்றை ``#``, அதைத் தொடர்ந்து ஒரு இடம், அதைத் தொடர்ந்து மூன்று முன்னோக்கி ச்லாச்கள், அதைத் தொடர்ந்து ஒரு இடம், அதைத் தொடர்ந்து மேனிலை தரவு வகை. தொகுதி ``# /// `` என்ற வரியுடன் முடிவடைய வேண்டும். அதாவது: ஒற்றை ``#``, அதைத் தொடர்ந்து ஒரு இடம், அதைத் தொடர்ந்து மூன்று முன்னோக்கி ச்லாச்கள். `` வகை`` தபஅஇகு எழுத்துக்கள், எண்கள் மற்றும் ஐபன்கள் மட்டுமே இருக்க வேண்டும்.

source: Every line between these two lines (``# /// TYPE`` and ``# ///``) MUST be a comment starting with ``#``. If there are characters after the ``#`` then the first character MUST be a space. The embedded content is formed by taking away the first two characters of each line if the second character is a space, otherwise just the first character (which means the line consists of only a single ``#``).
eo: Ĉiu linio inter tiuj du linioj (``# /// TYPE`` kaj ``# ///``) DEVAS esti komento komenciĝanta per ``#``. Se ekzistas signoj post la ``#``, do la unua signo DEVAS esti spaceto. La enkorpigita enhavo konsistas el la linio sen la unuaj du signoj (se la dua signo estas spaceto) aŭ el nur la unua signo (se ne, kio implicas, ke la linio konsistas el nur unu ``#``).
ja: これらふたつの行 (``# /// TYPE`` と ``# ///``) の間に入る各行は、 ``#`` で始まるコメントでなければなりません。もし、 ``#`` に文字が続くのであれば、その最初の文字は空白文字でなければなりません。ここに置かれる内容は、２文字目が空白文字であれば最初の２文字を削除して整形されますが、さもなければ最初の文字だけ (つまり、単独の ``#`` だけから構成される行) になります。
ru: Каждая строка между этими двумя строками (``# /// TYPE`` и ``# ///``) ДОЛЖНА быть комментарием, начинающимся с ``#``. Если после ``#`` идут символы, то первым символом должен быть пробел. Встроенное содержимое формируется путем удаления первых двух символов каждой строки, если второй символ - пробел, в противном случае - только первого символа (что означает, что строка состоит только из одного ``#``).
ta: இந்த இரண்டு வரிகளுக்கிடையேயான ஒவ்வொரு வரியும் (``# /// type`` மற்றும் ``# /// `)` `#` `உடன் தொடங்கும் கருத்தாக இருக்க வேண்டும். ``#`` க்குப் பிறகு எழுத்துக்கள் இருந்தால், முதல் எழுத்து ஒரு இடமாக இருக்க வேண்டும். இரண்டாவது எழுத்து ஒரு இடமாக இருந்தால் ஒவ்வொரு வரியின் முதல் இரண்டு எழுத்துக்களை எடுத்துச் செல்வதன் மூலம் உட்பொதிக்கப்பட்ட உள்ளடக்கம் உருவாகிறது, இல்லையெனில் முதல் எழுத்து (இதன் பொருள் வரி ஒரே ஒரு ``#``) மட்டுமே உள்ளது.

source: Precedence for an ending line ``# ///`` is given when the next line is not a valid embedded content line as described above. For example, the following is a single fully valid block:
eo: Oni preferu la finan lineon ``# ///``, kiam la sekva linio ne estas valida linio de enkorpigita enhavo laŭ la ĉi-supra priskribo. Ekzemple, la jeno estas unu plene valida bloko:
ja: 次の行が上述の埋め込みコメント行として正当なものではない場合に、 (コメントブロックの) 終わりの行である ``# ///`` が優先されます。例えば、次に示すものはひとつの完全に正当なブロックです:
ru: Приоритет для завершающей строки ``# ///`` отдается в том случае, если следующая строка не является допустимой строкой встроенного содержимого, как описано выше. Например, ниже приведен один полностью допустимый блок:
ta: மேலே விவரிக்கப்பட்டுள்ளபடி அடுத்த வரி செல்லுபடியாகும் உட்பொதிக்கப்பட்ட உள்ளடக்க வரியாக இல்லாதபோது ``# /// `` ஒரு இறுதி வரிக்கான முன்னுரிமை வழங்கப்படுகிறது. எடுத்துக்காட்டாக, பின்வருபவை முழுமையாக செல்லுபடியாகும் தொகுதி:

source: A starting line MUST NOT be placed between another starting line and its ending line. In such cases tools MAY produce an error. Unclosed blocks MUST be ignored.
eo: Komenca linio DEVAS NE ĉeesti inter alia komenca linio kaj ĝia fina linio. Tiukaze ilo POVAS sciigi pri eraro. Nefermita bloko DEVAS esti ignorita.
ja: 開始行は、他の開始行とその終了行の間に位置してはいけません。そのような場合には、ツール類はエラーを生成しても構いません。閉じられていないブロックは無視されなければなりません。
ru: Начальная линия НЕ ДОЛЖНА располагаться между другой начальной и конечной линиями. В таких случаях инструменты МОГУТ выдать ошибку. Незакрытые блоки ДОЛЖНЫ игнорироваться.
ta: மற்றொரு தொடக்க வரிக்கும் அதன் முடிவுக் கோட்டிற்கும் இடையில் ஒரு தொடக்க வரி வைக்கப்படக்கூடாது. இதுபோன்ற சந்தர்ப்பங்களில் கருவிகள் பிழையை உருவாக்கக்கூடும். திறக்கப்படாத தொகுதிகள் புறக்கணிக்கப்பட வேண்டும்.

source: When there are multiple comment blocks of the same ``TYPE`` defined, tools MUST produce an error.
eo: Se ekzistas pluraj komentaj blokoj de la sama ``TYPE``, ilo DEVAS sciigi pri eraro.
ja: 同じ ``TYPE`` が定義されたコメントブロックが複数存在する場合、ツール類はエラーを生成しなければなりません。
ru: Если определено несколько блоков комментариев одного и того же ``типа``, инструменты ДОЛЖНЫ выдать ошибку.
ta: ஒரே `` வகை`` வரையறுக்கப்பட்ட பல கருத்துத் தொகுதிகள் இருக்கும்போது, கருவிகள் பிழையை உருவாக்க வேண்டும்.

source: Tools reading embedded metadata MAY respect the standard Python encoding declaration. If they choose not to do so, they MUST process the file as UTF-8.
eo: Ilo leganta enmetitajn metadatenojn POVAS respekti la norman signokodo-deklaron de Python. Se ilo ne faras tion, ĝi DEVAS pritrakti la dosieron kiel UTF-8.
ja: 組み込みのメタデータを読み取るツール類は、 Python 標準のエンコーディング宣言を尊重しても構いません。もし、そうしないことを選択するのであれば、UTF-8 であるものとしてファイルを扱わなければなりません。
ru: Средства чтения встроенных метаданных МОГУТ соблюдать стандартное объявление кодировки Python. Если они этого не делают, они ДОЛЖНЫ обрабатывать файл в кодировке UTF-8.
ta: கருவிகள் படித்தல் உட்பொதிக்கப்பட்ட மேனிலை தரவு நிலையான பைதான் குறியாக்க அறிவிப்பை மதிக்கலாம். அவ்வாறு செய்ய வேண்டாம் என்று அவர்கள் தேர்வுசெய்தால், அவர்கள் கோப்பை யுடிஎஃப் -8 ஆக செயலாக்க வேண்டும்.

source: This is the canonical regular expression that MAY be used to parse the metadata:
eo: Jen la kanona regula esprimo, kiun oni POVAS uzi por sintakse analizi la metadatenojn:
ja: これは、メタデータをパースするのに使っても構わない正統な正規表現です:
ru: Это каноническое регулярное выражение, которое МОЖЕТ быть использовано для разбора метаданных:
ta: மெட்டாடேட்டாவை அலசுவதற்குப் பயன்படுத்தக்கூடிய நியமன வழக்கமான வெளிப்பாடு இது:

source: In circumstances where there is a discrepancy between the text specification and the regular expression, the text specification takes precedence.
eo: En cirkonstancoj kie ekzistas diferenco inter la teksta specifo kaj la regula esprimo, la teksta specifo havas prioritaton.
ja: テキストの仕様と正規表現の間に矛盾のある環境下では、テキストの仕様が優先されます。
ru: В случае расхождения между текстовой спецификацией и регулярным выражением приоритет отдается текстовой спецификации.
ta: உரை விவரக்குறிப்புக்கும் வழக்கமான வெளிப்பாட்டிற்கும் இடையில் முரண்பாடு உள்ள சூழ்நிலைகளில், உரை விவரக்குறிப்பு முன்னுரிமை பெறுகிறது.

source: Tools MUST NOT read from metadata blocks with types that have not been standardized by this specification.
eo: Ilo DEVAS NE legi el metadatena bloko de tipo ne normigita de ĉi tiu specifo.
ja: ツール類は、この仕様によって標準化されていないタイプを伴ったメタデータブロックから読み取ることがあってはなりません。
ru: Инструменты НЕ ДОЛЖНЫ читать из блоков метаданных с типами, которые не были стандартизированы данной спецификацией.
ta: இந்த விவரக்குறிப்பால் தரப்படுத்தப்படாத வகைகளைக் கொண்ட மேனிலை தரவு தொகுதிகளிலிருந்து கருவிகள் படிக்கக்கூடாது.

source: script type
eo: Tipo ``script``
ja: スクリプトのタイプ
ru: тип скрипта
ta: ச்கிரிப்ட் வகை

source: The first type of metadata block is named ``script``, which contains script metadata (dependency data and tool configuration).
eo: La unua tipo de metadatena bloko nomiĝas ``script``, kiu enhavas la programetajn metadatenojn (datenojn pri dependeco kaj agordoj de iloj).
ja: メタデータブロックのひとつめのタイプは ``script`` という名前で、スクリプトメタデータ (依存関係のデータとツールの設定) を格納しています。
ru: Первый тип блока метаданных называется ``script`, он содержит метаданные сценария (данные о зависимостях и конфигурации инструментов).
ta: முதல் வகை மேனிலை தரவு தொகுதி `` ச்கிரிப்ட்`` என்று பெயரிடப்பட்டுள்ளது, இதில் ச்கிரிப்ட் மேனிலை தரவு (சார்பு தரவு மற்றும் கருவி உள்ளமைவு) உள்ளது.

source: This document MAY include the top-level fields ``dependencies`` and ``requires-python``, and MAY optionally include a ``[tool]`` table.
eo: Tiu dokumento POVAS inkluzivi la supranivelajn kampojn ``dependencies`` kaj ``requires-python``, kaj POVAS nedevige inkluzivi tabelon ``[tool]``.
ja: このドキュメント (訳註、メタデータブロックのことか) は、トップレベルのフィールドとして ``dependencies`` と ``requires-python`` を含むことができ、また、オプションとして ``[tool]`` テーブルを含んでいても構いません。
ru: Этот документ МОЖЕТ включать поля верхнего уровня ``зависимости`` и ``требования-python``, и МОЖЕТ опционально включать таблицу ``[инструмент]``.
ta: இந்த ஆவணத்தில் `` சார்புநிலைகள்`` மற்றும் `` தேவைப்படுகிறது-பைதான் `` `[கருவி]` `அட்டவணையை சேர்க்கலாம்.

source: The ``[tool]`` table MAY be used by any tool, script runner or otherwise, to configure behavior. It has the same semantics as the :ref:`[tool] table in pyproject.toml <pyproject-tool-table>`.
eo: La tabelo ``[tool]`` POVAS esti uzata de ajna ilo, programrulilo aŭ ne, por agordi konduton. Ĝia semantiko estas sama kiel :ref:`la tabelo [tool] en pyproject.toml <pyproject-tool-table>`.
ru: Таблица ``[tool]`` МОЖЕТ использоваться любым инструментом, исполнителем скриптов или другим, для настройки поведения. Она имеет ту же семантику, что и таблица :ref:`[tool] в pyproject.toml <pyproject-tool-table>`.
ta: நடத்தையை உள்ளமைக்க `` [கருவி] `` அட்டவணை எந்தவொரு கருவி, ச்கிரிப்ட் ரன்னர் அல்லது வேறுவிதமாக பயன்படுத்தப்படலாம். இது அதே சொற்பொருளைக் கொண்டுள்ளது: ref: `[கருவி] அட்டவணை pyproject.toml <pyproject-tool-table>`.

source: The top-level fields are:
eo: Jen la supranivelaj kampoj:
ja: トップレベルのフィールドは:
ru: К полям верхнего уровня относятся:
ta: உயர்மட்ட புலங்கள்:

source: ``dependencies``: A list of strings that specifies the runtime dependencies of the script. Each entry MUST be a valid :ref:`dependency specifier <dependency-specifiers>`.
eo: ``dependencies`` : Listo de signoĉenoj specifantaj la rultempajn dependecojn de la programo. Ĉiu ero DEVAS esti valida :ref:`dependeco-specifilo <dependency-specifiers>`.
ja: ``dependencies``: スクリプトの動作時の依存関係を指定する文字列のリスト。それぞれの項目は正当な :ref:`依存関係指定子 <dependency-specifiers>` でなければなりません。
ru: ``зависимости``: Список строк, определяющих зависимости скрипта от времени выполнения. Каждая запись ДОЛЖНА быть действительным :ref:`спецификатором зависимости <dependency-specifiers>`.
ta: `` சார்புநிலைகள்``: ச்கிரிப்ட்டின் இயக்க நேர சார்புகளைக் குறிப்பிடும் சரங்களின் பட்டியல். ஒவ்வொரு நுழைவும் செல்லுபடியாகும்: ref: `சார்பு விவரக்குறிப்பு <சார்பு-விவரக்குறிப்புகள்>`.

source: ``requires-python``: A string that specifies the Python version(s) with which the script is compatible. The value of this field MUST be a valid :ref:`version specifier <version-specifiers>`.
eo: ``requires-python``: Signoĉeno specifanta la Python-versio(j)n kun kiu(j) la programo kongruas. La valoro de tiu kampo devas esti :ref:`versio-specifilo <version-specifiers>`.
ja: ``requires-python``: そのスクリプトと互換性のある Python のバージョン(群) を指定する文字列。このフィールドの値は正当な :ref:`バージョン指定子 <version-specifiers>` でなければなりません。
ru: ``requires-python``: Строка, указывающая версию(и) Python, с которой(ыми) совместим(ы) скрипт. Значение этого поля ДОЛЖНО быть действительным :ref:`спецификатором версии <version-specifiers>`.
ta: ``-பைதான் தேவை` ``: ச்கிரிப்ட் இணக்கமான பைதான் பதிப்பை (களை) குறிப்பிடும் ஒரு சரம். இந்த புலத்தின் மதிப்பு செல்லுபடியாகும்: ref: `பதிப்பு விவரக்குறிப்பு <பதிப்பு-விவரக்குறிப்புகள்>`.

source: Script runners MUST error if the specified ``dependencies`` cannot be provided. Script runners SHOULD error if no version of Python that satisfies the specified ``requires-python`` can be provided.
eo: Programeto-rulilo DEVAS sciigi pri eraro, se la specifita ``dependencies`` ne estas plenumebla. Programeto-rulilo SCIIGU pri eraro, se troviĝas neniu versio de Python plenumanta la specifitan ``requires-python``.
ja: スクリプトを走らせる側では、指定された ``dependencies`` を提供できない場合にはエラーを起こさなければなりません。指定された ``requires-python`` で指定されたバージョンの Python を提供できない場合には、スクリプトを走らせる側でエラーを起こすべきです。
ru: Программы запуска сценариев ДОЛЖНЫ ошибаться, если указанные ``зависимости`` не могут быть предоставлены. Программы запуска сценариев ДОЛЖНЫ ошибаться, если не может быть предоставлена версия Python, удовлетворяющая указанному ``требованию-python``.
ta: குறிப்பிட்ட `` சார்புநிலைகள்`` வழங்க முடியாவிட்டால் ச்கிரிப்ட் ஓட்டப்பந்தய வீரர்கள் பிழையாக வேண்டும். குறிப்பிட்ட `` தேவைகள் தேவைப்படும் பைதானின் பதிப்பு எதுவும் வழங்கப்படாவிட்டால் ச்கிரிப்ட் ஓட்டப்பந்தய வீரர்கள் பிழையாக இருக்க வேண்டும்.

source: The following is an example of a script with embedded metadata:
eo: Jen ekzemplo de programeto kun enkorpigitaj metadatenoj:
ja: 組み込まれたメタデータを伴うスクリプトの例を以下に示します:
ru: Ниже приведен пример сценария со встроенными метаданными:
ta: உட்பொதிக்கப்பட்ட மேனிலை தரவு கொண்ட ச்கிரிப்ட்டின் எடுத்துக்காட்டு பின்வருமாறு:

source: The following is an example of how to read the metadata on Python 3.11 or higher.
eo: Jen ekzemplo de kiel legi la metadatenojn sur Python 3.11 aŭ pli nova.
ja: 3.11 およびそれ以降の Python でどのようにメタデータを読み取るのかについて例を以下に示します。
ru: Ниже приведен пример того, как читать метаданные на Python 3.11 и выше.
ta: பைதான் 3.11 அல்லது அதற்கு மேற்பட்ட மெட்டாடேட்டாவை எவ்வாறு படிப்பது என்பதற்கு பின்வருபவை ஒரு எடுத்துக்காட்டு.

source: Often tools will edit dependencies like package managers or dependency update automation in CI. The following is a crude example of modifying the content using the ``tomlkit`` library__.
eo: Ofte ilo modifas dependecojn kiel padadministrilo aŭ aŭtomata ĝisdatigilo de dependecoj en kontinua integrado. Jen malneta ekzemplo de modifado de la enhavo per la `biblioteko <library>`__ ``tomlkit``.
ja: ツール類は、しばしば、パッケージ管理機構や CI における依存関係更新の自動化機構のように、依存関係を編集するでしょう。以下に、 ``tomlkit`` library__ を使って内容を書き換える際のおおまかな例を示します。
ru: Часто для редактирования зависимостей используются такие инструменты, как менеджеры пакетов или автоматизация обновления зависимостей в CI. Ниже приведен пример изменения содержимого с помощью библиотеки ``tomlkit``.
ta: பெரும்பாலும் கருவிகள் தொகுப்பு மேலாளர்கள் அல்லது தொஒ இல் சார்பு புதுப்பிப்பு ஆட்டோமேசன் போன்ற சார்புகளைத் திருத்தும். `` டாம்ல்கிட்`` நூலகத்தைப் பயன்படுத்தி உள்ளடக்கத்தை மாற்றுவதற்கான ஒரு கச்சா எடுத்துக்காட்டு பின்வருமாறு.
