Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: It's sometimes helpful to be able to get the absolute links to download artifacts from PyPI based on their hashes, e.g. if a particular project or release has been deleted from PyPI. The metadata table includes the ``path`` column, which includes the hash and artifact filename.
eo: Fojfoje utilas akiri absolutan hiperligon al elŝutebla artefakto ĉe PyPI per la haketaĵo, ekz. se speciala projekto aŭ eldono estis forviŝita de PyPI. La metadatena tabelo enhavas la kolumnon ``path``, kiu inkluzivas la haketaĵon kaj la artefaktan dosiernomon.
ja: 例えばあるプロジェクトやリリースが PyPI から削除されてしまったような場合に、ハッシュ値に基づいて PyPI からアーティファクト(訳注、そのようなプロジェクトやリリース)をダウンロードすることができる完全なリンクがあれば便利な時もあるでしょう。メタデータテーブルには ``path`` 列があって、ハッシュ値とアーティファクトのファイル名を保持しています。
pt_br: Às vezes, é útil ser capaz de obter os links absolutos para baixar artefatos de PyPI com base em seus hashes, por exemplo, se um determinado projeto ou versão foi excluído de PyPI. A tabela de metadados inclui a coluna ``path``, que inclui o hash e o nome do arquivo do artefato.
ru: Иногда полезно иметь возможность получить абсолютные ссылки на загрузку артефактов из PyPI на основе их хэшей, например, если определенный проект или релиз был удален из PyPI. В таблице метаданных есть колонка ``path'', которая включает в себя хэш и имя файла артефакта.
ta: அவற்றின் ஆச்களின் அடிப்படையில் PYPI இலிருந்து கலைப்பொருட்களைப் பதிவிறக்குவதற்கான முழுமையான இணைப்புகளைப் பெறுவது சில நேரங்களில் உதவியாக இருக்கும், எ.கா. ஒரு குறிப்பிட்ட திட்டம் அல்லது வெளியீடு PYPI இலிருந்து நீக்கப்பட்டிருந்தால். மேனிலை தரவு அட்டவணையில் `` பாதை`` நெடுவரிசையை உள்ளடக்கியது, இதில் ஆச் மற்றும் கலைப்பொருள் கோப்பு பெயர் அடங்கும்.

source: The URL generated here is not guaranteed to be stable, but currently aligns with the URL where PyPI artifacts are hosted.
eo: La generita retadreso ne estas stabila, sed aktuale ĝi kongruas kun la retadreso ĉe kiu la PyPI-artefaktoj troviĝas.
ja: ここで生成された URL はいつまでも存在するとは限りませんが、しかし、その時点で PyPI のアーティファクトがどこに保存されているかを示す URL を含んでいます。
pt_br: Não é garantido que a URL gerada aqui seja estável, mas atualmente está alinhada com a URL onde os artefatos PyPI estão hospedados.
ru: Не гарантируется, что сгенерированный здесь URL будет стабильным, но в настоящее время он совпадает с URL, на котором размещены артефакты PyPI.
ta: இங்கே உருவாக்கப்படும் முகவரி நிலையானது என்று பொறுப்பு அளிக்கப்படவில்லை, ஆனால் தற்போது PYPI கலைப்பொருட்கள் புரவலன் செய்யப்படும் முகவரி உடன் ஒத்துப்போகிறது.

source: url
ta: முகவரி

source: Caveats
eo: Avertoj
ja: 注意書き
pt_br: Ressalvas
ru: Оговорки
ta: எச்சரிக்கைகள்

source: In addition to the caveats listed in the background above, Linehaul suffered from a bug which caused it to significantly under-report download statistics prior to July 26, 2018. Downloads before this date are proportionally accurate (e.g. the percentage of Python 2 vs. Python 3 downloads) but total numbers are lower than actual by an order of magnitude.
eo: Aldone al la avertoj ĉi-supraj, Linehaul suferis de cimo, kiu kaŭzis tre maltroan kalkuladon pri elŝutaj statistikoj antaŭ la 26a de Julio 2018. Elŝutoj antaŭ tiu dato estas proporcie precizaj (ekz. la elcento de Python 2 kontraste al Python 3), sed la reportataj totaloj estas pli-ol-dekoble malgrandaj ol la realaj nombroj.
ja: 上記の背景に列挙した注意書きに加えて、Linehaulは、極端に過小報告されていたダウンロード統計の原因となったバグに2018年7月26日まで悩まされていました。この日より前のダウンロード数については、比率の点(例えばPython2とPython3の百分率)では正確ですが、絶対数の点では桁が異なるほどに過小です。
pt_br: Além das advertências listadas no histórico acima, Linehaul sofreu de um bug que causou um subestimamento das estatísticas de download antes de 26 de julho de 2018. Downloads antes dessa data são proporcionalmente precisos (por exemplo, a porcentagem de Python 2 vs. Python 3 downloads), mas os números totais são menores do que o real em uma ordem de magnitude.
ru: В дополнение к предостережениям, перечисленным выше, Linehaul страдает от ошибки, из-за которой он значительно занижает статистику загрузок до 26 июля 2018 года. Количество загрузок до этой даты пропорционально точно (например, процентное соотношение загрузок Python 2 и Python 3), но общее количество на порядок ниже фактического.
ta: மேலே உள்ள பின்னணியில் பட்டியலிடப்பட்ட எச்சரிக்கைகளுக்கு மேலதிகமாக, லைன்ஆல் ஒரு பிழையால் பாதிக்கப்பட்டார், இது சூலை 26, 2018 க்கு முன்னர் பதிவிறக்க புள்ளிவிவரங்களை கணிசமாகக் கூறியது. இந்த தேதிக்கு முந்தைய பதிவிறக்கங்கள் விகிதாசாரமாக துல்லியமானவை (எ.கா. பைதான் 2 வெர்சச் பைத்தானின் விழுக்காடு 3 பதிவிறக்கங்கள்) ஆனால் மொத்த எண்கள் அளவின் வரிசையால் உண்மையானதை விட குறைவாக உள்ளன.

source: Additional tools
eo: Pliaj iloj
ja: その他のツール
pt_br: Ferramentas adicionais
ru: Дополнительные инструменты
ta: கூடுதல் கருவிகள்

source: Besides using the BigQuery console, there are some additional tools which may be useful when analyzing download statistics.
eo: Krom la BigQuery-konzolo, ekzistas kelkaj ceteraj iloj utilaj por analizado de elŝuta statistiko.
ja: BigQueryコンソールを用いる他に、ダウンロード統計を分析する際に役に立つと思われるツールがいくつかあります。
pt_br: Além de usar o console do BigQuery, existem algumas ferramentas adicionais que podem ser úteis ao analisar estatísticas de download.
ru: Помимо использования консоли BigQuery, есть несколько дополнительных инструментов, которые могут быть полезны при анализе статистики загрузок.
ta: பிக்வெரி கன்சோலைப் பயன்படுத்துவதைத் தவிர, பதிவிறக்க புள்ளிவிவரங்களை பகுப்பாய்வு செய்யும் போது பயனுள்ளதாக இருக்கும் சில கூடுதல் கருவிகள் உள்ளன.

source: You can also access the public PyPI download statistics dataset programmatically via the BigQuery API and the `google-cloud-bigquery`_ project, the official Python client library for BigQuery.
eo: Oni ankaŭ povas programe akiri la publikan statistikan datenaron pri elŝutoj el PyPI per la API de BigQuery kaj la projekto `google-cloud-bigquery`_, la oficiala klienta Python-biblioteko por BigQuery.
ja: BigQuery APIとBigQuery用の公式Pythonクライアントである `google-cloud-bigquery`_ プロジェクトを使って、プログラムからPyPIの公開ダウンロード統計データセットにアクセスすることもできます。
pt_br: Você também pode acessar o conjunto de dados público de estatísticas de download PyPI de maneira programática por meio da API do BigQuery e do projeto `google-cloud-bigquery`_, a biblioteca cliente oficial do Python para BigQuery.
ru: Вы также можете получить доступ к публичному набору данных статистики загрузок PyPI программным путем через BigQuery API и проект `google-cloud-bigquery`_, официальную клиентскую библиотеку Python для BigQuery.
ta: பிக்வெரி பநிஇ மற்றும் பிக்வரிக்கான அதிகாரப்பூர்வ பைதான் கிளையன்ட் நூலகமான `கூகிள்-கிளவுட்-பிக்வரி`_ திட்டத்தின் வழியாக பொது PYPI பதிவிறக்க புள்ளிவிவர தரவுத்தொகுப்பை நிரல் முறையில் அணுகலாம்.

source: ``pypinfo``
ta: `` பைபின்ஃபோ``

source: `pypinfo`_ is a command-line tool which provides access to the dataset and can generate several useful queries. For example, you can query the total number of download for a package with the command ``pypinfo package_name``.
eo: `pypinfo`_ estas komandlinia ilo por aliri al la datenaro, kapabla generi plurajn utilajn informpetojn. Ekzemple, oni povas pridemandi la totalan nombron de elŝutoj de pako per la komando ``pypinfo paknomo``.
ja: `pypinfo`_ はデータセットにアクセスして、役に立つクエリをいくつか生成する機能を提供するコマンドラインツールです。例えば、``pypinfo package_name``を実行すれば、そのパッケージのダウンロード総数を問い合わせることができます。
pt_br: `pypinfo`_ é uma ferramenta de linha de comando que fornece acesso ao conjunto de dados e pode gerar várias consultas úteis. Por exemplo, você pode consultar o número total de downloads de um pacote com o comando ``pypinfo package_name``.
ru: `pypinfo`_ - это инструмент командной строки, который предоставляет доступ к набору данных и может генерировать несколько полезных запросов. Например, вы можете запросить общее количество загрузок для пакета с помощью команды ``pypinfo package_name``.
ta: `பைபின்ஃபோ`_ என்பது ஒரு கட்டளை-வரி கருவியாகும், இது தரவுத்தொகுப்பிற்கான அணுகலை வழங்குகிறது மற்றும் பல பயனுள்ள வினவல்களை உருவாக்க முடியும். எடுத்துக்காட்டாக, `` பைபின்ஃபோ தொகுப்பு_நாம்`` கட்டளையுடன் ஒரு தொகுப்புக்கான மொத்த பதிவிறக்கத்தின் எண்ணிக்கையை வினவலாம்.

source: Install `pypinfo`_ using pip.
eo: Instalu `pypinfo`_ per pip.
ja: pipを用いて `pypinfo`_ をインストール。
pt_br: Instale `pypinfo`_ usando o pip.
ru: Установите `pypinfo`_ через :program:`pip`.
ta: PIP ஐப் பயன்படுத்தி `pypinfo`_ ஐ நிறுவவும்.

source: Usage:
eo: Uzado:
ja: 使い方：
pt_br: Uso:
ru: Использование:
ta: பயன்பாடு:

source: ``pandas-gbq``
ta: `Panak-gbq``.

source: The `pandas-gbq`_ project allows for accessing query results via `Pandas`_.
eo: La projekto `pandas-gbq`_ permesas atingi informpetajn rezultojn per `Pandas`_.
ja: `pandas-bbq`_ プロジェクトを使えば `Pandas`_ 経由でクエリ結果を参照することができます。
pt_br: O projeto `pandas-gbq`_ permite acessar resultados de pesquisa com `Pandas`_.
ru: Проект `pandas-gbq`_ позволяет получать доступ к результатам запросов через `Pandas`_.
ta: `பாண்டாச்-GBQ`_ திட்டம்` பாண்டாச்`_ வழியாக வினவல் முடிவுகளை அணுக அனுமதிக்கிறது.

source: References
eo: Referencoj
ja: 参考文献
pt_br: Referências
ru: Ссылка
ta: குறிப்புகள்

source: `PyPI Download Counts deprecation email <https://mail.python.org/pipermail/distutils-sig/2013-May/020855.html>`__
eo: `Retmesaĝo pri evitindigo de la Kalkuloj de Elŝutoj ĉe PyPI <https://mail.python.org/pipermail/distutils-sig/2013-May/020855.html>`__
ja: `PyPI ダウンロード統計を非推奨とするメール (PyPI Download Counts deprecation email) <https://mail.python.org/pipermail/distutils-sig/2013-May/020855.html>`__
pt_br: `E-mail de descontinuação das contagens de download do PyPI <https://mail.python.org/pipermail/distutils-sig/2013-May/020855.html>`__
ru: `PyPI Скачать Counts deprecation email <https://mail.python.org/pipermail/distutils-sig/2013-May/020855.html>`__
ta: `Pypi பதிவிறக்கம் எண்ணிக்கைகள் தேய்மான மின்னஞ்சல் <https://mail.python.org/pipermail/distutils-sig/2013-may/020855.html> ____ __ __

source: `PyPI BigQuery dataset announcement email <https://mail.python.org/pipermail/distutils-sig/2016-May/028986.html>`__
eo: `Retmesaĝo anoncanta datenaron pri PyPI ĉe BigQuery <https://mail.python.org/pipermail/distutils-sig/2016-May/028986.html>`__
ja: `PyPI BigQueryデータセットをアナウンスするメール (PyPI BigQuery dataset announcement email) <https://mail.python.org/pipermail/distutils-sig/2016-May/028986.html>`__
pt_br: `E-mail de anúncio do conjunto de dados BigQuery do PyPI <https://mail.python.org/pipermail/distutils-sig/2016-May/028986.html>`__
ru: Сообщение об анонсе набора данных PyPI BigQuery по электронной почте <https://mail.python.org/pipermail/distutils-sig/2016-May/028986.html>`__
ta: `Pypi bigquery தரவுத்தொகுப்பு அறிவிப்பு மின்னஞ்சல் <https://mail.python.org/pipermail/distutils-sig/2016-may/028986.html>` __ __ __

source: Creating and discovering plugins
eo: Krei kaj malkovri kromprogramojn
ja: プラグイン作成と発見
pt_br: Criando e descobrindo plug-ins
ru: Создание и обнаружение плагинов
ta: செருகுநிரல்களை உருவாக்கி கண்டுபிடிப்பது

source: Often when creating a Python application or library you'll want the ability to provide customizations or extra features via **plugins**. Because Python packages can be separately distributed, your application or library may want to automatically **discover** all of the plugins available.
eo: Ofte dum verkado de programo aŭ biblioteko en Python, oni volas havi la kapablon adapti aŭ aldoni pliajn funkciojn per **kromprogramo**. Ĉar Python-pako estas aparte distribuata, la programo aŭ biblioteko eble volas aŭtomate **malkovri** ĉiujn haveblajn kromprogramojn.
ja: Pythonのアプリケーションまたはライブラリを作成する時には、カスタマイズができるようにしたり **プラグイン** を通じて機能を追加できるようにしたりすることがしばしばあります。Pythonのパッケージは別々に配布できますので、あなたのアプリケーションまたはライブラリが利用可能なすべてのプラグインを自動的に **探し出す** ようにしたくなるかもしれません。
pt_br: Frequentemente, ao criar uma aplicação ou biblioteca Python, você desejará ter a capacidade de fornecer personalizações ou recursos extras por meio de **plug-ins**. Como os pacotes Python podem ser distribuídos separadamente, sua aplicação ou biblioteca pode querer **descobrir** automaticamente todos os plugins disponíveis.
ru: Часто при создании приложений или библиотек на Python вы хотите иметь возможность предоставлять настройки или дополнительные возможности с помощью **плагинов**. Поскольку пакеты Python могут распространяться отдельно, ваше приложение или библиотека могут захотеть автоматически **обнаружить** все доступные плагины.
ta: பெரும்பாலும் பைதான் பயன்பாடு அல்லது நூலகத்தை உருவாக்கும் போது ** செருகுநிரல்கள் ** வழியாக தனிப்பயனாக்கங்கள் அல்லது கூடுதல் அம்சங்களை வழங்கும் திறனை நீங்கள் விரும்புவீர்கள். பைதான் தொகுப்புகளை தனித்தனியாக விநியோகிக்க முடியும் என்பதால், உங்கள் பயன்பாடு அல்லது நூலகம் தானாகவே ** கண்டுபிடிக்க விரும்பலாம் ** கிடைக்கும் அனைத்து செருகுநிரல்களும்.

source: There are three major approaches to doing automatic plugin discovery:
eo: Ekzistas tri ĉefmanieroj igi kromaĵojn aŭtomate malkovreblaj:
ja: プラグインの自動検出には大きく分けて３個の実現方法があります。
pt_br: Existem três abordagens principais para fazer a descoberta automática de plugins:
ru: Существует три основных подхода к автоматическому обнаружению плагинов:
ta: தானியங்கி சொருகி கண்டுபிடிப்பை செய்வதற்கு மூன்று முக்கிய அணுகுமுறைகள் உள்ளன:

source: `Using naming convention`_.
eo: `Uzi nomajn konvenciojn <Using naming convention>`_.
ja: `命名規則を用いるやり方 <Using naming convention>`_ 。
pt_br: `Usando convenção de nomenclatura`_.
ru: `Использование соглашения об именах`_.
ta: `பெயரிடும் மாநாட்டைப் பயன்படுத்துதல்`_.

source: `Using namespace packages`_.
eo: `Uzi nomspacajn pakojn <Using namespace packages>`_.
ja: `namespaceパッケージを用いるやり方 <Using namespace packages>`_ 。
pt_br: `Usando pacotes de espaço de nomes`_.
ru: `Использование пакетов пространства имён`_.
ta: `பெயர்வெளி தொகுப்புகளைப் பயன்படுத்துதல்`_.

source: `Using package metadata`_.
eo: `Uzi pakajn metadatenojn <Using package metadata>`_.
ja: `パッケージのメタデータを用いるやり方 <Using package metadata>`_ 。
pt_br: `Usando metadados de pacote`_.
ru: `Использование метаданных пакета`_.
ta: `தொகுப்பு மெட்டாடேட்டா`_ ஐப் பயன்படுத்துதல்.

source: Using naming convention
eo: Uzi noman konvencion
ja: 命名規則を用いるやり方
pt_br: Usando convenção de nomenclatura
ru: Использование соглашения об именах
ta: பெயரிடும் மாநாட்டைப் பயன்படுத்துதல்

source: If all of the plugins for your application follow the same naming convention, you can use :func:`pkgutil.iter_modules` to discover all of the top-level modules that match the naming convention. For example, `Flask`_ uses the naming convention ``flask_{plugin_name}``. If you wanted to automatically discover all of the Flask plugins installed:
ja: あなたのアプリケーション用のすべてのプラグインが命名規則に従うのであれば、 :func:`pkgutil.iter_modules` を用いて命名規則に合致するトップレベルのすべてのモジュールを発見することができます。例えば、 `Flask`_ は命名規則として ``flask_{plugin_name}`` を使います。もし、すべてのインストール済みFlask用プラグインを発見したいのであれば：
pt_br: Se todos os plugins para sua aplicação seguem a mesma convenção de nomenclatura, você pode usar :func:`pkgutil.iter_modules` para descobrir todos os módulos de nível superior que correspondem à convenção de nomenclatura. Por exemplo, `Flask`_ usa a convenção de nomenclatura ``flask_{nome_plugin}``. Se você quiser descobrir automaticamente todos os plugins Flask instalados:
ru: Если все плагины вашего приложения имеют одинаковые имена, вы можете использовать :func:`pkgutil.iter_modules` для поиска всех модулей верхнего уровня, которые соответствуют этому соглашению. Например, `Flask`_ использует соглашение об именовании ``flask_{plugin_name}``. Если вы хотите автоматически обнаружить все установленные плагины Flask:
ta: உங்கள் பயன்பாட்டிற்கான அனைத்து செருகுநிரல்களும் ஒரே பெயரிடும் மாநாட்டைப் பின்பற்றினால், நீங்கள் பயன்படுத்தலாம்: func: `pkgutil.iter_modules` பெயரிடும் மாநாட்டுடன் பொருந்தக்கூடிய அனைத்து உயர்மட்ட தொகுதிகள் அனைத்தையும் கண்டறிய. எடுத்துக்காட்டாக, `பிளாச்க்`_ பெயரிடும் மாநாட்டை` `பிளாச்க்_ {plugin_name}` `பயன்படுத்துகிறது. நிறுவப்பட்ட அனைத்து பிளாச்க் செருகுநிரல்களையும் தானாகவே கண்டுபிடிக்க விரும்பினால்:

source: If you had both the `Flask-SQLAlchemy`_ and `Flask-Talisman`_ plugins installed then ``discovered_plugins`` would be:
eo: Se vi instalis la kromaĵojn `Flask-SQLAlchemy`_ kaj `Flask-Talisman`_, do ``discovered_plugins`` estos:
ja: もしあなたが `Flask-SQLAlchemy`_ と `Flask-Talisman`_ のふたつのプラグインをインストールしてあるなら、 ``discovered_plugins`` は次のようになるでしょう：
pt_br: Se você tivesse os plugins `Flask-SQLAlchemy`_ e `Flask-Talisman`_ instalados, então ``discover_plugins`` seria:
ru: Если у вас установлены оба плагина `Flask-SQLAlchemy`_ и `Flask-Talisman`_, то ``discovered_plugins`` будет иметь вид:
ta: உங்களிடம் `பிளாச்க்-சதுரச்செமி`_ மற்றும்` பிளாச்க்-டலிசான்`_ செருகுநிரல்கள் இரண்டையும் நிறுவியிருந்தால், `` கண்டுபிடிக்கப்பட்ட_பிளகின்ச்`` இருக்கும்:

source: Using naming convention for plugins also allows you to query the Python Package Index's :ref:`simple repository API <simple-repository-api>` for all packages that conform to your naming convention.
eo: Uzado de nomada konvencio por kromprogramoj permesas serĉi la :ref:`simplan deponejan API-on <simple-repository-api>` de la Python-Pakindekso por ĉiuj pakoj observantaj la nomandan konvencion.
ja: プラグインの命名規則を用いることで、あなたの命名規則に従うすべてのパッケージについてPython パッケージインデックスの :ref:`simple repository API <simple-repository-api>` から検索することもできるようになります。
pt_br: Usar a convenção de nomenclatura para plugins também permite que você consulte a :ref:`API de repositório simples <simple-repository-api>` do Índice de Pacotes Python para todos os pacotes que estão em conformidade com a sua convenção de nomenclatura.
ru: Использование соглашения об именовании для плагинов также позволяет запрашивать у Python Package Index :ref:`simple repository API <simple-repository-api>` все пакеты, которые соответствуют вашему соглашению об именовании.
ta: செருகுநிரல்களுக்கான பெயரிடும் மாநாட்டைப் பயன்படுத்துவது பைதான் தொகுப்பு குறியீட்டின் வினவலையும் அனுமதிக்கிறது: குறிப்பு: `எளிய களஞ்சிய பநிஇ <எளிய-ரோபோசிட்டரி-ஏபிஐ>` உங்கள் பெயரிடும் மாநாட்டிற்கு இணங்கும் அனைத்து தொகுப்புகளுக்கும்.

source: Using namespace packages
eo: Uzi nomspacajn pakojn
ja: namespaceパッケージを用いるやり方
pt_br: Usando pacotes de espaço de nomes
ru: Использование пакетов пространства имён
ta: பெயர்வெளி தொகுப்புகளைப் பயன்படுத்துதல்

source: :doc:`Namespace packages <packaging-namespace-packages>` can be used to provide a convention for where to place plugins and also provides a way to perform discovery. For example, if you make the sub-package ``myapp.plugins`` a namespace package then other :term:`distributions <Distribution Package>` can provide modules and packages to that namespace. Once installed, you can use :func:`pkgutil.iter_modules` to discover all modules and packages installed under that namespace:
eo: Oni povas uzi :doc:`nomspacan pakon <packaging-namespace-packages>` por starigi konvencion pri la lokoj de kromprogramoj kaj por trovi kromprogramojn. Ekzemple, se oni igas la subpakon ``myapp.plugins`` nomspaca pako, do alia :term:`distribuo <Distribution Package>` povas disponigi modulojn kaj pakojn al tiu nomspaco. Post instalo, oni povas uzi :func:`pkgutil.iter_modules` por trovi ĉiujn modulojn kaj pakojn instalitajn sub tiu nomspaco:
ja: :doc:`Namespace パッケージ <packaging-namespace-packages>` を使えば、プラグインをどこに配置するかに関する規則や、発見するための方法も提供できます。例えば、あなたが名前空間を決めるサブパッケージ ``myapp.plugins`` を作成したら、その名前空間に他の :term:`配布物 <Distribution Package>` がモジュールやパッケージを配置することができます。インストールが終われば、あなたは :func:`pkgutil.iter_modules` を用いてインストール済みの全てのモジュールやパッケージをその名前空間で発見できるでしょう。
pt_br: :doc:`Pacotes de espaços de nome <packaging-namespace-packages>` podem ser usados para fornecer uma convenção de onde colocar plugins e também fornece uma maneira de realizar a descoberta. Por exemplo, se você fizer do subpacote ``myapp.plugins`` um pacote de espaço de nomes, então outras :term:`distribuições <Distribution Package>` pode fornecer módulos e pacotes para aquele espaço de nomes. Uma vez instalado, você pode usar :func:`pkgutil.iter_modules` para descobrir todos os módulos e pacotes instalados sob esse espaço de nomes:
ru: :doc:`Пакеты пространства имен <пакеты-пространства имен>` могут быть использованы для обеспечения соглашения о том, где размещать плагины, а также обеспечивают способ обнаружения. Например, если вы сделаете подпакет ``myapp.plugins`` пакетом пространства имен, то другие :term:``дистрибутивы <Distribution Package>`` смогут предоставлять модули и пакеты для этого пространства имен. После установки вы можете использовать :func:`pkgutil.iter_modules` для обнаружения всех модулей и пакетов, установленных под этим пространством имен:
ta: . எடுத்துக்காட்டாக, நீங்கள் `` myapp.plugins`` ஒரு பெயர்வெளி தொகுப்பை உருவாக்கினால், பிற: கால: `விநியோகம் <விநியோக தொகுப்பு>` அந்த பெயர்வெளியில் தொகுதிகள் மற்றும் தொகுப்புகளை வழங்க முடியும். நிறுவியதும், நீங்கள் பயன்படுத்தலாம்: func: `pkgutil.iter_modules` அந்த பெயர்வெளியின் கீழ் நிறுவப்பட்ட அனைத்து தொகுதிகள் மற்றும் தொகுப்புகளைக் கண்டறிய:

source: Specifying ``myapp.plugins.__path__`` to :func:`~pkgutil.iter_modules` causes it to only look for the modules directly under that namespace. For example, if you have installed distributions that provide the modules ``myapp.plugins.a`` and ``myapp.plugins.b`` then ``discovered_plugins`` in this case would be:
eo: Specifado de ``myapp.plugins.__path__`` al :func:`~pkgutil.iter_modules` kaŭzas serĉadon de moduloj rekte sub tiu nomspaco. Ekzemple, se oni instalus distribuojn provizante la modulojn ``myapp.plugins.a`` kaj ``myapp.plugins.b``, do ``discovered_plugins`` estus la jeno:
ja: :func:`~pkgutil.iter_modules` に ``myapp.plugins.__path__`` を指定すると、その名前空間の直下にあるモジュールだけを探索するようになります。例えば、あなたがモジュールの ``myapp.plugins.a`` と ``myapp.plugins.b`` を提供する配布物をインストールしているとしたら、 ``discovered_plugins`` は次のようになるでしょう：
pt_br: Especificar ``myapp.plugins.__path__`` para :func:`~pkgutil.iter_modules` faz com que ele procure apenas os módulos diretamente sob aquele espaço de nomes. Por exemplo, se você instalou distribuições que fornecem os módulos ``myapp.plugins.a`` e ``myapp.plugins.b``, então ``found_plugins`` neste caso seria:
ru: Указание ``myapp.plugins.__path__`` в :func:`~pkgutil.iter_modules`` заставляет его искать только те модули, которые находятся непосредственно в этом пространстве имен. Например, если у вас установлены дистрибутивы, предоставляющие модули ``myapp.plugins.a`` и ``myapp.plugins.b``, то ``discovered_plugins`` в этом случае будет:
ta: `` Myapp.plugins .__ பாதை__`` க்கு: func: `~ pkgutil.iter_modules` இது அந்த பெயர்வெளியின் கீழ் நேரடியாக தொகுதிகளை மட்டுமே தேடுகிறது. எடுத்துக்காட்டாக, `` myapp.plugins.a`` மற்றும் `` myapp.plugins.b`` தொகுதிகளை வழங்கும் விநியோகங்களை நீங்கள் நிறுவியிருந்தால், இந்த விசயத்தில் `` கண்டுபிடிக்கப்பட்ட_பிலுசின்ச்`` இருக்கும்:
