Repository: pypa/packaging.python.org
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: eo, ja, pt_br, ru, ta

source: The ``EXTERNALLY-MANAGED`` file is an INI-style metadata file intended to be parsable by the standard library configparser_ module. If the file can be parsed by ``configparser.ConfigParser(interpolation=None)`` using the UTF-8 encoding, and it contains a section ``[externally-managed]``, then the installer should look for an error message specified in the file and output it as part of its error. If the first element of the tuple returned by ``locale.getlocale(locale.LC_MESSAGES)``, i.e., the language code, is not ``None``, it should look for the error message as the value of a key named ``Error-`` followed by the language code. If that key does not exist, and if the language code contains underscore or hyphen, it should look for a key named ``Error-`` followed by the portion of the language code before the underscore or hyphen. If it cannot find either of those, or if the language code is ``None``, it should look for a key simply named ``Error``.
eo: La dosiero ``EXTERNALLY-MANAGED`` estas INI-stila metadatena dosiero, kiu estu analizebla de la norma biblioteka modulo configparser_. Se la dosiero estas analizebla per ``configparser.ConfigParser(interpolation=None)`` uzante UTF-8, kaj ĝi enhavas sekcion ``[externally-managed]``, do la instalilo serĉu erarmesaĝon specifitan en la dosiero kaj eligu ĝin kiel parton de la eraro. Se la unua elemento de la opo ``locale.getlocale(locale.LC_MESSAGES)``, t.e. la lingvokodo, ne estas ``None``, ĝi serĉu la erarmesaĝon kiel la valoron de ŝlosilo nomita `Error-`` sekvita de la lingvokodo. Se tiu ŝlosilo ne ekzistas, kaj se la lingvokodo enhavas substrekon aŭ streketon, ĝi serĉu ŝlosilon nomitan ``Error-`` sekvita de la parto de la lingvokodo antaŭ la substreko aŭ streketo. Se ĝi ne povas trovi ambaŭ, aŭ se la lingvokodo estas ``None``, ĝi serĉu ŝlosilon simple nomitan ``Error``.
ja: ``EXTERNALLY-MANAGED`` ファイルは INI スタイルのメタデータファイルで、標準ライブラリの configparser_ モジュールでパースできることを意図しています。このファイルが UTF-8 エンコーディングを用いて ``configparser.ConfigParser(interpolation=None)`` によってパースできて、かつ、ファイル内に ``[externally-managed]`` セクションがあれば、インストーラはこのファイル内で指定されたエラーメッセージを探して、エラーの一部として出力するべきです。 ``locale.getlocale(locale.LC_MESSAGES)`` によって返されるタプルの最初の要素が ``None`` ではない場合には、 ``Error-`` の後に言語コードが続く名前を持つキーの値として提供されるエラーメッセージを探すべきです。そのようなキーが存在しない場合でも、言語コードがアンダースコアかハイフンを含むのであれば、 ``Error-`` の後に言語コードのアンダースコアかハイフンの前までの部分が続くキーを探すべきです。これらのいずれも発見できない場合や、言語コードが ``None`` の場合には、単に ``Error`` というキーを探すべきです。
ru: Файл ``EXTERNALLY-MANAGED`` - это файл метаданных в стиле INI, предназначенный для разбора модулем configparser_ стандартной библиотеки. Если файл может быть разобран модулем ``configparser.ConfigParser(interpolation=None)`` с использованием кодировки UTF-8 и содержит секцию ``[externally-managed]``, то программа установки должна искать сообщение об ошибке, указанное в файле, и выводить его как часть своей ошибки. Если первый элемент кортежа, возвращаемого функцией ``locale.getlocale(locale.LC_MESSAGES)``, т.е. код языка, не является ``None``, то программа должна искать сообщение об ошибке как значение ключа с именем ``Error-``, за которым следует код языка. Если такого ключа не существует, а код языка содержит подчеркивание или дефис, то следует искать ключ с именем ``Error-``, за которым следует часть кода языка перед подчеркиванием или дефисом. Если ни один из них не найден, или если код языка - ``None``, следует искать ключ с простым именем ``Error``.
ta: `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` கோப்பு என்பது ஒரு ஐ.என்.ஐ-பாணி மேனிலை தரவு கோப்பாகும், இது நிலையான நூலக கட்டமைப்பு_ தொகுதி மூலம் பாகுபடுத்தக்கூடியதாக இருக்கும். கோப்பை `` configparser.configparser (இடைக்கணிப்பு = எதுவுமில்லை) `` `யுடிஎஃப் -8 குறியாக்கத்தைப் பயன்படுத்துவதன் மூலம் பாகுபடுத்த முடியும் என்றால், அதில் ஒரு பிரிவு` `[வெளிப்புறமாக நிர்வகிக்கப்படும்]` `ஆகியவற்றைக் கொண்டுள்ளது, பின்னர் நிறுவி ஒரு பிழை செய்தியைத் தேட வேண்டும் கோப்பில் குறிப்பிடப்பட்டுள்ளது மற்றும் அதன் பிழையின் ஒரு பகுதியாக அதை வெளியிடுகிறது. டூப்பின் முதல் உறுப்பு `` locale.getLocale (locale.lc_messages) ``, அதாவது, மொழிக் குறியீடு, `` எதுவுமில்லை'` அல்ல என்றால், அது பிழை செய்தியை பெயரிடப்பட்ட ஒரு முக்கிய மதிப்பாக பார்க்க வேண்டும் `` பிழை- `` மொழித் குறியீட்டைத் தொடர்ந்து. அந்த விசை இல்லையென்றால், மொழிக் குறியீட்டில் அடிக்கோடிட்டு அல்லது ஐபன் இருந்தால், அது `` பிழை-` 'என்ற விசையை அடிக்கோடிட்டுக் காட்ட வேண்டும். அவற்றில் ஏதேனும் ஒன்றைக் கண்டுபிடிக்க முடியாவிட்டால், அல்லது மொழிக் குறியீடு `` எதுவுமில்லை`` என்றால், அது வெறுமனே `` பிழை` என்ற பெயரைக் காண வேண்டும்.

source: If the installer cannot find an error message in the file (either because the file cannot be parsed or because no suitable error key exists), then the installer should just use a pre-defined error message of its own, which should suggest that the user create a virtual environment to install packages.
ja: インストーラがファイル内のエラーメッセージを見つけられない (ファイルをパースできないか、適切なエラーキーが存在しないのいずれか) 時は、インストーラは自身の内部に予め定義されたエラーメッセージ、それは当該パッケージをインストールするためにユーザが仮想環境を作成することを示唆するものであるべきですが、それを使うべきです。
ru: Если программа установки не может найти сообщение об ошибке в файле (либо потому, что файл не может быть разобран, либо потому, что не существует подходящего ключа ошибки), то программа установки должна просто использовать собственное предопределенное сообщение об ошибке, которое должно предложить пользователю создать виртуальную среду для установки пакетов.
ta: நிறுவி கோப்பில் பிழை செய்தியைக் கண்டுபிடிக்க முடியாவிட்டால் (கோப்பை பாகுபடுத்த முடியாது அல்லது பொருத்தமான பிழை விசை இல்லாததால்), நிறுவி அதன் சொந்த முன் வரையறுக்கப்பட்ட பிழை செய்தியைப் பயன்படுத்த வேண்டும், இது பயனரை பரிந்துரைக்க வேண்டும் தொகுப்புகளை நிறுவ ஒரு மெய்நிகர் சூழலை உருவாக்கவும்.

source: Software distributors who have a non-Python-specific package manager that manages libraries in the ``sys.path`` of their Python package should, in general, ship an ``EXTERNALLY-MANAGED`` file in their standard library directory. For instance, Debian may ship a file in ``/usr/lib/python3.9/EXTERNALLY-MANAGED`` consisting of something like
ru: Распространители программного обеспечения, у которых есть неспецифичный для Python менеджер пакетов, управляющий библиотеками в ``sys.path` их пакета Python, должны, как правило, поставлять файл ``EXTERNALLY-MANAGED`` в их стандартном каталоге библиотек. Например, Debian может поставлять файл в ``/usr/lib/python3.9/EXTERNALLY-MANAGED``, состоящий из чего-то вроде
ta: பைதான் அல்லாத-குறிப்பிட்ட தொகுப்பு மேலாளரைக் கொண்ட மென்பொருள் விநியோகச்தர்கள், அவர்களின் பைதான் தொகுப்பின் `` sys.bath`` இல் உள்ள நூலகங்களை நிர்வகிக்கும், பொதுவாக, `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` கோப்பை அவர்களின் நிலையான நூலக கோப்பகத்தில் அனுப்ப வேண்டும். உதாரணமாக, டெபியன் ஒரு கோப்பை ``/usr/lib/python3.9/வெளிப்புறமாக நிர்வகிக்கப்பட்ட` போன்றவற்றில் அனுப்பலாம்.

source: which provides useful and distro-relevant information to a user trying to install a package. Optionally, translations can be provided in the same file:
eo: kio provizas utilajn kaj distribuo-rilatajn informojn al uzanto provanta instali pakon. Oni ankaŭ povas provizi tradukaĵojn en la sama dosiero:
ja: パッケージのインストールを試みるユーザ向けに役に立つとともにディストロに適合した情報を適合すること。オプションとして、同一ファイル内に提供されるトランザクション:
ru: который предоставляет полезную и относящуюся к дистрибутиву информацию пользователю, пытающемуся установить пакет. По желанию в том же файле можно предоставить переводы:
ta: இது ஒரு தொகுப்பை நிறுவ முயற்சிக்கும் பயனருக்கு பயனுள்ள மற்றும் டிச்ட்ரோ தொடர்பான தகவல்களை வழங்குகிறது. விருப்பமாக, மொழிபெயர்ப்புகளை அதே கோப்பில் வழங்க முடியும்:

source: In certain contexts, such as single-application container images that aren't updated after creation, a distributor may choose not to ship an ``EXTERNALLY-MANAGED`` file, so that users can install whatever they like (as they can today) without having to manually override this rule.
eo: En kelkaj kazoj, kiel ekzemple unuprograma ujo-diskokopio ne ĝisdatigota post kreo, distribuanto povas elekti ne inkluzivi dosieron ``EXTERNALY-MANAGED``, por ke uzanto povas instali tion ajn, kion oni ŝatas (same kiel la hodiaŭa sperto) sen malaŭtomate malaktivigi tiun regulon.
ja: 作成後には更新できない単一アプリケーションのコンテナイメージのようなある種のコンテキストでは、配布者 <distributor> は、このルールを手動でオーバーライドせざるを得ないということがなくてもユーザが何であれ彼らの望むものを (その時に) インストールできるように、 ``EXTERNALLY-MANAGED`` ファイルを同梱しない選択を行っても構いません。
ru: В некоторых случаях, например, при использовании образов контейнеров с одним приложением, которые не обновляются после создания, дистрибьютор может не поставлять файл ``EXTERNALLY-MANAGED``, чтобы пользователи могли устанавливать все, что им нравится (как и сейчас), без необходимости вручную отменять это правило.
ta: படைப்புக்குப் பிறகு புதுப்பிக்கப்படாத ஒற்றை-பயன்பாட்டு கொள்கலன் படங்கள் போன்ற சில சூழல்களில், ஒரு விநியோகச்தர் ஒரு `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` கோப்பை அனுப்ப வேண்டாம் என்று தேர்வு செய்யலாம், இதனால் பயனர்கள் தங்களால் விரும்பியதை நிறுவ முடியும் (இன்று அவர்கள் முடிந்தவரை) இந்த விதியை கைமுறையாக மேலெழுதாமல்.

source: Writing to only the target ``sysconfig`` scheme
eo: Skribi al nur la cela skemo ``sysconfig``
ja: ターゲットとなる ``sysconfig`` スキームだけを書く
ru: Запись только в целевую схему ``sysconfig``
ta: இலக்கு `` சிச்கான்ஃபிக்`` திட்டத்திற்கு மட்டுமே எழுதுதல்

source: Usually, a Python package installer installs to directories in a scheme returned by the ``sysconfig`` standard library package. Ordinarily, this is the scheme returned by ``sysconfig.get_default_scheme()``, but based on configuration (e.g. ``pip install --user``), it may use a different scheme.
eo: Ordinare Python-pakinstalo instalas al dosierujo en skemo liverita de la norma biblioteka pako ``sysconfig``. Ofte tio estas la skemo ``sysconfig.get_default_scheme()``, sed oni povas alimaniere agordi tion (ekz. per ``pip install --user``).
ja: 通常は、 Python パッケージインストーラは、標準ライブラリパッケージの ``sysconfig`` によって返されるスキームにあるディレクトリへインストールを行います。普通は、これは、 ``sysconfig.get_default_scheme()`` が返すスキームのことですが、設定 (例えば ``pip install --user``) に基づいて異なるスキームを用いることもあります。
ru: Обычно программа установки пакетов Python устанавливает их в каталоги по схеме, возвращаемой пакетом стандартной библиотеки ``sysconfig`. Обычно это схема, возвращаемая ``sysconfig.get_default_scheme()``, но в зависимости от конфигурации (например, ``pip install --user``) она может использовать другую схему.
ta: வழக்கமாக, ஒரு பைதான் தொகுப்பு நிறுவி `` சிச்கான்ஃபிக்`` நிலையான நூலக தொகுப்பு மூலம் திரும்பிய திட்டத்தில் கோப்பகங்களுக்கு நிறுவுகிறது. பொதுவாக, இது `` sysconfig.get_default_scheme () `` வழங்கிய திட்டமாகும், ஆனால் உள்ளமைவின் அடிப்படையில் (எ.கா.

source: Whenever the installer is installing to a ``sysconfig`` scheme, this specification declares that the installer should never modify or delete files outside of that scheme. For instance, if it's upgrading a package, and the package is already installed in a directory outside that scheme (perhaps in a directory from another scheme), it should leave the existing files alone.
ja: インストーラが ``sysconfig`` スキームへインストールする時はいつでも、そのスキームの外側のファイルをインストーラが決して変更したり削除したりするべきではないことをこの仕様が宣言しています。例えば、パッケージのアップグレードを行う時にそのパッケージがスキームの外側のディレクトリ (おそらく別のスキームのもの) にすでにインストールされているなら、既存のファイル群をそのままにしておくべきです。
ru: Если программа установки выполняет установку в схему ``sysconfig``, эта спецификация заявляет, что программа установки никогда не должна изменять или удалять файлы за пределами этой схемы. Например, если он обновляет пакет, а пакет уже установлен в каталог вне этой схемы (возможно, в каталог из другой схемы), он должен оставить существующие файлы в покое.
ta: நிறுவி ஒரு `` சிச்கான்ஃபிக்`` திட்டத்திற்கு நிறுவும் போதெல்லாம், அந்த திட்டத்திற்கு வெளியே உள்ள கோப்புகளை நிறுவி ஒருபோதும் மாற்றவோ அல்லது நீக்கவோ கூடாது என்று இந்த விவரக்குறிப்பு அறிவிக்கிறது. உதாரணமாக, இது ஒரு தொகுப்பை மேம்படுத்தினால், தொகுப்பு ஏற்கனவே அந்தத் திட்டத்திற்கு வெளியே ஒரு கோப்பகத்தில் நிறுவப்பட்டிருந்தால் (ஒருவேளை மற்றொரு திட்டத்திலிருந்து ஒரு கோப்பகத்தில்), அது ஏற்கனவே இருக்கும் கோப்புகளை மட்டும் விட்டுவிட வேண்டும்.

source: If the installer does end up shadowing an existing installation during an upgrade, we recommend that it produces a warning at the end of its run.
eo: Se la instalilo ombras ekzistantan instalon dum ĝisdatigado, ni rekomendas, ke ĝi montru averton post la rulo.
ja: もし、アップグレードの最中にインストーラが既存のインストール (済のファイル群) をシャドーしてしまうのであれば、警告を生成して実行を中止することを推奨します。
ru: Если во время обновления программа установки окажется в тени существующей установки, мы рекомендуем выдать предупреждение в конце ее работы.
ta: மேம்படுத்தலின் போது நிறுவி ஏற்கனவே உள்ள நிறுவலை நிழலாடுவதை முடித்தால், அதன் ஓட்டத்தின் முடிவில் அது ஒரு எச்சரிக்கையை உருவாக்க பரிந்துரைக்கிறோம்.

source: If the installer is installing to a location outside of a ``sysconfig`` scheme (e.g., ``pip install --target``), then this subsection does not apply.
eo: Se la instalilo instalas al loko ekster ``sysconfig``-skemo (ekz. ``pip install --target``), do ĉi tiu subsekcio ne estas efektiva.
ja: インストーラが ``sysconfig`` スキームの外側の場所 (即ち ``pip install --target``) へインストールしようとしているなら、このサブセクションは適用されません。
ru: Если программа установки выполняет установку в местоположение вне схемы ``sysconfig` (например, ``pip install --target``), то этот подраздел не применяется.
ta: நிறுவி ஒரு `` சிச்கான்ஃபிக்` திட்டத்திற்கு வெளியே ஒரு இடத்திற்கு நிறுவினால் (எ.கா., `` பிஐபி நிறுவல் - -இலக்கு``), இந்த துணைப்பிரிவு பொருந்தாது.

source: Recommendations for distros
eo: Rekomendoj pri distribuoj
ja: ディストロへの推奨
pt_br: Recomendações para distribuições
ru: Рекомендации по дистрибутивам
ta: டிச்ட்ரோக்களுக்கான பரிந்துரைகள்

source: This section is non-normative. It provides best practices we believe distros should follow unless they have a specific reason otherwise.
eo: Jen nedeviga paragrafo priskribanta la bonan praktikon, kiu niaopinie distribuoj observu, se specifa kialo mankas.
ja: この節は規範的なものではありません。特に他の理由がなければディストロが従うべきであると信じられるベストプラクティスを提供するものです。
ru: Этот раздел не является нормативным. В нем представлены лучшие практики, которым, по нашему мнению, должны следовать дистрибутивы, если у них нет особых причин для обратного.
ta: இந்த பிரிவு நெறிமுறையற்றது. டிச்ட்ரோக்கள் ஒரு குறிப்பிட்ட காரணத்தை இல்லாவிட்டால் அவர்களுக்கு பின்பற்ற வேண்டும் என்று நாங்கள் நம்புகிறோம்.

source: Mark the installation as externally managed
eo: Marku la instalaĵon kiel ekstere mastrumatan
ja: インストールされたものを外部管理のものとしてマークする
ru: Пометьте установку как управляемую извне
ta: வெளிப்புறமாக நிர்வகிக்கப்பட்டபடி நிறுவலைக் குறிக்கவும்

source: Distros should create an ``EXTERNALLY-MANAGED`` file in their ``stdlib`` directory.
eo: Distribuo kreu dosieron ``EXTERNALLY-MANAGED`` en sia dosierujo ``stdlib``.
ja: ディストロは、その ``stdlib`` ディレクトリ内に ``EXTERNALLY-MANAGED`` ファイルを作成するべきです。
ru: Дистры должны создать файл ``EXTERNALLY-MANAGED`` в своем каталоге ``stdlib``.
ta: டிச்ட்ரோக்கள் தங்கள் `` stdlib`` கோப்பகத்தில் `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` கோப்பை உருவாக்க வேண்டும்.

source: Guide users towards virtual environments
eo: Gvidu uzantojn al virtualaj medioj
ja: 仮想環境へ向かうユーザへのガイド文書
ru: Направляйте пользователей в виртуальную среду
ta: மெய்நிகர் சூழல்களை நோக்கி பயனர்களை வழிநடத்துங்கள்

source: The file should contain a useful and distro-relevant error message indicating both how to install system-wide packages via the distro's package manager and how to set up a virtual environment. If your distro is often used by users in a state where the ``python3`` command is available (and especially where ``pip`` or ``get-pip`` is available) but ``python3 -m venv`` does not work, the message should indicate clearly how to make ``python3 -m venv`` work properly.
ja: このファイルは、ディストロのパッケージマネージャを使ってシステムワイドのパッケージをインストールする方法と仮想鑑賞を構築する方法の両方を示す、役に立ち、かつ、ディストロに適合したエラーメッセージを含んでいるべきです。もし、そのディストロが ``python3`` コマンドは利用できる (かつ、とりわけ ``pip`` か ``get-pip`` が利用できる) が、 ``python3 -m venv`` は動作しない状態で使われることが多いのであれば、当該メッセージは、 ``python3 -m venv`` を正しく動作させるにはどうすれば良いかをはっきりと示すべきです。
ru: Файл должен содержать полезное и соответствующее дистрибутиву сообщение об ошибке, указывающее как на установку общесистемных пакетов через менеджер пакетов дистрибутива, так и на настройку виртуального окружения. Если ваш дистрибутив часто используется пользователями в состоянии, когда команда ``python3`` доступна (и особенно когда доступны ``pip`` или ``get-pip``), но ``python3 -m venv`` не работает, в сообщении должно быть четко указано, как заставить ``python3 -m venv`` работать правильно.
ta: டிச்ட்ரோவின் தொகுப்பு மேலாளர் வழியாக கணினி அளவிலான தொகுப்புகளை எவ்வாறு நிறுவுவது மற்றும் மெய்நிகர் சூழலை எவ்வாறு அமைப்பது என்பதைக் குறிக்கும் பயனுள்ள மற்றும் டிச்ட்ரோ தொடர்பான பிழை செய்தியை கோப்பில் கொண்டிருக்க வேண்டும். `` பைதான் 3`` கட்டளை கிடைக்கும் (குறிப்பாக `` பிப்`` அல்லது `` கெட் -பிப்`` கிடைக்கும் இடத்தில்) உங்கள் டிச்ட்ரோ பெரும்பாலும் பயனர்களால் பயன்படுத்தப்பட்டால்) ஆனால் `` பைதான் 3 -எம் வென்வ்``` வேலை செய்யாது, செய்தி `` பைதான் 3 -எம் வெர்வ்`` சரியாக வேலை செய்வது எப்படி என்பதை தெளிவாகக் குறிக்க வேண்டும்.

source: Consider packaging pipx_, a tool for installing Python-language applications, and suggesting it in the error. pipx automatically creates a virtual environment for that application alone, which is a much better default for end users who want to install some Python-language software (which isn't available in the distro) but are not themselves Python users. Packaging pipx in the distro avoids the irony of instructing users to ``pip install --user --break-system-packages pipx`` to *avoid* breaking system packages. Consider arranging things so your distro's package / environment for Python for end users (e.g., ``python3`` on Fedora or ``python3-full`` on Debian) depends on pipx.
eo: Konsideru disponigi pipx_, ilon por instali Python-programojn, kaj sugesti ĝin en la eraro. pipx aŭtomate kreas virtualan medion por unu solan programon, kio estas multe pli bona port tiuj uzantoj, kiuj deziras instali iun Python-programon (kiun la distribuo ne disponigas) sed ne estas Python-uzantoj mem. Pakado de pipx en la distribuo evitas la ironion instrui uzantojn ruli ``pip install --user --break-system-packages pipx`` por *eviti* rompi sistemajn pakojn. Konsideru dependigi de pipx la Python-pakon/medion de via distribuo por ordinaraj uzantoj (ekz. ``python3`` ĉe Fedora aŭ ``python3-full`` ĉe Debian).
ja: Python 言語で書かれたアプリケーションをインストールするツールである packaging pipx_ を採用して、エラーの中で示唆することを検討してください。 pipx はそのアプリケーションだけのための仮想環境を自動的に構築しますし、何らかの Python 言語で書かれたソフトウェア (であって、ディストロ側では利用可能ではないもの) をインストールしたいけれども自身は Python ユーザではないエンドユーザにとってはずっと良いデフォルト動作です。 Packaging pipx がディストロ側で準備されていれば、システム側のパッケージ群を破壊することを *避ける* ために ``pip install --user --break-system-packages pipx`` を使うようにユーザに指示すると言う皮肉を避けることができます。このように整えることで、ディストロ側パッケージとエンドユーザ用 Python 環境 (例えば、 Fedora での ``python3`` や Debian での ``python3-full`` ) がともに pipx に依存するようにすることができます。
ru: Рассмотрим упаковку pipx_, инструмента для установки приложений на языке Python, и предложение его в качестве ошибки. pipx автоматически создает виртуальную среду только для этого приложения, что гораздо лучше по умолчанию для конечных пользователей, которые хотят установить некоторое программное обеспечение на языке Python (которого нет в дистрибутиве), но сами не являются пользователями Python. Упаковка pipx в дистрибутив позволяет избежать иронии, когда пользователям предлагается ``pip install --user --break-system-packages pipx``, чтобы *избежать* нарушения системных пакетов. Подумайте о том, чтобы пакет / окружение Python для конечных пользователей вашего дистрибутива (например, ``python3`` на Fedora или ``python3-full`` на Debian) зависел от pipx.
ta: பைதான்-மொழி பயன்பாடுகளை நிறுவுவதற்கான கருவியான PIPX_ ஐ பேக்கேசிங் செய்வதைக் கவனியுங்கள், மேலும் அதை பிழையில் பரிந்துரைக்கவும். PIPX தானாகவே அந்த பயன்பாட்டிற்கான ஒரு மெய்நிகர் சூழலை உருவாக்குகிறது, இது சில பைதான்-மொழி மென்பொருளை (இது டிச்ட்ரோவில் கிடைக்கவில்லை) நிறுவ விரும்பும் இறுதி பயனர்களுக்கு மிகச் சிறந்த இயல்புநிலையாகும், ஆனால் அவை பைதான் பயனர்கள் அல்ல. டிச்ட்ரோவில் உள்ள பிஐபிஎக்ச் பேக்கேசிங் பயனர்களுக்கு `` பிஐபி நிறுவுதல்-யூசர்-பிரேக்-சிச்டம்-பேக்கேச்கள் பிப்எக்ச்`` கணினி தொகுப்புகளை உடைப்பதை * தவிர்க்க அறிவுறுத்துவதன் முரண்பாட்டைத் தவிர்க்கிறது. விசயங்களை ஒழுங்குபடுத்துவதைக் கவனியுங்கள், எனவே இறுதி பயனர்களுக்கான பைத்தானுக்கான உங்கள் டிச்ட்ரோவின் தொகுப்பு / சூழல் (எ.கா., ஃபெடோராவில் `` பைதான் 3`` அல்லது `` பைதான் 3-ஃபுல்`` டெபியன் மீது) பிப்எக்ச் சார்ந்துள்ளது.

source: Keep the marker file in container images
eo: Retenu la markan dosieron en uja bildo
ja: コンテナイメージ内のマーカーファイルを維持する
ru: Храните файл маркера в образах контейнеров
ta: மார்க்கர் கோப்பை கொள்கலன் படங்களில் வைக்கவும்

source: Distros that produce official images for single-application containers (e.g., Docker container images) should keep the ``EXTERNALLY-MANAGED`` file, preferably in a way that makes it not go away if a user of that image installs package updates inside their image (think ``RUN apt-get dist-upgrade``).
eo: Distribuo, kiu provizas oficialan bildon por unuprograma ujo (ekz., Docker-bildo) retenu la dosieron ``EXTERNALLY-MANAGED``, prefere tiel, ke ĝisdatigo de la bildo (kiel ``RUN apt-get dist-upgrade``) ne forigos la dosieron.
ja: 単一アプリケーションのコンテナ用の公式イメージ (即ち Docker コンテナイメージ) を作成するようなディストロは、 ``EXTERNALLY-MANAGED`` ファイルを維持すべきで、さらに言えば、ユーザがそのイメージなでパッケージのアップデートをインストールしたとしても (``RUN apt-get dist-upgrade`` のようなものを考えてみてほしい) 失われることのないようなやり方で行うのが望ましいことです。
ru: Дистры, выпускающие официальные образы для контейнеров с одним приложением (например, образы контейнеров Docker), должны хранить файл ``EXTERNALLY-MANAGED``, желательно таким образом, чтобы он не исчезал, если пользователь этого образа устанавливает обновления пакетов внутри образа (подумайте о ``RUN apt-get dist-upgrade``).
ta: ஒற்றை-பயன்பாட்டு கொள்கலன்களுக்கான அதிகாரப்பூர்வ படங்களை உருவாக்கும் டிச்ட்ரோக்கள் (எ.கா., கப்பல்துறை கொள்கலன் படங்கள்) `` வெளிப்புறமாக நிர்வகிக்கப்பட்ட`` கோப்பை வைத்திருக்க வேண்டும், முன்னுரிமை அந்த படத்தின் பயனர் அவற்றின் உள்ளே தொகுப்பு புதுப்பிப்புகளை நிறுவினால் அது போகாது படம் (`` என்று சிந்தியுங்கள்.

source: Create separate distro and local directories
eo: Kreu apartajn distribuan kaj lokan dosierujojn
ja: ディストロとローカルのディレクトリを別々に作成する
ru: Создайте отдельные каталоги дистрибутива и локального каталога
ta: தனி டிச்ட்ரோ மற்றும் உள்ளக கோப்பகங்களை உருவாக்கவும்

source: Distros should place two separate paths on the system interpreter's ``sys.path``, one for distro-installed packages and one for packages installed by the local system administrator, and configure ``sysconfig.get_default_scheme()`` to point at the latter path. This ensures that tools like pip will not modify distro-installed packages. The path for the local system administrator should come before the distro path on ``sys.path`` so that local installs take preference over distro packages.
ja: ディストロは、ディストロがインストールしたパッケージのためのものと、ローカルのシステム管理者がインストールしたパッケージのためのものというふたつの別々のパスをシステム側に持っているインタープリタの ``sys.path`` に置くべきであり、また、 ``sysconfig.get_default_scheme()`` が後者のパスを指し示すように設定するべきです。こうすることで、pip のようなツール類がディストロ側でインストールしたパッケージを修正してしまうことがなくなります。ローカルのシステム管理者用のパスは ``sys.path`` 内でディストロ側のパスの前にくるべきで、そうすることでローカルにインストールされたものがディストロ側のパッケージよりも選好されるようになります。
ru: Дистры должны поместить два отдельных пути в ``sys.path`` системного интерпретатора, один для пакетов, установленных в дистрибутиве, и один для пакетов, установленных локальным системным администратором, и настроить ``sysconfig.get_default_scheme()`` так, чтобы он указывал на последний путь. Это гарантирует, что такие инструменты, как pip, не будут изменять установленные в дистрибутиве пакеты. Путь для локального системного администратора должен находиться перед путем для дистрибутива в ``sys.path``, чтобы локальные установки имели предпочтение перед пакетами дистрибутива.
ta: டிச்ட்ரோக்கள் கணினி மொழிபெயர்ப்பாளரின் `` sys.bath``, ஒன்று டிச்ட்ரோ-நிறுவப்பட்ட தொகுப்புகளுக்கு மற்றும் உள்ளக கணினி நிர்வாகியால் நிறுவப்பட்ட தொகுப்புகளுக்கு ஒன்று வைக்க வேண்டும், மேலும் `` sysconfig.get_default_scheme () `` பிந்தைய பாதை. பிஐபி போன்ற கருவிகள் டிச்ட்ரோ நிறுவப்பட்ட தொகுப்புகளை மாற்றாது என்பதை இது உறுதி செய்கிறது. உள்ளக கணினி நிர்வாகிக்கான பாதை `` sys.path`` இல் டிச்ட்ரோ பாதைக்கு முன் வர வேண்டும், இதனால் உள்ளக நிறுவல்கள் டிச்ட்ரோ தொகுப்புகளை விட முன்னுரிமை பெறுகின்றன.
